 Q: Which {film starring} {succeeds to} {In the Mood for Love} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1056853 wdt:P155 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starring', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'In the Mood for Love', 'p': 'succeeds to', 'o': '$y0'}}

 Q: What is {position held} of {George VI} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q280856 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George VI', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George VI', 'p': 'position held', 'o': '$y0'}}]

 Q: Is the global warming potential of the norflurane equal to 1430?
 SPARQL: ASK WHERE { wd:Q423029 wdt:P2565 ?obj filter(?obj = 1430) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'norflurane', 'p': 'global warming potential', 'o': '?x0', '?x0': '1430'}

 Q: What are the positional notation which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1747853 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'positional notation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is the {specialty} for {health specialty} of {pedophilia}
 SPARQL:  select distinct ?obj where { wd:Q8388 wdt:P1995 ?obj . ?obj wdt:P31 wd:Q1047113 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pedophilia', 'p': 'health specialty', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'specialty'}}

 Q: Tell me binary operation whose name has the word union in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164307 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'union')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'binary operation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'union'}}

 Q: what is the {start time} for {John Stuart, 3rd Earl of Bute} has {position held} as {Secretary of State for the Northern Department} ?
 SPARQL: SELECT ?value WHERE { wd:Q294651 p:P39 ?s . ?s ps:P39 wd:Q3954358 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Stuart, 3rd Earl of Bute', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary of State for the Northern Department'}}}

 Q: Which is the MYmovies name ID of Dino De Laurentiis?
 SPARQL: select distinct ?answer where { wd:Q296796 wdt:P4785 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dino De Laurentiis', 'p': 'MYmovies name ID', 'o': '?x0'}

 Q: How many brands are there for Procter & Gamble?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q212405 wdt:P1716 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Procter & Gamble', 'p': 'brand', 'o': '?x0'}

 Q: What is the type of taxon parent of Felidae?
 SPARQL: SELECT ?answer WHERE { wd:Q25265 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of taxon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Felidae', 'p': 'taxon parent', 'o': '$y0'}}

 Q: What is {kind of music} of {previous is} of {The Hobbit: The Desolation of Smaug} ?
 SPARQL: SELECT ?answer WHERE { wd:Q719915 wdt:P155 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kind of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Hobbit: The Desolation of Smaug', 'p': 'previous is', 'o': '$y0'}}

 Q: What is United States Reports ID for Brown v. Board of Education ?
 SPARQL: select distinct ?answer where { wd:Q875738 wdt:P3147 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brown v. Board of Education', 'p': 'United States Reports ID', 'o': '?x0'}

 Q: Which is the tungsten alloy that has an effect on tungsten carbide exposure and starts with the letter c?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37789249 . ?sbj wdt:P1542 wd:Q21175402 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tungsten alloy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'effect', 'o': 'tungsten carbide exposure'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is the {citrate anion} for {conjugate acid} of {citric acid}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q159683 . ?sbj wdt:P31 wd:Q55502846 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'citric acid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'citrate anion'}}

 Q: What is the {airline} for {business division} of {Aeroflot}
 SPARQL:  select distinct ?obj where { wd:Q58707 wdt:P199 ?obj . ?obj wdt:P31 wd:Q46970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aeroflot', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline'}}

 Q: Name the Velká pardubická sponsored by Česká pojišťovna with the longest race time ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P859 wd:Q11283119 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'race time', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Velká pardubická', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sponsor', 'o': 'Česká pojišťovna'}}}

 Q: What is named after Alexander Hamilton?
 SPARQL: select distinct ?answer where { ?answer wdt:P138 wd:Q178903}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Alexander Hamilton'}

 Q: What is {electoral district} and {elected in} of {{James Scullin} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q23362 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P768 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Scullin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Scullin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: How many producers are by Hal B. Wallis?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P162 wd:Q472520 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'producer', 'o': 'Hal B. Wallis'}

 Q: How many {medical condition treated} are for {acetic acid} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q47512 wdt:P2175 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'acetic acid', 'p': 'medical condition treated', 'o': '?x0'}

 Q: What is {located in time zone} of {Antarctica} that is {applies to part} is {Antarctica/Macquarie} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P518 wd:Q4771017 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antarctica', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'Antarctica/Macquarie'}}}

 Q: What is the KMRB film rating of The Dark Knight?
 SPARQL: select distinct ?answer where { wd:Q163872 wdt:P3818 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Dark Knight', 'p': 'KMRB film rating', 'o': '?x0'}

 Q: What is the tributary of the lake next to Honshu?
 SPARQL: SELECT ?answer WHERE { wd:Q13989 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honshu', 'p': 'lake', 'o': '$y0'}}

 Q: give me the name of determination method for Belo Horizonte has population as 2.50256e+06?
 SPARQL: SELECT ?value WHERE { wd:Q42800 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'2.50256e+06')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belo Horizonte', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '2.50256e+06'}}}

 Q: what is the {for work} for {Robert Altman} has {nominated for} as {Academy Award for Best Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q55163 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Altman', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Director'}}}

 Q: Who is the mother and child of Amitabh Bachchan?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q9570 wdt:P25 ?ans_1 . wd:Q9570 wdt:P40 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Amitabh Bachchan', 'p': 'mother', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Amitabh Bachchan', 'p': 'child', 'o': '?x1'}]

 Q: What is branch of developer of Julia set ?
 SPARQL: SELECT ?answer WHERE { wd:Q848427 wdt:P61 ?X . ?X wdt:P241 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'branch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julia set', 'p': 'developer', 'o': '$y0'}}

 Q: What is {date of birth} of {Lysippos} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192222 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lysippos', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'c'}}}

 Q: tell  me province of China that capital Chengdu  starts with letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj wdt:P36 wd:Q30002 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'province of China', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Chengdu'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Tell me the road bridge that contains the word 'bridge' in its name and that is designed by Joseph Strauss
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj wdt:P287 wd:Q261174 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bridge')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road bridge', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Joseph Strauss'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'bridge'}}

 Q: What is {place built} of {Olympia}, that has {geographical coordinates} is {2.35183} ?
 SPARQL: SELECT ?answer WHERE { wd:Q737062 wdt:P1071 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'2.35183'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Olympia', 'p': 'place built', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coordinates', 'o': '2.35183'}}

 Q: Give me {international association football national teams competition} that {season starts} {November} and which contains the word {cup} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542827 . ?sbj wdt:P4794 wd:Q125 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international association football national teams competition', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'season starts', 'o': 'November'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cup'}}

 Q: What is the game artist for Naoto Ohshima?
 SPARQL: select distinct ?answer where { ?answer wdt:P3080 wd:Q658384}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'game artist', 'o': 'Naoto Ohshima'}

 Q: what is the {series ordinal} for {Appetite for Destruction} has {tracklist} as {Paradise City} ?
 SPARQL: SELECT ?value WHERE { wd:Q270690 p:P658 ?s . ?s ps:P658 wd:Q843032 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Appetite for Destruction', 'p': 'tracklist', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'tracklist', 'o': 'Paradise City'}}}

 Q: DOES THE PRESSURE OF THE MARK 91 LESS THAN 2206.4
 SPARQL: ASK WHERE { wd:Q39997381 wdt:P2077 ?obj filter(?obj < 2206.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Mark 91', 'p': 'pressure', 'o': '?x0', '?x0': '2206.4'}

 Q: What was Burt Lancaster nominated for in 1953?
 SPARQL: SELECT ?obj WHERE { wd:Q160528 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Burt Lancaster', 'p': 'nominated for', 'o': '?x0', 't': '1953'}

 Q: What is  in the GLAM Identifier of Kunsthaus Zürich ?
 SPARQL: select distinct ?answer where { wd:Q685038 wdt:P3066 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kunsthaus Zürich', 'p': 'GLAM Identifier', 'o': '?x0'}

 Q: What award did Dilip Kumar receive in 1994?
 SPARQL: SELECT ?obj WHERE { wd:Q377789 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dilip Kumar', 'p': 'award', 'o': '?x0', 't': '1994'}

 Q: What number of households did a census, as a determination method, find in Tifariti?
 SPARQL: SELECT ?obj WHERE { wd:Q2360337 p:P1538 ?s . ?s ps:P1538 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of households', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tifariti', 'p': 'number of households', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: The Annals of Mathematics is in what Dialnet journal?
 SPARQL: select distinct ?answer where { wd:Q564426 wdt:P1609 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Annals of Mathematics', 'p': 'Dialnet journal', 'o': '?x0'}

 Q: How many {highway system} are to/by {Interstate Highway System} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P16 wd:Q94247 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'highway system', 'o': 'Interstate Highway System'}

 Q: Which is the aircraft fleet used by a helicopter?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2283 wd:Q34486 . ?sbj wdt:P31 wd:Q17372500 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'used', 'o': 'helicopter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft fleet'}}

 Q: How many commemorates were given to Giuseppe Garibaldi?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P547 wd:Q539 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'commemorates', 'o': 'Giuseppe Garibaldi'}

 Q: How many {licensed to broadcast to} are to/by {Dayton} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1408 wd:Q34739 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'licensed to broadcast to', 'o': 'Dayton'}

 Q: Wich means{theme music }in {Boléro} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P942 wd:Q327331}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'theme music', 'o': 'Boléro'}

 Q: What are the major works of Marin Alsop's supervisor?
 SPARQL: SELECT ?answer WHERE { wd:Q242931 wdt:P1066 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marin Alsop', 'p': 'supervisor', 'o': '$y0'}}

 Q: what is the {determination method} for {Juneau} has {population} as {31275.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q29445 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'31275.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Juneau', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '31275.0'}}}

 Q: What are the people which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2472587 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which is regulated by FIDE?
 SPARQL: select distinct ?answer where { ?answer wdt:P3719 wd:Q102178}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'regulated by', 'o': 'FIDE'}

 Q: How many {parent astronomical body} are to/by {Large Magellanic Cloud} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P397 wd:Q49957 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Large Magellanic Cloud'}

 Q: What is the {Wikimedia category} for {category for films shot at this location} of {Yokohama}
 SPARQL:  select distinct ?obj where { wd:Q38283 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yokohama', 'p': 'category for films shot at this location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: what is the total fertility rate of the county seat of Moroni?
 SPARQL: SELECT ?answer WHERE { wd:Q3901 wdt:P1376 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moroni', 'p': 'county seat of', 'o': '$y0'}}

 Q: What is the {human} for {mother} of {Antonio Vivaldi}
 SPARQL:  select distinct ?obj where { wd:Q1340 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Antonio Vivaldi', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the total liability of the Humana equal to 14711000000 ?
 SPARQL: ASK WHERE { wd:Q910866 wdt:P2138 ?obj filter(?obj = 14711000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Humana', 'p': 'total liabilities', 'o': '?x0', '?x0': '14711000000'}

 Q: When did member of sports team of Christine Sinclair and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q262802 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christine Sinclair', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christine Sinclair', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: How many interactions does an antiproton have ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q107575 wdt:P517 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'antiproton', 'p': 'interaction', 'o': '?x0'}

 Q: Which is the beam bridge that was created by Frank Gehry?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q180374 . ?sbj wdt:P31 wd:Q158626 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'created by', 'o': 'Frank Gehry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'beam bridge'}}

 Q: What is {unemployment rate} of {economy of Germany} that is {point in time} is {2014-3-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8046 p:P1198 ?s . ?s ps:P1198 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'economy of Germany', 'p': 'unemployment rate', 'o': '?x0', 't': '2014'}

 Q: What is Julius Wellhausen's Marburger Professorenkatalog ID?
 SPARQL: select distinct ?answer where { wd:Q76897 wdt:P3187 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Julius Wellhausen', 'p': 'Marburger Professorenkatalog ID', 'o': '?x0'}

 Q: What is next to Almeria and has 4288.0 inhabitants?
 SPARQL: SELECT ?answer WHERE { wd:Q10400 wdt:P47 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'4288.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Almeria', 'p': 'next to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '4288.0'}}

 Q: Which is Monte Carlo Particle Number for antiproton?
 SPARQL: select distinct ?answer where { wd:Q107575 wdt:P1360 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'antiproton', 'p': 'Monte Carlo Particle Number', 'o': '?x0'}

 Q: How many {statement describes} are to/by {conic section} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2384 wd:Q124255 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'statement describes', 'o': 'conic section'}

 Q: Which is the SwimSwam ID of Michael Phelps?
 SPARQL: select distinct ?answer where { wd:Q39562 wdt:P4315 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Michael Phelps', 'p': 'SwimSwam ID', 'o': '?x0'}

 Q: What is the capital of England?
 SPARQL:  select distinct ?obj where { wd:Q179876 wdt:P36 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'England', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: How many Majuros are in the port of registry?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P532 wd:Q12919 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'port of registry', 'o': 'Majuro'}

 Q: Which is the Database of Classical Scholars ID for George Bancroft?
 SPARQL: select distinct ?answer where { wd:Q741482 wdt:P1935 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Bancroft', 'p': 'Database of Classical Scholars ID', 'o': '?x0'}

 Q: Which is the magazine that has Jann Wenner as an editor and starts with the letter r?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj wdt:P98 wd:Q519143 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'editor', 'o': 'Jann Wenner'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: Is the median income of the United Kingdom less than 25293.6?
 SPARQL: ASK WHERE { wd:Q145 wdt:P3529 ?obj filter(?obj < 25293.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'United Kingdom', 'p': 'median income', 'o': '?x0', '?x0': '25293.6'}

 Q: Who is the person that is a political party member of Indian National Congress?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P102 wd:Q10225 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'party', 'o': 'Indian National Congress', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {subnetwork} of {alumni of} of {Aleksandr Solzhenitsyn} ?
 SPARQL: SELECT ?answer WHERE { wd:Q34474 wdt:P69 ?X . ?X wdt:P3761 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subnetwork', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'alumni of', 'o': '$y0'}}

 Q: Is the case fatality rate of Fournier gangrene fewer than 9.0?
 SPARQL: ASK WHERE { wd:Q616449 wdt:P3457 ?obj filter(?obj < 9.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Fournier gangrene', 'p': 'case fatality rate', 'o': '?x0', '?x0': '9.0'}

 Q: Is the prevalance of tuberculosis equal to 0.00078?
 SPARQL: ASK WHERE { wd:Q12204 wdt:P1193 ?obj filter(?obj = 0.00078) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'tuberculosis', 'p': 'prevalence', 'o': '?x0', '?x0': '0.00078'}

 Q: What is the {international sport governing body} for {authority} of {association football}
 SPARQL:  select distinct ?obj where { wd:Q2736 wdt:P797 ?obj . ?obj wdt:P31 wd:Q11422536 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'association football', 'p': 'governing body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international sport governing body'}}

 Q: What is the {parent organization} and the {owner of} of {Society_of_Jesus} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36380 wdt:P749 ?ans_1 . wd:Q36380 wdt:P1830 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Society of Jesus', 'p': 'parent organization', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Society of Jesus', 'p': 'owner of', 'o': '?x1'}]

 Q: What is the {enterprise} for {product or material produced} of {Commodore 64}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q99775 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'Commodore 64', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'company'}}

 Q: Tell me newspaper whose name has the word şalom in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'şalom')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newspaper'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'şalom'}}

 Q: Who are the sons of Alphonse Mucha, who is the daughter of Marie Chytilová?
 SPARQL: SELECT ?answer WHERE { wd:Q146691 wdt:P40 ?answer . ?answer wdt:P25 wd:Q15111563}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alphonse Mucha', 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'daughter of', 'o': 'Marie Chytilová'}}

 Q: what is the {point in time} for {J. K. Rowling} has {award received} as {Andre Norton Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q34660 p:P166 ?s . ?s ps:P166 wd:Q285568 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'J. K. Rowling', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Andre Norton Award'}, 't': '?x0'}

 Q: What astronaut mission did Gordon Cooper use the Gemini spacecraft for?
 SPARQL:  select distinct ?obj where { wd:Q312833 wdt:P450 ?obj . ?obj wdt:P31 wd:Q831109 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gordon Cooper', 'p': 'astronaut mission', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Gemini spacecraft'}}

 Q: What is {start time} and {end time} of {{Ruhollah Khomeini} has {spouse} as {Khadijeh Saqafi}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q38823 p:P26 ?s . ?s ps:P26 wd:Q686560 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruhollah Khomeini', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Khadijeh Saqafi'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruhollah Khomeini', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Khadijeh Saqafi'}}}]

 Q: What is DPLA subject ID for horse ?
 SPARQL: select distinct ?answer where { wd:Q726 wdt:P4272 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'horse', 'p': 'DPLA subject ID', 'o': '?x0'}

 Q: What skyscraper did architect Zaha Hadid design?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q47780 . ?sbj wdt:P31 wd:Q11303 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Zaha Hadid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skyscraper'}}

 Q: Is the clock speed of GP32 equal to 106.4?
 SPARQL: ASK WHERE { wd:Q426119 wdt:P2149 ?obj filter(?obj = 106.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'GP32', 'p': 'clock speed', 'o': '?x0', '?x0': '106.4'}

 Q: What is {nomination received} of {D. T. Suzuki}, that has {prizewinner} is {Lester B. Pearson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44847 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q128604}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'D. T. Suzuki', 'p': 'nomination received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Lester B. Pearson'}}

 Q: Who is the spouse of Katharine Cornell in 1921-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q272086 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1921')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Katharine Cornell', 'p': 'spouse', 'o': '?x0', 't': '1921'}

 Q: Which is the part of the orchestra?
 SPARQL: select distinct ?answer where { ?answer wdt:P361 wd:Q42998}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'part of', 'o': 'orchestra'}

 Q: What is <board member> of <Stewart Brand> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3320 wd:Q971994}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'board member', 'o': 'Stewart Brand'}

 Q: What is the {business} for {product or material produced} of {CBS}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q43380 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'CBS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What award did Michael Gough achieve in 1979?
 SPARQL: SELECT ?obj WHERE { wd:Q299302 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michael Gough', 'p': 'award', 'o': '?x0', 't': '1979'}

 Q: What is {birth place} of {Elizabeth Wurtzel}, that has {inhabitants} is {152056.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q442854 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'152056.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Elizabeth Wurtzel', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '152056.0'}}

 Q: Which is the QUDT unit ID of henry?
 SPARQL: select distinct ?answer where { wd:Q163354 wdt:P2968 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'henry', 'p': 'QUDT unit ID', 'o': '?x0'}

 Q: who aircraft hijacking for immediate cause of War on Terror?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1536 wd:Q185729 . ?sbj wdt:P31 wd:Q898712 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'immediate cause of', 'o': 'War on Terror', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft hijacking'}}

 Q: Is the total produced by Tupolev ANT-1 equal to 1.2?
 SPARQL: ASK WHERE { wd:Q433083 wdt:P1092 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tupolev ANT-1', 'p': 'total produced', 'o': '?x0', '?x0': '1.2'}

