 Q: What precedes and what follows Star Wars Episode V: The Empire Strikes Back in the Star Wars series?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q181795 p:P179 ?s . ?s ps:P179 wd:Q22092344 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'precedes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars'}}}]

 Q: What is {academic major} and {academic degree} of {{Josef Mengele} has {educated at} as {Ludwig Maximilian University of Munich}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q57109 p:P69 ?s . ?s ps:P69 wd:Q55044 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Mengele', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Munich'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Mengele', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Munich'}}}]

 Q: what is the {start time} for {Burgas} has {head of government} as {Dimitar Nikolov} ?
 SPARQL: SELECT ?value WHERE { wd:Q6509 p:P6 ?s . ?s ps:P6 wd:Q224746 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Burgas', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Dimitar Nikolov'}}}

 Q: What is the {sovereign state} for {owned by} of {Mona Lisa}
 SPARQL:  select distinct ?obj where { wd:Q12418 wdt:P127 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mona Lisa', 'p': 'owned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who is the son of the sibling of Freydís Eiríksdóttir
 SPARQL: SELECT ?answer WHERE { wd:Q451114 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Freydís Eiríksdóttir', 'p': 'sibling', 'o': '$y0'}}

 Q: What is the {think tank} with the {MAX(total expenditure)} whose {field of work} is {social policy}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q155271 . ?ent wdt:P2402 ?obj . ?ent wdt:P101 wd:Q828395 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total expenditure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'think tank', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'field of work', 'o': 'social policy'}}}

 Q: What is {apparent magnitude} of {planet} of {far side of the Moon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q816838 wdt:P376 ?X . ?X wdt:P1215 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'apparent magnitude', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'far side of the Moon', 'p': 'planet', 'o': '$y0'}}

 Q: What is the TV host of the copy of Berpacu Dalam Melodi?
 SPARQL: SELECT ?answer WHERE { wd:Q12475983 wdt:P144 ?X . ?X wdt:P371 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'host', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Berpacu Dalam Melodi', 'p': 'copy of', 'o': '$y0'}}

 Q: In which barley wine contains the maximum of alcohol by volume?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q808329 . ?ent wdt:P2665 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'alcohol by volume', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'barley wine'}}

 Q: What is {sport played} of {event producer} of {World Series} ?
 SPARQL: SELECT ?answer WHERE { wd:Q265538 wdt:P664 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sport', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'World Series', 'p': 'event producer', 'o': '$y0'}}

 Q: Which is the Internet Broadway Database person ID of Anna Paquin?
 SPARQL: select distinct ?answer where { wd:Q199884 wdt:P1220 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anna Paquin', 'p': 'Internet Broadway Database person ID', 'o': '?x0'}

 Q: what is the {end time} for {Kate Sheppard} has {member of} as {National Council of Women of New Zealand} ?
 SPARQL: SELECT ?value WHERE { wd:Q455072 p:P463 ?s . ?s ps:P463 wd:Q6971948 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kate Sheppard', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'National Council of Women of New Zealand'}}}

 Q: What is {label} of {sequel is} of {Are You Experienced} ?
 SPARQL: SELECT ?answer WHERE { wd:Q640397 wdt:P156 ?X . ?X wdt:P264 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'label', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Are You Experienced', 'p': 'sequel is', 'o': '$y0'}}

 Q: Was the screenwriter of SpongeBob Squarepants named Kazimieras G. Prapuolenis?
 SPARQL: ASK WHERE { wd:Q83279 wdt:P58 wd:Q1291296 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'SpongeBob', 'p': 'screenwriter', 'o': '?x0', '?x0': 'Kazimieras G. Prapuolenis'}]

 Q: What award did Ettore Scola receive in 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q53037 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ettore Scola', 'p': 'award', 'o': '?x0', 't': '1980'}

 Q: What is the {stock exchange} for {headquarters location} of {Cleveland}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q11691 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Cleveland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stock exchange'}}

 Q: What are the survival skill which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'survival skill'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {member of sports team} of {Clarence Seedorf} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'team', 'o': '$y0'}}]

 Q: Did {Alexander_Hamilton} {occupation} {lawyer}?
 SPARQL: ASK WHERE { wd:Q178903 wdt:P106 wd:Q40348 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Alexander Hamilton', 'p': 'occupation', 'o': '?x0', '?x0': 'lawyer'}]

 Q: How many {educated at} are to/by {law school} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P69 wd:Q1321960 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'educated at', 'o': 'law school'}

 Q: Is it true that Delta Air Lines cash is equivelant to 1252000000.0?
 SPARQL: ASK WHERE { wd:Q188920 wdt:P2232 ?obj filter(?obj = 1252000000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Delta Air Lines', 'p': 'cash', 'o': '?x0', '?x0': '1252000000.0'}

 Q: Who is {service operator} of {aircraft carried} of {LATAM Brasil} ?
 SPARQL: SELECT ?answer WHERE { wd:Q690789 wdt:P121 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operator', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'LATAM Brasil', 'p': 'aircraft carried', 'o': '$y0'}}

 Q: What is the {municipality of Spain} for {shares border with} of {Bilbao}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q8692 . ?sbj wdt:P31 wd:Q2074737 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Bilbao', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Spain'}}

 Q: Who was Rosa Luxemburg's spouse until 1903?
 SPARQL: SELECT ?obj WHERE { wd:Q7231 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1903')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rosa Luxemburg', 'p': 'spouse', 'o': '?x0', 't': '1903'}

 Q: What is <significant drug interaction> of <methadone> ?
 SPARQL: select distinct ?answer where { wd:Q179996 wdt:P769 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'methadone', 'p': 'significant drug interaction', 'o': '?x0'}

 Q: Which edition of Othello is this?
 SPARQL:  select distinct ?obj where { wd:Q26833 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Othello', 'p': 'edition', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'edition'}}

 Q: What is {monarch} of {sport country} of {Mana Mamuwene} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3844110 wdt:P1532 ?X . ?X wdt:P35 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'monarch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mana Mamuwene', 'p': 'sport country', 'o': '$y0'}}

 Q: what is the {replaced by} for {Malcolm Turnbull} has {position held} as {Leader of the Opposition of Australia} ?
 SPARQL: SELECT ?value WHERE { wd:Q927550 p:P39 ?s . ?s ps:P39 wd:Q2460433 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Turnbull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Leader of the Opposition of Australia'}}}

 Q: Tell me literary character whose name has the word wu in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3658341 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary character'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wu'}}

 Q: What is {elected in} and {end cause} of {{Ramsay MacDonald} has {position held} as {Member of the 32nd Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582584 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 32nd Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 32nd Parliament of the United Kingdom'}}}]

 Q: Which cricket team containing the word Indian was headed by coach Mahela Jayawardene?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17376093 . ?sbj wdt:P286 wd:Q2739165 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'indians')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cricket team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coach', 'o': 'Mahela Jayawardene'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'indians'}}

 Q: What is a Christian holiday that starts with the letter s.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60075825 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian holiday'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the historical country of the diplomatic relation of Czechoslovakia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P530 wd:Q33946 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Czechoslovakia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Who are the alumni of the developer of Gregorian telescope?
 SPARQL: SELECT ?answer WHERE { wd:Q742318 wdt:P61 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'alumni of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gregorian telescope', 'p': 'developer', 'o': '$y0'}}

 Q: tell me beer style starts with t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1998962 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'beer style'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which galaxy with the Eridanus constellation has the fastest radial velocity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q10433 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'radial velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'galaxy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Eridanus'}}}

 Q: Is the height of the EMT Luna X-2000 greater than 0.696?
 SPARQL: ASK WHERE { wd:Q646050 wdt:P2048 ?obj filter(?obj > 0.696) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'EMT Luna X-2000', 'p': 'height', 'o': '?x0', '?x0': '0.696'}

 Q: Vladimir Lenin is a citizen of which republic of the Soviet Union ?
 SPARQL:  select distinct ?obj where { wd:Q1394 wdt:P27 ?obj . ?obj wdt:P31 wd:Q236036 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Lenin', 'p': 'citizen of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic of the Soviet Union'}}

 Q: What is {sculptors} of {portrayed by} of {mandolin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q302497 wdt:P1299 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sculptor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mandolin', 'p': 'portrayed by', 'o': '$y0'}}

 Q: "Whichis {protonym} of {King Quail}, that has {taxon parent} is {Tetrao} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q244429 wdt:P1403 ?answer . ?answer wdt:P171 wd:Q756174}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'King Quail', 'p': 'protonym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon parent', 'o': 'Tetrao'}}

 Q: What is <health specialty> of <microbiology> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1995 wd:Q7193}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'health specialty', 'o': 'microbiology'}

 Q: What is award received  from  Claudia Cardinale   point in time  is  2002 - 6 - 1 ?
 SPARQL: SELECT ?obj WHERE { wd:Q107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Claudia Cardinale', 'p': 'award received', 'o': '?x0', 't': '2002'}

 Q: Which is the shopping day that starts with "b"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43516519 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'shopping day'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: How many US National Archives Identifier are mentioned in newspaper?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q11032 wdt:P1225 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'newspaper', 'p': 'National Archives Identifier', 'o': '?x0'}

 Q: Did {Julius_Caesar} {country of citizenship} {ancient Rome}?
 SPARQL: ASK WHERE { wd:Q1048 wdt:P27 wd:Q1747689 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Caesar', 'p': 'citizenship', 'o': '?x0', '?x0': 'Rome'}]

 Q: Which is the day in year for periodic occurrence of the Chinese New Year?
 SPARQL: select distinct ?answer where { wd:Q131772 wdt:P837 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chinese New Year', 'p': 'day in year for periodic occurrence', 'o': '?x0'}

 Q: Who is the director and director of photography of Spirited Away?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q155653 wdt:P57 ?ans_1 . wd:Q155653 wdt:P344 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Spirited Away', 'p': 'director', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Spirited Away', 'p': 'director of photography', 'o': '?x1'}]

 Q: Is it true that the prussian s 3 has 2.4 cylinders?
 SPARQL: ASK WHERE { wd:Q319087 wdt:P1100 ?obj filter(?obj = 2.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Prussian S 3', 'p': 'number of cylinders', 'o': '?x0', '?x0': '2.4'}

 Q: What is <residence> of <Isaac> ?
 SPARQL: select distinct ?answer where { wd:Q671872 wdt:P551 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Isaac', 'p': 'residence', 'o': '?x0'}

 Q: How many {measured by} are for {mental depression} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q4340209 wdt:P1880 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'mental depression', 'p': 'measured by', 'o': '?x0'}

 Q: Give me {art museum} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q207694 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art museum'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: How many significant drug interactions are there for aspirin?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q18216 wdt:P769 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'aspirin', 'p': 'significant drug interaction', 'o': '?x0'}

 Q: Which is the Compagnon de la Libération ID for Winston Churchill?
 SPARQL: select distinct ?answer where { wd:Q8016 wdt:P4804 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Winston Churchill', 'p': 'Compagnon de la Libération ID', 'o': '?x0'}

 Q: Which is NIST/CODATA ID for Planck length?
 SPARQL: select distinct ?answer where { wd:Q207387 wdt:P1645 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Planck length', 'p': 'NIST/CODATA ID', 'o': '?x0'}

 Q: Which is the taxon parent of the ingredient of squab?
 SPARQL: SELECT ?answer WHERE { wd:Q7581884 wdt:P186 ?X . ?X wdt:P171 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'taxon parent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'squab', 'p': 'ingredient', 'o': '$y0'}}

 Q: What is the Italian Senate of the Republic ID of Claudio Abbado?
 SPARQL: select distinct ?answer where { wd:Q151608 wdt:P2549 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Claudio Abbado', 'p': 'Italian Senate of the Republic ID', 'o': '?x0'}

 Q: What is the Mir@bel journal ID for Journal des sçavans ?
 SPARQL: select distinct ?answer where { wd:Q927072 wdt:P4730 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Journal des sçavans', 'p': 'Mir@bel journal ID', 'o': '?x0'}

 Q: What award did Fred Astaire receive in the year 1959?
 SPARQL: SELECT ?obj WHERE { wd:Q100937 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1959')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fred Astaire', 'p': 'award', 'o': '?x0', 't': '1959'}

 Q: What is {award received} of {Robert A. Heinlein} that is {for work} is {Requiem} ?
 SPARQL: SELECT ?obj WHERE { wd:Q123078 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q7314838 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert A. Heinlein', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Requiem'}}}

 Q: What is {instrument played} of {sport played} of {Oleg Davydov} ?
 SPARQL: SELECT ?answer WHERE { wd:Q920635 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oleg Davydov', 'p': 'sport', 'o': '$y0'}}

 Q: What is the diplomatic relation of the sovereign state of North China?
 SPARQL: SELECT ?answer WHERE { wd:Q1046848 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North China', 'p': 'sovereign state', 'o': '$y0'}}

 Q: WhIch is medical specialty of genetic association of FUT2 ?
 SPARQL: SELECT ?answer WHERE { wd:Q18024807 wdt:P2293 ?X . ?X wdt:P1995 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'medical specialty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'FUT2', 'p': 'genetic association', 'o': '$y0'}}

 Q: What is the {location of formation} and the {political ideology} of {Ku_Klux_Klan} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q47131 wdt:P740 ?ans_1 . wd:Q47131 wdt:P1142 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'KKK', 'p': 'location of formation', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'KKK', 'p': 'political ideology', 'o': '?x1'}]

 Q: Give me {aircraft model} that contains the word {tu} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056995 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tu'}}

 Q: What is the {human} for {distributor} of {The Birth of a Nation}
 SPARQL:  select distinct ?obj where { wd:Q220394 wdt:P750 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Birth of a Nation', 'p': 'distributor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: where is the head of government and head of state of Kerala?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1186 wdt:P6 ?ans_1 . wd:Q1186 wdt:P35 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Kerala', 'p': 'head of government', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Kerala', 'p': 'head of state', 'o': '?x1'}]

 Q: What is the {country code top-level domain} for {top-level Internet domain} of {Soviet Union}
 SPARQL:  select distinct ?obj where { wd:Q15180 wdt:P78 ?obj . ?obj wdt:P31 wd:Q42032 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Soviet Union', 'p': 'domain', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country code top-level domain'}}

 Q: What is {educated at} of {Ralph Bunche} that is {end time} is {1928-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q213500 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1928')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ralph Bunche', 'p': 'educated at', 'o': '?x0', 't': '1928'}

 Q: What is the Australian Classification category with the highest minimum age whose instance of is 15 rating?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q26708074 . ?ent wdt:P2899 ?obj . ?ent wdt:P31 wd:Q47542366 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'minimum age', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Australian Classification category', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': '15 rating'}}}

 Q: Who are the publishers for Civilization?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1868663 wdt:P123 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Civilization', 'p': 'publisher', 'o': '?x0'}

 Q: What is the {national economy} for {currency} of {Japanese yen}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q8146 . ?sbj wdt:P31 wd:Q6456916 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Yen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national economy'}}

 Q: what is the {end time} for {Chelsea Manning} has {place of detention} as {United States Disciplinary Barracks} ?
 SPARQL: SELECT ?value WHERE { wd:Q298423 p:P2632 ?s . ?s ps:P2632 wd:Q642270 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chelsea Manning', 'p': 'place of detention', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of detention', 'o': 'United States Disciplinary Barracks'}}}

 Q: Give me {branch of science} that {practiced by} {engineer} and which contains the word {engineering} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj wdt:P3095 wd:Q81096 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'engineering')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of science', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'engineer'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'engineering'}}

 Q: Give me {computer network protocol} that {main regulatory text} {WebDAV SEARCH} and which contains the word {hypertext} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15836568 . ?sbj wdt:P92 wd:Q30500704 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hypertext')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer network protocol', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'main regulatory text', 'o': 'WebDAV SEARCH'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hypertext'}}

 Q: Which is the crystal system of an amorphous solid?
 SPARQL: select distinct ?answer where { ?answer wdt:P556 wd:Q103382}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'crystal system', 'o': 'amorphous solid'}

 Q: What is the {business enterprise} with the {MAX(number of subscribers)} whose {legal form} is {joint-stock company}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P3744 ?obj . ?ent wdt:P1454 wd:Q134161 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of subscribers', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'legal form', 'o': 'joint-stock company'}}}

 Q: When did Tadao Ando receive his Asahi Prize award?
 SPARQL: SELECT ?value WHERE { wd:Q208220 p:P166 ?s . ?s ps:P166 wd:Q720434 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tadao Ando', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Asahi Prize'}, 't': '?x0'}

 Q: In 1993, what award did Anthony Hopkins receive?
 SPARQL: SELECT ?obj WHERE { wd:Q65932 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anthony Hopkins', 'p': 'award', 'o': '?x0', 't': '1993'}

 Q: what is the {start time} for {Frankfurt} has {instance of} as {city} ?
 SPARQL: SELECT ?value WHERE { wd:Q1794 p:P31 ?s . ?s ps:P31 ?x filter(contains(?x,'http://dbpedia.org/ontology/City')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frankfurt', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'http'}}}

 Q: What is the played by of the before was of The Wiggles Movie Soundtrack ?
 SPARQL: SELECT ?answer WHERE { wd:Q7774812 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Wiggles Movie Soundtrack', 'p': 'before was', 'o': '$y0'}}

 Q: What are the hot spring which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177380 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hot spring'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is the gene for genetic association of major depressive disorder?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2293 wd:Q42844 . ?sbj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'major depressive disorder', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: How many {noble title} are to/by {Sir} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P97 wd:Q209690 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'noble title', 'o': 'Sir'}

 Q: What is <owned by> of <Bank of China> ?
 SPARQL: select distinct ?answer where { wd:Q790068 wdt:P127 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bank of China', 'p': 'owned by', 'o': '?x0'}

 Q: What is the {comics character} for {sibling} of {Wonder Woman}
 SPARQL:  select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q1114461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wonder Woman', 'p': 'sibling', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comics character'}}

 Q: What is the {ward or electoral division of the United Kingdom} with the {MIN(mean age)} whose {country} is {United Kingdom}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q589282 . ?ent wdt:P4442 ?obj . ?ent wdt:P17 wd:Q145} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'mean age', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ward or electoral division of the United Kingdom', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'UK'}}}

 Q: What is Leslie Lamport's country of citizenship?
 SPARQL: select distinct ?answer where { wd:Q92613 wdt:P27 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leslie Lamport', 'p': 'country of citizenship', 'o': '?x0'}

 Q: What state of Peranakan Museum has a total fertility rate of 1.29?
 SPARQL: SELECT ?answer WHERE { wd:Q3078303 wdt:P131 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'1.29'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peranakan Museum', 'p': 'state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '1.29'}}

