 Q: What is the {weapon model} with the {MAX(field of view)} whose {conflict} is {World War II}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P4036 ?obj . ?ent wdt:P607 wd:Q362 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'field of view', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weapon model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'WWII'}}}

 Q: Which is the government of the executive body of Beijing?
 SPARQL:  select distinct ?obj where { wd:Q956 wdt:P208 ?obj . ?obj wdt:P31 wd:Q7188 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Beijing', 'p': 'executive body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'government'}}

 Q: what is the {street number} for {Les Demoiselles d'Avignon} has {exhibition history} as {rue d'Antin} ?
 SPARQL: SELECT ?value WHERE { wd:Q910199 p:P608 ?s . ?s ps:P608 wd:Q3450475 . ?s pq:P670 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'street number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Les Demoiselles d'Avignon", 'p': 'exhibition history', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'exhibition history', 'o': "rue d'Antin"}}}

 Q: How many {culture} are for {Enlil} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q214672 wdt:P2596 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Enlil', 'p': 'culture', 'o': '?x0'}

 Q: What is the {aircraft hijacking} for {has immediate cause} of {War on Terror}
 SPARQL:  select distinct ?obj where { wd:Q185729 wdt:P1478 ?obj . ?obj wdt:P31 wd:Q898712 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'War on Terror', 'p': 'has immediate cause', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft hijacking'}}

 Q: What is the tributary of Mindanao's body of water?
 SPARQL: SELECT ?answer WHERE { wd:Q124873 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mindanao', 'p': 'body of water', 'o': '$y0'}}

 Q: Tell me the sports team which contains the word world in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12973014 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sports team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: What linked jurisdiction is adjacent to the Council of the North?
 SPARQL: SELECT ?answer WHERE { wd:Q5176544 wdt:P1001 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'adjacent to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Council of the North', 'p': 'jurisdiction', 'o': '$y0'}}

 Q: How many officeholders are there with {Jiang Zemin} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1308 wd:Q16597 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Jiang Zemin'}

 Q: what is the {academic degree} for {James Mattis} has {educated at} as {Richland High School} ?
 SPARQL: SELECT ?value WHERE { wd:Q267902 p:P69 ?s . ?s ps:P69 wd:Q7330633 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Mattis', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Richland High School'}}}

 Q: What was located in Krasnodar prior to 1934?
 SPARQL: SELECT ?obj WHERE { wd:Q3646 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1934')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Krasnodar', 'p': 'in', 'o': '?x0', 't': '1934'}

 Q: What is {category of associated people} of {born in} of {Francis Crick} ?
 SPARQL: SELECT ?answer WHERE { wd:Q123280 wdt:P19 ?X . ?X wdt:P1792 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'category of associated people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francis Crick', 'p': 'born in', 'o': '$y0'}}

 Q: What is {county seat of} of {died in} of {Musa al-Kadhim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q315031 wdt:P20 ?X . ?X wdt:P1376 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'county seat of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Musa al-Kadhim', 'p': 'died in', 'o': '$y0'}}

 Q: what is the {point in time} for {Jerome Bruner} has {award received} as {APA Award for Distinguished Scientific Contributions to Psychology} ?
 SPARQL: SELECT ?value WHERE { wd:Q114867 p:P166 ?s . ?s ps:P166 wd:Q17112655 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jerome Bruner', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'APA Award for Distinguished Scientific Contributions to Psychology'}, 't': '?x0'}

 Q: What is the {codon} for {encoded by} of {L-phenylalanine}
 SPARQL:  select distinct ?obj where { wd:Q170545 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'L-phenylalanine', 'p': 'encoded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'codon'}}

 Q: What is {location} of {hunting} that is {excluding} is {domesticated animal} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36963 p:P276 ?s . ?s ps:P276 ?obj . ?s pq:P1011 wd:Q622852 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hunt', 'p': 'location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'excluding', 'o': 'domesticated animal'}}}

 Q: what is first-order metaclass contains the word type in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24017414 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'type')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'first-order metaclass'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'type'}}

 Q: Tell me the award Stephen Jay Gould received on the first of January 2001?
 SPARQL: SELECT ?obj WHERE { wd:Q180619 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Stephen Jay Gould', 'p': 'award', 'o': '?x0', 't': '2001'}

 Q: Did {Rajneesh} {occupation} {artist} and {guru} ?
 SPARQL: ASK WHERE { wd:Q148285 wdt:P106 wd:Q483501 . wd:Q148285 wdt:P106 wd:Q484260 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Rajneesh', 'p': 'occupation', 'o': '?x0', '?x0': 'artist'}, {'h': 'IS', 'v': '?x1', 's': 'Rajneesh', 'p': 'occupation', 'o': '?x1', '?x1': 'guru'}]

 Q: Which is the location of first performance of La traviata?
 SPARQL: select distinct ?answer where { wd:Q186162 wdt:P4647 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'La traviata', 'p': 'location of first performance', 'o': '?x0'}

 Q: which binary relation starts with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130901 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'binary relation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the rotation period for Crab Pulsar?
 SPARQL: select distinct ?answer where { wd:Q1044623 wdt:P2147 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Crab Pulsar', 'p': 'rotation period', 'o': '?x0'}

 Q: Is transgender the opposite of cisgender?
 SPARQL: ASK WHERE { wd:Q189125 wdt:P461 wd:Q1093205 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'transgender', 'p': 'opposite of', 'o': '?x0', '?x0': 'cis'}]

 Q: Does the vilkhivchik area equal to 0?
 SPARQL: ASK WHERE { wd:Q4334348 wdt:P2046 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vilkhivchik', 'p': 'area', 'o': '?x0', '?x0': '0'}

 Q: What is <Anime News Network person ID> of <Onyanko Club> ?
 SPARQL: select distinct ?answer where { wd:Q669430 wdt:P1982 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Onyanko Club', 'p': 'Anime News Network person ID', 'o': '?x0'}

 Q: what is the {end time} for {Otto von Bismarck} has {position held} as {Bundeskanzler (Norddeutscher Bund)} ?
 SPARQL: SELECT ?value WHERE { wd:Q8442 p:P39 ?s . ?s ps:P39 wd:Q885840 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Otto von Bismarck', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Bundeskanzler (Norddeutscher Bund)'}}}

 Q: what is the {valid in period} for {Turin} has {located in time zone} as {UTC+02:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q495 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Turin', 'p': 'time', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time', 'o': 'UTC+02:00'}}}

 Q: What is {science, that studies} of {disease}, that has {has outcome} is {genetic disease} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12136 wdt:P2579 ?answer . ?answer wdt:P1542 wd:Q200779}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'disease', 'p': 'science, that studies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has outcome', 'o': 'genetic disease'}}

 Q: What is {seat} of {Mitsubishi UFJ Financial Group}, that has {has local government areas} is {Yonbanchō} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1542175 wdt:P159 ?answer . ?answer wdt:P150 wd:Q3347147}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mitsubishi UFJ Financial Group', 'p': 'seat', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has local government areas', 'o': 'Yonbanchō'}}

 Q: Who was Peter Paul Rubens' employer in September 1609?
 SPARQL: SELECT ?obj WHERE { wd:Q5599 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1609')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Paul Rubens', 'p': 'employer', 'o': '?x0', 't': '1609'}

 Q: What work location of Gerolamo Cardano has a surface area of 93.03?
 SPARQL: SELECT ?answer WHERE { wd:Q184530 wdt:P937 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'93.03'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gerolamo Cardano', 'p': 'work location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'area', 'o': '93.03'}}

 Q: What is the {municipality of the Netherlands} with the {MAX(employment by economic sector)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2039348 . ?ent wdt:P2297 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'employment by economic sector', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of the Netherlands'}}

 Q: Was Lewis Hamilton a member of the sports team Minardi?
 SPARQL: ASK WHERE { wd:Q9673 wdt:P54 wd:Q142381 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lewis Hamilton', 'p': 'team', 'o': '?x0', '?x0': 'Minardi'}]

 Q: Who is the admin HQ of the movie studio for Dinner for Schmucks?
 SPARQL: SELECT ?answer WHERE { wd:Q1226599 wdt:P272 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'HQ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dinner for Schmucks', 'p': 'studio', 'o': '$y0'}}

 Q: What is Stuttgart Database of Scientific Illustrators ID for Marie Tharp?
 SPARQL: select distinct ?answer where { wd:Q538786 wdt:P2349 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marie Tharp', 'p': 'Stuttgart Database of Scientific Illustrators ID', 'o': '?x0'}

 Q: What is {label in official language} of {characters} of {Odyssey} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35160 wdt:P674 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'label in official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Odyssey', 'p': 'characters', 'o': '$y0'}}

 Q: Give me {organization} that {anthem} {Anthem of Europe} and which that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj wdt:P85 wd:Q11993 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'Anthem of Europe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {market capitalisation} of {holding company} of {PayPal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q483959 wdt:P749 ?X . ?X wdt:P2226 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'market cap', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paypal', 'p': 'holding', 'o': '$y0'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Roberto Baggio} has {member of sports team} as {Bologna F.C. 1909}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q67964 p:P54 ?s . ?s ps:P54 wd:Q1893 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberto Baggio', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Bologna'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberto Baggio', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Bologna'}}}]

 Q: What is {country} of {Belfast} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belfast', 'p': 'country', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belfast', 'p': 'country', 'o': '$y0'}}]

 Q: How many times was Austria-Hungary dissolved, abolished or demolished ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q28513 wdt:P576 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Austria-Hungary', 'p': 'abolished', 'o': '?x0'}

 Q: DOES THE FLASH POINT OF THE METHANOL EQUALS 52
 SPARQL: ASK WHERE { wd:Q14982 wdt:P2128 ?obj filter(?obj = 52) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'methanol', 'p': 'flash point', 'o': '?x0', '?x0': '52'}

 Q: What is the pronunciation audio of the administrative centre of Joseon ?
 SPARQL: SELECT ?answer WHERE { wd:Q28179 wdt:P36 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseon', 'p': 'administrative centre', 'o': '$y0'}}

 Q: What are the currency  which start with the letter yen
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'currency'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yen'}}

 Q: Did {Frank_Zappa} {child} {Moon Zappa} and {Ahmet Zappa} ?
 SPARQL: ASK WHERE { wd:Q127330 wdt:P40 wd:Q291024 . wd:Q127330 wdt:P40 wd:Q401963 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Frank Zappa', 'p': 'child', 'o': '?x0', '?x0': 'Moon Zappa'}, {'h': 'IS', 'v': '?x1', 's': 'Frank Zappa', 'p': 'child', 'o': '?x1', '?x1': 'Ahmet Zappa'}]

 Q: does the topaz mohs' hardness equal to 8?
 SPARQL: ASK WHERE { wd:Q134985 wdt:P1088 ?obj filter(?obj = 8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'topaz', 'p': 'hardness', 'o': '?x0', '?x0': '8'}

 Q: What is {writer} of {A Brief History of Time}, that has {professor} is {Dennis W. Sciama} ?
 SPARQL: SELECT ?answer WHERE { wd:Q471726 wdt:P50 ?answer . ?answer wdt:P1066 wd:Q284336}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'A Brief History of Time', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'professor', 'o': 'Dennis W. Sciama'}}

 Q: what is the {for work} for {W. H. Auden} has {award received} as {Pulitzer Prize for Poetry} ?
 SPARQL: SELECT ?value WHERE { wd:Q178698 p:P166 ?s . ?s ps:P166 wd:Q2117891 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'W. H. Auden', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Pulitzer Prize for Poetry'}}}

 Q: What is {taxonomic rank} of {higher taxon} of {crocodile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2535664 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'crocodile', 'p': 'higher taxon', 'o': '$y0'}}

 Q: What is <Les Voix de la poésie poet ID> of <Alphonse Daudet> ?
 SPARQL: select distinct ?answer where { wd:Q228546 wdt:P5477 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alphonse Daudet', 'p': 'Les Voix de la poésie poet ID', 'o': '?x0'}

 Q: Which is the asteroid spectral type for 10 Hygiea?
 SPARQL: select distinct ?answer where { wd:Q2640 wdt:P720 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '10 Hygiea', 'p': 'asteroid spectral type', 'o': '?x0'}

 Q: What is <ICCF player ID> of <Magnus Carlsen> ?
 SPARQL: select distinct ?answer where { wd:Q106807 wdt:P3316 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Magnus Carlsen', 'p': 'ICCF player ID', 'o': '?x0'}

 Q: what is the {point in time} for {Yul Brynner} has {award received} as {Special Tony Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q102813 p:P166 ?s . ?s ps:P166 wd:Q2308234 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Yul Brynner', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Special Tony Award'}, 't': '?x0'}

 Q: What was Anna Freud's country of citizenship in 1946?
 SPARQL: SELECT ?obj WHERE { wd:Q78485 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anna Freud', 'p': 'country of citizenship', 'o': '?x0', 't': '1946'}

 Q: What is the {logarithmic scale} for {measured physical quantity} of {energy}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P111 wd:Q11379 . ?sbj wdt:P31 wd:Q937378 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'measured physical quantity', 'o': 'energy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'logarithmic scale'}}

 Q: When did series of In the Mood for Love and follows?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1056853 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'In the Mood for Love', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'In the Mood for Love', 'p': 'series', 'o': '$y0'}}]

 Q: What is {educated at} of {William Walker} that is {end time} is {1838-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q196401 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1838')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Walker', 'p': 'educated at', 'o': '?x0', 't': '1838'}

 Q: Which is the Linguist list code of Esperanto?
 SPARQL: select distinct ?answer where { wd:Q143 wdt:P1232 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'Linguist list code', 'o': '?x0'}

 Q: who is favorite player of doctoral supervisor of Darius Lakdawalla ?
 SPARQL: SELECT ?answer WHERE { wd:Q5222945 wdt:P184 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'favorite player', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Darius Lakdawalla', 'p': 'doctoral supervisor', 'o': '$y0'}}

 Q: What is {participant of event} of {is the antonym of} of {girl} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3031 wdt:P461 ?X . ?X wdt:P1344 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'participant of event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'girl', 'p': 'antonym', 'o': '$y0'}}

 Q: What is {area of responsibility} of {NPR}, that has {time} is {UTC−07:00} ?
 SPARQL: SELECT ?answer WHERE { wd:Q671510 wdt:P2541 ?answer . ?answer wdt:P421 wd:Q2212}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'NPR', 'p': 'area of responsibility', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'time', 'o': 'UTC−07:00'}}

 Q: What is the underlying cause of genetic drift?
 SPARQL: SELECT ?answer WHERE { wd:Q486420 wdt:P1542 ?X . ?X wdt:P828 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'genetic drift', 'p': 'cause of', 'o': '$y0'}}

 Q: What religion do the children of Mahisente Habte Mariam follow?
 SPARQL: SELECT ?answer WHERE { wd:Q6734112 wdt:P40 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'religion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mahisente Habte Mariam', 'p': 'child', 'o': '$y0'}}

 Q: What is {spouse} of {Meghan, Duchess of Sussex} that is {end cause} is {divorce} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3304418 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1534 wd:Q93190 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husband', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Meghan, Duchess of Sussex', 'p': 'husband', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end cause', 'o': 'divorce'}}}

 Q: Tell me the characters in the version of Božanska komedija (Debevec).
 SPARQL: SELECT ?answer WHERE { wd:Q21191070 wdt:P629 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Božanska komedija (Debevec)', 'p': 'version of', 'o': '$y0'}}

 Q: which  USDA NDB number of hot dog ?
 SPARQL: select distinct ?answer where { wd:Q181055 wdt:P1978 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hot dog', 'p': 'USDA NDB number', 'o': '?x0'}

 Q: Is it true that the standard molar entropy of germanium equals to 37.32?
 SPARQL: ASK WHERE { wd:Q867 wdt:P3071 ?obj filter(?obj = 37.32) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'germanium', 'p': 'standard molar entropy', 'o': '?x0', '?x0': '37.32'}

 Q: whats the route of administration for lead poisoning?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q110315 wdt:P636 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'lead poisoning', 'p': 'route of administration', 'o': '?x0'}

 Q: Tell me the sports team Giuseppe Meazza plays for and when he began with them.
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q192131 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'began', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Giuseppe Meazza', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Giuseppe Meazza', 'p': 'team', 'o': '$y0'}}]

 Q: Does the speed limit of the Brocken Railway equal 40?
 SPARQL: ASK WHERE { wd:Q514245 wdt:P3086 ?obj filter(?obj = 40) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Brocken Railway', 'p': 'speed limit', 'o': '?x0', '?x0': '40'}

 Q: What is {opposite} of {manifestation of} of {noise} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179448 wdt:P1557 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'noise', 'p': 'manifestation of', 'o': '$y0'}}

 Q: who is cousin for motif of Portrait of Adele Bloch-Bauer I ?
 SPARQL: SELECT ?answer WHERE { wd:Q354396 wdt:P180 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cousin', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Portrait of Adele Bloch-Bauer I', 'p': 'motif', 'o': '$y0'}}

 Q: What administrative territorial entity of Kenya starts with the letter "n"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3976641 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'administrative territorial entity of Kenya'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: How many {political alignment} are to/by {populism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1387 wd:Q180490 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'political alignment', 'o': 'populism'}

 Q: What are the group or class of chemical substances which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17339814 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group or class of chemical substances'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Which is the produced sound of thunder?
 SPARQL: select distinct ?answer where { ?answer wdt:P4733 wd:Q83301}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'produced sound', 'o': 'thunder'}

 Q: What is the {airline} for {operator} of {Airbus A340}
 SPARQL:  select distinct ?obj where { wd:Q6481 wdt:P137 ?obj . ?obj wdt:P31 wd:Q46970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Airbus A340', 'p': 'operator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline'}}

 Q: What is the subsidiary company working for Leonard Maltin?
 SPARQL: SELECT ?answer WHERE { wd:Q731195 wdt:P108 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leonard Maltin', 'p': 'working for', 'o': '$y0'}}

 Q: What are the historic county of England which start with the letter yorkshire
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yorkshire')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historic county of England'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yorkshire'}}

 Q: Which is the Familypedia person ID for Clement Attlee?
 SPARQL: select distinct ?answer where { wd:Q129006 wdt:P4193 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Clement Attlee', 'p': 'Familypedia person ID', 'o': '?x0'}

 Q: What is the {business} for {business division} of {Ford Motor Company}
 SPARQL:  select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ford Motor Company', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: what is the {replaced by} for {Cnut the Great} has {position held} as {monarch of Norway} ?
 SPARQL: SELECT ?value WHERE { wd:Q134128 p:P39 ?s . ?s ps:P39 wd:Q1294765 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cnut the Great', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of Norway'}}}

 Q: Did {Milky_Way} {child astronomical body} {Messier 47} and {NGC 4833} ?
 SPARQL: ASK WHERE { wd:Q321 wdt:P398 wd:Q13942 . wd:Q321 wdt:P398 wd:Q840301 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Milky Way', 'p': 'child astronomical body', 'o': '?x0', '?x0': 'Messier 47'}, {'h': 'IS', 'v': '?x1', 's': 'Milky Way', 'p': 'child astronomical body', 'o': '?x1', '?x1': 'NGC 4833'}]

 Q: Is the personal best of Walter Steiner equal to 179?
 SPARQL: ASK WHERE { wd:Q372873 wdt:P2415 ?obj filter(?obj = 179) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Walter Steiner', 'p': 'personal best', 'o': '?x0', '?x0': '179'}

 Q: How many employers does Johnson & Johnson provide?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P108 wd:Q333718 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Johnson & Johnson'}

 Q: What is the operator and manufacturer of Boeing B-52 Stratofortress?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q174534 wdt:P137 ?ans_1 . wd:Q174534 wdt:P176 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Boeing B-52 Stratofortress', 'p': 'operator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Boeing B-52 Stratofortress', 'p': 'manufacturer', 'o': '?x1'}]

 Q: Is the age of majority in Ireland equal to 21.6?
 SPARQL: ASK WHERE { wd:Q27 wdt:P2997 ?obj filter(?obj = 21.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ireland', 'p': 'age of majority', 'o': '?x0', '?x0': '21.6'}

 Q: What sport does the chairwoman of the Athletic Club play?
 SPARQL: SELECT ?answer WHERE { wd:Q8687 wdt:P488 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sport', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Athletic Club', 'p': 'chairwoman', 'o': '$y0'}}

 Q: What is {animals species kept} of {venue} of {Dinny, the Brontosaur (Calgary Zoo)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44664230 wdt:P276 ?X . ?X wdt:P1990 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'species kept', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dinny, the Brontosaur (Calgary Zoo)', 'p': 'location', 'o': '$y0'}}

 Q: What award did Gherman Titov receive on August 9, 1961?
 SPARQL: SELECT ?obj WHERE { wd:Q152298 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gherman Titov', 'p': 'award', 'o': '?x0', 't': '1961'}

 Q: What is the exact date of John Cabot's death in 1498?
 SPARQL: SELECT ?value WHERE { wd:Q85642 p:P570 ?s . ?s ps:P570 ?x filter(contains(YEAR(?x),'1498')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Cabot', 'p': 'death', 'o': '$y0'}}

 Q: Who are the illustrator and author of The Hobbit?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q74287 wdt:P110 ?ans_1 . wd:Q74287 wdt:P50 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Hobbit', 'p': 'illustrator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Hobbit', 'p': 'author', 'o': '?x1'}]

 Q: What is {owners} of {original air channel} of {CCTV Spring Festival Gala 1998} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24836991 wdt:P449 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'CCTV Spring Festival Gala 1998', 'p': 'channel', 'o': '$y0'}}

 Q: What is the mortality rate with the highest frequency?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q58702 . ?ent wdt:P2844 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'incidence', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mortality rate'}}

