 Q: Is it true that the topographic isolation of Pollux equals to 0.7?
 SPARQL: ASK WHERE { wd:Q30485 wdt:P2659 ?obj filter(?obj = 0.7) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Pollux', 'p': 'topographic isolation', 'o': '?x0', '?x0': '0.7'}

 Q: What award did Edward C. Prescott receive on 1-1-2004?
 SPARQL: SELECT ?obj WHERE { wd:Q312585 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Edward C. Prescott', 'p': 'award', 'o': '?x0', 't': '2004'}

 Q: What is the {headquarters location} and the {location of formation} of {Google} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q95 wdt:P159 ?ans_1 . wd:Q95 wdt:P740 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Google', 'p': 'headquarters location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Google', 'p': 'location of formation', 'o': '?x1'}]

 Q: What is <has melody> of <Tristan und Isolde> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1625 wd:Q1324254}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has melody', 'o': 'Tristan und Isolde'}

 Q: What is the diplomatic relations like in basin countries of Lake Okeechobee?
 SPARQL: SELECT ?answer WHERE { wd:Q202905 wdt:P205 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lake Okeechobee', 'p': 'basin countries', 'o': '$y0'}}

 Q: What is {twin town} of {principle office} of {Financial Times} ?
 SPARQL: SELECT ?answer WHERE { wd:Q183399 wdt:P159 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Financial Times', 'p': 'principle office', 'o': '$y0'}}

 Q: How many {active ingredient in} are for {lidocaine} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q216935 wdt:P3780 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'lidocaine', 'p': 'active ingredient in', 'o': '?x0'}

 Q: what is the {applies to part} for {Augustus II the Strong} has {place of burial} as {Katholische Hofkirche} ?
 SPARQL: SELECT ?value WHERE { wd:Q53437 p:P119 ?s . ?s ps:P119 wd:Q666935 . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Augustus II the Strong', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of burial', 'o': 'Katholische Hofkirche'}}}

 Q: What is the CBS municipality code of Nijmegen?
 SPARQL: select distinct ?answer where { wd:Q47887 wdt:P382 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nijmegen', 'p': 'CBS municipality code', 'o': '?x0'}

 Q: Was Herbie Hancock the winner of the award for the Grammy Award for Best Pop Collaboration with Vocals?
 SPARQL: SELECT ?value WHERE { wd:Q105875 p:P166 ?s . ?s ps:P166 wd:Q691203 . ?s pq:P1346 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Herbie Hancock', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grammy Award for Best Pop Collaboration with Vocals'}}}

 Q: What is {total fertility rate} of {Sudan} that is {determination method} is {estimation process} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1049 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sudan', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'estimation process'}}}

 Q: Is the half-life of silicon-36 less than 0.54?
 SPARQL: ASK WHERE { wd:Q18844603 wdt:P2114 ?obj filter(?obj < 0.54) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'silicon-36', 'p': 'half-life', 'o': '?x0', '?x0': '0.54'}

 Q: What is a sovereign state for office held by the pope's head of state?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1906 wd:Q19546 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'pope', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the Malayalam alphabet?
 SPARQL:  select distinct ?obj where { wd:Q36236 wdt:P282 ?obj . ?obj wdt:P31 wd:Q9779 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Malayalam', 'p': 'alphabet', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alphabet'}}

 Q: What is the {programming language} for {designed by} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q9143 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'programming language'}}

 Q: Give me {Zuckerart} that contains the word {syrup} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syrup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Zuckerart'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'syrup'}}

 Q: Which reward was The Diary of Anne Frank a nominee for?
 SPARQL: SELECT ?answer WHERE { wd:Q707986 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Diary of Anne Frank', 'p': 'nominee for', 'o': '$y0'}}

 Q: What is the {business} for {headquarters location} of {Lyon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Lyon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is the Commons category of Classic of Poetry ?
 SPARQL: select distinct ?answer where { wd:Q465108 wdt:P373 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Classic of Poetry', 'p': 'Commons category', 'o': '?x0'}

 Q: Who was married to Ida Lupino on January 1st, 1951?
 SPARQL: SELECT ?obj WHERE { wd:Q148669 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1951')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ida Lupino', 'p': 'married to', 'o': '?x0', 't': '1951'}

 Q: What agent had conflict with Lowell English?
 SPARQL: SELECT ?answer WHERE { wd:Q6693201 wdt:P607 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'agent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lowell English', 'p': 'conflict', 'o': '$y0'}}

 Q: What is <approved by> of <European Parliament> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P790 wd:Q8889}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'approved by', 'o': 'European Parliament'}

 Q: What is <nickname> of <Mike Krzyzewski> ?
 SPARQL: select distinct ?answer where { wd:Q434909 wdt:P1449 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mike Krzyzewski', 'p': 'nickname', 'o': '?x0'}

 Q: What is Fantastic Fiction author ID of James Ellroy?
 SPARQL: select distinct ?answer where { wd:Q318487 wdt:P5408 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Ellroy', 'p': 'Fantastic Fiction author ID', 'o': '?x0'}

 Q: Where was Syrie Maugham's country of citizenship in 1927?
 SPARQL: SELECT ?obj WHERE { wd:Q7663337 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1927')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Syrie Maugham', 'p': 'country of citizenship', 'o': '?x0', 't': '1927'}

 Q: What administrative territorial entity was Sint Maarten located in the year December 15, 1954?
 SPARQL: SELECT ?obj WHERE { wd:Q26273 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1954')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sint Maarten', 'p': 'in', 'o': '?x0', 't': '1954'}

 Q: What is the density of aluminium at a temperature of 20 degrees?
 SPARQL: SELECT ?obj WHERE { wd:Q663 p:P2054 ?s . ?s ps:P2054 ?obj . ?s pq:P2076 ?x filter(contains(?x,'20.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'density', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'aluminium', 'p': 'density', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'temperature', 'o': '20.0'}}}

 Q: Which is the GeneReviews ID for Alzheimers disease?
 SPARQL: select distinct ?answer where { wd:Q11081 wdt:P668 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alzheimer', 'p': 'GeneReviews ID', 'o': '?x0'}

 Q: What is {date of death} and {father} of {{Joseph Stalin} has {child} as {Artem Sergeev}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q4416801 . ?s pq:P570 ?value1 . ?s pq:P22 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Artem Sergeev'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'son of', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Artem Sergeev'}}}]

 Q: "What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Member of the 55th Parliament of the United Kingdom} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q57689 wdt:P39 ?answer . ?answer wdt:P156 wd:Q35494253}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Martin McGuinness', 'p': 'holds position', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prequel of', 'o': 'Member of the 55th Parliament of the United Kingdom'}}

 Q: Give me {sport discipline} that {authority} {World Rugby} and which contains the word {rugby} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj wdt:P797 wd:Q369225 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rugby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport discipline', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'authority', 'o': 'World Rugby'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'rugby'}}

 Q: Which is the SAHRA heritage site ID for University of Cape Town?
 SPARQL: select distinct ?answer where { wd:Q951305 wdt:P3759 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Cape Town', 'p': 'SAHRA heritage site ID', 'o': '?x0'}

 Q: What is the CPU with the greatest charge?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2229 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'thermal design power', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'CPU'}}

 Q: what is the {end time} for {Sarah Bernhardt} has {spouse} as {Jacques Damala} ?
 SPARQL: SELECT ?value WHERE { wd:Q4605 p:P26 ?s . ?s ps:P26 wd:Q6120528 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sarah Bernhardt', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Jacques Damala'}}}

 Q: What is {birth city} of {Kristen Stewart}, that has {county seat of} is {Los Angeles County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q126599 wdt:P19 ?answer . ?answer wdt:P1376 wd:Q104994}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kristen Stewart', 'p': 'birth city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat of', 'o': 'Los Angeles County'}}

 Q: Where {faith} {has influence} on {Madonna} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1744 wdt:P737 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'faith', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Madonna', 'p': 'has influence', 'o': '$y0'}}

 Q: What is the {biopharmaceutical} for {encoded by} of {INS}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P702 wd:Q21163221 . ?sbj wdt:P31 wd:Q679692 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'encoded by', 'o': 'INS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biopharmaceutical'}}

 Q: what is the {end time} for {Alla Pugacheva} has {spouse} as {Mykolas Orbakas} ?
 SPARQL: SELECT ?value WHERE { wd:Q80510 p:P26 ?s . ?s ps:P26 wd:Q16465149 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alla Pugacheva', 'p': 'wife', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'wife', 'o': 'Mykolas Orbakas'}}}

 Q: what is the {point in time} for {Isadora Duncan} has {significant event} as {funeral} ?
 SPARQL: SELECT ?value WHERE { wd:Q483512 p:P793 ?s . ?s ps:P793 wd:Q201676 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Isadora Duncan', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'significant event', 'o': 'funeral'}, 't': '?x0'}

 Q: Which is the gens of Sallust?
 SPARQL: select distinct ?answer where { wd:Q7170 wdt:P5025 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sallust', 'p': 'gens', 'o': '?x0'}

 Q: What is {culture} of {state} of {Australian Secret Intelligence Service} ?
 SPARQL: SELECT ?answer WHERE { wd:Q181694 wdt:P17 ?X . ?X wdt:P172 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'culture', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Australian Secret Intelligence Service', 'p': 'state', 'o': '$y0'}}

 Q: What is <open days> of <Thursday> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3025 wd:Q129}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'open days', 'o': 'Thursday'}

 Q: What language does the sculptor of Z3 write in?
 SPARQL: SELECT ?answer WHERE { wd:Q222419 wdt:P170 ?X . ?X wdt:P1412 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Z3', 'p': 'sculptor', 'o': '$y0'}}

 Q: What award did I.M. Pei receive in 2010?
 SPARQL: SELECT ?obj WHERE { wd:Q46868 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'I.M. Pei', 'p': 'award', 'o': '?x0', 't': '2010'}

 Q: "Where is {deathplace} of {Amelia Earhart}, which has {tributary} is {Ayampe River} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q3355 wdt:P20 ?answer . ?answer wdt:P974 wd:Q1367043}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Amelia Earhart', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Ayampe River'}}

 Q: Was Cleopatra's child named Caesarion?
 SPARQL: ASK WHERE { wd:Q635 wdt:P40 wd:Q39589 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Cleopatra', 'p': 'child', 'o': '?x0', '?x0': 'Caesarion'}]

 Q: what is the {point in time} for {Barry Humphries} has {award received} as {Centenary Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q734221 p:P166 ?s . ?s ps:P166 wd:Q2393205 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Barry Humphries', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Centenary Medal'}, 't': '?x0'}

 Q: Which chemical compound has the most binding energy?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2154 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'binding energy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is {date of death} and {father} of {{Abigail Adams} has {child} as {Abigail Adams Smith}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P570 ?value1 . ?s pq:P22 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'father', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams'}}}]

 Q: What was the population of Washington, D.C. at the start of 1860?
 SPARQL: SELECT ?obj WHERE { wd:Q61 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1860')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Washington, D.C.', 'p': 'population', 'o': '?x0', 't': '1860'}

 Q: Did {Mao_Zedong} {position held} {President of the People's Republic of China}?
 SPARQL: ASK WHERE { wd:Q5816 wdt:P39 wd:Q655407 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mao Zedong', 'p': 'position held', 'o': '?x0', '?x0': "President of the People's Republic of China"}]

 Q: what is the {afflicts} for {arsenic} has {minimal lethal dose} as {300.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q871 p:P2300 ?s . ?s ps:P2300 ?x filter(contains(?x,'300.0')) . ?s pq:P689 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'afflicts', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'arsenic', 'p': 'minimal lethal dose', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'minimal lethal dose', 'o': '300.0'}}}

 Q: Is it true that the maximum wavelength of sensitivity of Submilimeter Array is greater than 2.004?
 SPARQL: ASK WHERE { wd:Q1205241 wdt:P3737 ?obj filter(?obj > 2.004) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Submillimeter Array', 'p': 'maximum wavelength of sensitivity', 'o': '?x0', '?x0': '2.004'}

 Q: What nonprofit organization is regulated by the association of football?
 SPARQL:  select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q163740 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'football', 'p': 'regulated by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonprofit organization'}}

 Q: Which is the spacecraft that is manufactured by SpaceX?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q40218 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufactured by', 'o': 'SpaceX', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spacecraft'}}

 Q: what is the {start time} for {Boris Johnson} has {position held} as {Member of the 56th Parliament of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q180589 p:P39 ?s . ?s ps:P39 wd:Q30524718 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boris Johnson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 56th Parliament of the United Kingdom'}}}

 Q: What is the {city} for {capital} of {Wales}
 SPARQL:  select distinct ?obj where { wd:Q25 wdt:P36 ?obj . ?obj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wales', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: Which is the Commons gallery for Georges Seurat?
 SPARQL: select distinct ?answer where { wd:Q34013 wdt:P935 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Georges Seurat', 'p': 'Commons gallery', 'o': '?x0'}

 Q: What is a nut that starts with the letter n.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nut'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is {date of death} and {date of birth} of {{Joseph Stalin} has {child} as {Svetlana Alliluyeva}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q228584 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Svetlana Alliluyeva'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Svetlana Alliluyeva'}}}]

 Q: How many {occupant} are to/by {Rijksmuseum} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q190804 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'occupant', 'o': 'Rijksmuseum'}

 Q: What is the {archive} for {archives at} of {The Walt Disney Company}
 SPARQL:  select distinct ?obj where { wd:Q7414 wdt:P485 ?obj . ?obj wdt:P31 wd:Q166118 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Disney', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archives'}}

 Q: what is the {for work} for {Jack Warner} has {award received} as {Academy Award for Best Picture} ?
 SPARQL: SELECT ?value WHERE { wd:Q72614 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jack Warner', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Academy Award for Best Picture'}}}

 Q: What is the birthplace of Maureen O'Hara, which has the co-ordinate location of 53.3252?
 SPARQL: SELECT ?answer WHERE { wd:Q229276 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'53.3252'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Maureen O'Hara", 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'co-ordinate location', 'o': '53.3252'}}

 Q: What is the official residence of Queens?
 SPARQL: select distinct ?answer where { ?answer wdt:P263 wd:Q18424}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official residence', 'o': 'Queens'}

 Q: What is {spouse} of {Gerard Reve} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q364153 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerard Reve', 'p': 'married', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerard Reve', 'p': 'married', 'o': '$y0'}}]

 Q: What is the {Commonwealth realm} with the {MIN(real gross domestic product growth rate)} whose {diplomatic relation} is {Taiwan}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q202686 . ?ent wdt:P2219 ?obj . ?ent wdt:P530 wd:Q865} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'real gross domestic product growth rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Commonwealth realm', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Taiwan'}}}

 Q: What is <located on astronomical body> of <North America> ?
 SPARQL: select distinct ?answer where { wd:Q49 wdt:P376 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'North America', 'p': 'located on astronomical body', 'o': '?x0'}

 Q: Who is the owner of the theatre company that made 'The Birth of the Star Spangled Banner'?
 SPARQL: SELECT ?answer WHERE { wd:Q21184208 wdt:P272 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Birth of the Star Spangled Banner', 'p': 'theatre company', 'o': '$y0'}}

 Q: What is {manner of death} of {Abraham Lincoln} that is {killed by} is {John Wilkes Booth} ?
 SPARQL: SELECT ?obj WHERE { wd:Q91 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P157 wd:Q180914 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manner of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abraham Lincoln', 'p': 'manner of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'killed by', 'o': 'John Wilkes Booth'}}}

 Q: What sovereign state belonging to the International Finance Corporation has the lowest unemployment rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1198 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'unemployment rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Finance Corporation'}}}

 Q: Who was the person with Chris Rock when he was awarded the Lunt-Fontanne Award for Ensemble Excellence?
 SPARQL: SELECT ?value WHERE { wd:Q4109 p:P166 ?s . ?s ps:P166 wd:Q28007406 . ?s pq:P1706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chris Rock', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Lunt-Fontanne Award for Ensemble Excellence'}}}

 Q: What is the {country of citizenship} and the {occupation} of {Kelly_Clarkson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q483507 wdt:P27 ?ans_1 . wd:Q483507 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Kelly Clarkson', 'p': 'country of citizenship', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Kelly Clarkson', 'p': 'occupation', 'o': '?x1'}]

 Q: What is the Uppslagsverket Finland ID for kickboxing?
 SPARQL: select distinct ?answer where { wd:Q178678 wdt:P4854 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'kickboxing', 'p': 'Uppslagsverket Finland ID', 'o': '?x0'}

 Q: How many different kinds of industry are affected by furniture?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P452 wd:Q14745 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'industry', 'o': 'furniture'}

 Q: what is the {end time} for {Lee de Forest} has {spouse} as {Nora Stanton Blatch Barney} ?
 SPARQL: SELECT ?value WHERE { wd:Q354863 p:P26 ?s . ?s ps:P26 wd:Q17676 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lee de Forest', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Nora Stanton Blatch Barney'}}}

 Q: What is {follows} and {followed by} of {{Louis the Pious} has {noble title} as {king of Franks}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'predecessor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'successor', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}]

 Q: What is the bibliography of the  PhD advisor to Karl Herzfeld?
 SPARQL: SELECT ?answer WHERE { wd:Q84763 wdt:P184 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bibliography', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karl Herzfeld', 'p': 'advisor', 'o': '$y0'}}

 Q: What is {total fertility rate} of {Slovakia} that is {determination method} is {estimation process} ?
 SPARQL: SELECT ?obj WHERE { wd:Q214 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Slovakia', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'estimation process'}}}

 Q: Tell me {intergovernmental organization}  whose name  starts with s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intergovernmental organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {stable version} of {user interface} of {Amazon Kindle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q136469 wdt:P1414 ?X . ?X wdt:P348 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'version', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amazon Kindle', 'p': 'user interface', 'o': '$y0'}}

 Q: What is {music genre} of {developed by} of {Battle Zeque Den} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4870126 wdt:P178 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle Zeque Den', 'p': 'developed by', 'o': '$y0'}}

 Q: what is the {start time} for {Republican Party} has {chairperson} as {Ronna Romney McDaniel} ?
 SPARQL: SELECT ?value WHERE { wd:Q29468 p:P488 ?s . ?s ps:P488 wd:Q27899325 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Republican Party', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Ronna Romney McDaniel'}}}

 Q: Which is the Basketball-Reference.com NBA player ID of Hakeem Olajuwon?
 SPARQL: select distinct ?answer where { wd:Q273256 wdt:P2685 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hakeem Olajuwon', 'p': 'Basketball-Reference.com NBA player ID', 'o': '?x0'}

 Q: What is {follows} and {followed by} of {{Communist Party of China} has {chairperson} as {Hu Jintao}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q15029 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chinese Communist Party', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Hu Jintao'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chinese Communist Party', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Hu Jintao'}}}]

 Q: What is { solubility } of { nitrous oxide } { solvent } is { water }?
 SPARQL: SELECT ?obj WHERE { wd:Q905750 p:P2177 ?s . ?s ps:P2177 ?obj . ?s pq:P2178 wd:Q283 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'solubility', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'nitrous oxide', 'p': 'solubility', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'solvent', 'o': 'water'}}}

 Q: What is {type locality (geology)} of {beryl}, that has {gps coordinates} is {24.77111111 34.71805556} ?
 SPARQL: SELECT ?answer WHERE { wd:Q103480 wdt:P2695 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'24.77111111 34.71805556'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'beryl', 'p': 'type locality (geology)', 'o': '?x0'}

 Q: Which {history of topic} and the {geography of topic} is {Melbourne} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q3141 wdt:P2184 ?ans_1 . wd:Q3141 wdt:P2633 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Melbourne', 'p': 'history of topic', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Melbourne', 'p': 'geography of topic', 'o': '?x1'}]

