 Q: what is the {start time} for {Anni-Frid Lyngstad} has {spouse} as {Prince Heinrich Ruzzo Reuss of Plauen} ?
 SPARQL: SELECT ?value WHERE { wd:Q201908 p:P26 ?s . ?s ps:P26 wd:Q1208883 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anni-Frid Lyngstad', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Prince Heinrich Ruzzo Reuss of Plauen'}}}

 Q: Who gave the{product of} of {series} of {Honda RC174} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15074515 wdt:P179 ?X . ?X wdt:P176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'product of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honda RC174', 'p': 'series', 'o': '$y0'}}

 Q: How many {language of work or name} are to/by {Esperanto} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P407 wd:Q143 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Esperanto'}

 Q: Which the venue of the bibliographic citation of the Toward a general psychobiological theory of emotions?
 SPARQL: SELECT ?answer WHERE { wd:Q22251380 wdt:P2860 ?X . ?X wdt:P1433 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'venue', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Toward a general psychobiological theory of emotions', 'p': 'bibliographic citation', 'o': '$y0'}}

 Q: what is the {type of kinship} for {Gina Lollobrigida} has {relative} as {Guido Lollobrigida} ?
 SPARQL: SELECT ?value WHERE { wd:Q56009 p:P1038 ?s . ?s ps:P1038 wd:Q1553604 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gina Lollobrigida', 'p': 'family', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'family', 'o': 'Guido Lollobrigida'}}}

 Q: what is the {conferred by} for {Paulo Freire} has {award received} as {doctor honoris causa} ?
 SPARQL: SELECT ?value WHERE { wd:Q164797 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P1027 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conferred by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paulo Freire', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'doctor honoris causa'}}}

 Q: What is {nominated for} of {Claude Rains} that is {for work} is {Notorious} ?
 SPARQL: SELECT ?obj WHERE { wd:Q318734 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q587419 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Claude Rains', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Notorious'}}}

 Q: What is {born in} of {Frank Zamboni}, that has {has villages} is {Carbon County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1287174 wdt:P19 ?answer . ?answer wdt:P150 wd:Q156467}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frank Zamboni', 'p': 'born in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has villages', 'o': 'Carbon County'}}

 Q: Who is the {human} for {position held} of {United Nations Secretary-General}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P39 wd:Q81066 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'position held', 'o': 'United Nations Secretary-General', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When was Leonardo DiCaprio nominated for the Academy Award for Best Actor.
 SPARQL: SELECT ?value WHERE { wd:Q38111 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Leonardo DiCaprio', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}, 't': '?x0'}

 Q: What is the {monument} for {place of death} of {David Livingstone}
 SPARQL:  select distinct ?obj where { wd:Q48373 wdt:P20 ?obj . ?obj wdt:P31 wd:Q4989906 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Livingstone', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monument'}}

 Q: what is the {start time} for {Cornelis Drebbel} has {work location} as {Haarlem} ?
 SPARQL: SELECT ?value WHERE { wd:Q365463 p:P937 ?s . ?s ps:P937 wd:Q9920 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cornelis Drebbel', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'Haarlem'}}}

 Q: What is {leader} of {awards} of {Cliff Robinson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1101335 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'leader', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cliff Robinson', 'p': 'awards', 'o': '$y0'}}

 Q: Is the right ascension of the Sh2-308 greater than 82.84?
 SPARQL: ASK WHERE { wd:Q30086636 wdt:P6257 ?obj filter(?obj > 82.84) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Sh2-308', 'p': 'right ascension', 'o': '?x0', '?x0': '82.84'}

 Q: What is {employer} of {Gabriel Fauré} that is {position held} is {kapellmeister} ?
 SPARQL: SELECT ?obj WHERE { wd:Q104919 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q215793 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gabriel Fauré', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'kapellmeister'}}}

 Q: What are the phonetic alphabet which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q579287 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phonetic alphabet'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {record producer} of {preceded by} of {The Dark Knight Rises} ?
 SPARQL: SELECT ?answer WHERE { wd:Q189330 wdt:P155 ?X . ?X wdt:P162 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'producer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Dark Knight Rises', 'p': 'preceded by', 'o': '$y0'}}

 Q: What is {married to} of {is daughter of} of {Constantine VII} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41608 wdt:P25 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'married to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Constantine VII', 'p': 'is daughter of', 'o': '$y0'}}

 Q: Which is the antonym of the location of the moustache?
 SPARQL: SELECT ?answer WHERE { wd:Q15179 wdt:P276 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'moustache', 'p': 'location', 'o': '$y0'}}

 Q: what is the {end time} for {Ban Ki-moon} has {position held} as {United Nations Secretary-General} ?
 SPARQL: SELECT ?value WHERE { wd:Q1253 p:P39 ?s . ?s ps:P39 wd:Q81066 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ban Ki-moon', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United Nations Secretary-General'}}}

 Q: Give me {patent medicine} that {discoverer or inventor} {John Pemberton} and which that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3480271 . ?sbj wdt:P61 wd:Q215959 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'patent medicine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discoverer or inventor', 'o': 'John Pemberton'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Is principle office Girls' Generation new label?
 SPARQL: SELECT ?answer WHERE { wd:Q20153 wdt:P264 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'principle office', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Girls' Generation", 'p': 'label', 'o': '$y0'}}

 Q: When did member of sports team of George Weah and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q173139 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Weah', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Weah', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is {award received} and {together with} of {{Park Sung-hyun} has {participant of} as {2008 FITA Archery World Cup}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q233884 p:P1344 ?s . ?s ps:P1344 wd:Q2232366 . ?s pq:P166 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Sung-hyun', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'participant of', 'o': '2008 FITA Archery World Cup'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Sung-hyun', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'participant of', 'o': '2008 FITA Archery World Cup'}}}]

 Q: Is the Gini coefficient of the USA less than 41.52?
 SPARQL: ASK WHERE { wd:Q30 wdt:P1125 ?obj filter(?obj < 41.52) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'USA', 'p': 'Gini coefficient', 'o': '?x0', '?x0': '41.52'}

 Q: What is {date of birth} and {date of death} of {{Joseph Stalin} has {child} as {Vasily Dzhugashvili}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Vasily Dzhugashvili'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Vasily Dzhugashvili'}}}]

 Q: What are the incorporation which start with the letter g
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25394665 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'incorporation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: what is the {sourcing circumstances} for {Roger Bacon} has {date of birth} as {1219-0-0} ?
 SPARQL: SELECT ?value WHERE { wd:Q171677 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1219')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roger Bacon', 'p': 'date of birth', 'o': '$y0'}}

 Q: Is -306 the melting point of propane?
 SPARQL: ASK WHERE { wd:Q131189 wdt:P2101 ?obj filter(?obj = -306) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'propane', 'p': 'melting point', 'o': '?x0', '?x0': '-306'}

 Q: what is the {start time} for {Uma Thurman} has {spouse} as {Ethan Hawke} ?
 SPARQL: SELECT ?value WHERE { wd:Q125017 p:P26 ?s . ?s ps:P26 wd:Q484615 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Uma Thurman', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Ethan Hawke'}}}

 Q: what is the {replaces} for {Benazir Bhutto} has {position held} as {Prime Minister of Pakistan} ?
 SPARQL: SELECT ?value WHERE { wd:Q34413 p:P39 ?s . ?s ps:P39 wd:Q735575 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benazir Bhutto', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Pakistan'}}}

 Q: What award Roald Dahl received on 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q25161 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Roald Dahl', 'p': 'award', 'o': '?x0', 't': '1984'}

 Q: Who was the owner of Willie Nelson's guitar?
 SPARQL:  select distinct ?obj where { wd:Q206112 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q6607 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Willie Nelson', 'p': 'owner of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'guitar'}}

 Q: Did {Donald_Glover} {occupation} {screenwriter}?
 SPARQL: ASK WHERE { wd:Q1239933 wdt:P106 wd:Q28389 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Donald Glover', 'p': 'occupation', 'o': '?x0', '?x0': 'screenwriter'}]

 Q: What is the current time in Singapore MRT?
 SPARQL: SELECT ?answer WHERE { wd:Q40176 wdt:P131 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Singapore MRT', 'p': 'in', 'o': '$y0'}}

 Q: What item is used to play with a list of sleds?
 SPARQL: SELECT ?answer WHERE { wd:Q50210255 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'list of sleds', 'p': 'play', 'o': '$y0'}}

 Q: Canada contains administrative territorial entity of how many?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q16 wdt:P150 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Canada', 'p': 'contains administrative territorial entity', 'o': '?x0'}

 Q: What is {prize money} and {together with} of {{Frederick Sanger} has {award received} as {Nobel Prize in Chemistry}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q151564 p:P166 ?s . ?s ps:P166 wd:Q44585 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick Sanger', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Chemistry'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick Sanger', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Chemistry'}}}]

 Q: What is {position held} of {Kanishka} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q312544 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'until', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kanishka', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kanishka', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {position held} of {Lady Jane Grey} that is {of} is {Kingdom of England} ?
 SPARQL: SELECT ?obj WHERE { wd:Q162356 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P642 wd:Q179876 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lady Jane Grey', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'England'}}}

 Q: What is {divided into} of {South Holland}, that has {populated places within} is {Streefkerk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q694 wdt:P150 ?answer . ?answer wdt:P1383 wd:Q959585}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'South Holland', 'p': 'divided into', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'populated places within', 'o': 'Streefkerk'}}

 Q: what is the series ordinal for Rainer Maria Rilke has name as Karl ?
 SPARQL: SELECT ?value WHERE { wd:Q76483 p:P735 ?s . ?s ps:P735 wd:Q15731830 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rainer Maria Rilke', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'name', 'o': 'Karl'}}}

 Q: What is {results in} of {developed by} of {iPod Touch 6} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20670531 wdt:P178 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'results in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'iPod Touch 6', 'p': 'developer', 'o': '$y0'}}

 Q: What is the {academic major} for {field of work} of {Claude Shannon}
 SPARQL:  select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q4671286 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Claude Shannon', 'p': 'field of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'major'}}

 Q: Tell me the branch of biology that contains the word virology in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28598684 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of biology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'virology'}}

 Q: Which is the domain of saint or deity of Francis of Assisi?
 SPARQL: select distinct ?answer where { wd:Q676555 wdt:P2925 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Francis of Assisi', 'p': 'domain of saint or deity', 'o': '?x0'}

 Q: Who gave the {titleholder} of {nomination received} of {Jennifer Capriati} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11680 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'titleholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jennifer Capriati', 'p': 'nomination received', 'o': '$y0'}}

 Q: When did noble title of Guy of Lusignan and follows?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is {Institution template} of {papers at} of {Religious Society of Friends} ?
 SPARQL: SELECT ?answer WHERE { wd:Q170208 wdt:P485 ?X . ?X wdt:P1612 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Institution template', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Religious Society of Friends', 'p': 'papers at', 'o': '$y0'}}

 Q: What is {seiyu} of {Last Exile}, that has {place of residence} is {St. Petersburg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1052846 wdt:P725 ?answer . ?answer wdt:P551 wd:Q49236}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Last Exile', 'p': 'seiyu', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'residence', 'o': 'St. Petersburg'}}

 Q: Which is replaced by Tamar of Georgia?
 SPARQL: select distinct ?answer where { wd:Q244007 wdt:P1366 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tamar of Georgia', 'p': 'replaced by', 'o': '?x0'}

 Q: Who left the Neymar sports team on 8-3-2017?
 SPARQL: SELECT ?obj WHERE { wd:Q142794 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Neymar', 'p': 'team', 'o': '?x0', 't': '2017'}

 Q: Who is the {discography} for {discography} of {Yo-Yo Ma}
 SPARQL:  select distinct ?obj where { wd:Q234891 wdt:P358 ?obj . ?obj wdt:P31 wd:Q273057 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yo-Yo Ma', 'p': 'discography', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discography'}}

 Q: Which is the Catalan Biographical Dictionary of Women ID for Alicia de Larrocha?
 SPARQL: select distinct ?answer where { wd:Q232255 wdt:P2498 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alicia de Larrocha', 'p': 'Catalan Biographical Dictionary of Women ID', 'o': '?x0'}

 Q: who citrate anion for conjugate base of citric acid?
 SPARQL:  select distinct ?obj where { wd:Q159683 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55502846 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'citric acid', 'p': 'conjugate base', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'citrate anion'}}

 Q: what is the speed of sound of a nitric oxide at a temperature of 10 degree celcius?
 SPARQL: SELECT ?obj WHERE { wd:Q207843 p:P2075 ?s . ?s ps:P2075 ?obj . ?s pq:P2076 ?x filter(contains(?x,'10.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'speed of sound', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'nitric oxide', 'p': 'speed of sound', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'temperature', 'o': '10.0'}}}

 Q: what is the {point in time} for {Jaromír Jágr} has {award received} as {Golden Hockey Stick} ?
 SPARQL: SELECT ?value WHERE { wd:Q295345 p:P166 ?s . ?s ps:P166 wd:Q207219 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jaromír Jágr', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Golden Hockey Stick'}, 't': '?x0'}

 Q: What is {start time} and {end time} of {{Gore Vidal} has {partner} as {Howard Austen}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q167821 p:P451 ?s . ?s ps:P451 wd:Q17309157 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gore Vidal', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Howard Austen'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gore Vidal', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Howard Austen'}}}]

 Q: Give me {Original Public Ivy} that {office held by head of the organisation} {chancellor} and which contains the word {carolina} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj wdt:P2388 wd:Q61061 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'carolina')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Original Public Ivy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'chancellor'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'carolina'}}

 Q: Who was Ruby Dee's spouse when their marriage ended in 2005?
 SPARQL: SELECT ?obj WHERE { wd:Q234360 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ruby Dee', 'p': 'spouse', 'o': '?x0', 't': '2005'}

 Q: Which is located and participated in the conflict of Thomas Blamey?
 SPARQL: SELECT ?answer WHERE { wd:Q952813 wdt:P607 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Blamey', 'p': 'conflict', 'o': '$y0'}}

 Q: What is {season begins} of {takes part} of {Austria Fed Cup team} ?
 SPARQL: SELECT ?answer WHERE { wd:Q301938 wdt:P1344 ?X . ?X wdt:P4794 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'season begins', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Austria Fed Cup team', 'p': 'takes part', 'o': '$y0'}}

 Q: Give me {unit of time} that {measured physical quantity} {duration} and which contains the word {year} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790144 . ?sbj wdt:P111 wd:Q2199864 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'year')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of time', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured physical quantity', 'o': 'duration'}}}

 Q: what is the {statement is subject of} for {Ralph Richardson} has {nominated for} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q381285 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ralph Richardson', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: what is the {determination method} for {Los Ríos Region} has {population} as {380131} ?
 SPARQL: SELECT ?value WHERE { wd:Q2177 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'380131')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Los Rios Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '380131'}}}

 Q: Is it true that the vehicle range of H120 Colibri is less than 459.6?
 SPARQL: ASK WHERE { wd:Q39665 wdt:P2073 ?obj filter(?obj < 459.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'H120 Colibri', 'p': 'vehicle range', 'o': '?x0', '?x0': '459.6'}

 Q: What are the Mahavidya which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Mahavidya'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {style of architecture} of {correspondence at} of {Geraldine Page} ?
 SPARQL: SELECT ?answer WHERE { wd:Q228650 wdt:P485 ?X . ?X wdt:P149 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'style of architecture', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Geraldine Page', 'p': 'correspondence at', 'o': '$y0'}}

 Q: How many {country} are to/by {Luxembourg} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P17 wd:Q32 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Luxembourg'}

 Q: What is the {country code top-level domain} for {top-level Internet domain} of {European Union}
 SPARQL:  select distinct ?obj where { wd:Q458 wdt:P78 ?obj . ?obj wdt:P31 wd:Q42032 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'European Union', 'p': 'domain', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country code top-level domain'}}

 Q: Tell me the activity which has social control as fabrication method and contains the word management in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj wdt:P2079 wd:Q623971 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'management')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'activity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'social control'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'management'}}

 Q: What is the received signal type of Gaia?
 SPARQL: select distinct ?answer where { wd:Q767805 wdt:P1194 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gaia', 'p': 'received signal type', 'o': '?x0'}

 Q: How many {significant event} are for {Universe} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1 wdt:P793 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Universe', 'p': 'event', 'o': '?x0'}

 Q: Did {John_Wayne} {partner} {Marlene Dietrich}?
 SPARQL: ASK WHERE { wd:Q40531 wdt:P451 wd:Q4612 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Wayne', 'p': 'partner', 'o': '?x0', '?x0': 'Marlene Dietrich'}]

 Q: Which is the review score for 12 Angry Men?
 SPARQL: select distinct ?answer where { wd:Q2345 wdt:P444 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '12 Angry Men', 'p': 'review score', 'o': '?x0'}

 Q: what is  classical Japanese performing arts practiced by kabuki actor whose  name has the word kabuki in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11615913 . ?sbj wdt:P3095 wd:Q48146261 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'kabuki')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'classical Japanese performing arts', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'kabuki actor'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'kabuki'}}

 Q: what is the {for work} for {Neil Patrick Harris} has {award received} as {Emmy Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q485310 p:P166 ?s . ?s ps:P166 wd:Q123737 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neil Patrick Harris', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Emmy Award'}}}

 Q: What is {member of sports team} of {Michael Jordan} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q41421 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Jordan', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Jordan', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Which is the Israel Antiquities Authority ID for Rishon LeZion?
 SPARQL: select distinct ?answer where { wd:Q201051 wdt:P3941 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rishon LeZion', 'p': 'Israel Antiquities Authority ID', 'o': '?x0'}

 Q: What is the {animated series} for {voice actor} of {Phil LaMarr}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q356541 . ?sbj wdt:P31 wd:Q581714 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Phil LaMarr', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated series'}}

 Q: In what year did Bruce Willis win a Primetime Emmy Award for Outstanding Lead Actor in a Drama Series?
 SPARQL: SELECT ?value WHERE { wd:Q2680 p:P166 ?s . ?s ps:P166 wd:Q989439 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Bruce Willis', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Primetime Emmy Award for Outstanding Lead Actor in a Drama Series'}, 't': '?x0'}

