 Q: What is the {sport in a geographic region} with the {MIN(number of players in region)} whose {sport} is {netball}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4909 ?obj . ?ent wdt:P641 wd:Q231200} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of players in region', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport in a geographic region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'netball'}}}

 Q: What is {elected in} and {end cause} of {{Neville Chamberlain} has {position held} as {Member of the 31st Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q10664 p:P39 ?s . ?s ps:P39 wd:Q41582582 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neville Chamberlain', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 31st Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neville Chamberlain', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 31st Parliament of the United Kingdom'}}}]

 Q: Tell me private not-for-profit educational institution whose name has the word university in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'university')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private not-for-profit educational institution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'university'}}

 Q: Tell me least squares method  whose name has the word least in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q74304 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'least')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'least squares method'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'least'}}

 Q: Which is the country of Iloilo City?
 SPARQL: select distinct ?answer where { wd:Q459787 wdt:P17 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iloilo City', 'p': 'country', 'o': '?x0'}

 Q: Who is member of Marguerite Yourcenar since 1980-3-6?
 SPARQL: SELECT ?obj WHERE { wd:Q163118 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marguerite Yourcenar', 'p': 'member of', 'o': '?x0', 't': '1980'}

 Q: Does the number of records for  the Boijmans artist ID equal 4681?
 SPARQL: ASK WHERE { wd:P3888 wdt:P4876 ?obj filter(?obj = 4681) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Boijmans artist ID', 'p': 'number of records', 'o': '?x0', '?x0': '4681'}

 Q: What is {prize awarded} of {Carcassonne}, that has {victor} is {Elfenland} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17262 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q1328502}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carcassonne', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'victor', 'o': 'Elfenland'}}

 Q: What is {academic degree} and {academic major} of {{Chanda Kochhar} has {educated at} as {Jamnalal Bajaj Institute of Management Studies}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q539281 p:P69 ?s . ?s ps:P69 wd:Q6148070 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chanda Kochhar', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Jamnalal Bajaj Institute of Management Studies'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chanda Kochhar', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Jamnalal Bajaj Institute of Management Studies'}}}]

 Q: Tell me about award received of Animal Farm and followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1396889 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Animal Farm', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Animal Farm', 'p': 'award received', 'o': '$y0'}}]

 Q: What is the service ribbon image for the Medal of Honor?
 SPARQL: select distinct ?answer where { wd:Q203535 wdt:P2425 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Medal of Honor', 'p': 'service ribbon image', 'o': '?x0'}

 Q: what is the {start time} for {John of the Cross} has {religious name} as {Juan de la Cruz} ?
 SPARQL: SELECT ?value WHERE { wd:Q190388 p:P1635 ?s . ?s ps:P1635 ?x filter(contains(?x,'Juan de la Cruz')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John of the Cross', 'p': 'religious name', 'o': '$y0'}}

 Q: What is {twinned administrative body} of {Charleroi} that is {start time} is {1958-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q81046 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1958')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charleroi', 'p': 'twinned administrative body', 'o': '?x0', 't': '1958'}

 Q: What is {sister} of {daddy} of {Adad} ?
 SPARQL: SELECT ?answer WHERE { wd:Q346547 wdt:P22 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adad', 'p': 'dad', 'o': '$y0'}}

 Q: What was the population of Gharbia Governorate on 11/19/1996?
 SPARQL: SELECT ?obj WHERE { wd:Q30835 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gharbia Governorate', 'p': 'population', 'o': '?x0', 't': '1996'}

 Q: What is the natural language for the Arabic alphabet?
 SPARQL:  select distinct ?obj where { wd:Q8196 wdt:P407 ?obj . ?obj wdt:P31 wd:Q33742 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arabic alphabet', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural language'}}

 Q: what is the {start time} for {Jonny Wilkinson} has {member of sports team} as {RC Toulonnais} ?
 SPARQL: SELECT ?value WHERE { wd:Q318920 p:P54 ?s . ?s ps:P54 wd:Q1857064 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jonny Wilkinson', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'RC Toulonnais'}}}

 Q: What is the {human} for {work location} of {Hamburg}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P937 wd:Q1055 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work location', 'o': 'Hamburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {elected in} and {end cause} of {{Enoch Powell} has {position held} as {Member of the 48th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q333028 p:P39 ?s . ?s ps:P39 wd:Q41582619 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Enoch Powell', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 48th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Enoch Powell', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 48th Parliament of the United Kingdom'}}}]

 Q: What is {place of birth} of {Sylvester II} that is {country} is {Kingdom of France} ?
 SPARQL: SELECT ?obj WHERE { wd:Q172383 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q70972 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birth place', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvester II', 'p': 'birth place', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Kingdom of France'}}}

 Q: Give me {flammable gas} that {safety classification and labelling} {NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response} and which contains the word {vinyl} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10913792 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vinyl')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable gas', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'safety classification and labelling', 'o': 'NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vinyl'}}

 Q: What is the supervisor of the painter of quantum mechanics?
 SPARQL: SELECT ?answer WHERE { wd:Q944 wdt:P170 ?X . ?X wdt:P1066 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'supervisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'quantum mechanics', 'p': 'painter', 'o': '$y0'}}

 Q: What is {position held} of {George Reid} and {electoral district}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q23352 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Reid', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Reid', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {founders} of {distributed by} of {Ain't Nobody Got Time for That} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16826312 wdt:P750 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founders', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Ain't Nobody Got Time for That", 'p': 'distributed by', 'o': '$y0'}}

 Q: Taungoo Dynasty covers what area?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q519718 wdt:P2046 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Taungoo Dynasty', 'p': 'area', 'o': '?x0'}

 Q: What group of people died in Tenochtitlan?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P20 wd:Q13695 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'died in', 'o': 'Tenochtitlan', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: What is the {partner} and the {spouse} of {Neil_Young} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q633 wdt:P451 ?ans_1 . wd:Q633 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Neil Young', 'p': 'partner', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Neil Young', 'p': 'spouse', 'o': '?x1'}]

 Q: Which is AllMovie movie ID for Amélie?
 SPARQL: select distinct ?answer where { wd:Q484048 wdt:P1562 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amélie', 'p': 'AllMovie movie ID', 'o': '?x0'}

 Q: Is 15 service life of the Intelsat 15?
 SPARQL: ASK WHERE { wd:Q195783 wdt:P5069 ?obj filter(?obj = 15) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Intelsat 15', 'p': 'service life', 'o': '?x0', '?x0': '15'}

 Q: What is {prize money} and {together with} of {{William Henry Bragg} has {award received} as {Nobel Prize in Physics}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q133747 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Henry Bragg', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Nobel Prize in Physics'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Henry Bragg', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Nobel Prize in Physics'}}}]

 Q: How many {commanded by} are for {Warsaw Pact} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q41644 wdt:P4791 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Warsaw Pact', 'p': 'commanded by', 'o': '?x0'}

 Q: What is the electrical plug type that is used in Nicaragua?
 SPARQL: select distinct ?answer where { wd:Q811 wdt:P2853 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nicaragua', 'p': 'electrical plug type', 'o': '?x0'}

 Q: what is the {point in time} for {Fahrenheit 451} has {award received} as {Prometheus Award - Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q202009 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Fahrenheit 451', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Prometheus Award - Hall of Fame'}, 't': '?x0'}

 Q: Who gave the{located in} of {participant of event} of {Annemarie Moser-Pröll} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9586 wdt:P1344 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Annemarie Moser-Pröll', 'p': 'participant of event', 'o': '$y0'}}

 Q: What is {horse} of {characters} of {Madame Sans-Gêne (play)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3136222 wdt:P674 ?X . ?X wdt:P3091 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'horse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Madame Sans-Gêne (play)', 'p': 'characters', 'o': '$y0'}}

 Q: What is the {sovereign state} for {applies to jurisdiction} of {U.S. Declaration of Independence}
 SPARQL:  select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Declaration of Independence', 'p': 'applies to jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the {Casada Nova} for {residence} of {Venice}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P551 wd:Q641 . ?sbj wdt:P31 wd:Q58439237 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'residence', 'o': 'Venice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Casada Nova'}}

 Q: Is it true that the total expenditure of the Central Catholic High School is less than 4272234.24?
 SPARQL: ASK WHERE { wd:Q5060518 wdt:P2402 ?obj filter(?obj < 4272234.24) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Central Catholic High School', 'p': 'total expenditure', 'o': '?x0', '?x0': '4272234.24'}

 Q: Name the twinned administrative body of Salt Lake City when it was started in 1989?
 SPARQL: SELECT ?obj WHERE { wd:Q23337 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Salt Lake City', 'p': 'twinned administrative body', 'o': '?x0', 't': '1989'}

 Q: what is the {replaced by} for {Park Chung-hee} has {position held} as {president of South Korea} ?
 SPARQL: SELECT ?value WHERE { wd:Q14356 p:P39 ?s . ?s ps:P39 wd:Q6296418 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Chung-hee', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'president of South Korea'}}}

 Q: How many anatomical locations are by the thymus?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P927 wd:Q163987 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'thymus'}

 Q: who coach of player of Simone Biles ?
 SPARQL: SELECT ?answer WHERE { wd:Q7520267 wdt:P54 ?X . ?X wdt:P286 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coach', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Simone Biles', 'p': 'player of', 'o': '$y0'}}

 Q: Is it true that the thermal design power of AMD Ryzen Threadripper 1920X is less than 216?
 SPARQL: ASK WHERE { wd:Q56062735 wdt:P2229 ?obj filter(?obj < 216.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'AMD Ryzen Threadripper 1920X', 'p': 'thermal design power', 'o': '?x0', '?x0': '216.0'}

 Q: what is the {replaced by} for {Alfred Deakin} has {position held} as {Member of the Victorian Legislative Assembly} ?
 SPARQL: SELECT ?value WHERE { wd:Q313805 p:P39 ?s . ?s ps:P39 wd:Q18534408 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Deakin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Victorian Legislative Assembly'}}}

 Q: What is the name of the sovereign state located in Benghazi?
 SPARQL:  select distinct ?obj where { wd:Q40816 wdt:P131 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Benghazi', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who are the founders of Benelux, which has an inflation rate of consumer price index of 1.4?
 SPARQL: SELECT ?answer WHERE { wd:Q13116 wdt:P112 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'1.4'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Benelux', 'p': 'founders', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '1.4'}}

 Q: Which is the corporation for the products produced by Coca-Cola?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q2813 . ?sbj wdt:P31 wd:Q167037 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product', 'o': 'Coca-Cola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'corporation'}}

 Q: What is {characters} of {The Name of the Rose}, that has {musician} is {Christian Slater} ?
 SPARQL: SELECT ?answer WHERE { wd:Q172850 wdt:P674 ?answer . ?answer wdt:P175 wd:Q204590}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Name of the Rose', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'musician', 'o': 'Christian Slater'}}

 Q: What is the {human} for {country of citizenship} of {German Democratic Republic}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P27 wd:Q16957 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'German Democratic Republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {end time} and {start time} of {{Louis VII of France} has {position held} as {king of Franks}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q134259 p:P39 ?s . ?s ps:P39 wd:Q22923081 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis VII of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'king of Franks'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis VII of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'king of Franks'}}}]

 Q: what is the statement for subject of Kuwait which has diplomatic relation as Mexico?
 SPARQL: SELECT ?value WHERE { wd:Q817 p:P530 ?s . ?s ps:P530 wd:Q96 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kuwait', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'diplomatic relation', 'o': 'Mexico'}}}

 Q: Which is the language of the writing system of the Phoenician alphabet?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q26752 . ?sbj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'Phoenician', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Which is the museum for the parent organization of the Smithsonian Institution?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q131626 . ?sbj wdt:P31 wd:Q33506 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Smithsonian Institution', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'museum'}}

 Q: Tell me metabolite whose name has the word violaxanthin in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q407595 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'violaxanthin')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metabolite'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'violaxanthin'}}

 Q: "Where is {administrative centre} of {Holy Roman Empire}, which has {populated places within} is {Dolní Černošice} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q12548 wdt:P36 ?answer . ?answer wdt:P1383 wd:Q26807279}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Holy Roman Empire', 'p': 'administrative centre', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'populated places within', 'o': 'Dolní Černošice'}}

 Q: Where is {land} {adjacent to} {Villanova University} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1466001 wdt:P17 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'adjacent to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Villanova University', 'p': 'land', 'o': '$y0'}}

 Q: Which is the married name for Angel Merkel?
 SPARQL: select distinct ?answer where { wd:Q567 wdt:P2562 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Merkel', 'p': 'married name', 'o': '?x0'}

 Q: What is {end time} and {start time} of {{William Henry Bragg} has {employer} as {University of Leeds}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q133747 p:P108 ?s . ?s ps:P108 wd:Q503424 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Henry Bragg', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'University of Leeds'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Henry Bragg', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'University of Leeds'}}}]

 Q: What is the {human} for {killed by} of {Commodus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P157 wd:Q1434 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'killed by', 'o': 'Commodus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is parent organization of ARD ?
 SPARQL: select distinct ?answer where { ?answer wdt:P749 wd:Q49653}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'ARD'}

 Q: Are Juliet and Friar Laurence characters in Romeo and Juliet?
 SPARQL: ASK WHERE { wd:Q83186 wdt:P674 wd:Q1092632 . wd:Q83186 wdt:P674 wd:Q5503354 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Romeo and Juliet', 'p': 'characters', 'o': '?x0', '?x0': 'Juliet'}, {'h': 'IS', 'v': '?x1', 's': 'Romeo and Juliet', 'p': 'characters', 'o': '?x1', '?x1': 'Friar Laurence'}]

 Q: Did the cost of damage from Hurricane Ike equal 38,000,000,000?
 SPARQL: ASK WHERE { wd:Q392603 wdt:P2630 ?obj filter(?obj = 38000000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Hurricane Ike', 'p': 'cost of damage', 'o': '?x0', '?x0': '38000000000'}

 Q: Which outer planet has the most flattening?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q30014 . ?ent wdt:P1102 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'flattening', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'outer planet'}}

 Q: Which {record label} and the {genre} is of {Radiohead} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q44190 wdt:P264 ?ans_1 . wd:Q44190 wdt:P136 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Radiohead', 'p': 'record label', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Radiohead', 'p': 'genre', 'o': '?x1'}]

 Q: What was Dmitry Merezhkovsky nominated for on 1-1-1937?
 SPARQL: SELECT ?obj WHERE { wd:Q326459 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1937')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dmitry Merezhkovsky', 'p': 'nominated for', 'o': '?x0', 't': '1937'}

 Q: What is <instruction set> of <x86> ?
 SPARQL: select distinct ?answer where { wd:Q182933 wdt:P1068 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'x86', 'p': 'instruction set', 'o': '?x0'}

 Q: What is the {sovereign state} for {country} of {pound sterling}
 SPARQL:  select distinct ?obj where { wd:Q25224 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pound sterling', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: what are the cold war which start with the letter g
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4176199 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cold war'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: What is {characters} of {Married... with Children} that is {performer} is {Ed O'Neill} ?
 SPARQL: SELECT ?obj WHERE { wd:Q208647 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P175 wd:Q16758 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Married... with Children', 'p': 'characters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'performer', 'o': "Ed O'Neill"}}}

 Q: Give me {square root} that contains the word {root} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134237 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'root')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'square root'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'root'}}

 Q: What is {spouse} of {Charlie Parker} that is {end time} is {1955-3-12} ?
 SPARQL: SELECT ?obj WHERE { wd:Q103767 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1955')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charlie Parker', 'p': 'spouse', 'o': '?x0', 't': '1955'}

 Q: Which is the organization that has it's headquarters located in Cleveland?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters', 'o': 'Cleveland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: What is the {political murder} for {significant event} of {Sirhan Sirhan}
 SPARQL:  select distinct ?obj where { wd:Q297112 wdt:P793 ?obj . ?obj wdt:P31 wd:Q1139665 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sirhan Sirhan', 'p': 'significant event', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political murder'}}

 Q: what is the {point in time} for {Jacqueline Wilson} has {award received} as {Guardian Children's Fiction Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q240647 p:P166 ?s . ?s ps:P166 wd:Q971363 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jacqueline Wilson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': "Guardian Children's Fiction Prize"}, 't': '?x0'}

 Q: Did {Berlin_Wall} {country} {Germany}?
 SPARQL: ASK WHERE { wd:Q5086 wdt:P17 wd:Q183 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Berlin Wall', 'p': 'country', 'o': '?x0', '?x0': 'Germany'}]

 Q: What is <open days> of <British Museum> ?
 SPARQL: select distinct ?answer where { wd:Q6373 wdt:P3025 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'British Museum', 'p': 'open days', 'o': '?x0'}

 Q: What is {professorship} of {Isaac Newton} that is {start time} is {1669-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q935 p:P803 ?s . ?s ps:P803 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1669')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isaac Newton', 'p': 'professorship', 'o': '?x0', 't': '1669'}

 Q: tell me comic genre whose name has the word novel in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'novel')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comic genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'novel'}}

 Q: What region of Salerno divides into Teggiano?
 SPARQL: SELECT ?answer WHERE { wd:Q1083 wdt:P131 ?answer . ?answer wdt:P150 wd:Q81728}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Salerno', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divides into', 'o': 'Teggiano'}}

 Q: Which chemical element of subclass period 5 has the highest density?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11344 . ?ent wdt:P2054 ?obj . ?ent wdt:P279 wd:Q244982 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'density', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical element', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'period 5'}}}

 Q: What is the correct family name for the family name of Genghis Khan?
 SPARQL:  select distinct ?obj where { wd:Q720 wdt:P734 ?obj . ?obj wdt:P31 wd:Q101352 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genghis Khan', 'p': 'family name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'family name'}}

 Q: Name a principality located in the Weimar Republic
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q41304 . ?sbj wdt:P31 wd:Q208500 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Weimar Republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'principality'}}

 Q: What is {played for} of {directed by} of {The Night of the Headless Horseman} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7754144 wdt:P57 ?X . ?X wdt:P54 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Night of the Headless Horseman', 'p': 'directed by', 'o': '$y0'}}

