 Q: What is the {linguistic typology} and the {has grammatical gender} of {Spanish_language} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P5109 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Spanish', 'p': 'linguistic typology', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Spanish', 'p': 'has grammatical gender', 'o': '?x1'}]

 Q: Did {The_New_York_Times} {place of publication} {New York City} and {Manhattan} ?
 SPARQL: ASK WHERE { wd:Q9684 wdt:P291 wd:Q60 . wd:Q9684 wdt:P291 wd:Q11299 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The New York Times', 'p': 'place of publication', 'o': '?x0', '?x0': 'New York City'}, {'h': 'IS', 'v': '?x1', 's': 'The New York Times', 'p': 'place of publication', 'o': '?x1', '?x1': 'Manhattan'}]

 Q: Who is the child of William Jennings Bryan that has the biological sex of male?
 SPARQL: SELECT ?answer WHERE { wd:Q205282 wdt:P22 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Jennings Bryan', 'p': 'child of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'biological sex', 'o': 'male'}}

 Q: What is the {independent agency of the United States government} for {archives at} of {Jefferson Davis}
 SPARQL:  select distinct ?obj where { wd:Q162269 wdt:P485 ?obj . ?obj wdt:P31 wd:Q1752939 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jefferson Davis', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'independent agency of the United States government'}}

 Q: What is the {novel} for {notable work} of {Robert Louis Stevenson}
 SPARQL:  select distinct ?obj where { wd:Q1512 wdt:P800 ?obj . ?obj wdt:P31 wd:Q8261 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Louis Stevenson', 'p': 'notable work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'novel'}}

 Q: What is {instrument played} of {plays} of {foil} ?
 SPARQL: SELECT ?answer WHERE { wd:Q471447 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'foil', 'p': 'play', 'o': '$y0'}}

 Q: What is <lake outflow> of <Lake Winnebago> ?
 SPARQL: select distinct ?answer where { wd:Q1801110 wdt:P201 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Winnebago', 'p': 'lake outflow', 'o': '?x0'}

 Q: What is {has fruit type} of {higher taxon} of {Philodendron edmundoi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15313826 wdt:P171 ?X . ?X wdt:P4000 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has fruit type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philodendron edmundoi', 'p': 'higher taxon', 'o': '$y0'}}

 Q: How many {operating area} are to/by {Ireland} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2541 wd:Q27 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'operating area', 'o': 'Ireland'}

 Q: what is the {for work} for {Ringo Starr} has {nominated for} as {Academy Award for Best Original Song Score} ?
 SPARQL: SELECT ?value WHERE { wd:Q2632 p:P1411 ?s . ?s ps:P1411 wd:Q22344608 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ringo Starr', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Original Song Score'}}}

 Q: What is the language official in Federated States of Micronesia having a shortened name of
 SPARQL: SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'инглизсә'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Federated States of Micronesia', 'p': 'language official', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shortened name', 'o': 'инглизсә'}}

 Q: What is {formation} of {Story Musgrave}, that has {in action} is {Banana Wars} ?
 SPARQL: SELECT ?answer WHERE { wd:Q462132 wdt:P241 ?answer . ?answer wdt:P607 wd:Q768496}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Story Musgrave', 'p': 'formation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in action', 'o': 'Banana Wars'}}

 Q: what is the {end time} for {Camille Pissarro} has {work location} as {Netherlands} ?
 SPARQL: SELECT ?value WHERE { wd:Q134741 p:P937 ?s . ?s ps:P937 wd:Q55 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Camille Pissarro', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'Netherlands'}}}

 Q: What is {killed by} and {has effect} of {{John F. Kennedy} has {cause of death} as {ballistic trauma}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q9696 p:P509 ?s . ?s ps:P509 wd:Q2140674 . ?s pq:P157 ?value1 . ?s pq:P1542 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'killed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John F. Kennedy', 'p': 'cause of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cause of death', 'o': 'ballistic trauma'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'has effect', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John F. Kennedy', 'p': 'cause of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cause of death', 'o': 'ballistic trauma'}}}]

 Q: what is the {for work} for {Patrick White} has {award received} as {Miles Franklin Literary Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q129187 p:P166 ?s . ?s ps:P166 wd:Q996 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Patrick White', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Miles Franklin Literary Award'}}}

 Q: what is the {end time} for {Alexandria} has {located in the administrative territorial entity} as {Diocese of Egypt} ?
 SPARQL: SELECT ?value WHERE { wd:Q87 p:P131 ?s . ?s ps:P131 wd:Q1018761 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexandria', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Diocese of Egypt'}}}

 Q: What is the {owned by} and the {named after} of {Disneyland} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q181185 wdt:P127 ?ans_1 . wd:Q181185 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Disneyland', 'p': 'owned by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Disneyland', 'p': 'named after', 'o': '?x1'}]

 Q: What are the treaty which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131569 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'treaty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Is it true that the caliber of Ehrhardt 7.5 cm Model 1901 equals to 60?
 SPARQL: ASK WHERE { wd:Q259036 wdt:P4403 ?obj filter(?obj = 60.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ehrhardt 7.5 cm Model 1901', 'p': 'caliber', 'o': '?x0', '?x0': '60.0'}

 Q: What is the item operated of a B-29 Superfortress?
 SPARQL: select distinct ?answer where { ?answer wdt:P121 wd:Q184870}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'item operated', 'o': 'B-29 Superfortress'}

 Q: Which is the instance of Puduhepa?
 SPARQL: select distinct ?answer where { wd:Q268887 wdt:P31 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Puduhepa', 'p': 'type', 'o': '?x0'}

 Q: Which is the process function of the measured physical quantity of joule?
 SPARQL:  select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q900800 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'joule', 'p': 'measured physical quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'process function'}}

 Q: Is Alex Ferguson is the member of sports team which was started in 1-1-1973?
 SPARQL: SELECT ?obj WHERE { wd:Q44980 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1973')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alex Ferguson', 'p': 'member of sports team', 'o': '?x0', 't': '1973'}

 Q: How many {member of the crew of} are to/by {Enola Gay} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P5096 wd:Q204424 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'member of the crew of', 'o': 'Enola Gay'}

 Q: How many {conflict} are to/by {Crusades} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P607 wd:Q12546 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'Crusades'}

 Q: Give me {dyad} that contains the word {yan} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dyad'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yan'}}

 Q: Was Helen Keller a member of the Transport Workers Union of America?
 SPARQL: ASK WHERE { wd:Q38203 wdt:P463 wd:Q3537776 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Helen Keller', 'p': 'member of', 'o': '?x0', '?x0': 'Transport Workers Union of America'}]

 Q: Give me {board game} that {practiced by} {backgammon player} and which contains the word {backgammon} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131436 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'backgammon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'board game', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'backgammon player'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'backgammon'}}

 Q: What is the first described of the ideology of Progressive Party?
 SPARQL: SELECT ?answer WHERE { wd:Q7248784 wdt:P1142 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first described', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Progressive Party', 'p': 'ideology', 'o': '$y0'}}

 Q: Which is the HQ location in The Economic Times having Indian reservation in Bombay State?
 SPARQL: SELECT ?answer WHERE { wd:Q1954757 wdt:P159 ?answer . ?answer wdt:P131 wd:Q2627082}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Economic Times', 'p': 'HQ', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Bombay State'}}

 Q: Joseph belongs to what family?
 SPARQL:  select distinct ?obj where { wd:Q128267 wdt:P53 ?obj . ?obj wdt:P31 wd:Q8436 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joseph', 'p': 'family', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'family'}}

 Q: Who are the film crew members and cast members of Game of Thrones?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q23572 wdt:P3092 ?ans_1 . wd:Q23572 wdt:P161 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Game of Thrones', 'p': 'film crew member', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Game of Thrones', 'p': 'cast member', 'o': '?x1'}]

 Q: "Which is {marry} of {Cassiopeia}, who {has son} is {Andromeda} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q207681 wdt:P26 ?answer . ?answer wdt:P40 wd:Q161582}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cassiopeia', 'p': 'marry', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'son', 'o': 'Andromeda'}}

 Q: Is Spain's unemployment rate 25?
 SPARQL: ASK WHERE { wd:Q29 wdt:P1198 ?obj filter(?obj = 25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Spain', 'p': 'unemployment rate', 'o': '?x0', '?x0': '25'}

 Q: What award did Zadie Smith receive in 2006?
 SPARQL: SELECT ?obj WHERE { wd:Q140052 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zadie Smith', 'p': 'award', 'o': '?x0', 't': '2006'}

 Q: What is the garrison of AT&T, which is in the settlement of Denton County?
 SPARQL: SELECT ?answer WHERE { wd:Q35476 wdt:P159 ?answer . ?answer wdt:P131 wd:Q109265}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'AT&T', 'p': 'garrison', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is in the settlement of', 'o': 'Denton County'}}

 Q: What is the {sovereign state} for {replaces} of {Ottoman Empire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaces', 'o': 'Ottoman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: what is the {sourcing circumstances} for {Amtrak} has {net profit} as {-1.23269e+09} ?
 SPARQL: SELECT ?value WHERE { wd:Q23239 p:P2295 ?s . ?s ps:P2295 ?x filter(contains(?x,'-1.23269e+09')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amtrak', 'p': 'net profit', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'net profit', 'o': '-1.23269e+09'}}}

 Q: which time of the day contains the word morning in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'morning')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'time of the day'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'morning'}}

 Q: When Atacama Region has its population 230873.0?
 SPARQL: SELECT ?value WHERE { wd:Q2120 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'230873.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Atacama Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '230873.0'}, 't': '?x0'}

 Q: What are the political philosophy which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political philosophy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: what is the {start time} for {Aurangabad} has {located in the administrative territorial entity} as {Hyderabad State} ?
 SPARQL: SELECT ?value WHERE { wd:Q200713 p:P131 ?s . ?s ps:P131 wd:Q1240096 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aurangabad', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Hyderabad State'}}}

 Q: What is {position held} of {David Cameron} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q192 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Cameron', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Cameron', 'p': 'position held', 'o': '$y0'}}]

 Q: what are the mathematical notation which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mathematical notation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {start time} and {place of marriage} of {{Victor Hugo} has {spouse} as {Adèle Foucher}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q535 p:P26 ?s . ?s ps:P26 wd:Q2825429 . ?s pq:P580 ?value1 . ?s pq:P2842 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Adele Foucher'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'place of marriage', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Adele Foucher'}}}]

 Q: Tell me about member of sports team of Rinus Michels and number of points/goals/set scored?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rinus Michels', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rinus Michels', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: IS THE SERVICE LIFE OF THE AMBATOVY MINE EQUALS 29
 SPARQL: ASK WHERE { wd:Q16002794 wdt:P5069 ?obj filter(?obj = 29) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ambatovy mine', 'p': 'service life', 'o': '?x0', '?x0': '29'}

 Q: Is Mary I of England a sibling of Edward VI of England?
 SPARQL: ASK WHERE { wd:Q82674 wdt:P3373 wd:Q83229 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mary I of England', 'p': 'sibling', 'o': '?x0', '?x0': 'Edward VI of England'}]

 Q: Which image compression contains the word graphics in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q412438 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'graphics')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'image compression'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'graphics'}}

 Q: Which is antonym of painting of Madonna enthroned with child and Saints Petronius and John the Evangelist ?
 SPARQL: SELECT ?answer WHERE { wd:Q3889219 wdt:P180 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Madonna enthroned with child and Saints Petronius and John the Evangelist', 'p': 'painting of', 'o': '$y0'}}

 Q: Is Scientology the same as Church of Scientology?
 SPARQL: ASK WHERE { wd:Q131036 wdt:P460 wd:Q1820380 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Scientology', 'p': 'same as', 'o': '?x0', '?x0': 'Church of Scientology'}]

 Q: Who is the nominee for Nevermind, that was produced on 1991-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q17444 wdt:P1411 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1991'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nevermind', 'p': 'nominee for', 'o': '?x0', 't': '1991'}

 Q: What is the {video game developer} for {product or material produced} of {Pong}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q216293 . ?sbj wdt:P31 wd:Q210167 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'Pong', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'game studio'}}

 Q: "Who is {rector} of {Moscow State University}, which {alumna of} is {Saint Petersburg State University} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q13164 wdt:P1075 ?answer . ?answer wdt:P69 wd:Q27621}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Moscow State University', 'p': 'rector', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alumna of', 'o': 'Saint Petersburg State University'}}

 Q: What is {educated at} of {Al-Waleed bin Talal} that is {academic degree} is {Master of Science} ?
 SPARQL: SELECT ?obj WHERE { wd:Q293679 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q950900 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Al-Waleed bin Talal', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'Master of Science'}}}

 Q: What is the death location, whose partner city is Jakarta, of Samuel Butler?
 SPARQL: SELECT ?answer WHERE { wd:Q258766 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3630}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Samuel Butler', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'Jakarta'}}

 Q: What is {preceeds} of {implies} of {vaporization} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6452502 wdt:P1542 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'preceeds', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'vaporization', 'p': 'implies', 'o': '$y0'}}

 Q: What is the {type of quantum particle} with the {MAX(mean lifetime)} whose {antiparticle} is {antineutron}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2645 ?obj . ?ent wdt:P2152 wd:Q156530 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'mean lifetime', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'antiparticle', 'o': 'antineutron'}}}

 Q: What is the {steam engine} for {discoverer or inventor} of {James Watt}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P61 wd:Q9041 . ?sbj wdt:P31 wd:Q12760 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'invented by', 'o': 'James Watt', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steam engine'}}

 Q: What is the member of a sports team of Iker Casillas that starts January 1st, 1991?
 SPARQL: SELECT ?obj WHERE { wd:Q11584 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Iker Casillas', 'p': 'team', 'o': '?x0', 't': '1999'}

 Q: What is {father} and {date of birth} of {{Abigail Adams} has {child} as {Abigail Adams Smith}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P22 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'father', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams Smith'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams Smith'}}}]

 Q: What award did Ken Thompson receive on January 1st, 1983?
 SPARQL: SELECT ?obj WHERE { wd:Q1107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ken Thompson', 'p': 'award', 'o': '?x0', 't': '1983'}

 Q: Give me {film} that {filming location} {New York City} and which that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj wdt:P915 wd:Q60 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'filming location', 'o': 'New York'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What aspect of mysticism is distinguished from dharma?
 SPARQL: SELECT ?answer WHERE { wd:Q45996 wdt:P1269 ?answer . ?answer wdt:P1889 wd:Q134293}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'mysticism', 'p': 'aspect of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'distinguished from', 'o': 'dharma'}}

 Q: What is the business with the least debt on the Euronext?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2133 ?obj . ?ent wdt:P414 wd:Q842108} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'debt', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'stock exchange', 'o': 'Euronext'}}}

 Q: What was Gene Wolfe nominated for in 1990?
 SPARQL: SELECT ?obj WHERE { wd:Q361149 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gene Wolfe', 'p': 'nominated for', 'o': '?x0', 't': '1990'}

 Q: Did {Jimi_Hendrix} {manner of death} {EMLL 24th Anniversary Show}?
 SPARQL: ASK WHERE { wd:Q5928 wdt:P1196 wd:Q5323544 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jimi Hendrix', 'p': 'manner of death', 'o': '?x0', '?x0': 'EMLL 24th Anniversary Show'}]

 Q: what is the {end time} for {Don Bradman} has {member of sports team} as {Australia national cricket team} ?
 SPARQL: SELECT ?value WHERE { wd:Q313591 p:P54 ?s . ?s ps:P54 wd:Q142555 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Don Bradman', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Australia national cricket team'}}}

 Q: What material has the highest operating temperature?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5066 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'operating temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'material'}}

 Q: What medical condition did Väinö Linna have in 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q311037 p:P1050 ?s . ?s ps:P1050 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Väinö Linna', 'p': 'medical condition', 'o': '?x0', 't': '1984'}

 Q: Which taxon has the highest chromosome count?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'chromosome count', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is {human population} of {birth place} of {Konstantin Khabensky} ?
 SPARQL: SELECT ?answer WHERE { wd:Q558666 wdt:P19 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Konstantin Khabensky', 'p': 'birthplace', 'o': '$y0'}}

 Q: What is Flags of the World ID for Union Jack ?
 SPARQL: select distinct ?answer where { wd:Q3173323 wdt:P3089 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Union Jack', 'p': 'Flags of the World ID', 'o': '?x0'}

 Q: which is scientific area of developed by of perl?
 SPARQL: SELECT ?answer WHERE { wd:Q42478 wdt:P178 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'perl', 'p': 'developed by', 'o': '$y0'}}

 Q: What is <Museum of Fine Arts, Boston object ID> of <L. L. Zamenhof> ?
 SPARQL: select distinct ?answer where { wd:Q11758 wdt:P4625 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'L. Zamenhof', 'p': 'Museum of Fine Arts, Boston object ID', 'o': '?x0'}

 Q: What is alphabet  language signed of  Ōe no Yoshitoki ?
 SPARQL: SELECT ?answer WHERE { wd:Q3594014 wdt:P1412 ?X . ?X wdt:P282 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'alphabet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ōe no Yoshitoki', 'p': 'language signed', 'o': '$y0'}}

 Q: Is it true that the residence time of water in Tai Lake equals 0.79?
 SPARQL: ASK WHERE { wd:Q140712 wdt:P3020 ?obj filter(?obj = 0.79) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tai Lake', 'p': 'residence time of water', 'o': '?x0', '?x0': '0.79'}

 Q: what is the {postal code} for {Baidu} has {headquarters location} as {Beijing} ?
 SPARQL: SELECT ?value WHERE { wd:Q14772 p:P159 ?s . ?s ps:P159 wd:Q956 . ?s pq:P281 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'postal code', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Baidu', 'p': 'headquarters location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'headquarters location', 'o': 'Beijing'}}}

 Q: Give me {decimal classification} that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'decimal classification'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What {subject has role} which {physically interacts with} of {Dopamine} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q170304 wdt:P2868 ?ans_1 . wd:Q170304 wdt:P129 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Dopamin', 'p': 'subject has role', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Dopamin', 'p': 'physically interacts with', 'o': '?x1'}]

 Q: What is {middle name} of {Dan Carter}, that has {pronunciation audio} is {Pl-Daniel.ogg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q726199 wdt:P735 ?answer . ?answer wdt:P443 ?x FILTER(contains(?x,'Pl-Daniel.ogg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dan Carter', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'pronunciation audio', 'o': 'pl-daniel.ogg'}}

 Q: What is the taxonomic type of Cactaceae?
 SPARQL:  select distinct ?obj where { wd:Q14560 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cactaceae', 'p': 'taxonomic type', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is {end cause} and {elected in} of {{Thomas Wakley} has {position held} as {Member of the 12th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q334239 p:P39 ?s . ?s ps:P39 wd:Q41582548 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Wakley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 12th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Wakley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 12th Parliament of the United Kingdom'}}}]

