 Q: Name a Catholic cathedral dedicated to Virgin Mary that contains the word "dame" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj wdt:P825 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dame')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Catholic cathedral', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'dedicated to', 'o': 'Virgin Mary'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dame'}}

 Q: Tell me time whose name has the word  prehistory in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11471 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'prehistory')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'time'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'prehistory'}}

 Q: What is the garrison of International Society for Krishna Consciousness, of which the Women in Red Banner are Mayapur Banner.jpg?
 SPARQL: SELECT ?answer WHERE { wd:Q190193 wdt:P159 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Mayapur Banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'International Society for Krishna Consciousness', 'p': 'garrison', 'o': '?x0'}

 Q: What is {position held} of {Hammer DeRoburt} that is {end time} is {1986-9-17} ?
 SPARQL: SELECT ?obj WHERE { wd:Q336231 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1986')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hammer DeRoburt', 'p': 'position held', 'o': '?x0', 't': '1986'}

 Q: What is SHARE Catalogue author ID for John Greenleaf Whittier?
 SPARQL: select distinct ?answer where { wd:Q458372 wdt:P3987 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Greenleaf Whittier', 'p': 'SHARE Catalogue author ID', 'o': '?x0'}

 Q: What is the leader of the nominee for of The Lavender Hill Mob ?
 SPARQL: SELECT ?answer WHERE { wd:Q1168531 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'leader', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Lavender Hill Mob', 'p': 'nominee for', 'o': '$y0'}}

 Q: What is the {wizard in the Harry Potter universe} for {present in work} of {Harry Potter}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q8337 . ?sbj wdt:P31 wd:Q15298259 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Harry Potter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'wizard in the Harry Potter universe'}}

 Q: Which is the World Surf League ID for Kelly Slater?
 SPARQL: select distinct ?answer where { wd:Q364406 wdt:P3339 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kelly Slater', 'p': 'World Surf League ID', 'o': '?x0'}

 Q: What is {date of death} and {date of birth} of {{Abigail Adams} has {child} as {Charles Adams}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles Adams'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles Adams'}}}]

 Q: Which is the audio pronunciation of Alfred Jodl?
 SPARQL: select distinct ?answer where { wd:Q57123 wdt:P443 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alfred Jodl', 'p': 'audio pronunciation', 'o': '?x0'}

 Q: How many electrical plug types are used for Saint Kitts and Nevis?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q763 wdt:P2853 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Saint Kitts and Nevis', 'p': 'electrical plug type', 'o': '?x0'}

 Q: what is the {end time} for {Pliny the Elder} has {position held} as {Procurator} ?
 SPARQL: SELECT ?value WHERE { wd:Q82778 p:P39 ?s . ?s ps:P39 wd:Q499165 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pliny the Elder', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Procurator'}}}

 Q: Kurdish people are of what ethnic group?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P172 wd:Q12223 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'ethnic group', 'o': 'Kurdish people', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: What is {number of out of school children} of {continent} of {decolonisation of Asia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5249554 wdt:P30 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'decolonisation of Asia', 'p': 'continent', 'o': '$y0'}}

 Q: Which is the CTHS person ID for François Quesnay?
 SPARQL: select distinct ?answer where { wd:Q13575 wdt:P2383 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'François Quesnay', 'p': 'CTHS person ID', 'o': '?x0'}

 Q: What is the effect of aspirin?
 SPARQL: select distinct ?answer where { wd:Q18216 wdt:P1542 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aspirin', 'p': 'effect', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Birgit Prinz} has {member of sports team} as {FSV Frankfurt}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q109868 p:P54 ?s . ?s ps:P54 wd:Q157352 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Birgit Prinz', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'FSV Frankfurt'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Birgit Prinz', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'FSV Frankfurt'}}}]

 Q: What is the Christian name for Peter Garrett, it is said to the same as Petelo
 SPARQL: SELECT ?answer WHERE { wd:Q528907 wdt:P735 ?answer . ?answer wdt:P460 wd:Q18640816}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Garrett', 'p': 'Christian name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Petelo'}}

 Q: What are the love deity which contains the word inanna in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1670614 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'inanna')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'love deity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'inanna'}}

 Q: When did country for sport of Michael Schumacher and start time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9671 p:P1532 ?s . ?s ps:P1532 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Schumacher', 'p': 'country for sport', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country for sport', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Schumacher', 'p': 'country for sport', 'o': '$y0'}}]

 Q: What is <UltraSignup runner ID> of <Dean Karnazes> ?
 SPARQL: select distinct ?answer where { wd:Q331288 wdt:P3585 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dean Karnazes', 'p': 'UltraSignup runner ID', 'o': '?x0'}

 Q: where is the head of government and head of state of Goa?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1171 wdt:P6 ?ans_1 . wd:Q1171 wdt:P35 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Goa', 'p': 'head of government', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Goa', 'p': 'head of state', 'o': '?x1'}]

 Q: Give me {international organization} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484652 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is Righteous Among The Nations ID for Raoul Wallenberg ?
 SPARQL: select distinct ?answer where { wd:Q152850 wdt:P1979 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Raoul Wallenberg', 'p': 'Righteous Among The Nations ID', 'o': '?x0'}

 Q: What is the birth date of the book by Avenue Q?
 SPARQL: SELECT ?answer WHERE { wd:Q790583 wdt:P87 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birth date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Avenue Q', 'p': 'book by', 'o': '$y0'}}

 Q: Was Michael Bloomberg a residence in Medford and Allston?
 SPARQL: ASK WHERE { wd:Q607 wdt:P551 wd:Q54145 . wd:Q607 wdt:P551 wd:Q572788 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Michael Bloomberg', 'p': 'residence', 'o': '?x0', '?x0': 'Medford'}, {'h': 'IS', 'v': '?x1', 's': 'Michael Bloomberg', 'p': 'residence', 'o': '?x1', '?x1': 'Allston'}]

 Q: Is Bhumibol Adulyadej the child of Sirikit and Chulabhorn Walailak?
 SPARQL: ASK WHERE { wd:Q855252 wdt:P40 wd:Q164518 . wd:Q855252 wdt:P40 wd:Q1089410 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bhumibol Adulyadej', 'p': 'child', 'o': '?x0', '?x0': 'Sirikit'}, {'h': 'IS', 'v': '?x1', 's': 'Bhumibol Adulyadej', 'p': 'child', 'o': '?x1', '?x1': 'Chulabhorn Walailak'}]

 Q: Who is the {human} for {spouse} of {Sean Hannity}
 SPARQL:  select distinct ?obj where { wd:Q557730 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sean Hannity', 'p': 'spouse', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the narrative location and genre of Hamlet?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q41567 wdt:P840 ?ans_1 . wd:Q41567 wdt:P136 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hamlet', 'p': 'narrative location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hamlet', 'p': 'genre', 'o': '?x1'}]

 Q: What is {coordinate location} of {Ganges} that is {applies to part} is {river mouth} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5089 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ganges', 'p': 'coordinates', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river mouth'}}}

 Q: What is {member of the board of directors} of {developed by} of {Mac OS X 10.1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q478451 wdt:P178 ?X . ?X wdt:P3320 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of the board of directors', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mac OS X 10.1', 'p': 'developed by', 'o': '$y0'}}

 Q: What has the higher taxon of Ulmus, is it the common name jilmovite?
 SPARQL: SELECT ?answer WHERE { wd:Q131113 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'jilmovité'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ulmus', 'p': 'higher taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'common name', 'o': 'jilmovité'}}

 Q: Tell me novella that starts with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q149537 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'novella'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the study of Kazimierz Nitsch's academic subject?
 SPARQL: SELECT ?answer WHERE { wd:Q2077007 wdt:P101 ?X . ?X wdt:P2578 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'study of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kazimierz Nitsch', 'p': 'subject', 'o': '$y0'}}

 Q: what is the life stance of Bantu People, that was established by Jesus Christ ?
 SPARQL: SELECT ?answer WHERE { wd:Q173371 wdt:P140 ?answer . ?answer wdt:P112 wd:Q302}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bantu', 'p': 'life stance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'established by', 'o': 'Jesus'}}

 Q: What would be the penalty of blasphemy?
 SPARQL: select distinct ?answer where { ?answer wdt:P1596 wd:Q200481}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'penalty', 'o': 'blasphemy'}

 Q: How many {active ingredient in} are for {acetaminophen} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q57055 wdt:P3780 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'acetaminophen', 'p': 'active ingredient in', 'o': '?x0'}

 Q: Tell me criterion of similarity whose name has the word number in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7250271 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'number')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'criterion of similarity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'number'}}

 Q: What is {daughters} of {Olivia de Havilland}, that has {craft} is {journalist} ?
 SPARQL: SELECT ?answer WHERE { wd:Q95068 wdt:P40 ?answer . ?answer wdt:P106 wd:Q1930187}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Olivia de Havilland', 'p': 'daughter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'craft', 'o': 'journalist'}}

 Q: what is the {start time} for {Alfred Dreyfus} has {award received} as {Officer of the Legion of Honour} ?
 SPARQL: SELECT ?value WHERE { wd:Q171826 p:P166 ?s . ?s ps:P166 wd:Q10855195 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Dreyfus', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Officer of the Legion of Honour'}}}

 Q: What is the {biological process} for {biological phase} of {DNA replication}
 SPARQL:  select distinct ?obj where { wd:Q130996 wdt:P4774 ?obj . ?obj wdt:P31 wd:Q2996394 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'DNA replication', 'p': 'biological phase', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biological process'}}

 Q: What is <C-SPAN organization ID> of <Hamburg> ?
 SPARQL: select distinct ?answer where { wd:Q1055 wdt:P4725 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hamburg', 'p': 'C-SPAN organization ID', 'o': '?x0'}

 Q: What is the {human} for {influenced by} of {Louis Pasteur}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P737 wd:Q529 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'influenced by', 'o': 'Louis Pasteur', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Give me {soft drink} that {country of origin} {North America} and which contains the word {beer} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q147538 . ?sbj wdt:P495 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'beer')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'soft drink', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'North America'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'beer'}}

 Q: what is the {point in time} for {Colorado} has {population} as {939629.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q1261 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'939629.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Colorado', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '939629.0'}, 't': '?x0'}

 Q: Can you tell me which dwarf planet with the largest argument of periapsis has a moon called Dysnomia?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2199 . ?ent wdt:P2248 ?obj . ?ent wdt:P398 wd:Q102656 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'argument of periapsis', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dwarf planet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Dysnomia'}}}

 Q: What was the operator of the London Underground that finished in December 31st, 1969?
 SPARQL: SELECT ?obj WHERE { wd:Q20075 p:P137 ?s . ?s ps:P137 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'London Underground', 'p': 'operator', 'o': '?x0', 't': '1969'}

 Q: What is the name of Ian Fleming's sister, whose language is English?
 SPARQL: SELECT ?answer WHERE { wd:Q82104 wdt:P3373 ?answer . ?answer wdt:P1412 wd:Q1860}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ian Fleming', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language', 'o': 'English'}}

 Q: Christopher Columbus is dedicated to how many?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P825 wd:Q7322 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'dedicated to', 'o': 'Christopher Columbus'}

 Q: What is {competed in} of {Angela Merkel}, that has {agent} is {Andreas Schwarz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q567 wdt:P1344 ?answer . ?answer wdt:P710 wd:Q15434565}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Angela Merkel', 'p': 'competed in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'agent', 'o': 'Andreas Schwarz'}}

 Q: What is <applies to part> of <Go> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P518 wd:Q11413}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'applies to part', 'o': 'Go'}

 Q: Which is the depositor for United Nations Secretary-General?
 SPARQL: select distinct ?answer where { ?answer wdt:P2058 wd:Q81066}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depositor', 'o': 'United Nations Secretary-General'}

 Q: Marge Champion's given name is Celeste in which series ordinal?
 SPARQL: SELECT ?value WHERE { wd:Q2617543 p:P735 ?s . ?s ps:P735 wd:Q3664222 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marge Champion', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Celeste'}}}

 Q: Which is the IAAF ID of Genzebe Dibaba?
 SPARQL: select distinct ?answer where { wd:Q457099 wdt:P1146 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genzebe Dibaba', 'p': 'IAAF ID', 'o': '?x0'}

 Q: What is Plymouth's IWM memorial ID?
 SPARQL: select distinct ?answer where { wd:Q43382 wdt:P3038 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Plymouth', 'p': 'IWM memorial ID', 'o': '?x0'}

 Q: Did Socrates marry Xanthippe and Myrto?
 SPARQL: ASK WHERE { wd:Q913 wdt:P26 wd:Q233677 . wd:Q913 wdt:P26 wd:Q1956836 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Socrates', 'p': 'marry', 'o': '?x0', '?x0': 'Xanthippe'}, {'h': 'IS', 'v': '?x1', 's': 'Socrates', 'p': 'marry', 'o': '?x1', '?x1': 'Myrto'}]

 Q: Which  is wing configuration of A-10 Thunderbolt II?
 SPARQL: select distinct ?answer where { wd:Q192443 wdt:P1654 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thunderbolt II', 'p': 'wing configuration', 'o': '?x0'}

 Q: Who married Grover Cleveland on June 2, 1886?
 SPARQL: SELECT ?obj WHERE { wd:Q35171 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1886')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Grover Cleveland', 'p': 'married', 'o': '?x0', 't': '1886'}

 Q: In 1933, what sports team was Douglas Jardine a part of?
 SPARQL: SELECT ?obj WHERE { wd:Q3038014 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1933')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Douglas Jardine', 'p': 'team', 'o': '?x0', 't': '1933'}

 Q: Did {Nancy_Kerrigan} {country for sport} {United States of America}?
 SPARQL: ASK WHERE { wd:Q239988 wdt:P1532 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Nancy Kerrigan', 'p': 'country for sport', 'o': '?x0', '?x0': 'United States of America'}]

 Q: Who is the student of Carl Friedrich Gauss?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q6722 wdt:P1066 ?ans_1 . wd:Q6722 wdt:P802 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Carl Friedrich Gauss', 'p': 'student of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Carl Friedrich Gauss', 'p': 'student', 'o': '?x1'}]

 Q: Tell me what literary form has the word yuefu in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4263830 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yuefu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary form'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yuefu'}}

 Q: Tell me weekly newspaper whose name has the word es in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'és')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weekly newspaper'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'és'}}

 Q: What is {death location} of {John Flynn}, that has {is in the municipality of} is {New South Wales} ?
 SPARQL: SELECT ?answer WHERE { wd:Q323080 wdt:P20 ?answer . ?answer wdt:P131 wd:Q3224}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Flynn', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'New South Wales'}}

 Q: What award was James Gandolfini nominated for in 2009?
 SPARQL: SELECT ?obj WHERE { wd:Q308722 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'James Gandolfini', 'p': 'nominated for', 'o': '?x0', 't': '2009'}

 Q: Which one is of the pasteurization?
 SPARQL: select distinct ?answer where { wd:Q58148 wdt:P642 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pasteurization', 'p': 'of', 'o': '?x0'}

 Q: Which is the constellation of Hercules?
 SPARQL: select distinct ?answer where { ?answer wdt:P59 wd:Q10448}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Hercules'}

 Q: What what is dead language has conjugation class Latin third conjungation and also which starts with letter i
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45762 . ?sbj wdt:P5206 wd:Q54295441 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dead language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has conjugation class', 'o': 'Latin third conjungation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Who is the judge of Nuremberg trials?
 SPARQL: select distinct ?answer where { wd:Q80130 wdt:P1594 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nuremberg trials', 'p': 'judge', 'o': '?x0'}

 Q: What is the name of the awards confered by Youtube ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1027 wd:Q866 . ?sbj wdt:P31 wd:Q618779 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'by', 'o': 'Youtube', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award'}}

 Q: what is the {follows} for {Baja California Sur} has {inception} as {1930-12-30} ?
 SPARQL: SELECT ?value WHERE { wd:Q46508 p:P571 ?s . ?s ps:P571 ?x filter(contains(YEAR(?x),'1930')) . ?s pq:P155 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Baja California Sur', 'p': 'inception', 'o': '$y0'}}

 Q: What is {has towns} of {comes from} of {Game Informer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27197 wdt:P495 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has towns', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Game Informer', 'p': 'comes from', 'o': '$y0'}}

 Q: Give me {city of the United States} that contains the word {washington} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1093829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'washington')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city of the United States'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'washington'}}

 Q: How many {partnership with} are to/by {Autonomous University of Barcelona} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2652 wd:Q43452 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'partnership with', 'o': 'Autonomous University of Barcelona'}

 Q: Flickr is depends on software ?
 SPARQL: select distinct ?answer where { wd:Q103204 wdt:P1547 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Flickr', 'p': 'depends on software', 'o': '?x0'}

 Q: what is the {start time} for {Bank of America} has {subsidiary} as {Seafirst Bank} ?
 SPARQL: SELECT ?value WHERE { wd:Q487907 p:P355 ?s . ?s ps:P355 wd:Q7440350 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bank of America', 'p': 'subsidiary', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subsidiary', 'o': 'Seafirst Bank'}}}

 Q: What is {member of sports team} of {Just Fontaine} that is {start time} is {1950-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1950')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Just Fontaine', 'p': 'member of sports team', 'o': '?x0', 't': '1950'}

 Q: Where is the administrative unit of {architecture of India}, whose {administrative centre} is {New Delhi}?
 SPARQL: SELECT ?answer WHERE { wd:Q61050 wdt:P131 ?answer . ?answer wdt:P36 wd:Q987}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'architecture of India', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'administrative centre', 'o': 'New Delhi'}}

 Q: Does the apoapsis of the 3375 Amy equal 2.227?
 SPARQL: ASK WHERE { wd:Q545429 wdt:P2243 ?obj filter(?obj = 2.227) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '3375 Amy', 'p': 'apoapsis', 'o': '?x0', '?x0': '2.227'}

 Q: What is the {imperative programming language} for {developer} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q21562092 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'imperative programming language'}}

 Q: Who is the{SCO summit} for {participant of} of {Alexander Lukashenko}
 SPARQL:  select distinct ?obj where { wd:Q2866 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q30178840 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexander Lukashenko', 'p': 'participant of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'SCO summit'}}

 Q: What is {profession's field} of {studied by} of {canoeing} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20856109 wdt:P3095 ?X . ?X wdt:P425 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': "profession's field", 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'canoeing', 'p': 'studied by', 'o': '$y0'}}

 Q: What is the village of Ukraine with the maximum elevation above sea level whose located in the administrative territorial entity is Staryi Sambir Raion?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21672098 . ?ent wdt:P2044 ?obj . ?ent wdt:P131 wd:Q2599775 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'elevation above sea level', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'village of Ukraine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Staryi Sambir Raion'}}}

 Q: What is {instrument played} of {zero-sum game}, that has {scientific area} is {control theory} ?
 SPARQL: SELECT ?answer WHERE { wd:Q156612 wdt:P2283 ?answer . ?answer wdt:P101 wd:Q6501221}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'zero-sum game', 'p': 'uses', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'area', 'o': 'control theory'}}

 Q: What is the {standardized writing system} for {writing system} of {traditional Chinese characters}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q55692290 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'traditional Chinese characters', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'standardized writing system'}}

 Q: What is the {kingdom} for {official language} of {Romanian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q7913 . ?sbj wdt:P31 wd:Q417175 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Romanian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kingdom'}}

 Q: Who did Louis XIV of France marry on June 9, 1660?
 SPARQL: SELECT ?obj WHERE { wd:Q7742 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1660')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louis XIV of France', 'p': 'marry', 'o': '?x0', 't': '1660'}

 Q: Which is the tributary over the Pont Neuf?
 SPARQL: SELECT ?answer WHERE { wd:Q335277 wdt:P177 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pont Neuf', 'p': 'over', 'o': '$y0'}}

 Q: What is the {manned spacecraft} for {astronaut mission} of {Alan Shepard}
 SPARQL:  select distinct ?obj where { wd:Q174979 wdt:P450 ?obj . ?obj wdt:P31 wd:Q7217761 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alan Shepard', 'p': 'astronaut mission', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'manned spacecraft'}}

 Q: What is {subtopic of} of {history of Suriname}, that has {consumer price index inflation rate} is {28.4} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1516634 wdt:P1269 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'28.4'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Suriname', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '28.4'}}

