 Q: what is the {statement is subject of} for {Donald Trump} has {significant event} as {inauguration} ?
 SPARQL: SELECT ?value WHERE { wd:Q22686 p:P793 ?s . ?s ps:P793 wd:Q1417098 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Trump', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'significant event', 'o': 'inauguration'}}}

 Q: What award did Joseph E. Stiglitz receive at the start of 1979?
 SPARQL: SELECT ?obj WHERE { wd:Q18430 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph E. Stiglitz', 'p': 'award', 'o': '?x0', 't': '1979'}

 Q: Sevastopol is located on what peninsula?
 SPARQL:  select distinct ?obj where { wd:Q7525 wdt:P706 ?obj . ?obj wdt:P31 wd:Q34763 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sevastopol', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'peninsula'}}

 Q: What is {member of sports team} of {Ronaldinho} that is {number of matches played} is {6.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q39444 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'6.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ronaldinho', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '6.0'}}}

 Q: What is {studied under} of {sculptor} of {Urd Werdande Skuld (The Norns)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18543004 wdt:P170 ?X . ?X wdt:P1066 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'studied under', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Urd Werdande Skuld (The Norns)', 'p': 'sculptor', 'o': '$y0'}}

 Q: Is the base salary of George Stephenson more than 240.0?
 SPARQL: ASK WHERE { wd:Q133614 wdt:P3618 ?obj filter(?obj > 240.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'George Stephenson', 'p': 'base salary', 'o': '?x0', '?x0': '240.0'}

 Q: How many {total produced} are for {Glock} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q739882 wdt:P1092 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Glock', 'p': 'total produced', 'o': '?x0'}

 Q: What is {continent} of {participants} of {Cold War} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8683 wdt:P710 ?X . ?X wdt:P30 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cold War', 'p': 'participant', 'o': '$y0'}}

 Q: Is the duration of the 2058-2059 one-year-period greater than 1.2?
 SPARQL: ASK WHERE { wd:Q61702894 wdt:P2047 ?obj filter(?obj > 1.2) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '2058-2059 one-year-period', 'p': 'duration', 'o': '?x0', '?x0': '1.2'}

 Q: What are the Christian denomination which start with the letter united
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q879146 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'united')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian denomination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'united'}}

 Q: What is <established from medical condition> of <Down syndrome> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5166 wd:Q47715}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'established from medical condition', 'o': 'Down syndrome'}

 Q: What credit institution starts with the letter "w"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q730038 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'credit institution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: what is the {point in time} for {Szczecin} has {population} as {407811.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q393 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'407811.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Szczecin', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '407811.0'}, 't': '?x0'}

 Q: What is MYmovies actor ID of Adrien Brody?
 SPARQL: select distinct ?answer where { wd:Q104514 wdt:P4779 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Adrien Brody', 'p': 'MYmovies actor ID', 'o': '?x0'}

 Q: What is the {trademark} with the {MAX(alcohol by volume)} whose {country of origin} is {Belgium}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q167270 . ?ent wdt:P2665 ?obj . ?ent wdt:P495 wd:Q31 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'alcohol by volume', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'trademark', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'Belgium'}}}

 Q: How many movements made for the {futurism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P135 wd:Q131221 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'movement', 'o': 'futurism'}

 Q: Is it true that the visitors per year of Paul-Raymond Museum equals to 882?
 SPARQL: ASK WHERE { wd:Q3329306 wdt:P1174 ?obj filter(?obj = 882) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Paul-Raymond Museum', 'p': 'visitors per year', 'o': '?x0', '?x0': '882'}

 Q: What is {champ} of {nomination received} of {Stephen Hendry} ?
 SPARQL: SELECT ?answer WHERE { wd:Q295201 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stephen Hendry', 'p': 'nomination received', 'o': '$y0'}}

 Q: What is {nominated for} of {Clint Eastwood} that is {statement is subject of} is {76th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43203 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q458646 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clint Eastwood', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '76th Academy Awards'}}}

 Q: Which is used by the standard genetic code?
 SPARQL: select distinct ?answer where { wd:Q180618 wdt:P1535 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'standard genetic code', 'p': 'used by', 'o': '?x0'}

 Q: What is the {administrative building} for {occupant} of {East India Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P466 wd:Q83164 . ?sbj wdt:P31 wd:Q2519340 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'occupant', 'o': 'East India Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'administrative building'}}

 Q: Is the vehicles per thousand people of Berlin equal to 342?
 SPARQL: ASK WHERE { wd:Q64 wdt:P5167 ?obj filter(?obj = 342) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Berlin', 'p': 'vehicles per thousand people', 'o': '?x0', '?x0': '342'}

 Q: who  is the professional wrestling promotion for replaces of WWE?
 SPARQL:  select distinct ?obj where { wd:Q35339 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q721067 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'WWE', 'p': 'replaces', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'professional wrestling promotion'}}

 Q: Which is the chromosome count for Down syndrome?
 SPARQL: select distinct ?answer where { wd:Q47715 wdt:P5230 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Down syndrome', 'p': 'chromosome count', 'o': '?x0'}

 Q: Was PHP influenced by C++ and PHP?
 SPARQL: ASK WHERE { wd:Q59 wdt:P737 wd:Q2407 . wd:Q59 wdt:P737 wd:Q59 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'PHP', 'p': 'influenced by', 'o': '?x0', '?x0': 'C++'}, {'h': 'IS', 'v': '?x1', 's': 'PHP', 'p': 'influenced by', 'o': '?x1', '?x1': 'PHP'}]

 Q: When did position held of Arthur Balfour and elected in?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q19008 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Balfour', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Balfour', 'p': 'position held', 'o': '$y0'}}]

 Q: What is the {video game publisher} for {product or material produced} of {Commodore 64}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q99775 . ?sbj wdt:P31 wd:Q1137109 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'Commodore 64', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game publisher'}}

 Q: What is the {human} for {sport} of {boxing}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P641 wd:Q32112 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'boxing', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which metabolite has the largest mass?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q407595 . ?ent wdt:P2067 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'mass', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metabolite'}}

 Q: Which are the honors of the discoverer of hovercraft?
 SPARQL: SELECT ?answer WHERE { wd:Q185757 wdt:P61 ?X . ?X wdt:P166 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'honors', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hovercraft', 'p': 'discoverer', 'o': '$y0'}}

 Q: Is it true that the rate of fire of the 127/54 Compact equal 48.0?
 SPARQL: ASK WHERE { wd:Q1257331 wdt:P3792 ?obj filter(?obj = 48.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '127/54 Compact', 'p': 'rate of fire', 'o': '?x0', '?x0': '48.0'}

 Q: What is {chairperson} of {University of Tokyo} that is {start time} is {2015-4-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q7842 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'University of Tokyo', 'p': 'chairperson', 'o': '?x0', 't': '2015'}

 Q: What is {population} of {Baku} that is {point in time} is {1979-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q9248 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Baku', 'p': 'population', 'o': '?x0', 't': '1979'}

 Q: What is the country of origin for thrash metal?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q483352 wdt:P495 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'thrash metal', 'p': 'country of origin', 'o': '?x0'}

 Q: What is {county seat for} of {work location} of {Feodor Chaliapin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q189164 wdt:P937 ?X . ?X wdt:P1376 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'county seat for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Feodor Chaliapin', 'p': 'work location', 'o': '$y0'}}

 Q: What award was given to Gerhart Hauptmann, and how much money did he win from it?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q43523 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerhart Hauptmann', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerhart Hauptmann', 'p': 'award', 'o': '$y0'}}]

 Q: What is the {language} for {indigenous to} of {Khazars}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2341 wd:Q173282 . ?sbj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'indigenous to', 'o': 'Khazars', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: When was Dizzee Rascal nominated for the Brit Award for British Breakthrough Act?
 SPARQL: SELECT ?value WHERE { wd:Q366506 p:P1411 ?s . ?s ps:P1411 wd:Q16985318 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dizzee Rascal', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Brit Award for British Breakthrough Act'}, 't': '?x0'}

 Q: What is {end time} and {start time} of {{Deodoro da Fonseca} has {position held} as {President of Brazil}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q200812 p:P39 ?s . ?s ps:P39 wd:Q5176750 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Deodoro da Fonseca', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Brazil'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Deodoro da Fonseca', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Brazil'}}}]

 Q: Who gave the {unit symbol} of {adaptation of} of {foot per second} ?
 SPARQL: SELECT ?answer WHERE { wd:Q748716 wdt:P144 ?X . ?X wdt:P5061 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'unit symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'foot per second', 'p': 'adaptation of', 'o': '$y0'}}

 Q: What is the Setlist FM artist ID of The Cure?
 SPARQL: select distinct ?answer where { wd:Q484427 wdt:P5431 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Cure', 'p': 'Setlist FM artist ID', 'o': '?x0'}

 Q: what is forensic technique starts with d
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q456443 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'forensic technique'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Who gave the {co-founded by} of {has designer} of {RIM-116 Rolling Airframe Missile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1060737 wdt:P287 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'RIM-116 Rolling Airframe Missile', 'p': 'has designer', 'o': '$y0'}}

 Q: What is {made by} of {in narrative} of {Jacques} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24565962 wdt:P1441 ?X . ?X wdt:P2079 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'made by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacques', 'p': 'in narrative', 'o': '$y0'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Gordon Banks} has {member of sports team} as {Stoke City F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q213879 p:P54 ?s . ?s ps:P54 wd:Q18736 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gordon Banks', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Stoke City F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gordon Banks', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Stoke City F.C.'}}}]

 Q: When was the population of Burkina Faso 8.57982e+06?
 SPARQL: SELECT ?value WHERE { wd:Q965 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'8.57982e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Burkina Faso', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '8.57982e+06'}, 't': '?x0'}

 Q: Is the atomic number of sulfur greater than 12.8
 SPARQL: ASK WHERE { wd:Q682 wdt:P1086 ?obj filter(?obj > 12.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'sulfur', 'p': 'atomic number', 'o': '?x0', '?x0': '12.8'}

 Q: Which is the 3D model of David?
 SPARQL: select distinct ?answer where { wd:Q179900 wdt:P4896 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David', 'p': '3D model', 'o': '?x0'}

 Q: Who is the facility operator of UTair Flight 120?
 SPARQL: SELECT ?answer WHERE { wd:Q633870 wdt:P137 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operator of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'UTair Flight 120', 'p': 'operator', 'o': '$y0'}}

 Q: what is the {replaces} for {Frank Forde} has {position held} as {Member of the Queensland Legislative Assembly} ?
 SPARQL: SELECT ?value WHERE { wd:Q459146 p:P39 ?s . ?s ps:P39 wd:Q18526194 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frank Forde', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Queensland Legislative Assembly'}}}

 Q: what is the {point in time} for {Lassie} has {original network} as {broadcast syndication} ?
 SPARQL: SELECT ?value WHERE { wd:Q289537 p:P449 ?s . ?s ps:P449 wd:Q1572845 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lassie', 'p': 'network', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'network', 'o': 'broadcast syndication'}, 't': '?x0'}

 Q: Does the University of Oxford admit a rate of .0175?
 SPARQL: ASK WHERE { wd:Q34433 wdt:P5822 ?obj filter(?obj = 0.175) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'University of Oxford', 'p': 'admission rate', 'o': '?x0', '?x0': '0.175'}

 Q: Is the endowment of McGill University greater than 1252960800?
 SPARQL: ASK WHERE { wd:Q201492 wdt:P6589 ?obj filter(?obj > 1252960800.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'McGill University', 'p': 'endowment', 'o': '?x0', '?x0': '1252960800.0'}

 Q: What is the {said to be the same as} and the {present in work} of {Satan} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q35230 wdt:P460 ?ans_1 . wd:Q35230 wdt:P1441 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Satan', 'p': 'said to be the same as', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Satan', 'p': 'present in work', 'o': '?x1'}]

 Q: Which is the Crunchbase organisation ID of Alphabet Inc. ?
 SPARQL: select distinct ?answer where { wd:Q20800404 wdt:P2088 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alphabet Inc.', 'p': 'Crunchbase organisation ID', 'o': '?x0'}

 Q: "What is the treats disease of bismuth whose treatment is Trovafloxacin?
 SPARQL: SELECT ?answer WHERE { wd:Q942 wdt:P2175 ?answer . ?answer wdt:P2176 wd:Q544393}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'bismuth', 'p': 'treats', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'treatment', 'o': 'Trovafloxacin'}}

 Q: What is the {human} for {position held} of {UNESCO}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P39 wd:Q7809 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'position held', 'o': 'UNESCO', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {son of} of {has brother} of {Stanisław Grabowski} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9341975 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanisław Grabowski', 'p': 'bro', 'o': '$y0'}}

 Q: How many highest point are scored by Ben Nevis?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P610 wd:Q104674 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'highest point', 'o': 'Ben Nevis'}

 Q: What is {member of sports team} of {George Mikan} that is {position played on team / speciality} is {center} ?
 SPARQL: SELECT ?obj WHERE { wd:Q314185 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P413 wd:Q222052 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Mikan', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position played on team / speciality', 'o': 'center'}}}

 Q: Is it true that the Sister member count equals 4?
 SPARQL: ASK WHERE { wd:Q223048 wdt:P2124 ?obj filter(?obj = 4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sistar', 'p': 'member count', 'o': '?x0', '?x0': '4'}

 Q: What is {is in the borough of} of {Limpopo}, that has {has cities} is {North West} ?
 SPARQL: SELECT ?answer WHERE { wd:Q134907 wdt:P131 ?answer . ?answer wdt:P150 wd:Q165956}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Limpopo', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'North West'}}

 Q: What is named for Compton scattering which has the honorary title of "X-ray badge"?
 SPARQL: SELECT ?answer WHERE { wd:Q171516 wdt:P138 ?answer . ?answer wdt:P166 wd:Q2202680}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Compton scattering', 'p': 'named for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'honorary title', 'o': 'X-ray badge'}}

 Q: WHat are the types of software that contain the word "system" in their name ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28530532 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'system')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'types of software'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'system'}}

 Q: what is the {country} for {Marilyn Chambers} has {place of death} as {Santa Clarita} ?
 SPARQL: SELECT ?value WHERE { wd:Q220693 p:P20 ?s . ?s ps:P20 wd:Q491132 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marilyn Chambers', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Santa Clarita'}}}

 Q: What is {coat of arms} of {national of} of {Thomas Love Peacock} ?
 SPARQL: SELECT ?answer WHERE { wd:Q561408 wdt:P27 ?X . ?X wdt:P237 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coat of arms', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Love Peacock', 'p': 'national of', 'o': '$y0'}}

 Q: What is <ISzDb film ID> of <Jaws> ?
 SPARQL: select distinct ?answer where { wd:Q189505 wdt:P3110 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jaws', 'p': 'ISzDb film ID', 'o': '?x0'}

 Q: What is {developed by} of {medium} of {Filhos da Grávida de Taubaté} ?
 SPARQL: SELECT ?answer WHERE { wd:Q49305856 wdt:P437 ?X . ?X wdt:P178 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'developed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Filhos da Grávida de Taubaté', 'p': 'medium', 'o': '$y0'}}

 Q: What's the native label for congee?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q878624 wdt:P1705 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'congee', 'p': 'native label', 'o': '?x0'}

 Q: What is {award received} of {Robert Bresson} that is {for work} is {L'Argent} ?
 SPARQL: SELECT ?obj WHERE { wd:Q55391 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q2621769 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Bresson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "L'Argent"}}}

 Q: Who is {discoverer of} {big event} of {Najib Razak} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57675 wdt:P793 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discoverer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Najib Razak', 'p': 'big event', 'o': '$y0'}}

 Q: What is the {Yukon Quest} with the {MAX(size of team at finish)} whose {participant} is {Cody Strathe}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P710 wd:Q18588261 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'size of team at finish', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Yukon Quest', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Cody Strathe'}}}

 Q: What is {published in journal} of {citation} of {Darwin's abominable mystery: Insights from a supertree of the angiosperms} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24621983 wdt:P2860 ?X . ?X wdt:P1433 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Darwin's abominable mystery: Insights from a supertree of the angiosperms", 'p': 'citation', 'o': '$y0'}}

 Q: When Cardiff has its population 346100.0?
 SPARQL: SELECT ?value WHERE { wd:Q10690 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'346100.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Cardiff', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '346100.0'}, 't': '?x0'}

 Q: What is <event distance> of <Epsom Derby> ?
 SPARQL: select distinct ?answer where { wd:Q55629 wdt:P3157 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Epsom Derby', 'p': 'event distance', 'o': '?x0'}

 Q: What is {vapor pressure} of {Galinstan} that is {determination method} is {maximum} ?
 SPARQL: SELECT ?obj WHERE { wd:Q675176 p:P2119 ?s . ?s ps:P2119 ?obj . ?s pq:P459 wd:Q10578722 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'vapor pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Galinstan', 'p': 'vapor pressure', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'maximum'}}}

 Q: What is the {triangular number} with the {MIN(numeric value)} whose {instance of} is {composite number}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q245102 . ?ent wdt:P1181 ?obj . ?ent wdt:P31 wd:Q50707} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'numeric value', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'triangular number', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'composite number'}}}

 Q: What is the {executive body} and the {legislative body} of {Goa} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1171 wdt:P208 ?ans_1 . wd:Q1171 wdt:P194 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Goa', 'p': 'executive body', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Goa', 'p': 'legislative body', 'o': '?x1'}]

 Q: Are there fewer than 3.6 spans of the Kew Bridge?
 SPARQL: ASK WHERE { wd:Q371906 wdt:P1314 ?obj filter(?obj < 3.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Kew Bridge', 'p': 'spans', 'o': '?x0', '?x0': '3.6'}

 Q: who is the {mother} for {Will Smith} that has {child} as {Willow Smith} ?
 SPARQL: SELECT ?value WHERE { wd:Q40096 p:P40 ?s . ?s ps:P40 wd:Q298209 . ?s pq:P25 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Will Smith', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Willow Smith'}}}

 Q: "Which is {topic of} of {history of Alabama}, that has {has shires} is {Perry County} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q5774933 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q253538}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Alabama', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has shires', 'o': 'Perry County'}}

 Q: What is {occupation} of {Charles Baudelaire} that is {field of work} is {English} ?
 SPARQL: SELECT ?obj WHERE { wd:Q501 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P101 wd:Q1860 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'occupation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Baudelaire', 'p': 'occupation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'field of work', 'o': 'English'}}}

 Q: What is {diplomatic relation} of {location of burial} of {Karen Carpenter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1250861 wdt:P119 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karen Carpenter', 'p': 'location of burial', 'o': '$y0'}}

 Q: What is the {library} for {owned by} of {University of Oxford}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q7075 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'University of Oxford', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'library'}}

 Q: What is RYM artist ID for Van Morrison ?
 SPARQL: select distinct ?answer where { wd:Q272203 wdt:P5404 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Van Morrison', 'p': 'RYM artist ID', 'o': '?x0'}

 Q: which programming paradigm is language of mIRC ?
 SPARQL: SELECT ?answer WHERE { wd:Q211680 wdt:P277 ?X . ?X wdt:P3966 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'programming paradigm', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mIRC', 'p': 'language', 'o': '$y0'}}

 Q: Is it true that the emissivity of the cement is greater than 0.648?
 SPARQL: ASK WHERE { wd:Q45190 wdt:P1295 ?obj filter(?obj > 0.648) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'cement', 'p': 'emissivity', 'o': '?x0', '?x0': '0.648'}

 Q: What earthquake in Kamouraskas had the most aftershocks?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2320 ?obj . ?ent wdt:P131 wd:Q178178 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'aftershocks', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'earthquake', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Kamouraska Regional County Municipality'}}}

 Q: Tell me municipiu of Romania whose name has the word  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q640364 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zalău')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipiu of Romania'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zalău'}}

 Q: Was Sony BMG Music Entertainment Backstreet Boys' record label?
 SPARQL: ASK WHERE { wd:Q17140 wdt:P264 wd:Q3001888 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Backstreet Boys', 'p': 'record label', 'o': '?x0', '?x0': 'Sony BMG'}]

 Q: Who is the daughter of the president of the Conservative Party?
 SPARQL: SELECT ?answer WHERE { wd:Q9626 wdt:P488 ?X . ?X wdt:P25 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Conservative Party', 'p': 'president', 'o': '$y0'}}

 Q: What is the {Wikidata property for lexicographical data} for {subject item of this property} of {Chinese characters}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1629 wd:Q8201 . ?sbj wdt:P31 wd:Q54076056 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'item', 'o': 'Chinese characters', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikidata property for lexicographical data'}}

