 Q: What is {topic of} of {History of Haiti}, that has {has boroughs} is {Nippes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q846445 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q125232}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Haiti', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has boroughs', 'o': 'Nippes'}}

 Q: What is the domain child of Roman Smoluchowski?
 SPARQL: SELECT ?answer WHERE { wd:Q9312628 wdt:P22 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'domain', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roman Smoluchowski', 'p': 'child of', 'o': '$y0'}}

 Q: What is {mediatised to} of {characters} of {Merrie Melodies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1750628 wdt:P674 ?X . ?X wdt:P1366 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mediatised to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Merrie Melodies', 'p': 'characters', 'o': '$y0'}}

 Q: What is {product of} of {game platform} of {Deflektor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3263157 wdt:P400 ?X . ?X wdt:P176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'product of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Deflektor', 'p': 'platform', 'o': '$y0'}}

 Q: The {Finnish MP ID} of {Urho Kekkonen} is what?
 SPARQL: select distinct ?answer where { wd:Q179858 wdt:P2181 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Urho Kekkonen', 'p': 'Finnish MP ID', 'o': '?x0'}

 Q: What is the birth city of Laurie Anderson that is a partner town to Mexico City?
 SPARQL: SELECT ?answer WHERE { wd:Q235066 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1489}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Laurie Anderson', 'p': 'birth city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Mexico City'}}

 Q: Give me {aspect of history} that {facet of} {India} and which contains the word {history} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj wdt:P1269 wd:Q668 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'history')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of history', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'India'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'history'}}

 Q: What is <VGMdb artist ID> of <Burt Bacharach> ?
 SPARQL: select distinct ?answer where { wd:Q212762 wdt:P3435 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Burt Bacharach', 'p': 'VGMdb artist ID', 'o': '?x0'}

 Q: When did Wisconsin have a population of 1.05467e+0.6?
 SPARQL: SELECT ?value WHERE { wd:Q1537 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.05467e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Wisconsin', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.05467e+06'}, 't': '?x0'}

 Q: Which is the roof shape which contains the word tower in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1156686 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tower')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'roof shape'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tower'}}

 Q: What is the National Inventors Hall of Fame ID for Douglas Engelbart?
 SPARQL: select distinct ?answer where { wd:Q92614 wdt:P3468 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Douglas Engelbart', 'p': 'National Inventors Hall of Fame ID', 'o': '?x0'}

 Q: What is {death location} of {Robert Aldrich}, that has {sister city} is {Bordeaux} ?
 SPARQL: SELECT ?answer WHERE { wd:Q95133 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1479}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Robert Aldrich', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Bordeaux'}}

 Q: What international airport is Delta Air Lines' hub?
 SPARQL:  select distinct ?obj where { wd:Q188920 wdt:P113 ?obj . ?obj wdt:P31 wd:Q644371 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Delta Air Lines', 'p': 'hub', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international airport'}}

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Brian Clough} has {member of sports team} as {England B national football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q1110944 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brian Clough', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England B'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brian Clough', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England B'}}}]

 Q: What is {educated at} of {Christopher A. Sims} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q109737 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher A. Sims', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher A. Sims', 'p': 'educated at', 'o': '$y0'}}]

 Q: what is the {for work} for {Hans Zimmer} has {nominated for} as {Academy Award for Best Original Score} ?
 SPARQL: SELECT ?value WHERE { wd:Q76364 p:P1411 ?s . ?s ps:P1411 wd:Q488651 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Zimmer', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Original Score'}}}

 Q: What is the member of sports team of Danie Craven that ended at 1938-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q742873 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1938')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Danie Craven', 'p': 'member of sports team', 'o': '?x0', 't': '1938'}

 Q: What are the property which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'property'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is the tributary for Mississippi River having a height of 242.0?
 SPARQL: SELECT ?answer WHERE { wd:Q1497 wdt:P974 ?answer . ?answer wdt:P2044 ?x FILTER(contains(?x,'242.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mississippi River', 'p': 'tributary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'height', 'o': '242.0'}}

 Q: What is the {Reichstag election in the Weimar Republic} for {applies to jurisdiction} of {Weimar Republic}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q41304 . ?sbj wdt:P31 wd:Q2047484 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'Weimar Republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Reichstag election in the Weimar Republic'}}

 Q: Who did Eddie Fisher marry in 1967?
 SPARQL: SELECT ?obj WHERE { wd:Q363708 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Eddie Fisher', 'p': 'marry', 'o': '?x0', 't': '1967'}

 Q: What is the territorial jurisdiction of Plessy v. Ferguson, that has a total fertility rate of 2.0075?
 SPARQL: SELECT ?answer WHERE { wd:Q656660 wdt:P1001 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'2.0075'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Plessy v. Ferguson', 'p': 'jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '2.0075'}}

 Q: "Who is the namesake of the Lorentz force, who was also a member of the Royal Netherlands Academy of Arts and Sciences?"
 SPARQL: SELECT ?answer WHERE { wd:Q172137 wdt:P138 ?answer . ?answer wdt:P463 wd:Q253439}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lorentz force', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Royal Netherlands Academy of Arts and Sciences'}}

 Q: What is the {located in or next to body of water} and the {located in time zone} of {Belgrade} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q3711 wdt:P206 ?ans_1 . wd:Q3711 wdt:P421 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Belgrade', 'p': 'body of water', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Belgrade', 'p': 'time zone', 'o': '?x1'}]

 Q: How many home worlds are determined for Venus?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1165 wd:Q313 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'home world', 'o': 'Venus'}

 Q: What is the {television series} for {executive producer} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1431 wd:Q22686 . ?sbj wdt:P31 wd:Q5398426 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'executive producer', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV show'}}

 Q: Who is the husband of Madhuri Dixit, who has gender identity as male?
 SPARQL: SELECT ?answer WHERE { wd:Q232451 wdt:P26 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Madhuri Dixit', 'p': 'husband', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'gender identity', 'o': 'male'}}

 Q: What is the molar mass of the parent body of Titania?
 SPARQL: SELECT ?answer WHERE { wd:Q3322 wdt:P397 ?X . ?X wdt:P2067 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mass', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Titania', 'p': 'parent body', 'o': '$y0'}}

 Q: Which is the Reddit username for American Civil Liberties Union?
 SPARQL: select distinct ?answer where { wd:Q21637 wdt:P4265 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Civil Liberties Union', 'p': 'Reddit username', 'o': '?x0'}

 Q: Which is the FootballFacts.ru player ID of Diego Maradona?
 SPARQL: select distinct ?answer where { wd:Q17515 wdt:P3660 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Diego Maradona', 'p': 'FootballFacts.ru player ID', 'o': '?x0'}

 Q: What award did Jerome Robbins receive in 1976?
 SPARQL: SELECT ?obj WHERE { wd:Q353019 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jerome Robbins', 'p': 'award', 'o': '?x0', 't': '1976'}

 Q: What is the country in the Kuril Islands that ends at 1875-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q80389 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1875')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kuril Islands', 'p': 'country', 'o': '?x0', 't': '1875'}

 Q: How many drainage basins are by Chad Basin?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4614 wd:Q575245 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'drainage basin', 'o': 'Chad Basin'}

 Q: How many ethnic groups are in Brazil?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q155 wdt:P172 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Brazil', 'p': 'ethnic group', 'o': '?x0'}

 Q: What is <location of formation> of <NSYNC> ?
 SPARQL: select distinct ?answer where { wd:Q154454 wdt:P740 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'NSYNC', 'p': 'location of formation', 'o': '?x0'}

 Q: What is <Dictionary of Ulster Biography ID> of <Samuel Beckett> ?
 SPARQL: select distinct ?answer where { wd:Q37327 wdt:P2029 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Samuel Beckett', 'p': 'Dictionary of Ulster Biography ID', 'o': '?x0'}

 Q: What is {first name} of {Paul Verhoeven}, that has {said to be different from} is {Paweł} ?
 SPARQL: SELECT ?answer WHERE { wd:Q129079 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19816823}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paul Verhoeven', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be different from', 'o': 'Paweł'}}

 Q: What is <signed form> of <Esperanto> ?
 SPARQL: select distinct ?answer where { wd:Q143 wdt:P3969 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'signed form', 'o': '?x0'}

 Q: What is the ATC code of halothane?
 SPARQL: select distinct ?answer where { wd:Q32921 wdt:P267 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'halothane', 'p': 'ATC code', 'o': '?x0'}

 Q: what is the {start time} for {Nigel Farage} has {position held} as {member of the European Parliament} ?
 SPARQL: SELECT ?value WHERE { wd:Q318471 p:P39 ?s . ?s ps:P39 wd:Q27169 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigel Farage', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the European Parliament'}}}

 Q: Tell me about member of sports team of Bobby Moore and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bobby Moore', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bobby Moore', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is associated with the sport played in physical fitness?
 SPARQL: SELECT ?answer WHERE { wd:Q309252 wdt:P641 ?X . ?X wdt:P3095 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'associated with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'physical fitness', 'p': 'sport', 'o': '$y0'}}

 Q: What is <by-product> of <animal husbandry> ?
 SPARQL: select distinct ?answer where { wd:Q80962 wdt:P2821 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'animal husbandry', 'p': 'by-product', 'o': '?x0'}

 Q: What is the {recurrent event edition} for {genre} of {ballet}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P136 wd:Q41425 . ?sbj wdt:P31 wd:Q27968055 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genre', 'o': 'ballet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurrent event edition'}}

 Q: What gunpowder developer has a 1318-0-0 birthdate?
 SPARQL: SELECT ?answer WHERE { wd:Q12861 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1318'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'gunpowder', 'p': 'developer', 'o': '?x0', 't': '1318'}

 Q: What award did Alec Baldwin win in 2017?
 SPARQL: SELECT ?obj WHERE { wd:Q170572 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alec Baldwin', 'p': 'award', 'o': '?x0', 't': '2017'}

 Q: When did Robert Musil earn his doctoral degree?
 SPARQL: SELECT ?value WHERE { wd:Q78487 p:P512 ?s . ?s ps:P512 wd:Q849697 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert Musil', 'p': 'degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'doctoral degree'}, 't': '?x0'}

 Q: Is the height of Sumbawa Pony greater than 0.96?
 SPARQL: ASK WHERE { wd:Q919647 wdt:P2048 ?obj filter(?obj > 0.96) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Sumbawa Pony', 'p': 'height', 'o': '?x0', '?x0': '0.96'}

 Q: what is the {end time} for {Cha Bum-kun} has {member of sports team} as {Bayer 04 Leverkusen} ?
 SPARQL: SELECT ?value WHERE { wd:Q346751 p:P54 ?s . ?s ps:P54 wd:Q104761 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cha Bum-kun', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Bayer 04 Leverkusen'}}}

 Q: Who gave the{affiliate of} of {plays for} of {Amauri Sanit} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2841376 wdt:P54 ?X . ?X wdt:P831 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'affiliate of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amauri Sanit', 'p': 'plays for', 'o': '$y0'}}

 Q: What is {makes} of {branch} of {Jorkwang Film} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35980843 wdt:P452 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'makes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jorkwang Film', 'p': 'branch', 'o': '$y0'}}

 Q: What was NCIS nominated for in the year 2013?
 SPARQL: SELECT ?obj WHERE { wd:Q4525 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'NCIS', 'p': 'nominated for', 'o': '?x0', 't': '2013'}

 Q: Who are members of sports team of Clarence Seedorf since the year 2002?
 SPARQL: SELECT ?obj WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Clarence Seedorf', 'p': 'team', 'o': '?x0', 't': '2002'}

 Q: What is {prevalence} of {dementia} that is {location} is {Americas} ?
 SPARQL: SELECT ?obj WHERE { wd:Q83030 p:P1193 ?s . ?s ps:P1193 ?obj . ?s pq:P276 wd:Q828 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prevalence', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'dementia', 'p': 'prevalence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'location', 'o': 'Americas'}}}

 Q: Is the longest span of the Deutz Suspension Bridge equal 184?
 SPARQL: ASK WHERE { wd:Q316976 wdt:P2787 ?obj filter(?obj = 184) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Deutz Suspension Bridge', 'p': 'longest span', 'o': '?x0', '?x0': '184'}

 Q: What sovereign state uses the Australian dollar as currency?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q259502 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Australian dollar', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is {member of sports team} of {Kareem Abdul-Jabbar} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q179051 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kareem Abdul-Jabbar', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kareem Abdul-Jabbar', 'p': 'team', 'o': '$y0'}}]

 Q: Which is the written work which has English as a language of work?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work', 'o': 'English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: Who was the wife of Valentinian I?
 SPARQL: select distinct ?answer where { wd:Q46720 wdt:P26 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Valentinian I', 'p': 'wife', 'o': '?x0'}

 Q: Which limestone powder has the highest emissivity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2908004 . ?ent wdt:P1295 ?obj . ?ent wdt:P186 wd:Q23757 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'emissivity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'powder', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'material used', 'o': 'limestone'}}}

 Q: Which is the ZDB ID for Maxim?
 SPARQL: select distinct ?answer where { wd:Q3552325 wdt:P1042 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maxim', 'p': 'ZDB ID', 'o': '?x0'}

 Q: What is {origin of the watercourse} of {Mittelland Canal} that is {coordinate location} is {52.277033333333 7.6040944444444} ?
 SPARQL: SELECT ?obj WHERE { wd:Q48480 p:P885 ?s . ?s ps:P885 ?obj . ?s pq:P625 ?x filter(contains(?x,'52.277033333333 7.6040944444444')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mittelland Canal', 'p': 'origin of the watercourse', 'o': '?x0'}

 Q: which country club has the highest slop rating?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1137210 . ?ent wdt:P3840 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'slope rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country club'}}

 Q: What is {formed on date} of {agent} of {Battle of Quiberon Bay} ?
 SPARQL: SELECT ?answer WHERE { wd:Q450318 wdt:P710 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formed on date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of Quiberon Bay', 'p': 'agent', 'o': '$y0'}}

 Q: What is {nominated for} of {Mr. Smith Goes to Washington} that is {statement is subject of} is {12th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q866120 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508513 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mr. Smith Goes to Washington', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '12th Academy Awards'}}}

 Q: What is {school attended} of {brother} of {Thomas J. Healey} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7791077 wdt:P3373 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'school attended', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas J. Healey', 'p': 'sibling', 'o': '$y0'}}

 Q: Which is the Royal Academy new identifier for Cardinal Richelieu?
 SPARQL: select distinct ?answer where { wd:Q26702 wdt:P4808 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardinal Richelieu', 'p': 'Royal Academy new identifier', 'o': '?x0'}

 Q: Were the Navirman Andolan arrested 8000 times?
 SPARQL: ASK WHERE { wd:Q1744162 wdt:P5582 ?obj filter(?obj = 8000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Navnirman Andolan', 'p': 'number of arrests', 'o': '?x0', '?x0': '8000'}

 Q: What is BoardGameGeek ID of Carrom?
 SPARQL: select distinct ?answer where { wd:Q900489 wdt:P2339 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carrom', 'p': 'BoardGameGeek ID', 'o': '?x0'}

 Q: What is {activity corresponding to this occupation} of {associated with} of {trumpet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8338 wdt:P3095 ?X . ?X wdt:P425 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'activity corresponding to this occupation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'trumpet', 'p': 'associated with', 'o': '$y0'}}

 Q: What is {circumstance of death} of {Nizam al-Mulk}, that has {implied by} is {human} ?
 SPARQL: SELECT ?answer WHERE { wd:Q298427 wdt:P1196 ?answer . ?answer wdt:P828 wd:Q5}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nizam al-Mulk', 'p': 'circumstance of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'implied by', 'o': 'people'}}

 Q: Does the angle from vertical of the Leaning Tower of Pisa equal 3.97?
 SPARQL: ASK WHERE { wd:Q39054 wdt:P4183 ?obj filter(?obj = 3.97) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Leaning Tower of Pisa', 'p': 'angle from vertical', 'o': '?x0', '?x0': '3.97'}

 Q: what is the {winner} for {Mick Jagger} has {award received} as {Golden Globe Award for Best Original Song} ?
 SPARQL: SELECT ?value WHERE { wd:Q128121 p:P166 ?s . ?s ps:P166 wd:Q1472235 . ?s pq:P1346 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mick Jagger', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Golden Globe Award for Best Original Song'}}}

 Q: What is {country} of {Belgrade} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q3711 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belgrade', 'p': 'country', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belgrade', 'p': 'country', 'o': '$y0'}}]

 Q: What are the examinations of the consequences of alcoholism?
 SPARQL: SELECT ?answer WHERE { wd:Q15326 wdt:P1542 ?X . ?X wdt:P923 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'examinations', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'alcoholism', 'p': 'consequence', 'o': '$y0'}}

 Q: Which is the location of first performance of Palace of Versailles?
 SPARQL: select distinct ?answer where { ?answer wdt:P4647 wd:Q2946}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location of first performance', 'o': 'Palace of Versailles'}

 Q: What is William of Rubruck's date of birth?
 SPARQL: SELECT ?value WHERE { wd:Q316083 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1220')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William of Rubruck', 'p': 'date of birth', 'o': '$y0'}}

 Q: Is the frequency of events for DFB-Pokal equal to 1?
 SPARQL: ASK WHERE { wd:Q150880 wdt:P2257 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'DFB-Pokal', 'p': 'frequency of event', 'o': '?x0', '?x0': '1'}

 Q: What has cause of Universiade ?
 SPARQL: select distinct ?answer where { wd:Q188158 wdt:P828 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Universiade', 'p': 'has cause', 'o': '?x0'}

 Q: What is {type of music} of {part of work} of {School of Ragtime, Exercise No. 6} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29541175 wdt:P1433 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'School of Ragtime, Exercise No. 6', 'p': 'part of work', 'o': '$y0'}}

 Q: What diplomatic relation to Canada is in the administrative unit of Victoria?
 SPARQL: SELECT ?answer WHERE { wd:Q36687 wdt:P131 ?answer . ?answer wdt:P530 wd:Q16}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Victoria', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Canada'}}

 Q: What is {mother} and {date of birth} of {{Charlemagne} has {child} as {Drogo}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q723791 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Drogo'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'birthdate', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Drogo'}}}]

 Q: What is {sequel of} of {day of periodic occurrence} of {Purim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q180115 wdt:P837 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sequel of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Purim', 'p': 'day', 'o': '$y0'}}

 Q: Which is the USK rating of Grand Theft Auto III?
 SPARQL: select distinct ?answer where { wd:Q149106 wdt:P914 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Grand Theft Auto III', 'p': 'USK rating', 'o': '?x0'}

 Q: what is the {for work} for {François Mauriac} has {award received} as {Grand Prix du roman de l'Académie française} ?
 SPARQL: SELECT ?value WHERE { wd:Q81685 p:P166 ?s . ?s ps:P166 wd:Q1542826 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'François Mauriac', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': "Grand Prix du roman de l'Académie française"}}}

 Q: What is the name of the culture of pupil of Isocrates?
 SPARQL: SELECT ?answer WHERE { wd:Q221182 wdt:P802 ?X . ?X wdt:P172 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'culture', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isocrates', 'p': 'pupil', 'o': '$y0'}}

 Q: what is the {type of kinship} for {Pieter Brueghel the Elder} has {relative} as {Pieter III. Brueghel} ?
 SPARQL: SELECT ?value WHERE { wd:Q43270 p:P1038 ?s . ?s ps:P1038 wd:Q2094250 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pieter Brueghel the Elder', 'p': 'relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relation', 'o': 'Pieter III. Brueghel'}}}

 Q: Tell me if the natural abundance of iron-56 is more than 0.734032
 SPARQL: ASK WHERE { wd:Q1052454 wdt:P2374 ?obj filter(?obj > 0.734032) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'iron-56', 'p': 'natural abundance', 'o': '?x0', '?x0': '0.734032'}

 Q: What is the {human} for {founded by} of {International Olympic Committee}
 SPARQL:  select distinct ?obj where { wd:Q40970 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'International Olympic Committee', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {rank} of {taxon parent} of {Salvia officinalis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1111359 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Salvia officinalis', 'p': 'taxon parent', 'o': '$y0'}}

 Q: Give me {spiral galaxy} that contains the word {ugc} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2488 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ugc')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spiral galaxy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ugc'}}

 Q: Did {Bryan_Adams} {nominated for} {Grammy Award for Album of the Year} and {Juno Award for Entertainer of the Year} ?
 SPARQL: ASK WHERE { wd:Q482907 wdt:P1411 wd:Q904528 . wd:Q482907 wdt:P1411 wd:Q6314074 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bryan Adams', 'p': 'nominated for', 'o': '?x0', '?x0': 'Grammy Award for Album of the Year'}, {'h': 'IS', 'v': '?x1', 's': 'Bryan Adams', 'p': 'nominated for', 'o': '?x1', '?x1': 'Juno Award for Entertainer of the Year'}]

 Q: What is {diplomatic relation} of {Philippines} that is {statement is subject of} is {Philippines–Qatar relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q928 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948934 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philippines', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Philippines–Qatar relations'}}}

 Q: Which is the IAFD male performer ID of Jamie Gillis?
 SPARQL: select distinct ?answer where { wd:Q725962 wdt:P4505 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jamie Gillis', 'p': 'IAFD male performer ID', 'o': '?x0'}

