 Q: IS THE ORBITAL ECCENTRICITY OF THE 6275 KIRYU EQAULS TO 0.01
 SPARQL: ASK WHERE { wd:Q556104 wdt:P1096 ?obj filter(?obj = 0.01) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '6275 Kiryu', 'p': 'orbital eccentricity', 'o': '?x0', '?x0': '0.01'}

 Q: What is the {musical} for {composer} of {Pete Townshend}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q26933 . ?sbj wdt:P31 wd:Q2743 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composer', 'o': 'Pete Townshend', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical'}}

 Q: What is {diplomatic relation} of {state} of {Arena Football League} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2725641 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arena Football League', 'p': 'state', 'o': '$y0'}}

 Q: Which is an active ingredient of the alcoholic beverage?
 SPARQL: select distinct ?answer where { wd:Q154 wdt:P3781 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'alcoholic beverage', 'p': 'active ingredient', 'o': '?x0'}

 Q: What is {differs from} of {heat}, that has {subitem of} is {energy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44432 wdt:P1889 ?answer . ?answer wdt:P1269 wd:Q11379}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'heat', 'p': 'differs from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subitem of', 'o': 'energy'}}

 Q: When did Delta Air Lines have a 12.8 market capitalization?
 SPARQL: SELECT ?value WHERE { wd:Q188920 p:P2226 ?s . ?s ps:P2226 ?x filter(contains(?x,'1.1643e+10')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Delta Air Lines', 'p': 'market capitalization', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'market capitalization', 'o': '1.1643e+10'}, 't': '?x0'}

 Q: What is the maximum angular resolution of robotic telescope?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3982946 . ?ent wdt:P3439 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'angular resolution', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'robotic telescope'}}

 Q: Bay Area Rapid Transit KML rank is what?
 SPARQL: select distinct ?answer where { wd:Q610120 wdt:P3096 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bay Area Rapid Transit', 'p': 'KML', 'o': '?x0'}

 Q: Is it true that 96 is the hydraulic head of Alqueva Dam?
 SPARQL: ASK WHERE { wd:Q2165228 wdt:P4441 ?obj filter(?obj = 96) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Alqueva Dam', 'p': 'hydraulic head', 'o': '?x0', '?x0': '96'}

 Q: What is {president} of {edited by} of {Garcia Report} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17277843 wdt:P98 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'president', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Garcia Report', 'p': 'edited by', 'o': '$y0'}}

 Q: What area are the papers at the Monique Genonceaux about?
 SPARQL: SELECT ?answer WHERE { wd:Q49965119 wdt:P485 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Monique Genonceaux', 'p': 'papers at', 'o': '$y0'}}

 Q: What is <NDL Auth ID> of <handball> ?
 SPARQL: select distinct ?answer where { wd:Q8418 wdt:P349 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'handball', 'p': 'NDL Auth ID', 'o': '?x0'}

 Q: What is Javier Zanetti's Soccerway player ID?
 SPARQL: select distinct ?answer where { wd:Q52876 wdt:P2369 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Javier Zanetti', 'p': 'Soccerway player ID', 'o': '?x0'}

 Q: What is {opposite} of {employment} of {Takeshi Inoue} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11373250 wdt:P106 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Takeshi Inoue', 'p': 'employment', 'o': '$y0'}}

 Q: When did Madison have a population of 6611?
 SPARQL: SELECT ?value WHERE { wd:Q43788 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'6611.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Madison', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '6611.0'}, 't': '?x0'}

 Q: What is the chemical compound with the least acceptable daily intake?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2542 ?obj . ?ent wdt:P31 wd:Q11173} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'acceptable daily intake', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is {medical specialty} of {treats medical condition} of {sodium bicarbonate} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179731 wdt:P2175 ?X . ?X wdt:P1995 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'medical specialty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sodium Bicarbonate', 'p': 'treats', 'o': '$y0'}}

 Q: What is the {human} for {spouse} of {Janet Yellen}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P26 wd:Q263725 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'married to', 'o': 'Janet Yellen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the number of casualties of Bulgaria equal to 79?
 SPARQL: ASK WHERE { wd:Q1265953 wdt:P1590 ?obj filter(?obj = 79) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Bulgaria', 'p': 'number of casualties', 'o': '?x0', '?x0': '79'}

 Q: What is {award received} of {John Mott} that is {prize money} is {60762.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q159726 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'60762.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Mott', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '60762.0'}}}

 Q: Which is the mythical dog that was killed by Heracles?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q30307328 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'killed by', 'o': 'Heracles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythical dog'}}

 Q: tell me chartered company starts with c
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chartered company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {population} of {Arizona} that is {determination method} is {census} ?
 SPARQL: SELECT ?obj WHERE { wd:Q816 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arizona', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: What is the {sovereign state} for {replaced by} of {Thirteen Colonies}
 SPARQL:  select distinct ?obj where { wd:Q179997 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thirteen Colonies', 'p': 'replaced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is {Showrunner} of {appears in} of {Creeper} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3696918 wdt:P1441 ?X . ?X wdt:P1431 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'showrunner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Creeper', 'p': 'appears in', 'o': '$y0'}}

 Q: Which is partially coincident with the web application?
 SPARQL: select distinct ?answer where { wd:Q189210 wdt:P1382 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'web application', 'p': 'partially coincident with', 'o': '?x0'}

 Q: What is {activity corresponding to this occupation} of {astronaut}, that has {often confused with} is {unmanned spaceflight} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11631 wdt:P425 ?answer . ?answer wdt:P1889 wd:Q512399}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'astronaut', 'p': 'activity corresponding to this occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'confused with', 'o': 'unmanned spaceflight'}}

 Q: Is the average shot length of the Too Late greater than 16.0?
 SPARQL: ASK WHERE { wd:Q20649989 wdt:P2208 ?obj filter(?obj > 16.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Too Late', 'p': 'average shot length', 'o': '?x0', '?x0': '16.0'}

 Q: what is the {start time} for {Kingdom of England} has {instance of} as {state} ?
 SPARQL: SELECT ?value WHERE { wd:Q179876 p:P31 ?s . ?s ps:P31 ?x filter(contains(?x,'http://dbpedia.org/ontology/State')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kingdom of England', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'http'}}}

 Q: Is the wing area of the Lancaster equal to 1556.4?
 SPARQL: ASK WHERE { wd:Q203622 wdt:P2112 ?obj filter(?obj = 1556.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lancaster', 'p': 'wing area', 'o': '?x0', '?x0': '1556.4'}

 Q: what is the {criterion used} for {Saturday} has {series ordinal} as {0} ?
 SPARQL: SELECT ?value WHERE { wd:Q131 p:P1545 ?s . ?s ps:P1545 ?x filter(contains(?x,'0')) . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saturday', 'p': 'series ordinal', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '0'}}}

 Q: Who is the narrator of the Adventures of Huckleberry Finn?
 SPARQL: select distinct ?answer where { wd:Q215410 wdt:P2438 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Adventures of Huckleberry Finn', 'p': 'narrator', 'o': '?x0'}

 Q: What is the name of the artery that supplies the liver?
 SPARQL:  select distinct ?obj where { wd:Q9368 wdt:P2286 ?obj . ?obj wdt:P31 wd:Q9655 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'liver', 'p': 'artery', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'artery'}}

 Q: what is the {end time} for {Jefferson Davis} has {spouse} as {Varina Davis} ?
 SPARQL: SELECT ?value WHERE { wd:Q162269 p:P26 ?s . ?s ps:P26 wd:Q457993 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jefferson Davis', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Varina Davis'}}}

 Q: what is the {point in time} for {Michael Palin} has {award received} as {BAFTA Award for Best Actor in a Supporting Role} ?
 SPARQL: SELECT ?value WHERE { wd:Q223985 p:P166 ?s . ?s ps:P166 wd:Q548389 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Michael Palin', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'BAFTA Award for Best Actor in a Supporting Role'}, 't': '?x0'}

 Q: Tell me neighborhood whose name has zeitungsviertel in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123705 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeitungsviertel')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'neighborhood'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeitungsviertel'}}

 Q: How many {executive body} are to/by {prefecture} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P208 wd:Q515716 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'executive body', 'o': 'prefecture'}

 Q: Is it true that pKa of cocaine equals to 8.41?
 SPARQL: ASK WHERE { wd:Q41576 wdt:P1117 ?obj filter(?obj = 8.41) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'cocaine', 'p': 'pKa', 'o': '?x0', '?x0': '8.41'}

 Q: What is Pantera's genre and record label?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q180880 wdt:P136 ?ans_1 . wd:Q180880 wdt:P264 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Pantera', 'p': 'genre', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Pantera', 'p': 'record label', 'o': '?x1'}]

 Q: what is the {start time} for {Luxembourg} has {member of} as {International Centre for Settlement of Investment Disputes} ?
 SPARQL: SELECT ?value WHERE { wd:Q32 p:P463 ?s . ?s ps:P463 wd:Q899770 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Luxembourg', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'International Centre for Settlement of Investment Disputes'}}}

 Q: What is {label in official language} of {historical period} of {Ephrem the Syrian} ?
 SPARQL: SELECT ?answer WHERE { wd:Q200608 wdt:P2348 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'label in official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ephrem the Syrian', 'p': 'historical period', 'o': '$y0'}}

 Q: What is {has counties} of {sovereign state} of {Hōryū-ji} ?
 SPARQL: SELECT ?answer WHERE { wd:Q261932 wdt:P17 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has counties', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hōryū-ji', 'p': 'country', 'o': '$y0'}}

 Q: What is the {human} for {founded by} of {International Red Cross and Red Crescent Movement}
 SPARQL:  select distinct ?obj where { wd:Q7178 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'International Red Cross and Red Crescent Movement', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What location with 1036412 inhabitants is the birthplace of Cecilia Brækhus?
 SPARQL: SELECT ?answer WHERE { wd:Q292783 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'1036412'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cecilia Brækhus', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '1036412'}}

 Q: what is the {start time} for {Victor Hugo} has {member of} as {Académie française} ?
 SPARQL: SELECT ?value WHERE { wd:Q535 p:P463 ?s . ?s ps:P463 wd:Q161806 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Académie française'}}}

 Q: Give me {commune of France with specific status} that {list of monuments} {list of monuments in Lyon} and which that starts with {'l'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj wdt:P1456 wd:Q3252117 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France with specific status', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'list of monuments', 'o': 'list of monuments in Lyon'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Who is the composer and librettist for West Side Story?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q669010 wdt:P86 ?ans_1 . wd:Q669010 wdt:P87 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'West Side Story', 'p': 'composer', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'West Side Story', 'p': 'librettist', 'o': '?x1'}]

 Q: Does Dick Cheney have children Elizabeth Cheney and Mary Cheney?
 SPARQL: ASK WHERE { wd:Q48259 wdt:P40 wd:Q5362573 . wd:Q48259 wdt:P40 wd:Q442226 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Dick Cheney', 'p': 'child', 'o': '?x0', '?x0': 'Elizabeth Cheney'}, {'h': 'IS', 'v': '?x1', 's': 'Dick Cheney', 'p': 'child', 'o': '?x1', '?x1': 'Mary Cheney'}]

 Q: What is the {human} for {rector} of {McGill University}
 SPARQL:  select distinct ?obj where { wd:Q201492 wdt:P1075 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'McGill University', 'p': 'rector', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who is the {national anthem} for {anthem} of {European Union}
 SPARQL:  select distinct ?obj where { wd:Q458 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'European Union', 'p': 'anthem', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national anthem'}}

 Q: What is {member of sports team} of {Glenn McGrath} that is {start time} is {2000-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1392178 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Glenn McGrath', 'p': 'team', 'o': '?x0', 't': '2000'}

 Q: Is the number of volunteers of the French Red Cross equal to 68400?
 SPARQL: ASK WHERE { wd:Q3003244 wdt:P6125 ?obj filter(?obj = 68400.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'French Red Cross', 'p': 'number of volunteers', 'o': '?x0', '?x0': '68400.0'}

 Q: Who are the inhabitants of the basin countries of Barents Sea?
 SPARQL: SELECT ?answer WHERE { wd:Q45823 wdt:P205 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barents Sea', 'p': 'basin countries', 'o': '$y0'}}

 Q: What is the GUI toolkit or framework for Objective-C?
 SPARQL: select distinct ?answer where { ?answer wdt:P1414 wd:Q188531}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'GUI toolkit or framework', 'o': 'Objective-C'}

 Q: What is <sidekick of> of <Luigi> ?
 SPARQL: select distinct ?answer where { wd:Q210593 wdt:P2546 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Luigi', 'p': 'sidekick of', 'o': '?x0'}

 Q: what is the {for work} for {Mark Rylance} has {award received} as {British Academy Television Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q324572 p:P166 ?s . ?s ps:P166 wd:Q2925701 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mark Rylance', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'British Academy Television Award for Best Actor'}}}

 Q: What is Songkick artist ID of Bohuslav Martinů ?
 SPARQL: select distinct ?answer where { wd:Q223258 wdt:P3478 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bohuslav Martinů', 'p': 'Songkick artist ID', 'o': '?x0'}

 Q: Tell me about country of citizenship of Compton Mackenzie and end time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1122051 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Compton Mackenzie', 'p': 'country of citizenship', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country of citizenship', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Compton Mackenzie', 'p': 'country of citizenship', 'o': '$y0'}}]

 Q: What is the {university and college sports club} for {represents} of {Duke University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1268 wd:Q168751 . ?sbj wdt:P31 wd:Q2367225 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'represents', 'o': 'Duke University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university and college sports club'}}

 Q: What is {extreme point south} of {set in location} of {The Third Man} ?
 SPARQL: SELECT ?answer WHERE { wd:Q271830 wdt:P840 ?X . ?X wdt:P1333 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'extreme point south', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Third Man', 'p': 'set in location', 'o': '$y0'}}

 Q: What is the {human} for {patient of} of {Louis XVIII of France}
 SPARQL:  select distinct ?obj where { wd:Q7750 wdt:P3205 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Louis XVIII of France', 'p': 'patient of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {altitude} of {partner town} of {Saskatoon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10566 wdt:P190 ?X . ?X wdt:P2044 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'altitude', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saskatoon', 'p': 'partner town', 'o': '$y0'}}

 Q: Is the total revenue of the Serviam Girls Academy equal to 672343?
 SPARQL: ASK WHERE { wd:Q7455628 wdt:P2139 ?obj filter(?obj = 672343) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Serviam Girls Academy', 'p': 'total revenue', 'o': '?x0', '?x0': '672343'}

 Q: Give me {college town} that {located in or next to body of water} {Rhine} and which contains the word {mannheim} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1187811 . ?sbj wdt:P206 wd:Q584 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mannheim')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'college town', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in or next to body of water', 'o': 'Rhine'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'mannheim'}}

 Q: What is {actress} of {comes before} of {Cotton Comes to Harlem} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5175678 wdt:P156 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actress', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cotton Comes to Harlem', 'p': 'comes before', 'o': '$y0'}}

 Q: Is the chromosome count of the Passiflora pentagona equal to 24?
 SPARQL: ASK WHERE { wd:Q17557987 wdt:P5230 ?obj filter(?obj = 24) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Passiflora pentagona', 'p': 'chromosome count', 'o': '?x0', '?x0': '24'}

 Q: What is {birthplace} of {Joseph Brodsky}, that has {next to lake} is {Bolshaya Neva River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q862 wdt:P19 ?answer . ?answer wdt:P206 wd:Q27780}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Brodsky', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'next to lake', 'o': 'Bolshaya Neva River'}}

 Q: What is the {human} for {cast member} of {Forrest Gump}
 SPARQL:  select distinct ?obj where { wd:Q134773 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Forrest Gump', 'p': 'cast member', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who are the parents of Aretha Franklin?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q125121 wdt:P22 ?ans_1 . wd:Q125121 wdt:P25 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Aretha Franklin', 'p': 'parent', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Aretha Franklin', 'p': 'parent', 'o': '?x1'}]

 Q: What is Little Rock's Legal Entity ID?
 SPARQL: select distinct ?answer where { wd:Q33405 wdt:P1278 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Little Rock', 'p': 'Legal Entity ID', 'o': '?x0'}

 Q: What is the {disease} with the {MIN(disease burden)} whose {drug used for treatment} is {erythromycin}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P2854 ?obj . ?ent wdt:P2176 wd:Q213511} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'disease burden', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'used for treatment', 'o': 'erythromycin'}}}

 Q: Give me the big city with the largest fiscal/tax revenue located in the region of Metro Manila.
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1549591 . ?ent wdt:P3087 ?obj . ?ent wdt:P131 wd:Q13580 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'fiscal/tax revenue', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'big city', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Metro Manila'}}}

 Q: Were the 1923 Bentley #8 laps completed equal to 89.6?
 SPARQL: ASK WHERE { wd:Q54989178 wdt:P5349 ?obj filter(?obj = 89.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '1923 Bentley #8', 'p': 'laps completed', 'o': '?x0', '?x0': '89.6'}

 Q: Which is Google Play Store App ID for Netflix?
 SPARQL: select distinct ?answer where { wd:Q907311 wdt:P3418 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Netflix', 'p': 'Google Play', 'o': '?x0'}

 Q: what is the {start time} for {Marie Louise, Duchess of Parma} has {spouse} as {Napoleon} ?
 SPARQL: SELECT ?value WHERE { wd:Q157491 p:P26 ?s . ?s ps:P26 wd:Q517 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marie Louise, Duchess of Parma', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Napoleon'}}}

 Q: How many shots are done by David Lynch, director of photography?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P344 wd:Q2071 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'director of photography', 'o': 'David Lynch'}

 Q: Give me {monotypic taxon} that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q310890 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monotypic taxon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {famous works} of {composed by} of {The Seasons} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7762868 wdt:P86 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Seasons', 'p': 'composed by', 'o': '$y0'}}

 Q: Where is the deathplace of Rupa Goswami whose height is 170.0?
 SPARQL: SELECT ?answer WHERE { wd:Q2989506 wdt:P20 ?answer . ?answer wdt:P2044 ?x FILTER(contains(?x,'170.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rupa Goswami', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'height', 'o': '170.0'}}

 Q: What is {work location} of {John Ruskin} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q179126 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Ruskin', 'p': 'work location', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'work location', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Ruskin', 'p': 'work location', 'o': '$y0'}}]

 Q: Is the carbon footprint of SAE 316L stainless steel equal 3.9?
 SPARQL: ASK WHERE { wd:Q28453931 wdt:P5991 ?obj filter(?obj = 3.9) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'SAE 316L stainless steel', 'p': 'carbon footprint', 'o': '?x0', '?x0': '3.9'}

 Q: What is {position held} of {Ingrid Bergman} that is {point in time} is {1973-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43247 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1973')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ingrid Bergman', 'p': 'position held', 'o': '?x0', 't': '1973'}

 Q: What is {award received} of {Beatrice Straight} that is {statement is subject of} is {7th Tony Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q232532 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q4644204 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Beatrice Straight', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '7th Tony Awards'}}}

 Q: What are the thoracic disease which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'thoracic disease'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Did {Charlize_Theron} {languages spoken, written or signed} {Old English}?
 SPARQL: ASK WHERE { wd:Q80046 wdt:P1412 wd:Q42365 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Charlize Theron', 'p': 'languages spoken, written or signed', 'o': '?x0', '?x0': 'Old English'}]

 Q: what is the {located in the administrative territorial entity} for {Aleksis Kivi} has {place of death} as {Aleksis Kivi Memorial Cottage} ?
 SPARQL: SELECT ?value WHERE { wd:Q216904 p:P20 ?s . ?s ps:P20 wd:Q17380002 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksis Kivi', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Aleksis Kivi Memorial Cottage'}}}

 Q: At what point in time did Barry Bonds receive the award for MLB MVP?
 SPARQL: SELECT ?value WHERE { wd:Q314712 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Barry Bonds', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'MVP'}, 't': '?x0'}

 Q: What is {follows} and {followed by} of {{Charles the Fat} has {noble title} as {emperor of Occident}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q23906200 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}]

 Q: What is <has edition> of <1> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P747 wd:Q199}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': '1'}

 Q: What was the inflation rate of Estonia in the year of 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q191 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Estonia', 'p': 'inflation rate', 'o': '?x0', 't': '2000'}

 Q: Were there 0 missing people after the 2018 Magnitogorsk building collapse?
 SPARQL: ASK WHERE { wd:Q60311957 wdt:P1446 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '2018 Magnitogorsk building collapse', 'p': 'missing', 'o': '?x0', '?x0': '0'}

 Q: Which is the ISFDB title ID of The Age of Innocence?
 SPARQL: select distinct ?answer where { wd:Q1045464 wdt:P1274 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Age of Innocence', 'p': 'ISFDB title ID', 'o': '?x0'}

