 Q: What are the physical quantity that measured by watt per meter kelvin and which that starts with the letter c
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q107715 . ?sbj wdt:P1880 wd:Q1463969 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical quantity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'watt per meter kelvin'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: How many programmers work for John Carmack?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q92605 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'programmer', 'o': 'John Carmack'}

 Q: Who is the husband of the actor in Psycho?
 SPARQL: SELECT ?answer WHERE { wd:Q163038 wdt:P161 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husband', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Psycho', 'p': 'actor', 'o': '$y0'}}

 Q: what is the {start time} for {Pierre Laval} has {position held} as {Deputy Prime Minister of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q151983 p:P39 ?s . ?s ps:P39 wd:Q19018261 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pierre Laval', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Deputy Prime Minister of France'}}}

 Q: What award did Pete Seeger receive in the year 1977?
 SPARQL: SELECT ?obj WHERE { wd:Q244441 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pete Seeger', 'p': 'award', 'o': '?x0', 't': '1977'}

 Q: Tell me steroid hormone whose name has the world testosterone in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q422137 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'testosterone')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steroid hormone'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'testosterone'}}

 Q: What is {foundation} of {alumna of} of {David Brudnoy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15516751 wdt:P69 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'foundation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Brudnoy', 'p': 'alumna of', 'o': '$y0'}}

 Q: what is the {start time} for {Old City of Jerusalem} has {country} as {Kingdom of Jerusalem} ?
 SPARQL: SELECT ?value WHERE { wd:Q213274 p:P17 ?s . ?s ps:P17 wd:Q55502 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Old City', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Kingdom of Jerusalem'}}}

 Q: Who is Lockheed C-130 Hercules' operator and developer?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q182027 wdt:P137 ?ans_1 . wd:Q182027 wdt:P178 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Lockheed C-130 Hercules', 'p': 'operator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Lockheed C-130 Hercules', 'p': 'developer', 'o': '?x1'}]

 Q: What is {diplomatic relation} of {Kingdom of the Netherlands} that is {statement is subject of} is {Belgium–Netherlands relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q29999 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q2684149 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'the Netherlands', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Belgium–Netherlands relations'}}}

 Q: What is the {place of burial} and the {place of death} of {Akhenaten} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q81794 wdt:P119 ?ans_1 . wd:Q81794 wdt:P20 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Akhenaten', 'p': 'place of burial', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Akhenaten', 'p': 'place of death', 'o': '?x1'}]

 Q: Mention the date of birth and death of Louis IX of France having child Peter, Count of Perche and Alençon
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q739327 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Peter, Count of Perche and Alençon'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Peter, Count of Perche and Alençon'}}}]

 Q: Where was James Clerk Maxwell born in Scotland?
 SPARQL: SELECT ?obj WHERE { wd:Q9095 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q22 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Clerk Maxwell', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'land', 'o': 'Scotland'}}}

 Q: What was the inflation rate in Jordan in 1981?
 SPARQL: SELECT ?obj WHERE { wd:Q810 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jordan', 'p': 'inflation rate', 'o': '?x0', 't': '1981'}

 Q: What is the full name of this Lucy and Ricky Ricardo musician?
 SPARQL: SELECT ?answer WHERE { wd:Q6698594 wdt:P175 ?answer . ?answer wdt:P1477 ?x FILTER(contains(?x,'Lucille Désirée Ball'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lucy and Ricky Ricardo', 'p': 'musician', 'o': '?x0'}

 Q: What is <audio recording of the subject's spoken voice> of <Charles Duke> ?
 SPARQL: select distinct ?answer where { wd:Q112284 wdt:P990 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Duke', 'p': "audio recording of the subject's spoken voice", 'o': '?x0'}

 Q: Which infectious disease is caused by Staphylococcus aureus?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P828 wd:Q188121 . ?sbj wdt:P31 wd:Q18123741 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause', 'o': 'Staphylococcus aureus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'infectious disease'}}

 Q: How many parent taxons does Brassicaceae have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P171 wd:Q156888 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'parent taxon', 'o': 'Brassicaceae'}

 Q: Who is the  {human} for {record held} of {marathon}
 SPARQL:  select distinct ?obj where { wd:Q40244 wdt:P1000 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'marathon', 'p': 'record held', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What was the significant event celebrated in the honor of Hans-Georg Gadamer on February 11, 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q76356 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hans-Georg Gadamer', 'p': 'significant event', 'o': '?x0', 't': '2000'}

 Q: What is {convicted of} of {Chris Brown} that is {target} is {Rihanna} ?
 SPARQL: SELECT ?obj WHERE { wd:Q155700 p:P1399 ?s . ?s ps:P1399 ?obj . ?s pq:P533 wd:Q36844 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'convicted of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chris Brown', 'p': 'convicted of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'target', 'o': 'Rihanna'}}}

 Q: What is <National Thesaurus for Author Names ID> of <Georges Bataille> ?
 SPARQL: select distinct ?answer where { wd:Q207359 wdt:P1006 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Georges Bataille', 'p': 'National Thesaurus for Author Names ID', 'o': '?x0'}

 Q: What is Rumi's culture and religion?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q43347 wdt:P2596 ?ans_1 . wd:Q43347 wdt:P140 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Rumi', 'p': 'culture', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Rumi', 'p': 'religion', 'o': '?x1'}]

 Q: What is the {human} for {movement} of {Christian Science}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P135 wd:Q624477 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'movement', 'o': 'Christian Science', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Tell me mineral resource whose name has the word petroleum in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q889659 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'petroleum')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral resource'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'petroleum'}}

 Q: What is {painters} of {characters} of {Wolves Beyond the Border} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8030575 wdt:P674 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'painter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wolves Beyond the Border', 'p': 'characters', 'o': '$y0'}}

 Q: What is the {human} for {founded by} of {judo}
 SPARQL:  select distinct ?obj where { wd:Q11420 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'judo', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the noble title given to Georges Cuvier on December 29, 1829?
 SPARQL: SELECT ?obj WHERE { wd:Q171969 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1829')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Georges Cuvier', 'p': 'noble title', 'o': '?x0', 't': '1829'}

 Q: What is the {media company} for {follows} of {Comcast}
 SPARQL:  select distinct ?obj where { wd:Q1113804 wdt:P155 ?obj . ?obj wdt:P31 wd:Q1331793 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Comcast', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'media company'}}

 Q: What is {nominated for} of {Sally Field} that is {statement is subject of} is {52nd Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q187033 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q543438 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sally Field', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '52nd Academy Awards'}}}

 Q: The UIC alphabetical country code of Lebanon is?
 SPARQL: select distinct ?answer where { wd:Q822 wdt:P2981 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lebanon', 'p': 'UIC alphabetical country code', 'o': '?x0'}

 Q: who theater for location of Soviet Union?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q15180 . ?sbj wdt:P31 wd:Q718893 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theater'}}

 Q: Is it true that the maximum thrust of the Pratt & Whitney F100 is equal to 17800?
 SPARQL: ASK WHERE { wd:Q1154115 wdt:P2228 ?obj filter(?obj = 17800) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Pratt & Whitney F100', 'p': 'maximum thrust', 'o': '?x0', '?x0': '17800'}

 Q: Which is the place of death of Robert Aldrich?
 SPARQL: select distinct ?answer where { wd:Q95133 wdt:P20 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Aldrich', 'p': 'place of death', 'o': '?x0'}

 Q: What is {child} of {Frederick William I of Prussia} and {date of birth}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P569 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0'}}]

 Q: What is {ethnicity} of {Luigi Pirandello}, that has {science, that studies} is {Italian studies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1403 wdt:P172 ?answer . ?answer wdt:P2579 wd:Q515601}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Luigi Pirandello', 'p': 'ethnicity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'science, that studies', 'o': 'Italian studies'}}

 Q: What is {has planet} of {makes use of} of {sundial} ?
 SPARQL: SELECT ?answer WHERE { wd:Q80793 wdt:P2283 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has planet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sundial', 'p': 'makes use of', 'o': '$y0'}}

 Q: What is {position held} of {Martin McGuinness} that is {end time} is {2017-1-26} ?
 SPARQL: SELECT ?obj WHERE { wd:Q57689 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Martin McGuinness', 'p': 'position held', 'o': '?x0', 't': '2017'}

 Q: What is {inception} of {Gregorian calendar} that is {applies to jurisdiction} is {Papal States} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12138 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P1001 wd:Q170174 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'introduced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gregorian calendar', 'p': 'introduced', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to jurisdiction', 'o': 'Papal States'}}}

 Q: Is the minimum explosive concentration of dinitro-ortho-cresol equal to 30?
 SPARQL: ASK WHERE { wd:Q209437 wdt:P2204 ?obj filter(?obj = 30) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'dinitro-ortho-cresol', 'p': 'minimum explosive concentration', 'o': '?x0', '?x0': '30'}

 Q: When did Barbara Payton the spouse of Franchot Tone die ?
 SPARQL: SELECT ?value WHERE { wd:Q457229 p:P26 ?s . ?s ps:P26 wd:Q4859221 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franchot Tone', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Barbara Payton'}}}

 Q: What is {position held} of {Sargon II} that is {start time} is {-721-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q208336 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(?x,'-721-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sargon II', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'started in', 'o': '-721-0-0'}}}

 Q: Due to what disease for anatomical location of human leg
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P927 wd:Q6027402 . ?sbj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'human leg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: When was LeBron James nominated for Best Male Athlete ESPY Award?
 SPARQL: SELECT ?value WHERE { wd:Q36159 p:P1411 ?s . ?s ps:P1411 wd:Q4896724 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'LeBron James', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Best Male Athlete ESPY Award'}, 't': '?x0'}

 Q: What is <CPU> of <electronic component> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P880 wd:Q11653}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'CPU', 'o': 'electronic component'}

 Q: What is the {airliner bombing} with the {MIN(number of survivors)} whose {participant} is {Umar Farouk Abdulmutallab}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19354904 . ?ent wdt:P1561 ?obj . ?ent wdt:P710 wd:Q983843} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of survivors', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airliner bombing', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Umar Farouk Abdulmutallab'}}}

 Q: What is {first name} of {Joe Cocker}, that has {is said to be the same as} is {Ion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q190076 wdt:P735 ?answer . ?answer wdt:P460 wd:Q1671988}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joe Cocker', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Ion'}}

 Q: "Which is {namesake} of {Lagrange multiplier}, that has {studies} is {mathematical analysis} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q598870 wdt:P138 ?answer . ?answer wdt:P101 wd:Q7754}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lagrange multiplier', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'mathematical analysis'}}

 Q: What is the {film character} for {characters} of {E.T. the Extra-Terrestrial}
 SPARQL:  select distinct ?obj where { wd:Q11621 wdt:P674 ?obj . ?obj wdt:P31 wd:Q15773347 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'E.T. the Extra-Terrestrial', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character'}}

 Q: What is the median income of Hong Kong
 SPARQL: select distinct ?answer where { wd:Q8646 wdt:P3529 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hong Kong', 'p': 'median income', 'o': '?x0'}

 Q: what was the  facet and  history of topic of copyright?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q12948581 wdt:P1269 ?ans_1 . wd:Q12948581 wdt:P2184 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'copyright', 'p': 'topic of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'copyright', 'p': 'history of topic', 'o': '?x1'}]

 Q: Which is the ULAN ID of Charles Rennie Mackintosh?
 SPARQL: select distinct ?answer where { wd:Q220703 wdt:P245 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Rennie Mackintosh', 'p': 'ULAN ID', 'o': '?x0'}

 Q: What is the {human spaceflight} for {member of the crew of} of {Christa McAuliffe}
 SPARQL:  select distinct ?obj where { wd:Q229674 wdt:P5096 ?obj . ?obj wdt:P31 wd:Q752783 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Christa McAuliffe', 'p': 'member of the crew of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human spaceflight'}}

 Q: Who is a graduate of John Key, who is a member of the Association of Research Libraries?
 SPARQL: SELECT ?answer WHERE { wd:Q57783 wdt:P69 ?answer . ?answer wdt:P463 wd:Q4810036}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Key', 'p': 'graduate of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Association of Research Libraries'}}

 Q: What is the {book publishing company} for {developer} of {Final Fantasy}
 SPARQL:  select distinct ?obj where { wd:Q189842 wdt:P178 ?obj . ?obj wdt:P31 wd:Q1320047 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Final Fantasy', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book publishing company'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Richie McCaw} has {member of sports team} as {New Zealand national rugby union team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q726148 p:P54 ?s . ?s ps:P54 wd:Q55801 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richie McCaw', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'New Zealand national rugby union team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richie McCaw', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'New Zealand national rugby union team'}}}]

 Q: What statement is subject of Louisiana that shares border with Texas?
 SPARQL: SELECT ?value WHERE { wd:Q1588 p:P47 ?s . ?s ps:P47 wd:Q1439 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louisiana', 'p': 'shares border with', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'shares border with', 'o': 'Texas'}}}

 Q: How many military casualty classification are in the prisoner of war?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1347 wd:Q179637 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'military casualty classification', 'o': 'prisoner of war'}

 Q: Which is the Norsk kunstnerleksikon ID of Edvard Munch?
 SPARQL: select distinct ?answer where { wd:Q41406 wdt:P5081 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Edvard Munch', 'p': 'Norsk kunstnerleksikon ID', 'o': '?x0'}

 Q: what is the {start time} for {Charles the Fat} has {noble title} as {king of Aquitaine} ?
 SPARQL: SELECT ?value WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q23931012 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Aquitaine'}}}

 Q: Is the sports league level of Cypriot First Division equal to 1.2?
 SPARQL: ASK WHERE { wd:Q155965 wdt:P3983 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Cypriot First Division', 'p': 'sports league level', 'o': '?x0', '?x0': '1.2'}

 Q: What is {head of government} of {Munich} that is {end time} is {1993-6-30} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1726 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Munich', 'p': 'head of government', 'o': '?x0', 't': '1993'}

 Q: What is Dmitry Medvedev's Declarator.org ID?
 SPARQL: select distinct ?answer where { wd:Q23530 wdt:P1883 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dmitry Medvedev', 'p': 'Declarator.org ID', 'o': '?x0'}

 Q: Which means{fernsehserien.de ID} from {Cheers} ?
 SPARQL: select distinct ?answer where { wd:Q732063 wdt:P5327 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cheers', 'p': 'fernsehserien.de ID', 'o': '?x0'}

 Q: What is {country} of {Honolulu} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q18094 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honolulu', 'p': 'country', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honolulu', 'p': 'country', 'o': '$y0'}}]

 Q: Tell me video game whose name has the word zauberschloß in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zauberschloß')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zauberschloß'}}

 Q: How many people have been inspired by Batman?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q2695156 wdt:P941 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Batman', 'p': 'inspired by', 'o': '?x0'}

 Q: what is the honours of Fred Astaire, that has leader of James Mason ?
 SPARQL: SELECT ?answer WHERE { wd:Q100937 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q209186}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fred Astaire', 'p': 'honours', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'leader', 'o': 'James Mason'}}

 Q: what is the {point in time} for {South America} has {number of out of school children} as {7.07274e+06} ?
 SPARQL: SELECT ?value WHERE { wd:Q18 p:P2573 ?s . ?s ps:P2573 ?x filter(contains(?x,'7.07274e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'South America', 'p': 'number of out of school children', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of out of school children', 'o': '7.07274e+06'}, 't': '?x0'}

 Q: How many {owned by} are to/by {NSDAP} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P127 wd:Q7320 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'NSDAP'}

 Q: What is ALCUIN ID for Dante Alighieri?
 SPARQL: select distinct ?answer where { wd:Q1067 wdt:P3126 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dante Alighieri', 'p': 'ALCUIN ID', 'o': '?x0'}

 Q: what is the {series ordinal} for {Johann Wolfgang von Goethe} has {given name} as {Johann} ?
 SPARQL: SELECT ?value WHERE { wd:Q5879 p:P735 ?s . ?s ps:P735 wd:Q11122389 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'goethe', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Johann'}}}

 Q: What is the procedural programming language designed by Grace Hopper ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q11641 . ?sbj wdt:P31 wd:Q28922885 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Grace Hopper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'procedural programming language'}}

 Q: Who is the subsidiary entity of the University of British Columbia that has superior formation over the University of Victoria?
 SPARQL: SELECT ?answer WHERE { wd:Q391028 wdt:P355 ?answer . ?answer wdt:P749 wd:Q1458113}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'University of British Columbia', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'superior formation', 'o': 'University of Victoria'}}

 Q: How many {exhibition history} are for {L'Origine du monde} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q334138 wdt:P608 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': "L'Origine du monde", 'p': 'exhibition history', 'o': '?x0'}

 Q: What is {animals housed} of {successor} of {İzmir Zoo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6055483 wdt:P156 ?X . ?X wdt:P1990 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'animals housed', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'İzmir Zoo', 'p': 'successor', 'o': '$y0'}}

 Q: what is the {start time} for {Bobby Moore} has {member of sports team} as {Seattle Sounders} ?
 SPARQL: SELECT ?value WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 wd:Q956200 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bobby Moore', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Seattle Sounders'}}}

 Q: What is {noble title} of {Louis the Pious} that is {end time} is {814-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P582 ?x filter(contains(?x,'814-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'noble title', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end time', 'o': '814-0-0'}}}

 Q: Who are the authors of The Republic, whose school is Platonism?
 SPARQL: SELECT ?answer WHERE { wd:Q123397 wdt:P50 ?answer . ?answer wdt:P135 wd:Q193589}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Republic', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'school', 'o': 'Platonism'}}

 Q: Which is the US Federal Election Commission ID of Carly Fiorina?
 SPARQL: select distinct ?answer where { wd:Q256380 wdt:P1839 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carly Fiorina', 'p': 'US Federal Election Commission ID', 'o': '?x0'}

 Q: How many record labels are with the {Trent Reznor} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q282722 wdt:P264 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Trent Reznor', 'p': 'record label', 'o': '?x0'}

 Q: What is {minimal incubation period in humans} of {target disease} of {Influenza vaccine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q383260 wdt:P1924 ?X . ?X wdt:P3488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'minimal incubation period in humans', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'influenza vaccine', 'p': 'target disease', 'o': '$y0'}}

 Q: Who was nominated for Monday Night Football in the year 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q1088765 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Monday Night Football', 'p': 'nominated for', 'o': '?x0', 't': '1980'}

 Q: what is the binary star has the highest color index?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q50053 . ?ent wdt:P1458 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'color index', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'binary star'}}

 Q: what is the {academic major} for {Howard H. Aiken} has {educated at} as {Harvard University} ?
 SPARQL: SELECT ?value WHERE { wd:Q299723 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Howard H. Aiken', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}

 Q: What is the {chemical compound} for {conjugate base} of {water}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4149 wd:Q283 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate base', 'o': 'water', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is {employer} of {Bram Stoker} that is {start time} is {1878-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1878')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bram Stoker', 'p': 'employer', 'o': '?x0', 't': '1878'}

 Q: What is {place of death} of {Leo III} that is {country} is {Papal States} ?
 SPARQL: SELECT ?obj WHERE { wd:Q132086 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q170174 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leo III', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Papal States'}}}

 Q: Which is the Greater Region located on terrain feature of the classical antiquity?
 SPARQL:  select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q1549534 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'classical antiquity', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greater Region'}}

 Q: Is the thermal design power of the Core i7-7700 equal to 65?
 SPARQL: ASK WHERE { wd:Q28973012 wdt:P2229 ?obj filter(?obj = 65) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Core i7-7700', 'p': 'thermal design power', 'o': '?x0', '?x0': '65'}

