 Q: Is the atomic number of sulfur 16?
 SPARQL: ASK WHERE { wd:Q2359934 wdt:P1086 ?obj filter(?obj = 16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'sulfur-31', 'p': 'atomic number', 'o': '?x0', '?x0': '16'}

 Q: What is {subtopic of} of {economy of Japan}, that has {diplomatic relation} is {Afghanistan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q319831 wdt:P1269 ?answer . ?answer wdt:P530 wd:Q889}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'economy of Japan', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Afghanistan'}}

 Q: what is the {place of publication} for {Saturday Night Fever} has {publication date} as {1977-12-16} ?
 SPARQL: SELECT ?value WHERE { wd:Q47654 p:P577 ?s . ?s ps:P577 ?x filter(contains(YEAR(?x),'1977')) . ?s pq:P291 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of publication', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saturday Night Fever', 'p': 'published', 'o': '$y0'}}

 Q: What is the {language} for {dialect of} of {Hebrew}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4913 wd:Q9288 . ?sbj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dialect of', 'o': 'he', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Which is the discovery method of Proxima Centauri b?
 SPARQL: select distinct ?answer where { wd:Q26692445 wdt:P1046 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Proxima Centauri b', 'p': 'discovery method', 'o': '?x0'}

 Q: What is {member of} of {writers} of {Asymmetric coevolutionary networks facilitate biodiversity maintenance.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q33240531 wdt:P50 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asymmetric coevolutionary networks facilitate biodiversity maintenance.', 'p': 'author', 'o': '$y0'}}

 Q: What is sport number for Tom Brady?
 SPARQL: select distinct ?answer where { wd:Q313381 wdt:P1618 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tom Brady', 'p': 'sport number', 'o': '?x0'}

 Q: What is {written by} of {theme} of {The Berenstain Bears (1985 TV series)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16200174 wdt:P144 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'written by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Berenstain Bears', 'p': 'theme', 'o': '$y0'}}

 Q: What is the determination method for war?
 SPARQL: select distinct ?answer where { ?answer wdt:P459 wd:Q198}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'determination method', 'o': 'war'}

 Q: How many days in a year for the {Passover} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q121393 wdt:P837 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Passover', 'p': 'day', 'o': '?x0'}

 Q: Which {has wards} of {stockholders} of {Kagawa Prefectural Road Route 18} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11667481 wdt:P127 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has wards', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kagawa Prefectural Road Route 18', 'p': 'stockholder', 'o': '$y0'}}

 Q: what is the {point in time} for {Nikolay Makarov} has {award received} as {State Stalin Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q1075399 p:P166 ?s . ?s ps:P166 wd:Q2329480 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nikolay Makarov', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Stalin Prize'}, 't': '?x0'}

 Q: What is the total fertility rate of Albania in the year 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q222 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Albania', 'p': 'total fertility rate', 'o': '?x0', 't': '2012'}

 Q: Which is the natural language which starts with the letter t?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Is the town with the local dialling code 45 the home town of Horiyoshi III?
 SPARQL: SELECT ?answer WHERE { wd:Q1558289 wdt:P551 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'45'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Horiyoshi III', 'p': 'home town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'dialling code', 'o': '45'}}

 Q: What is the SourceForge project of Portable Network Graphics?
 SPARQL: select distinct ?answer where { wd:Q178051 wdt:P2209 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Portable Network Graphics', 'p': 'SourceForge project', 'o': '?x0'}

 Q: Which is the FIS ski jumper ID of Matti Nykänen?
 SPARQL: select distinct ?answer where { wd:Q16849 wdt:P2775 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Matti Nykänen', 'p': 'FIS ski jumper ID', 'o': '?x0'}

 Q: what is the {determination method} for {Haiti} has {total fertility rate} as {3.853} ?
 SPARQL: SELECT ?value WHERE { wd:Q790 p:P4841 ?s . ?s ps:P4841 ?x filter(contains(?x,'3.853')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Haiti', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'total fertility rate', 'o': '3.853'}}}

 Q: What twinned administrative body of Krakow started in 1995?
 SPARQL: SELECT ?obj WHERE { wd:Q31487 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1995')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Krakow', 'p': 'twinned administrative body', 'o': '?x0', 't': '1995'}

 Q: what is the {start time} for {Karl Pearson} has {member of} as {American Academy of Arts and Sciences} ?
 SPARQL: SELECT ?value WHERE { wd:Q310794 p:P463 ?s . ?s ps:P463 wd:Q463303 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karl Pearson', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'American Academy of Arts and Sciences'}}}

 Q: How many {molecular function} are to/by {DNA polymerase} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P680 wd:Q206286 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'molecular function', 'o': 'DNA polymerase'}

 Q: What is the {academic discipline} for {history of topic} of {history of mathematics}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2184 wd:Q185264 . ?sbj wdt:P31 wd:Q11862829 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'history of topic', 'o': 'history of mathematics', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic discipline'}}

 Q: what is the {for work} for {Jamie Foxx} has {nominated for} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q171905 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jamie Foxx', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: When did Lech Walesa receive the Order of Pius IX award?
 SPARQL: SELECT ?value WHERE { wd:Q444 p:P166 ?s . ?s ps:P166 wd:Q1423841 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lech Walesa', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of Pius IX'}, 't': '?x0'}

 Q: Who is the mayor of Sihanoukville's sister town?
 SPARQL: SELECT ?answer WHERE { wd:Q18207676 wdt:P190 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mayor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sihanoukville', 'p': 'sister town', 'o': '$y0'}}

 Q: Where is the death location coined by BL Lacertae?
 SPARQL: SELECT ?answer WHERE { wd:Q373148 wdt:P61 ?X . ?X wdt:P20 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'BL Lacertae', 'p': 'coined', 'o': '$y0'}}

 Q: What is {twin city} of {location of birth} of {János Kornai} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179735 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'János Kornai', 'p': 'location of birth', 'o': '$y0'}}

 Q: Is the literate population of Matukpur equals 0?
 SPARQL: ASK WHERE { wd:Q60379965 wdt:P6499 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Matukpur', 'p': 'literate population', 'o': '?x0', '?x0': '0'}

 Q: What is {sister town} of {birth location} of {Yi Sun-sin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50184 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yi Sun-sin', 'p': 'birth location', 'o': '$y0'}}

 Q: re the number of elevators in the Garching-Forschungszentrum equal to 1?
 SPARQL: ASK WHERE { wd:Q439592 wdt:P1301 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Garching-Forschungszentrum', 'p': 'number of elevators', 'o': '?x0', '?x0': '1'}

 Q: What is the {written work} for {followed by} of {Great Expectations}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P156 wd:Q219552 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'followed by', 'o': 'Great Expectations', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is the {ship type} for {product or material produced} of {SpaceX}
 SPARQL:  select distinct ?obj where { wd:Q193701 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q2235308 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'SpaceX', 'p': 'product or material produced', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ship type'}}

 Q: how many drug interactions does fentanyl have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q407541 wdt:P769 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'fentanyl', 'p': 'drug interaction', 'o': '?x0'}

 Q: Is the radial velocity of the Andromeda galaxy greater than -240.8?
 SPARQL: ASK WHERE { wd:Q2469 wdt:P2216 ?obj filter(?obj > -240.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Andromeda', 'p': 'radial velocity', 'o': '?x0', '?x0': '-240.8'}

 Q: what is the {start time} for {Walgreens} has {chairperson} as {Charles Rudolph Walgreen, Sr.} ?
 SPARQL: SELECT ?value WHERE { wd:Q1591889 p:P488 ?s . ?s ps:P488 wd:Q5082215 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Walgreens', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Charles Rudolph Walgreen, Sr.'}}}

 Q: Give me {communist party} that {mouthpiece} {Pravda} and which that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj wdt:P2813 wd:Q183644 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'communist party', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mouthpiece', 'o': 'Pravda'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is the {religion} for {facet of} of {history of Islam}
 SPARQL:  select distinct ?obj where { wd:Q642379 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q9174 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'history of Islam', 'p': 'facet of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religion'}}

 Q: Who are the kids of Henry I of England, whose brother is Robert FitzEdith, Lord Okehampton}?
 SPARQL: SELECT ?answer WHERE { wd:Q101384 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q7344358}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henry I of England', 'p': 'kid', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'bro', 'o': 'Robert FitzEdith, Lord Okehampton'}}

 Q: Which is the conurbation for the capital of Empire of Japan?
 SPARQL:  select distinct ?obj where { wd:Q188712 wdt:P36 ?obj . ?obj wdt:P31 wd:Q245260 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire of Japan', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conurbation'}}

 Q: what is the locomotive class has the highest  boiler pressure?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P5071 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'boiler pressure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'locomotive class'}}

 Q: What is the {operator} and the {powerplant} of {McDonnell_Douglas_F-15_Eagle} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q29251 wdt:P137 ?ans_1 . wd:Q29251 wdt:P516 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'McDonnell Douglas F-15 Eagle', 'p': 'operator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'McDonnell Douglas F-15 Eagle', 'p': 'powerplant', 'o': '?x1'}]

 Q: Who is the  {taxon} for {parent taxon} of {fly agaric}
 SPARQL:  select distinct ?obj where { wd:Q131227 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fly agaric', 'p': 'parent taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What method did the census use to determine the population of the Coquimbo Region?
 SPARQL: SELECT ?obj WHERE { wd:Q2121 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Coquimbo Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'method', 'o': 'census'}}}

 Q: What was the population of Amiens in 1926?
 SPARQL: SELECT ?obj WHERE { wd:Q41604 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1926')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Amiens', 'p': 'population', 'o': '?x0', 't': '1926'}

 Q: What is {won by} of {nominee for} of {Donald Allen Wollheim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q908589 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Allen Wollheim', 'p': 'nominee for', 'o': '$y0'}}

 Q: What award did Colin Powell receive on 1991-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q150851 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Colin Powell', 'p': 'award', 'o': '?x0', 't': '1991'}

 Q: What is Ontario Sports Hall of Fame athlete ID for James Naismith ?
 SPARQL: select distinct ?answer where { wd:Q188962 wdt:P4412 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Naismith', 'p': 'Ontario Sports Hall of Fame athlete ID', 'o': '?x0'}

 Q: When was the Human Development Index recorded as 0.827 for Argentina?
 SPARQL: SELECT ?value WHERE { wd:Q414 p:P1081 ?s . ?s ps:P1081 ?x filter(contains(?x,'0.827')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Argentina', 'p': 'Human Development Index', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'Human Development Index', 'o': '0.827'}, 't': '?x0'}

 Q: what is the {point in time} for {Santiago Ramón y Cajal} has {award received} as {Grand Cross of the Order of Isabella the Catholic} ?
 SPARQL: SELECT ?value WHERE { wd:Q150526 p:P166 ?s . ?s ps:P166 wd:Q17365974 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Santiago Ramón y Cajal', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grand Cross of the Order of Isabella the Catholic'}, 't': '?x0'}

 Q: Tell me era whose name has the word zirconian in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q630830 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zirconian')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'era'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zirconian'}}

 Q: What is the {human} for {affiliation} of {Yale University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49112 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliated with', 'o': 'Yale University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Did {American football} {uses} {football boots}?
 SPARQL: ASK WHERE { wd:Q41323 wdt:P2283 wd:Q512804 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'American football', 'p': 'uses', 'o': '?x0', '?x0': 'football boots'}]

 Q: Give me {type of business entity} that contains the word {stiftung} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1269299 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'stiftung')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of business entity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'stiftung'}}

 Q: What is the population of Madagascar in the year 1999?
 SPARQL: SELECT ?obj WHERE { wd:Q1019 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Madagascar', 'p': 'population', 'o': '?x0', 't': '1999'}

 Q: What is {date of birth} and {date of death} of {{Frederick William I of Prussia} has {child} as {Prince Henry of Prussia}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q50993 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Prince Henry of Prussia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Prince Henry of Prussia'}}}]

 Q: Which is the first appearance of Donkey Kong?
 SPARQL: select distinct ?answer where { ?answer wdt:P4584 wd:Q12384}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'first appearance', 'o': 'Donkey Kong'}

 Q: What is the {operating system} for {named after} of {Unix}
 SPARQL:  select distinct ?obj where { wd:Q11368 wdt:P138 ?obj . ?obj wdt:P31 wd:Q9135 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Unix', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'operating system'}}

 Q: Which is the OEIS ID of a prime number?
 SPARQL: select distinct ?answer where { wd:Q49008 wdt:P829 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'prime number', 'p': 'OEIS ID', 'o': '?x0'}

 Q: Who is informed by the advisor of Ramesh Sitaraman?
 SPARQL: SELECT ?answer WHERE { wd:Q7289442 wdt:P184 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'informed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramesh Sitaraman', 'p': 'advisor', 'o': '$y0'}}

 Q: What is themed after radian with a unit symbol of __?
 SPARQL: SELECT ?answer WHERE { wd:Q33680 wdt:P144 ?answer . ?answer wdt:P5061 ?x FILTER(contains(?x,'م'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'radian', 'p': 'theme', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'unit symbol', 'o': 'م'}}

 Q: What is the diplomatic relation that comes from screamo?
 SPARQL: SELECT ?answer WHERE { wd:Q11363 wdt:P495 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'screamo', 'p': 'comes from', 'o': '$y0'}}

 Q: what is the {determination method} for {New Brunswick} has {population} as {751171.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q1965 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'751171.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'New Brunswick', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '751171.0'}}}

 Q: Which is the Wikitribune category for corruption?
 SPARQL: select distinct ?answer where { wd:Q366 wdt:P4973 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'corruption', 'p': 'Wikitribune category', 'o': '?x0'}

 Q: what is the {end time} for {Charles VI of France} has {position held} as {King of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q160349 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles VI of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of France'}}}

 Q: Which is the BARTOC ID for Hornbostel-Sachs?
 SPARQL: select distinct ?answer where { wd:Q496327 wdt:P2689 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hornbostel-Sachs', 'p': 'BARTOC ID', 'o': '?x0'}

 Q: Who is the fictional character in the notable work of Shigeru Miyamoto?
 SPARQL:  select distinct ?obj where { wd:Q12382 wdt:P800 ?obj . ?obj wdt:P31 wd:Q95074 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shigeru Miyamoto', 'p': 'notable work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional character'}}

 Q: What is {location of birth} of {Elihu Yale}, that has {human population} is {655884} ?
 SPARQL: SELECT ?answer WHERE { wd:Q514846 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'655884'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Elihu Yale', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '655884'}}

 Q: What is the population of Curacao in the year 2010?
 SPARQL: SELECT ?obj WHERE { wd:Q25279 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Curacao', 'p': 'population', 'o': '?x0', 't': '2010'}

 Q: what is the {end time} for {Rhineland-Palatinate} has {head of government} as {Helmut Kohl} ?
 SPARQL: SELECT ?value WHERE { wd:Q1200 p:P6 ?s . ?s ps:P6 wd:Q2518 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rhineland-Palatinate', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Helmut Kohl'}}}

 Q: What is {date of birth} and {date of death} of {{Louis IX of France} has {child} as {Blanche de France}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q14751950 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Blanche de France'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Blanche de France'}}}]

 Q: Which is the work location of Arab League?
 SPARQL: select distinct ?answer where { ?answer wdt:P937 wd:Q7172}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work location', 'o': 'Arab League'}

 Q: What is {mains electricity voltage} of {land} of {Bibliothèque nationale de France} ?
 SPARQL: SELECT ?answer WHERE { wd:Q193563 wdt:P17 ?X . ?X wdt:P2884 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mains electricity voltage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bibliothèque nationale de France', 'p': 'land', 'o': '$y0'}}

 Q: what is the {electoral district} for {Thomas Wakley} has {position held} as {Member of the 12th Parliament of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q334239 p:P39 ?s . ?s ps:P39 wd:Q41582548 . ?s pq:P768 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Wakley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 12th Parliament of the United Kingdom'}}}

 Q: Is Boris Johnson the father of Stanley Johnson?
 SPARQL: ASK WHERE { wd:Q180589 wdt:P22 wd:Q7599711 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Boris Johnson', 'p': 'father', 'o': '?x0', '?x0': 'Stanley Johnson'}]

 Q: Which is Behind The Voice Actors franchise ID for Silent Hill?
 SPARQL: select distinct ?answer where { wd:Q236821 wdt:P5382 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Silent Hill', 'p': 'Behind The Voice Actors franchise ID', 'o': '?x0'}

 Q: Which directory service has the highest number of port?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q756230 . ?ent wdt:P1641 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'port', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'directory service'}}

 Q: What is Ivo Andric's IPA Transcription?
 SPARQL: select distinct ?answer where { wd:Q47561 wdt:P898 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ivo Andric', 'p': 'IPA', 'o': '?x0'}

 Q: Is the French economy the main topic of the Court of Cassation, the highest judicial authority?
 SPARQL: SELECT ?answer WHERE { wd:Q8057 wdt:P1269 ?answer . ?answer wdt:P209 wd:Q1138599}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'French economy', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'highest judicial authority', 'o': 'Court of Cassation'}}

 Q: Did {Marvel_Comics} {owner of} {Marvel Tales}?
 SPARQL: ASK WHERE { wd:Q173496 wdt:P1830 wd:Q6778201 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Marvel Comics', 'p': 'owner of', 'o': '?x0', '?x0': 'Marvel Tales'}]

 Q: What was Charles Babbage academic degree in 1814?
 SPARQL: SELECT ?obj WHERE { wd:Q46633 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1814')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charles Babbage', 'p': 'academic degree', 'o': '?x0', 't': '1814'}

 Q: What is the habitat of Typha?
 SPARQL: select distinct ?answer where { wd:Q145707 wdt:P2974 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Typha', 'p': 'habitat', 'o': '?x0'}

 Q: What is {date of first performance} of {La traviata} that is {musical conductor} is {Gaetano Mares} ?
 SPARQL: SELECT ?obj WHERE { wd:Q186162 p:P1191 ?s . ?s ps:P1191 ?obj . ?s pq:P3300 wd:Q5516697 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of first performance', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'La traviata', 'p': 'date of first performance', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'musical conductor', 'o': 'Gaetano Mares'}}}

 Q: What is {producer of} of {maker} of {300B} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4634305 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'produces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '300B', 'p': 'maker', 'o': '$y0'}}

 Q: What is the fastest race in the Velká pardubická?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'race time', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Velká pardubická'}}

 Q: How many {muscle insertion} are for {humerus} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q162595 wdt:P3491 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'humerus', 'p': 'muscle insertion', 'o': '?x0'}

 Q: What is Jochi's date of birth?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q186581 wdt:P569 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Jochi', 'p': 'date of birth', 'o': '?x0'}

 Q: Tell me warfare whose name has the word war in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12786121 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'warfare'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'war'}}

 Q: Tell me the astronomical observatory with the most observing time?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1254933 . ?ent wdt:P3891 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'observing time available', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'astronomical observatory'}}

 Q: What is the population of Turks and Caicos Islands that started at 1985-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q18221 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1985')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Turks and Caicos Islands', 'p': 'population', 'o': '?x0', 't': '1985'}

 Q: What is <Athletics Australia athlete ID> of <Shirley Strickland> ?
 SPARQL: select distinct ?answer where { wd:Q230954 wdt:P3915 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shirley Strickland', 'p': 'Athletics Australia athlete ID', 'o': '?x0'}

 Q: Tell me animation technique whose name has the word supermarionation in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'supermarionation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animation technique'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'supermarionation'}}

 Q: When did Erasmus earn his Doctor of Divinity degree?
 SPARQL: SELECT ?value WHERE { wd:Q43499 p:P512 ?s . ?s ps:P512 wd:Q1984623 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Erasmus', 'p': 'degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Doctor of Divinity'}, 't': '?x0'}

 Q: Tell me force whose name has the word fundamental in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11402 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'fundamental')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'force'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'fundamental'}}

 Q: Which phonological system is used by a facet of Hungarian?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1269 wd:Q9067 . ?sbj wdt:P31 wd:Q49124804 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Hungarian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phonological system'}}

