 Q: Tell me the Hindu deity that has armament in Trishula and contains the word shiva in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q979507 . ?sbj wdt:P520 wd:Q3539698 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shiva')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Hindu deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'armament', 'o': 'Trishula'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'shiva'}}

 Q: what is the {start time} for {Kiev} has {twinned administrative body} as {Kyoto} ?
 SPARQL: SELECT ?value WHERE { wd:Q1899 p:P190 ?s . ?s ps:P190 wd:Q34600 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kiev', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Kyoto'}}}

 Q: Give me {big city} that {twinned administrative body} {Los Angeles} and which contains the word {vancouver} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj wdt:P190 wd:Q65 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vancouver')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'big city', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Los Angeles'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vancouver'}}

 Q: what is the wife of the tribute to of Eanna?
 SPARQL: SELECT ?answer WHERE { wd:Q706970 wdt:P825 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'wife', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eanna', 'p': 'tribute to', 'o': '$y0'}}

 Q: What is the middle name of Jim Ward that is similar to that of Yakub?
 SPARQL: SELECT ?answer WHERE { wd:Q1508964 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4537101}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jim Ward', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'similar to', 'o': 'Yakub'}}

 Q: Which means {eBird hotspot ID} from{Joshua Tree National Park} ?
 SPARQL: select distinct ?answer where { wd:Q735202 wdt:P5200 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joshua Tree National Park', 'p': 'eBird hotspot ID', 'o': '?x0'}

 Q: what is the {point in time} for {Simon Wiesenthal} has {award received} as {Otto Hahn Peace Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q49086 p:P166 ?s . ?s ps:P166 wd:Q314209 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Simon Wiesenthal', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Otto Hahn Peace Medal'}, 't': '?x0'}

 Q: what is the {point in time} for {Daniel J. Boorstin} has {award received} as {Bancroft Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q551252 p:P166 ?s . ?s ps:P166 wd:Q724144 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Daniel J. Boorstin', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Bancroft Prize'}, 't': '?x0'}

 Q: Who is the  {geographic envelope} for {studies} of {meteorology}
 SPARQL:  select distinct ?obj where { wd:Q25261 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q2627400 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'meteorology', 'p': 'studies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geographic envelope'}}

 Q: What is  in the  Nupill Literatura Digital - Author of Pedro II of Brazil ?
 SPARQL: select distinct ?answer where { wd:Q156774 wdt:P1473 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pedro II of Brazil', 'p': 'Nupill Literatura Digital - Author', 'o': '?x0'}

 Q: How many {lyrics by} are to/by {Viktor Tsoi} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P676 wd:Q487125 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'lyrics by', 'o': 'Viktor Tsoi'}

 Q: What is {death place} of {William Thomas Stead}, that has {point on a map} is {47.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q288301 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'47.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Thomas Stead', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'point on a map', 'o': '47.0'}}

 Q: What is {champion} of {awards received} of {Lee Roy Selmon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3228929 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lee Roy Selmon', 'p': 'awards', 'o': '$y0'}}

 Q: What is award received of E. E. Cummings that of point in time is 1944-0-0 ?
 SPARQL: SELECT ?obj WHERE { wd:Q298703 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1944')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'E. E. Cummings', 'p': 'award received', 'o': '?x0', 't': '1944'}

 Q: Which is coat of arms for coat of arms?
 SPARQL: select distinct ?answer where { ?answer wdt:P237 wd:Q14659}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'coat of arms', 'o': 'coat of arms'}

 Q: What is the {dependency of Norway} with the {MIN(coastline)} whose {located in the administrative territorial entity} is {Norway}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5260616 . ?ent wdt:P5141 ?obj . ?ent wdt:P131 wd:Q20} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'coastline', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dependency of Norway', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Norway'}}}

 Q: Tell me the written work whose place of publication is France and which contains the word leagues in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj wdt:P291 wd:Q142 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'leagues')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'place of publication', 'o': 'France'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'leagues'}}

 Q: Tell me virtue whose name has the word wisdom in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q157811 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wisdom')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'virtue'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wisdom'}}

 Q: tell me stock market crash that contains the word market  market in the name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1020018 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'market')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stock market crash'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'market'}}

 Q: which numeral system that starts with s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q122653 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'numeral system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Did you know the enterprise Walmart was owned by (blank)?
 SPARQL:  select distinct ?obj where { wd:Q483551 wdt:P127 ?obj . ?obj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Walmart', 'p': 'owned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: To which sovereign state and diplomatic relation does the Arab League belong?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P530 wd:Q7172 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Arab League', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the {academic discipline} for {health specialty} of {pedophilia}
 SPARQL:  select distinct ?obj where { wd:Q8388 wdt:P1995 ?obj . ?obj wdt:P31 wd:Q11862829 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pedophilia', 'p': 'health specialty', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic discipline'}}

 Q: How many collection are done by Museo Soumaya
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P195 wd:Q2097646 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'collection', 'o': 'Museo Soumaya'}

 Q: Name the  psychoactive drug made from Papaver somniferum that starts with letter O
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj wdt:P1582 wd:Q131584 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'psychoactive drug', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'made from', 'o': 'Papaver somniferum'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: What is <Bashkir encyclopedia (Russian version) ID> of <encyclopedia> ?
 SPARQL: select distinct ?answer where { wd:Q5292 wdt:P4211 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'encyclopedia', 'p': 'Bashkir encyclopedia (Russian version) ID', 'o': '?x0'}

 Q: Tell me stellar evolution whose name has the word kilonova in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6472 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'kilonova')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stellar evolution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'kilonova'}}

 Q: What is {apparent magnitude} of {(486958) 2014 MU69} that is {applies to part} is {maximum} ?
 SPARQL: SELECT ?obj WHERE { wd:Q18325885 p:P1215 ?s . ?s ps:P1215 ?obj . ?s pq:P518 wd:Q10578722 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'apparent magnitude', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2014 MU69', 'p': 'apparent magnitude', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'maximum'}}}

 Q: What venue of the Battle of Verdun is adjacent to Sivry-la-Perche?
 SPARQL: SELECT ?answer WHERE { wd:Q130847 wdt:P276 ?answer . ?answer wdt:P47 wd:Q981875}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Battle of Verdun', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'adjacent to', 'o': 'Sivry-la-Perche'}}

 Q: What is {date of birth} of {Anaxagoras} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q83041 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anaxagoras', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'circa'}}}

 Q: What is the {film} for {takes place in fictional universe} of {Marvel Cinematic Universe}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1434 wd:Q642878 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'takes place in fictional universe', 'o': 'Marvel Cinematic Universe', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: What is the {municipal corporation in India} for {capital} of {Karnataka}
 SPARQL:  select distinct ?obj where { wd:Q1185 wdt:P36 ?obj . ?obj wdt:P31 wd:Q6936225 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Karnataka', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal corporation in India'}}

 Q: Which is PfaF ID for Raphanus raphanistrum subsp. sativus?
 SPARQL: select distinct ?answer where { wd:Q7224565 wdt:P4301 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Raphanus raphanistrum subsp. sativus', 'p': 'PfaF ID', 'o': '?x0'}

 Q: What is the {Gryffindor student} for {characters} of {Harry Potter}
 SPARQL:  select distinct ?obj where { wd:Q8337 wdt:P674 ?obj . ?obj wdt:P31 wd:Q33179355 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Harry Potter', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Gryffindor student'}}

 Q: What is {language used} on {telenovela}, that has a {distribution map} of {idioma espanol en el mundo. PNG} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23745 wdt:P407 ?answer . ?answer wdt:P1846 ?x FILTER(contains(?x,'Idioma español en el mundo.PNG'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'telenovela', 'p': 'language', 'o': '?x0'}

 Q: What female is Rob Reiner's sister?
 SPARQL: SELECT ?answer WHERE { wd:Q287607 wdt:P3373 ?answer . ?answer wdt:P21 wd:Q6581072}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rob Reiner', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'female'}}

 Q: what is the {start time} for {Cluj-Napoca} has {country} as {Principality of Transylvania} ?
 SPARQL: SELECT ?value WHERE { wd:Q100188 p:P17 ?s . ?s ps:P17 wd:Q655621 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cluj-Napoca', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Principality of Transylvania'}}}

 Q: what is the {point in time} for {The Big Bang Theory} has {nominated for} as {Primetime Emmy Award for Outstanding Art Direction for a Multi-Camera Series} ?
 SPARQL: SELECT ?value WHERE { wd:Q8539 p:P1411 ?s . ?s ps:P1411 wd:Q17010286 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'The Big Bang Theory', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Primetime Emmy Award for Outstanding Art Direction for a Multi-Camera Series'}, 't': '?x0'}

 Q: What is the {competition class} for {competition class} of {curling}
 SPARQL:  select distinct ?obj where { wd:Q136851 wdt:P2094 ?obj . ?obj wdt:P31 wd:Q22936940 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'curling', 'p': 'competition class', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'competition class'}}

 Q: What is {nominated for} of {John Mayer} that is {point in time} is {2002-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q215215 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Mayer', 'p': 'nominated for', 'o': '?x0', 't': '2002'}

 Q: What is the {church building} for {commissioned by} of {Suleiman the Magnificent}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P88 wd:Q8474 . ?sbj wdt:P31 wd:Q16970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'Suleiman the Magnificent', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'church'}}

 Q: What is {time} of {hometown} of {Thomas Pynchon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35155 wdt:P551 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Pynchon', 'p': 'hometown', 'o': '$y0'}}

 Q: Which is the political seat of the chairman of the International Association of Athletics Federations?
 SPARQL: SELECT ?answer WHERE { wd:Q1158 wdt:P488 ?X . ?X wdt:P39 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'political seat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'International Association of Athletics Federations', 'p': 'chair', 'o': '$y0'}}

 Q: Did {Dr._Seuss} {occupation} {writer} and {illustrator} ?
 SPARQL: ASK WHERE { wd:Q298685 wdt:P106 wd:Q36180 . wd:Q298685 wdt:P106 wd:Q644687 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Seuss', 'p': 'occupation', 'o': '?x0', '?x0': 'writer'}, {'h': 'IS', 'v': '?x1', 's': 'Seuss', 'p': 'occupation', 'o': '?x1', '?x1': 'illustrator'}]

 Q: What is the {human} for {spouse} of {Rollo}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P26 wd:Q273773 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'wife', 'o': 'Rollo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {end time} for {Ravenna} has {country} as {Republic of Venice} ?
 SPARQL: SELECT ?value WHERE { wd:Q13364 p:P17 ?s . ?s ps:P17 wd:Q4948 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ravenna', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Republic of Venice'}}}

 Q: What is {mother} and {date of birth} of {{Charlemagne} has {child} as {Pepin the Hunchback}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q302212 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Pepin the Hunchback'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Pepin the Hunchback'}}}]

 Q: Did {Banana} {color} {yellow} and {shade of brown} ?
 SPARQL: ASK WHERE { wd:Q503 wdt:P462 wd:Q943 . wd:Q503 wdt:P462 wd:Q17079449 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'banana', 'p': 'color', 'o': '?x0', '?x0': 'yellow'}, {'h': 'IS', 'v': '?x1', 's': 'banana', 'p': 'color', 'o': '?x1', '?x1': 'shade of brown'}]

 Q: Tell me military order whose name has the word  saint in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'saint')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military order'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'saint'}}

 Q: What is {toponym} of {Beer Hall Putsch}, that has {branch} is {German Army} ?
 SPARQL: SELECT ?answer WHERE { wd:Q36749 wdt:P138 ?answer . ?answer wdt:P241 wd:Q313422}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Beer Hall Putsch', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'branch', 'o': 'German Army'}}

 Q: What is the {human} for {student of} of {Franz Schubert}
 SPARQL:  select distinct ?obj where { wd:Q7312 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Franz Schubert', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {date of commencement} of {book publisher} of {Astronomy and Astrophysics} ?
 SPARQL: SELECT ?answer WHERE { wd:Q752075 wdt:P123 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of commencement', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Astronomy and Astrophysics', 'p': 'publisher', 'o': '$y0'}}

 Q: Is the salinity of North Atlantic Deep Water equal to 28?
 SPARQL: ASK WHERE { wd:Q921070 wdt:P4350 ?obj filter(?obj = 28.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'North Atlantic Deep Water', 'p': 'salinity', 'o': '?x0', '?x0': '28.0'}

 Q: What is the {type of quantum particle} for {antiparticle} of {elementary particle}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2152 wd:Q43116 . ?sbj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'antiparticle', 'o': 'elementary particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: Which stone bridge has the longest span?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3397526 . ?ent wdt:P2787 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'longest span', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stone bridge'}}

 Q: What is <domain of saint or deity> of <memory> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2925 wd:Q492}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'domain of saint or deity', 'o': 'memory'}

 Q: Is the number of viewers/listeners of The Plow That Broke the Plains less than 8000000.0?
 SPARQL: ASK WHERE { wd:Q2480639 wdt:P5436 ?obj filter(?obj < 8000000.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'The Plow That Broke the Plains', 'p': 'number of viewers/listeners', 'o': '?x0', '?x0': '8000000.0'}

 Q: In what territory was P. G. T. Beauregard born in St. Bernard Parish?
 SPARQL: SELECT ?value WHERE { wd:Q313976 p:P19 ?s . ?s ps:P19 wd:Q503883 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'P. G. T. Beauregard', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'born in', 'o': 'St. Bernard Parish'}}}

 Q: Who is the person as the professional or sports partner of Carole King?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1327 wd:Q217787 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports partner', 'o': 'Carole King', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: Which is the city that is capital of Seville?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1376 wd:Q8717 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital of', 'o': 'Seville', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is the {recurring event} for {language used} of {Esperanto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q143 . ?sbj wdt:P31 wd:Q15275719 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Esperanto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring event'}}

 Q: Which is the military rank for the military rank of Salman of Saudi Arabia?
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P410 ?obj . ?obj wdt:P31 wd:Q56019 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'military rank', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military rank'}}

 Q: Tell me the dog breed that has Germany as country of origin and starts with the letter w?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39367 . ?sbj wdt:P495 wd:Q183 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dog breed', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'Germany'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is Epguides ID for The Fresh Prince of Bel-Air
 SPARQL: select distinct ?answer where { wd:Q309063 wdt:P3121 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Fresh Prince of Bel-Air', 'p': 'Epguides ID', 'o': '?x0'}

 Q: Who is the head of state of South Australia who started in the year 1952?
 SPARQL: SELECT ?obj WHERE { wd:Q35715 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1952')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'South Australia', 'p': 'head of state', 'o': '?x0', 't': '1952'}

 Q: Is the orbital eccentricity of Ariel equal to 0.0012?
 SPARQL: ASK WHERE { wd:Q3343 wdt:P1096 ?obj filter(?obj = 0.0012) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ariel', 'p': 'orbital eccentricity', 'o': '?x0', '?x0': '0.0012'}

 Q: Which people contains the word wuhuan in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2472587 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wuhuan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wuhuan'}}

 Q: Which is the literary work of the writer Dante Alighieri?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writer', 'o': 'Dante Alighieri', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: What is the {sport in a geographic region} with the {MAX(number of players in region)} whose {location} is {Papua New Guinea}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4909 ?obj . ?ent wdt:P276 wd:Q691 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of players in region', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport in a geographic region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Papua New Guinea'}}}

 Q: Who is the governor for the head of state of Tasmania?
 SPARQL:  select distinct ?obj where { wd:Q34366 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q132050 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tasmania', 'p': 'head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'governor'}}

 Q: Tell me about castle for commissioned by of William the Conqueror?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P88 wd:Q37594 . ?sbj wdt:P31 wd:Q23413 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'William the Conqueror', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'castle'}}

 Q: "Which adjacent to Kyiv Oblast, was initiated on February 2 1932?"
 SPARQL: SELECT ?answer WHERE { wd:Q170036 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1932'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kyiv Oblast', 'p': 'adjacent to', 'o': '?x0', 't': '1932'}

 Q: Who was the disciple and mentor of Wilhelm Grosz?
 SPARQL: SELECT ?answer WHERE { wd:Q5772932 wdt:P1066 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disciple', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wilhelm Grosz', 'p': 'mentor', 'o': '$y0'}}

 Q: What is {legislative period} of {located in mountain range} of {Seaview Range} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2262451 wdt:P4552 ?X . ?X wdt:P2348 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'legislative period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seaview Range', 'p': 'mountain range', 'o': '$y0'}}

 Q: When was C. V. Raman nominated for the Nobel Prize in Physics?
 SPARQL: SELECT ?value WHERE { wd:Q60429 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'C. V. Raman', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Physics'}, 't': '?x0'}

 Q: What is {member of crew of} of {cosmonaut mission} of {Anatoly Berezovoy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q465724 wdt:P450 ?X . ?X wdt:P1029 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of crew of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anatoly Berezovoy', 'p': 'cosmonaut mission', 'o': '$y0'}}

 Q: What are the depicts of The Starry Night?
 SPARQL: select distinct ?answer where { wd:Q45585 wdt:P180 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Starry Night', 'p': 'depicts', 'o': '?x0'}

 Q: What is the {single} for {lyrics by} of {Lady Gaga}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P676 wd:Q19848 . ?sbj wdt:P31 wd:Q134556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'lyrics by', 'o': 'Lady Gaga', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single'}}

 Q: What were the uses of Pan when it was invented in 1970?
 SPARQL: SELECT ?obj WHERE { wd:Q80174 p:P2283 ?s . ?s ps:P2283 ?obj . ?s pq:P575 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pan', 'p': 'uses', 'o': '?x0', 't': '1970'}

 Q: Which music by Egmont describes the disease of Crohn's disease?
 SPARQL: SELECT ?answer WHERE { wd:Q1156413 wdt:P86 ?answer . ?answer wdt:P1050 wd:Q1472}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Egmont', 'p': 'music by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'disease', 'o': "Crohn's disease"}}

 Q: Tell me the redshift of the planetary system called R136.
 SPARQL: SELECT ?answer WHERE { wd:Q5116 wdt:P397 ?X . ?X wdt:P1090 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'redshift', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'R136', 'p': 'planetary system', 'o': '$y0'}}

 Q: does ostrivets have an area that is 0.0 or greater?
 SPARQL: ASK WHERE { wd:Q4338939 wdt:P2046 ?obj filter(?obj > 0.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Ostrivets', 'p': 'area', 'o': '?x0', '?x0': '0.0'}

 Q: How many professorships are in the College de France?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P803 wd:Q202660 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'professorship', 'o': 'College de France'}

 Q: What award did Paul Dirac win together with someone else?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q47480 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Dirac', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Dirac', 'p': 'award', 'o': '$y0'}}]

 Q: What is {position held} of {Shigeru Yoshida} that is {start time} is {1946-5-22} ?
 SPARQL: SELECT ?obj WHERE { wd:Q301804 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Shigeru Yoshida', 'p': 'position held', 'o': '?x0', 't': '1946'}

 Q: When did Faina Ranevskaya stop working at the Mossovet Theatre?
 SPARQL: SELECT ?value WHERE { wd:Q470466 p:P108 ?s . ?s ps:P108 wd:Q571291 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faina Ranevskaya', 'p': 'working at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'working at', 'o': 'Mossovet Theatre'}}}

 Q: What notable work and genre did Christopher Hitchens write?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P136 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'notable work', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0'}}]

