 Q: Which is the sausage sandwich of the parent astronomical body of Proxima Centauri that starts with the letter d?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj wdt:P397 wd:Q14266 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sausage sandwich', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Proxima Centauri'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is the residence and the work of Derek Hough?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1189327 wdt:P551 ?ans_1 . wd:Q1189327 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Derek Hough', 'p': 'residence', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Derek Hough', 'p': 'work', 'o': '?x1'}]

 Q: What is {made of} of {maker of} of {tea house} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1072166 wdt:P1056 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'made of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'tea house', 'p': 'maker of', 'o': '$y0'}}

 Q: What is <start period> of <menopause> ?
 SPARQL: select distinct ?answer where { wd:Q177708 wdt:P3415 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'menopause', 'p': 'start period', 'o': '?x0'}

 Q: What is {has villages} of {birth location} of {Pan Yue} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6464972 wdt:P19 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has villages', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pan Yue', 'p': 'born in', 'o': '$y0'}}

 Q: What is the notation that implies centrifugal force ?
 SPARQL: SELECT ?answer WHERE { wd:Q178733 wdt:P1542 ?X . ?X wdt:P2534 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'notation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'centrifugal force', 'p': 'implies', 'o': '$y0'}}

 Q: who honorific for honorific prefix of Salman of Saudi Arabia?
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P511 ?obj . ?obj wdt:P31 wd:Q1326966 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'honorific prefix', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'honorific'}}

 Q: What is <BBFC rating> of <Who Framed Roger Rabbit> ?
 SPARQL: select distinct ?answer where { wd:Q379873 wdt:P2629 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Who Framed Roger Rabbit', 'p': 'BBFC rating', 'o': '?x0'}

 Q: How many {depends on software} are to/by {PHP} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1547 wd:Q59 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'depends on software', 'o': 'PHP'}

 Q: Tell me theme park whose name has the word  woman  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2416723 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theme park'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: Which is the superhero from the fictional universe of DC Universe that starts with the letter s?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj wdt:P1080 wd:Q1152150 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'superhero', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'universe', 'o': 'DC Universe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Is it true that the attendance of the 47th World Science Fiction Convention equals to 6837?
 SPARQL: ASK WHERE { wd:Q4638583 wdt:P1110 ?obj filter(?obj = 6837) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '47th World Science Fiction Convention', 'p': 'attendance', 'o': '?x0', '?x0': '6837'}

 Q: What is {executive director} of {working place} of {Christopher Wylie} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50845422 wdt:P108 ?X . ?X wdt:P169 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'executive director', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Wylie', 'p': 'working place', 'o': '$y0'}}

 Q: What is {fleet} of {service branch} of {Robert D. Russ} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7343340 wdt:P241 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fleet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert D. Russ', 'p': 'branch', 'o': '$y0'}}

 Q: What is {trend} of {role model} of {Buckminster Fuller} ?
 SPARQL: SELECT ?answer WHERE { wd:Q102289 wdt:P737 ?X . ?X wdt:P135 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'trend', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Buckminster Fuller', 'p': 'role model', 'o': '$y0'}}

 Q: What is <parent of this hybrid, breed, or cultivar> of <hinny> ?
 SPARQL: select distinct ?answer where { wd:Q217584 wdt:P1531 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hinny', 'p': 'parent of this hybrid, breed, or cultivar', 'o': '?x0'}

 Q: is the M sin i of HD 181342 b equal to 2.54?
 SPARQL: ASK WHERE { wd:Q4039888 wdt:P2051 ?obj filter(?obj = 2.54) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'HD 181342 b', 'p': 'M sin i', 'o': '?x0', '?x0': '2.54'}

 Q: Does the water footprint of the chicken egg equal less than 2612.0?
 SPARQL: ASK WHERE { wd:Q15260613 wdt:P6000 ?obj filter(?obj < 2612.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'chicken egg', 'p': 'water footprint', 'o': '?x0', '?x0': '2612.0'}

 Q: What is {musical key} of {Symphony No. 40}, that has {previous is} is {F-sharp minor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q231390 wdt:P826 ?answer . ?answer wdt:P155 wd:Q283910}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Symphony No. 40', 'p': 'musical key', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prev', 'o': 'F-sharp minor'}}

 Q: What is the {TV tower} with the {MAX(number of elevators)} whose {significant event} is {construction}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11166728 . ?ent wdt:P1301 ?obj . ?ent wdt:P793 wd:Q385378 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of elevators', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV tower', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'construction'}}}

 Q: What is {type of taxon} of {taxon parent} of {Xynenon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15872518 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of taxon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Xynenon', 'p': 'taxon parent', 'o': '$y0'}}

 Q: What is the {book of the Bible} for {followed by} of {Exodus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P156 wd:Q9190 . ?sbj wdt:P31 wd:Q29154430 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'followed by', 'o': 'Exodus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book of the Bible'}}

 Q: Does the scoeville grade of bell pepper equal to 0.0?
 SPARQL: ASK WHERE { wd:Q1548030 wdt:P2658 ?obj filter(?obj = 0.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'bell pepper', 'p': 'Scoville grade', 'o': '?x0', '?x0': '0.0'}

 Q: The physical quantity of a millimetre is represented by the symbol L. Which is it?
 SPARQL: SELECT ?answer WHERE { wd:Q174789 wdt:P111 ?answer . ?answer wdt:P416 ?x FILTER(contains(?x,'L'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'millimetre', 'p': 'quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'symbol', 'o': 'l'}}

 Q: What is Charity Commission no. of British Library ?
 SPARQL: select distinct ?answer where { wd:Q23308 wdt:P3057 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'British Library', 'p': 'Charity Commission no.', 'o': '?x0'}

 Q: Which is the JapanTour golf player ID for Ernie Els?
 SPARQL: select distinct ?answer where { wd:Q440171 wdt:P3535 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ernie Els', 'p': 'JapanTour golf player ID', 'o': '?x0'}

 Q: How many surface tensions are there for ethyl acetate?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q407153 wdt:P3013 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'ethyl acetate', 'p': 'surface tension', 'o': '?x0'}

 Q: What is {genetic association} of {lung cancer}, that has {ortholog} is {vti1a} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47912 wdt:P2293 ?answer . ?answer wdt:P684 wd:Q29782872}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'lung cancer', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'ortholog', 'o': 'vti1a'}}

 Q: What is {nominated for} of {Pearl Jam} that is {for work} is {The Fixer} ?
 SPARQL: SELECT ?obj WHERE { wd:Q142701 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1582205 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pearl Jam', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Fixer'}}}

 Q: How many start points are by Denver?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1427 wd:Q16554 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'Denver'}

 Q: What are the feminist movement which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15580856 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'feminist movement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which lake outflow's from the Nile?
 SPARQL: select distinct ?answer where { ?answer wdt:P201 wd:Q3392}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'lake outflow', 'o': 'Nile'}

 Q: Is the decomposition point of the limestone equal to 1820.4?
 SPARQL: ASK WHERE { wd:Q23757 wdt:P2107 ?obj filter(?obj = 1820.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'limestone', 'p': 'decomposition point', 'o': '?x0', '?x0': '1820.4'}

 Q: What was the population of Bonn as of December 31st, 1970?
 SPARQL: SELECT ?obj WHERE { wd:Q586 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bonn', 'p': 'population', 'o': '?x0', 't': '1970'}

 Q: Does the Sigma baryon have isospin z-component that is more than 0.8
 SPARQL: ASK WHERE { wd:Q424078 wdt:P1127 ?obj filter(?obj > 0.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Sigma baryon', 'p': 'isospin z-component', 'o': '?x0', '?x0': '0.8'}

 Q: What is the gender of Cecilia Bartoli, which has the abbreviation 'жін'?
 SPARQL: SELECT ?answer WHERE { wd:Q18828 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'жін'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cecilia Bartoli', 'p': 'gender', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'abbreviation', 'o': 'жін'}}

 Q: Who was the spouse of Jim Carrey prior to their divorce in 1997?
 SPARQL: SELECT ?obj WHERE { wd:Q40504 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1997')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jim Carrey', 'p': 'spouse', 'o': '?x0', 't': '1997'}

 Q: Which daughter of Apollo has a male son?
 SPARQL: SELECT ?answer WHERE { wd:Q37340 wdt:P40 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Apollo', 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'male'}}

 Q: What is the {human} for {mother} of {Hadrian}
 SPARQL:  select distinct ?obj where { wd:Q1427 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hadrian', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Boston Globe} has {owned by} as {John W. Henry} ?
 SPARQL: SELECT ?value WHERE { wd:Q824451 p:P127 ?s . ?s ps:P127 wd:Q1186372 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boston Globe', 'p': 'owner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'owner', 'o': 'John W. Henry'}}}

 Q: What is the asteroid with the lowest rotation period whose site of astronomical discovery is Bishop Observatory ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2147 ?obj . ?ent wdt:P65 wd:Q4329955} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'rotation period', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asteroid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'site of astronomical discovery', 'o': 'Bishop Observatory'}}}

 Q: What is {location of birth} of {William the Conqueror}, that has {gps coordinates} is {48.8922} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37594 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'48.8922'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William the Conqueror', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coordinates', 'o': '48.8922'}}

 Q: What is HGNC gene symbol for RHO?
 SPARQL: select distinct ?answer where { wd:Q14859555 wdt:P353 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'RHO', 'p': 'HGNC gene symbol', 'o': '?x0'}

 Q: What was the population of Puerto Rico in 1962?
 SPARQL: SELECT ?obj WHERE { wd:Q1183 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1962')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Puerto Rico', 'p': 'population', 'o': '?x0', 't': '1962'}

 Q: Who is the professional or sports partner of Madge Syers?
 SPARQL: select distinct ?answer where { wd:Q49292 wdt:P1327 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Madge Syers', 'p': 'sports partner', 'o': '?x0'}

 Q: Is it true that the standard enthalpy of formation of hydrogen fluoride is greater than -218.64?
 SPARQL: ASK WHERE { wd:Q2468 wdt:P3078 ?obj filter(?obj > -218.64) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'hydrogen fluoride', 'p': 'standard enthalpy of formation', 'o': '?x0', '?x0': '-218.64'}

 Q: what is the {country} for {Fred MacMurray} has {place of death} as {Santa Monica} ?
 SPARQL: SELECT ?value WHERE { wd:Q356309 p:P20 ?s . ?s ps:P20 wd:Q47164 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fred MacMurray', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Santa Monica'}}}

 Q: What is {famous for} of {writers} of {Sonnet 72} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3490580 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'famous for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sonnet 72', 'p': 'writer', 'o': '$y0'}}

 Q: Which is the historical region located on the terrain feature of the classical antiquity?
 SPARQL:  select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q1620908 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'classical antiquity', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical region'}}

 Q: Give me {heptalogy} that {takes place in fictional universe} {Harry Potter universe} and which contains the word {harry} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q614101 . ?sbj wdt:P1434 wd:Q5410773 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'harry')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'heptalogy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'takes place in fictional universe', 'o': 'Harry Potter universe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'harry'}}

 Q: Who did Juan Domingo Perón get married to on 1929-1-5?
 SPARQL: SELECT ?obj WHERE { wd:Q93330 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1929')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Juan Domingo Perón', 'p': 'married to', 'o': '?x0', 't': '1929'}

 Q: When did member of sports team of Andriy Shevchenko and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q41244 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Is the drag coefficient of the Hummer H2 equal to 0.424?
 SPARQL: ASK WHERE { wd:Q618590 wdt:P6497 ?obj filter(?obj = 0.424) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Hummer H2', 'p': 'drag coefficient', 'o': '?x0', '?x0': '0.424'}

 Q: What is the databaseFootball.com ID for O.J. Simpson?
 SPARQL: select distinct ?answer where { wd:Q44473 wdt:P3532 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'O.J. Simpson', 'p': 'databaseFootball.com ID', 'o': '?x0'}

 Q: What is {spouse} of {Pierre Curie} that is {place of marriage} is {Sceaux} ?
 SPARQL: SELECT ?obj WHERE { wd:Q37463 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q370498 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'wife', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pierre Curie', 'p': 'wife', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of marriage', 'o': 'Sceaux'}}}

 Q: Give me {physical constant} that contains the word {wavelength} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wavelength')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical constant'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wavelength'}}

 Q: Is Woody Harrelson's last name really Harrelson?
 SPARQL: ASK WHERE { wd:Q201279 wdt:P734 wd:Q21450338 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Woody Harrelson', 'p': 'last name', 'o': '?x0', '?x0': 'Harrelson'}]

 Q: What is the {artistic theme} for {significant person} of {Noah}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3342 wd:Q81422 . ?sbj wdt:P31 wd:Q1406161 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Noah', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theme'}}

 Q: Give me {comics character} that {from fictional universe} {Mickey Mouse universe} and which that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj wdt:P1080 wd:Q3260246 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comics character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'universe', 'o': 'Mickey Mouse universe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {inhabitants} of {workplace} of {Willy Brandt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2514 wdt:P937 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Willy Brandt', 'p': 'workplace', 'o': '$y0'}}

 Q: Which is the website affiliated with Harvard University?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q13371 . ?sbj wdt:P31 wd:Q35127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliated with', 'o': 'Harvard University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'website'}}

 Q: Which actor portrayed Batman in the movie Batman?
 SPARQL: SELECT ?obj WHERE { wd:Q2695156 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q116852 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Batman', 'p': 'actor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Batman'}}}

 Q: Is it true that the angular resolution of Hobby-Eberly Telescope equals to 1.8?
 SPARQL: ASK WHERE { wd:Q139605 wdt:P3439 ?obj filter(?obj = 1.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Hobby-Eberly Telescope', 'p': 'angular resolution', 'o': '?x0', '?x0': '1.8'}

 Q: What was the population of Sierra Leone in the year 1982?
 SPARQL: SELECT ?obj WHERE { wd:Q1044 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1982')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sierra Leone', 'p': 'population', 'o': '?x0', 't': '1982'}

 Q: What is {antonym of} of {religious affiliation} of {Pol Pot} ?
 SPARQL: SELECT ?answer WHERE { wd:Q39464 wdt:P140 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pol Pot', 'p': 'religious affiliation', 'o': '$y0'}}

 Q: What what is  property measured by Wechsler Intelligence Scale for Children   which that starts with letters i
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P1880 wd:Q1572850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'property', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'Wechsler Intelligence Scale for Children'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: Which is the streak color for apatite?
 SPARQL: select distinct ?answer where { wd:Q178397 wdt:P534 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'apatite', 'p': 'streak color', 'o': '?x0'}

 Q: What is the designer of iPad whose output is Apple Pay?
 SPARQL: SELECT ?answer WHERE { wd:Q2796 wdt:P287 ?answer . ?answer wdt:P1056 wd:Q18010990}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'iPad', 'p': 'designer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'output', 'o': 'Apple Pay'}}

 Q: What type of sport is jujutsu?
 SPARQL: select distinct ?answer where { ?answer wdt:P641 wd:Q163770}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'jujutsu'}

 Q: Which is the source of inspiration for the characters of The Lion King?
 SPARQL: SELECT ?answer WHERE { wd:Q36479 wdt:P941 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Lion King', 'p': 'source of inspiration', 'o': '$y0'}}

 Q: What is the {human} for {officeholder} of {pope}
 SPARQL:  select distinct ?obj where { wd:Q19546 wdt:P1308 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pope', 'p': 'officeholder', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {songwriter} of {Leck mich im Arsch}, that has {first language} is {German} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1373720 wdt:P86 ?answer . ?answer wdt:P103 wd:Q188}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leck mich im Arsch', 'p': 'songwriter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first language', 'o': 'German'}}

 Q: What is {elected in} and {end cause} of {{Arthur Henderson} has {position held} as {Member of the 29th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q208665 p:P39 ?s . ?s ps:P39 wd:Q41582579 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Henderson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 29th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Henderson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 29th Parliament of the United Kingdom'}}}]

 Q: Is it true that the median income of the Australia equal 37244.0?
 SPARQL: ASK WHERE { wd:Q408 wdt:P3529 ?obj filter(?obj = 37244.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Australia', 'p': 'median income', 'o': '?x0', '?x0': '37244.0'}

 Q: Does the Norwegian krone price equal 0.13
 SPARQL: ASK WHERE { wd:Q132643 wdt:P2284 ?obj filter(?obj = 0.13) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Norwegian krone', 'p': 'price', 'o': '?x0', '?x0': '0.13'}

 Q: Who is the {person} for {place of birth} in {Chicago}?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P19 wd:Q1297 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of birth', 'o': 'Chicago', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: Who is the {music genre} for {based on} of {country music}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P144 wd:Q83440 . ?sbj wdt:P31 wd:Q188451 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'country music', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'music genre'}}

 Q: what is the {start time} for {Iannis Xenakis} has {spouse} as {Françoise Xenakis} ?
 SPARQL: SELECT ?value WHERE { wd:Q152880 p:P26 ?s . ?s ps:P26 wd:Q3086635 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iannis Xenakis', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Françoise Xenakis'}}}

 Q: What are the diplomatic relations of the Kam people living in South Sudan?
 SPARQL: SELECT ?answer WHERE { wd:Q958 wdt:P530 ?answer . ?answer wdt:P172 wd:Q216096}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'South Sudan', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'people', 'o': 'Kam people'}}

 Q: Is the maximum temperature record of Russia less than 54.48?
 SPARQL: ASK WHERE { wd:Q159 wdt:P6591 ?obj filter(?obj < 54.48) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Russia', 'p': 'maximum temperature record', 'o': '?x0', '?x0': '54.48'}

 Q: What is the {Semitic languages} for {writing system} of {Phoenician alphabet}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q26752 . ?sbj wdt:P31 wd:Q34049 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'alphabet', 'o': 'Phoenician', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Semitic languages'}}

 Q: When will Dublin stop being a part of United Kingdom of Great Britain and Ireland?
 SPARQL: SELECT ?value WHERE { wd:Q1761 p:P17 ?s . ?s ps:P17 wd:Q174193 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dublin', 'p': 'land', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'land', 'o': 'United Kingdom of Great Britain and Ireland'}}}

 Q: Who is followed by Oliver Twist?
 SPARQL: select distinct ?answer where { wd:Q164974 wdt:P156 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oliver Twist', 'p': 'followed by', 'o': '?x0'}

 Q: When did position held of Gianni Agnelli and appointed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q356351 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P748 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'appointed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianni Agnelli', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianni Agnelli', 'p': 'position held', 'o': '$y0'}}]

 Q: What uses the German language and was co-founded by the Gestapo?
 SPARQL: SELECT ?answer WHERE { wd:Q43250 wdt:P112 ?answer . ?answer wdt:P1412 wd:Q188}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gestapo', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language', 'o': 'German'}}

 Q: what is the {end time} for {Mickey Rourke} has {spouse} as {Carré Otis} ?
 SPARQL: SELECT ?value WHERE { wd:Q178552 p:P26 ?s . ?s ps:P26 wd:Q508366 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mickey Rourke', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Carré Otis'}}}

 Q: Which is the annexation that contains the word war in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194465 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'annexation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'war'}}

 Q: What takes place in the House of Cards, if the highest judicial authority is the DC Court of Appeals?
 SPARQL: SELECT ?answer WHERE { wd:Q3330940 wdt:P840 ?answer . ?answer wdt:P209 wd:Q5283409}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'House of Cards', 'p': 'takes place in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'highest judicial authority', 'o': 'DC Court of Appeals'}}

 Q: What is the {belt sander model} with the {MIN(power consumed)} whose {subclass of} is {power tool}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23811260 . ?ent wdt:P2791 ?obj . ?ent wdt:P279 wd:Q1327701} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'power consumed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'belt sander model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'power tool'}}}

 Q: What is the birth location of Johann Heinrich Pestalozzi, which has a population of 360980?
 SPARQL: SELECT ?answer WHERE { wd:Q105428 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'360980.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Johann Heinrich Pestalozzi', 'p': 'birth location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '360980.0'}}

 Q: Did {Spider-Man} {present in work} {Spider-Man: Shattered Dimensions}?
 SPARQL: ASK WHERE { wd:Q79037 wdt:P1441 wd:Q729212 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Spider Man', 'p': 'present in work', 'o': '?x0', '?x0': 'Spider-Man: Shattered Dimensions'}]

 Q: What team did Mahela Jayawardene play for until 2010?
 SPARQL: SELECT ?obj WHERE { wd:Q2739165 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mahela Jayawardene', 'p': 'team', 'o': '?x0', 't': '2010'}

