 Q: How many distributions are there of a printed circuit board?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P437 wd:Q173350 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'distribution', 'o': 'printed circuit board'}

 Q: Were the number of casualties of the 2005 Jilin chemical plant explosions less than 4.8?
 SPARQL: ASK WHERE { wd:Q904738 wdt:P1590 ?obj filter(?obj < 4.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': '2005 Jilin chemical plant explosions', 'p': 'number of casualties', 'o': '?x0', '?x0': '4.8'}

 Q: Which is the strand orientation for RHO?
 SPARQL: select distinct ?answer where { wd:Q14859555 wdt:P2548 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'RHO', 'p': 'strand orientation', 'o': '?x0'}

 Q: What is the abjad that is the language of work or name of Hebrew and contains the word alphabet?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185087 . ?sbj wdt:P407 wd:Q9288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'alphabet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abjad', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Hebrew'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'alphabet'}}

 Q: Did {Shiva} {mount} {Nandi}?
 SPARQL: ASK WHERE { wd:Q11378 wdt:P3091 wd:Q841255 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Shiva', 'p': 'mount', 'o': '?x0', '?x0': 'Nandi'}]

 Q: The Lagrangian point of Wilkinson Microwave Anisotropy Probe is?
 SPARQL: select distinct ?answer where { wd:Q274106 wdt:P1145 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wilkinson Microwave Anisotropy Probe', 'p': 'Lagrangian point', 'o': '?x0'}

 Q: What awards did George Meredith receive for Merit?
 SPARQL: SELECT ?answer WHERE { wd:Q90238 wdt:P166 ?answer . ?answer wdt:P1451 ?x FILTER(contains(?x,'For Merit'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Meredith', 'p': 'awards', 'o': '?x0'}

 Q: Where is {subsidiary entity} {built by} {B-1 Lancer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q218636 wdt:P176 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'B-1 Lancer', 'p': 'built by', 'o': '$y0'}}

 Q: "Which is {not the same as} of {mushroom}, whose {type of taxon} is {species} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q83093 wdt:P1889 ?answer . ?answer wdt:P105 wd:Q7432}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'mushroom', 'p': 'not the same as', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type of taxon', 'o': 'species'}}

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Kevin Keegan} has {member of sports team} as {Newcastle United F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q152832 p:P54 ?s . ?s ps:P54 wd:Q18716 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kevin Keegan', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Newcastle United F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kevin Keegan', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Newcastle United F.C.'}}}]

 Q: Give me {Norse deity} that {official residence} {Asgard} and which that starts with {'o'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj wdt:P263 wd:Q178182 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Norse deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official residence', 'o': 'Asgard'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: What is { nominated for } of { Peter Matthiessen } that is { point in time } is { 2002 - 0 }?
 SPARQL: SELECT ?obj WHERE { wd:Q892108 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Matthiessen', 'p': 'nominated for', 'o': '?x0', 't': '2002'}

 Q: what is the {end time} for {Ernest Shackleton} has {record held} as {Farthest South} ?
 SPARQL: SELECT ?value WHERE { wd:Q957543 p:P1000 ?s . ?s ps:P1000 wd:Q2342357 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ernest Shackleton', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Farthest South'}}}

 Q: What is {nominated for} of {Éric Rohmer} that is {for work} is {The Marquise of O} ?
 SPARQL: SELECT ?obj WHERE { wd:Q50764 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q553649 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Éric Rohmer', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Marquise of O'}}}

 Q: What is the trend of sculptors of Physichromie 48
 SPARQL: SELECT ?answer WHERE { wd:Q28036714 wdt:P170 ?X . ?X wdt:P135 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'trend', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Physichromie 48', 'p': 'sculptor', 'o': '$y0'}}

 Q: Did Marilyn Monroe speak Romance languages?
 SPARQL: ASK WHERE { wd:Q4616 wdt:P1412 wd:Q19814 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Marilyn Monroe', 'p': 'language', 'o': '?x0', '?x0': 'Romance languages'}]

 Q: what is the {point in time} for {Karrie Webb} has {award received} as {Australian Sports Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q271024 p:P166 ?s . ?s ps:P166 wd:Q1649458 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Karrie Webb', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Australian Sports Medal'}, 't': '?x0'}

 Q: Where is Jacob W. Davis' place of death that is adjacent to Daly City?
 SPARQL: SELECT ?answer WHERE { wd:Q1488960 wdt:P20 ?answer . ?answer wdt:P47 wd:Q370925}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacob W. Davis', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'adjacent to', 'o': 'Daly City'}}

 Q: What number of theft convictions exist?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1399 wd:Q2727213 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'conviction', 'o': 'theft'}

 Q: What are the mantra which start with the letter M
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mantra'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Which is the MusicBrainz work ID for Adagio in G minor?
 SPARQL: select distinct ?answer where { wd:Q346741 wdt:P435 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Adagio in G minor', 'p': 'MusicBrainz work ID', 'o': '?x0'}

 Q: what is the {end time} for {Condé Nast} has {chief executive officer} as {Steven Florio} ?
 SPARQL: SELECT ?value WHERE { wd:Q605401 p:P169 ?s . ?s ps:P169 wd:Q16017756 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Condé Nast', 'p': 'chief executive officer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chief executive officer', 'o': 'Steven Florio'}}}

 Q: what is the {start time} for {Kareena Kapoor} has {spouse} as {Saif Ali Khan} ?
 SPARQL: SELECT ?value WHERE { wd:Q184885 p:P26 ?s . ?s ps:P26 wd:Q252290 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kareena Kapoor', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Saif Ali Khan'}}}

 Q: What is {human population} of {county seat for} of {Baghdad} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1530 wdt:P1376 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Baghdad', 'p': 'county seat for', 'o': '$y0'}}

 Q: Which is the rigid airship named after Paul von Hindenburg?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q2667 . ?sbj wdt:P31 wd:Q738584 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Paul von Hindenburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rigid airship'}}

 Q: what is the {for work} for {Gary Oldman} has {award received} as {BAFTA Award for Best Actor in a Leading Role} ?
 SPARQL: SELECT ?value WHERE { wd:Q83492 p:P166 ?s . ?s ps:P166 wd:Q400007 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gary Oldman', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'BAFTA Award for Best Actor in a Leading Role'}}}

 Q: What is {product} of {owners} of {Video CD} ?
 SPARQL: SELECT ?answer WHERE { wd:Q321259 wdt:P127 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'product', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Video CD', 'p': 'owner', 'o': '$y0'}}

 Q: When did spouse of Aleksandr Solzhenitsyn and end time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q34474 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is the {human} for {sport} of {cricket}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P641 wd:Q5375 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'cricket', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which federal state participated in the American Revolutionary War?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1344 wd:Q40949 . ?sbj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participated in', 'o': 'American Revolutionary War', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: What are the Christian movement which start with the letter P
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q995347 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian movement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is ISU figure skater ID for Ilia Kulik ?
 SPARQL: select distinct ?answer where { wd:Q1325882 wdt:P2694 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ilia Kulik', 'p': 'ISU figure skater ID', 'o': '?x0'}

 Q: How many {port of registry} are to/by {Tallinn} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P532 wd:Q1770 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'port of registry', 'o': 'Tallinn'}

 Q: What is the human being for Steven Pinker's sibling?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3373 wd:Q212730 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Steven Pinker', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What are the natural number which start with the letter g
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21199 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural number'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: Which is the cast member for King Kong?
 SPARQL: select distinct ?answer where { wd:Q309048 wdt:P161 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'King Kong', 'p': 'cast member', 'o': '?x0'}

 Q: Did {Kanye_West} {genre} {gangsta rap}?
 SPARQL: ASK WHERE { wd:Q15935 wdt:P136 wd:Q753679 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kanye West', 'p': 'genre', 'o': '?x0', '?x0': 'gangsta rap'}]

 Q: What's the patent number for MP3?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q42591 wdt:P1246 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'MP3', 'p': 'patent number', 'o': '?x0'}

 Q: Give me {noble family} that {basic form of government} {absolute monarchy} and which that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj wdt:P122 wd:Q184558 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble family', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'basic form of government', 'o': 'absolute monarchy'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Who is the disciple of sculptors of Village Street?
 SPARQL: SELECT ?answer WHERE { wd:Q20548739 wdt:P170 ?X . ?X wdt:P1066 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disciple of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Village Street', 'p': 'sculptor', 'o': '$y0'}}

 Q: What is the {human} for {affiliation} of {McGill University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q201492 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliation', 'o': 'McGill University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {libretto by} of {Tristan und Isolde}, that has {has kid} is {Siegfried Wagner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1324254 wdt:P87 ?answer . ?answer wdt:P40 wd:Q143867}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tristan und Isolde', 'p': 'libretto by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child', 'o': 'Siegfried Wagner'}}

 Q: What is <Hockey-reference player ID> of <Bobby Hull> ?
 SPARQL: select distinct ?answer where { wd:Q456688 wdt:P3598 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bobby Hull', 'p': 'Hockey-reference player ID', 'o': '?x0'}

 Q: What is <BC Geographical Names ID> of <Strait of Juan de Fuca> ?
 SPARQL: select distinct ?answer where { wd:Q867627 wdt:P2099 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Strait of Juan de Fuca', 'p': 'BC Geographical Names ID', 'o': '?x0'}

 Q: What is the {star cluster} with the {MAX(apparent magnitude)} whose {discoverer or inventor} is {James Dunlop}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q168845 . ?ent wdt:P1215 ?obj . ?ent wdt:P61 wd:Q375158 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'apparent magnitude', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'star cluster', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discovered by', 'o': 'James Dunlop'}}}

 Q: what is the {for work} for {Gary Cooper} has {nominated for} as {Academy Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q93957 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gary Cooper', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}}}

 Q: How many {basic form of government} are to/by {republic} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P122 wd:Q7270 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'basic form of government', 'o': 'republic'}

 Q: What is the motif, whose symbol is the Earth symbol, of The Blue Marble?
 SPARQL: SELECT ?answer WHERE { wd:Q202014 wdt:P180 ?answer . ?answer wdt:P913 wd:Q426529}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Blue Marble', 'p': 'motif', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'symbol', 'o': 'Earth symbol'}}

 Q: What military order starts with the letter "s"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military order'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {location of death} of {Doris Ulmann}, that has {inhabitants} is {391114.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q388471 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'391114.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Doris Ulmann', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '391114.0'}}

 Q: When John Dueholm ended as manager/director at Scandinavian Airlines?
 SPARQL: SELECT ?value WHERE { wd:Q187854 p:P1037 ?s . ?s ps:P1037 wd:Q24175767 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Scandinavian Airlines', 'p': 'manager', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'manager', 'o': 'John Dueholm'}}}

 Q: what is the {end time} for {Menachem Mendel Schneerson} has {notable work} as {Likkutei Sichos} ?
 SPARQL: SELECT ?value WHERE { wd:Q381397 p:P800 ?s . ?s ps:P800 wd:Q2907320 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Menachem Mendel Schneerson', 'p': 'work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work', 'o': 'Likkutei Sichos'}}}

 Q: What is the {chemical compound} for {drug used for treatment} of {anthrax}
 SPARQL:  select distinct ?obj where { wd:Q129104 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'anthrax', 'p': 'used for treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: what is the {end time} for {François Hollande} has {partner} as {Valérie Trierweiler} ?
 SPARQL: SELECT ?value WHERE { wd:Q157 p:P451 ?s . ?s ps:P451 wd:Q230539 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'François Hollande', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Valerie Trierweiler'}}}

 Q: what is the {replaced by} for {Jiang Zemin} has {position held} as {President of the People's Republic of China} ?
 SPARQL: SELECT ?value WHERE { wd:Q16597 p:P39 ?s . ?s ps:P39 wd:Q655407 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jiang Zemin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': "President of the People's Republic of China"}}}

 Q: What is the {IT consulting company} with the {MIN(market capitalization)} whose {subsidiary} is {IBM Denmark}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q20031260 . ?ent wdt:P2226 ?obj . ?ent wdt:P355 wd:Q16323757} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'market capitalization', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'IT consulting company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'IBM Denmark'}}}

 Q: what is the {end time} for {Nazareth} has {country} as {Ottoman Empire} ?
 SPARQL: SELECT ?value WHERE { wd:Q430776 p:P17 ?s . ?s ps:P17 wd:Q12560 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nazareth', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Ottoman Empire'}}}

 Q: What is the {country of the Kingdom of the Netherlands} with the {MAX(VAT-rate)} whose {member of} is {International Trade Union Confederation}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15304003 . ?ent wdt:P2855 ?obj . ?ent wdt:P463 wd:Q1071706 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'VAT-rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country of the Kingdom of the Netherlands', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Trade Union Confederation'}}}

 Q: What is {place of birth} of {Max von Sydow} that is {country} is {Sweden} ?
 SPARQL: SELECT ?obj WHERE { wd:Q203215 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q34 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Max von Sydow', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Sweden'}}}

 Q: Ireland  has how many ancestral homes?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P66 wd:Q27 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'ancestral home', 'o': 'Ireland'}

 Q: What is the number of Parkinson's disease genetic associations?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2293 wd:Q11085 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': "Parkinson's disease"}

 Q: What was Mary Martin nominated for in 1967?
 SPARQL: SELECT ?obj WHERE { wd:Q285483 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mary Martin', 'p': 'nominated for', 'o': '?x0', 't': '1967'}

 Q: What is {pronunciation audio} of {taxon parent} of {Mentha spicata} ?
 SPARQL: SELECT ?answer WHERE { wd:Q160114 wdt:P171 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mentha spicata', 'p': 'taxon parent', 'o': '$y0'}}

 Q: What is the {physically interacts with} and the {significant drug interaction} of {Cocaine} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q41576 wdt:P129 ?ans_1 . wd:Q41576 wdt:P769 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Cocain', 'p': 'physically interacts with', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Cocain', 'p': 'drug interaction', 'o': '?x1'}]

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Dixie Dean} has {member of sports team} as {Sligo Rovers F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 wd:Q244874 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dixie Dean', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Sligo Rovers F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dixie Dean', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Sligo Rovers F.C.'}}}]

 Q: Which is Swedish Film Database film ID for Nausicaä of the Valley of the Wind?
 SPARQL: select distinct ?answer where { wd:Q8885676 wdt:P2334 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nausicaä of the Valley of the Wind', 'p': 'Swedish Film Database film ID', 'o': '?x0'}

 Q: What is {typology} of {language of expression} of {Wayne Carey} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7976079 wdt:P1412 ?X . ?X wdt:P4132 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'typology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wayne Carey', 'p': 'language', 'o': '$y0'}}

 Q: What award did Roger Federer receive in 2009?
 SPARQL: SELECT ?obj WHERE { wd:Q1426 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Roger Federer', 'p': 'award', 'o': '?x0', 't': '2009'}

 Q: What is the {inner planet} for {parent astronomical body} of {Mir}
 SPARQL:  select distinct ?obj where { wd:Q48604 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3504248 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mir', 'p': 'parent astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inner planet'}}

 Q: What is the quantity for canton of Switzerland?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q23058 wdt:P1114 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'canton of Switzerland', 'p': 'quantity', 'o': '?x0'}

 Q: What is {owned by} and the {influenced by} of {JavaScript} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q2005 wdt:P127 ?ans_1 . wd:Q2005 wdt:P737 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'JavaScript', 'p': 'owned by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'JavaScript', 'p': 'influenced by', 'o': '?x1'}]

 Q: what is the {start time} for {Elon Musk} has {spouse} as {Justine Musk} ?
 SPARQL: SELECT ?value WHERE { wd:Q317521 p:P26 ?s . ?s ps:P26 wd:Q6318376 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Elon Musk', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Justine Musk'}}}

 Q: Give me {king in Greek mythology} that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24434794 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'king in Greek mythology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What are the series ordinal for hydrazine whose ionization energy is 8.93?
 SPARQL: SELECT ?value WHERE { wd:Q58447 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'8.93')) . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hydrazine', 'p': 'ionization energy', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ionization energy', 'o': '8.93'}}}

 Q: What is the antonym of the aspect of animal colouration?
 SPARQL: SELECT ?answer WHERE { wd:Q3242894 wdt:P1269 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'animal colouration', 'p': 'aspect of', 'o': '$y0'}}

 Q: What  typology does Richard Wright use when writing languages?
 SPARQL: SELECT ?answer WHERE { wd:Q190251 wdt:P1412 ?X . ?X wdt:P4132 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'typology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richard Wright', 'p': 'language', 'o': '$y0'}}

 Q: what is the {start time} for {Innsbruck} has {twinned administrative body} as {Kraków} ?
 SPARQL: SELECT ?value WHERE { wd:Q1735 p:P190 ?s . ?s ps:P190 wd:Q31487 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Innsbruck', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Kraków'}}}

 Q: How many {means of locomotion} are to/by {quadrupedalism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3512 wd:Q21907045 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'means of locomotion', 'o': 'quadrupedalism'}

 Q: What is the {human} for {culture} of {Etruschi}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2596 wd:Q17161 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'culture', 'o': 'Etruschi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Did {Jay-Z} {native language} {Icelandic}?
 SPARQL: ASK WHERE { wd:Q62766 wdt:P103 wd:Q294 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jay-Z', 'p': 'native language', 'o': '?x0', '?x0': 'Icelandic'}]

 Q: What are the condiment which start with the letter y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2596997 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'condiment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: what is the {end time} for {FIFA} has {chairperson} as {João Havelange} ?
 SPARQL: SELECT ?value WHERE { wd:Q253414 p:P488 ?s . ?s ps:P488 wd:Q207358 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'FIFA', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'João Havelange'}}}

 Q: When did educated at of Carl Sagan and academic degree?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q410 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Sagan', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Sagan', 'p': 'educated at', 'o': '$y0'}}]

 Q: what is the {point in time} for {Dominican Republic} has {number of out of school children} as {385433.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q786 p:P2573 ?s . ?s ps:P2573 ?x filter(contains(?x,'385433.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dominican Republic', 'p': 'number of out of school children', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of out of school children', 'o': '385433.0'}, 't': '?x0'}

 Q: What is <The Encyclopedia of Science Fiction ID> of <Sherlock Holmes> ?
 SPARQL: select distinct ?answer where { wd:Q4653 wdt:P5357 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sherlock Holmes', 'p': 'The Encyclopedia of Science Fiction ID', 'o': '?x0'}

 Q: What is {same} of {assault}, that has {distinct from} is {homicide} ?
 SPARQL: SELECT ?answer WHERE { wd:Q365680 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q149086}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'assault', 'p': 'same', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'distinct from', 'o': 'murder'}}

 Q: What is Women's Basketball Hall of Fame ID for Lisa Leslie ?
 SPARQL: select distinct ?answer where { wd:Q257980 wdt:P4410 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lisa Leslie', 'p': "Women's Basketball Hall of Fame ID", 'o': '?x0'}

