 Q: Which is the Artsy gene for Cubism?
 SPARQL: select distinct ?answer where { wd:Q42934 wdt:P2411 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cubism', 'p': 'Artsy gene', 'o': '?x0'}

 Q: What is the national anthem of Nazi Germany?
 SPARQL:  select distinct ?obj where { wd:Q7318 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nazi Germany', 'p': 'anthem', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national anthem'}}

 Q: Which bay of Valentia Island has the tributary Courantyne River?
 SPARQL: SELECT ?answer WHERE { wd:Q1146838 wdt:P206 ?answer . ?answer wdt:P974 wd:Q508582}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Valentia Island', 'p': 'bay', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Courantyne River'}}

 Q: What is {position held} of {José Sarney} that is {replaced by} is {Itamar Franco} ?
 SPARQL: SELECT ?obj WHERE { wd:Q244997 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q485946 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jose Sarney', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Itamar Franco'}}}

 Q: What was Jonathan Larson nominated for in 2002?
 SPARQL: SELECT ?obj WHERE { wd:Q449002 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jonathan Larson', 'p': 'nominated for', 'o': '?x0', 't': '2002'}

 Q: tell me social philosophy that starts with e
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180592 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social philosophy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'e'}}

 Q: Which is the vehicle normally used for Railjet?
 SPARQL: select distinct ?answer where { wd:Q327051 wdt:P3438 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Railjet', 'p': 'vehicle normally used', 'o': '?x0'}

 Q: What is <maximum thrust> of <Typhoon> ?
 SPARQL: select distinct ?answer where { wd:Q151384 wdt:P2228 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Typhoon', 'p': 'maximum thrust', 'o': '?x0'}

 Q: What is {contains} of {workplace} of {Frederick II of Prussia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q33550 wdt:P937 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'contains', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick II of Prussia', 'p': 'workplace', 'o': '$y0'}}

 Q: What are the Jewish denomination that starts with the letter j
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3001185 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'j')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Jewish denomination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'j'}}

 Q: What was Verona's population in 1981?
 SPARQL: SELECT ?obj WHERE { wd:Q2028 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Verona', 'p': 'population', 'o': '?x0', 't': '1981'}

 Q: What is the {big city} for {twinned administrative body} of {Leeds}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q39121 . ?sbj wdt:P31 wd:Q1549591 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Leeds', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'big city'}}

 Q: How many numbers of the official symbol for the Quebec} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q176 wdt:P2238 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Quebec', 'p': 'official symbol', 'o': '?x0'}

 Q: What award did Giorgos Seferis receive in 1963?
 SPARQL: SELECT ?obj WHERE { wd:Q165823 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Giorgos Seferis', 'p': 'award', 'o': '?x0', 't': '1963'}

 Q: How many input methods are there for a gamepad?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P479 wd:Q273140 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'input method', 'o': 'gamepad'}

 Q: what is the {point in time} for {Keio University} has {students count} as {2492.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q815432 p:P2196 ?s . ?s ps:P2196 ?x filter(contains(?x,'2492.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Keio University', 'p': 'students count', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'students count', 'o': '2492.0'}, 't': '?x0'}

 Q: wich means{Total number of cases}that {suffers from} at{Giovanni Battista Pergolesi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q185312 wdt:P1050 ?X . ?X wdt:P1603 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of cases', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Giovanni Battista Pergolesi', 'p': 'suffers from', 'o': '$y0'}}

 Q: What award is Luigi Pirandello received that is 1934-1-1 on point in time?
 SPARQL: SELECT ?obj WHERE { wd:Q1403 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1934')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Luigi Pirandello', 'p': 'award', 'o': '?x0', 't': '1934'}

 Q: What is the {atomic nucleus} with the {MAX(isospin z-component)} whose {follows} is {deuteron}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q37147 . ?ent wdt:P1127 ?obj . ?ent wdt:P155 wd:Q503527 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'isospin z-component', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'atomic nucleus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'follows', 'o': 'deuteron'}}}

 Q: When did Gabon have a population of 692,535?
 SPARQL: SELECT ?value WHERE { wd:Q1000 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'692535.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gabon', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '692535.0'}, 't': '?x0'}

 Q: What is {has proponent} of {medical specialty} of {schizotypal personality disorder} ?
 SPARQL: SELECT ?answer WHERE { wd:Q861560 wdt:P1995 ?X . ?X wdt:P3095 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has proponent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'schizotypal personality disorder', 'p': 'medical specialty', 'o': '$y0'}}

 Q: Who became the spouse of Auguste Rodin on January 29th 1917?
 SPARQL: SELECT ?obj WHERE { wd:Q30755 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1917')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Auguste Rodin', 'p': 'spouse', 'o': '?x0', 't': '1917'}

 Q: How many {present in work} are to/by {Assassin's Creed} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1441 wd:Q420292 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': "Assassin's Creed"}

 Q: "What is the {domain} of {unconformity} which is {associated with} is {geologist} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q876798 wdt:P2579 ?answer . ?answer wdt:P3095 wd:Q520549}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'unconformity', 'p': 'domain', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'associated with', 'o': 'geologist'}}

 Q: What is <history of topic> of <Zambia> ?
 SPARQL: select distinct ?answer where { wd:Q953 wdt:P2184 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zambia', 'p': 'history of topic', 'o': '?x0'}

 Q: What is a photographic technique which includes the word vignetting in the name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1439691 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vignetting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'photographic technique'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vignetting'}}

 Q: what is the {statement is subject of} for {Georges Delerue} has {nominated for} as {Academy Award for Best Original Score} ?
 SPARQL: SELECT ?value WHERE { wd:Q435034 p:P1411 ?s . ?s ps:P1411 wd:Q488651 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georges Delerue', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Original Score'}}}

 Q: What is the total revenue for ExxonMobil?
 SPARQL: select distinct ?answer where { wd:Q156238 wdt:P2139 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ExxonMobil', 'p': 'total revenue', 'o': '?x0'}

 Q: What is the {title of Mary} for {patron saint} of {Spanish Empire}
 SPARQL:  select distinct ?obj where { wd:Q80702 wdt:P417 ?obj . ?obj wdt:P31 wd:Q1509831 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Spanish Empire', 'p': 'patron saint', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'p'}}

 Q: what is the {replaces} for {Isabel Martínez de Perón} has {position held} as {President of Argentina} ?
 SPARQL: SELECT ?value WHERE { wd:Q191014 p:P39 ?s . ?s ps:P39 wd:Q12969145 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabel Martinez de Peron', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Argentina'}}}

 Q: What is {headquarters location} of {University of Barcelona} that is {postal code} is {08007} ?
 SPARQL: SELECT ?obj WHERE { wd:Q219615 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'08007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'University of Barcelona', 'p': 'headquarters location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'postal code', 'o': '08007'}}}

 Q: What is Kitaro's Myspace ID?
 SPARQL: select distinct ?answer where { wd:Q273652 wdt:P3265 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kitaro', 'p': 'Myspace ID', 'o': '?x0'}

 Q: What is the {association football tournament} with the {MIN(number of points/goals/set scored)} whose {country} is {Uruguay}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P1351 ?obj . ?ent wdt:P17 wd:Q77} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of points/goals/set scored', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'football tournament', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Uruguay'}}}

 Q: What is the twin town of Sakie Akiyama's birthplace?
 SPARQL: SELECT ?answer WHERE { wd:Q11594958 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sakie Akiyama', 'p': 'birthplace', 'o': '$y0'}}

 Q: What was the population of Hobart on August 9, 2016?
 SPARQL: SELECT ?obj WHERE { wd:Q40191 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hobart', 'p': 'population', 'o': '?x0', 't': '2016'}

 Q: Which is the Courrier international topic ID for Nicolas Sarkozy?
 SPARQL: select distinct ?answer where { wd:Q329 wdt:P5551 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nicolas Sarkozy', 'p': 'Courrier international topic ID', 'o': '?x0'}

 Q: what is the {determination method} for {Alberta} has {population} as {4306039} ?
 SPARQL: SELECT ?value WHERE { wd:Q1951 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4306039')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alberta', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '4306039'}}}

 Q: what is the {sport number} for {Moses Malone} has {member of sports team} as {Houston Rockets} ?
 SPARQL: SELECT ?value WHERE { wd:Q316179 p:P54 ?s . ?s ps:P54 wd:Q161345 . ?s pq:P1618 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sport number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moses Malone', 'p': 'played for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'played for', 'o': 'Houston Rockets'}}}

 Q: Who is the  {Wikidata property for an identifier} for {subject item of this property} of {Nazi Party}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1629 wd:Q7320 . ?sbj wdt:P31 wd:Q19847637 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'item', 'o': 'Nazi Party', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikidata property for an identifier'}}

 Q: What is {from} of {Yes}, that has {ocean} is {River Thames} ?
 SPARQL: SELECT ?answer WHERE { wd:Q184386 wdt:P740 ?answer . ?answer wdt:P206 wd:Q19686}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yes', 'p': 'from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'ocean', 'o': 'River Thames'}}

 Q: How many are followed by Oracle Corporation?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P156 wd:Q19900 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'followed by', 'o': 'Oracle Corporation'}

 Q: What is {award received} of {George Lucas} that is {point in time} is {2009-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q38222 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Lucas', 'p': 'award', 'o': '?x0', 't': '2009'}

 Q: Which is {influenced by} and {followed by} of {Alexander_the_Great} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8409 wdt:P737 ?ans_1 . wd:Q8409 wdt:P156 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Alexander', 'p': 'influenced by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Alexander', 'p': 'followed by', 'o': '?x1'}]

 Q: Is this taxon is source of goji?
 SPARQL: select distinct ?answer where { ?answer wdt:P1672 wd:Q2617260}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'this taxon is source of', 'o': 'goji'}

 Q: Give me {National Historic Trail} that {country} {United States of America} and which contains the word {trail} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6973377 . ?sbj wdt:P17 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trail')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'National Historic Trail', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'USA'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'trail'}}

 Q: What is the full address of Glencore's headquarters located at Baaremattstrasse 3?
 SPARQL: SELECT ?obj WHERE { wd:Q169339 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter(contains(?x,'Baarermattstrasse 3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Glencore', 'p': 'headquarters', 'o': '?x0'}

 Q: Tell me the name of a high-rise building designed by structural engineer Atkins, and which starts with "a".
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18142 . ?sbj wdt:P631 wd:Q1510450 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'high-rise building', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'structural engineer', 'o': 'Atkins'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: what is the {winner} for {Jean-Luc Godard} has {award received} as {Honorary César} ?
 SPARQL: SELECT ?value WHERE { wd:Q53001 p:P166 ?s . ?s ps:P166 wd:Q727282 . ?s pq:P1346 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-Luc Godard', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Honorary Cesar'}}}

 Q: Which uncle did a tribute to Christ Church?
 SPARQL: SELECT ?answer WHERE { wd:Q26451415 wdt:P825 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'uncle', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christ Church', 'p': 'tribute to', 'o': '$y0'}}

 Q: What is {location of death} of {Daniel Dunglas Home}, that has {diplomatic relation} is {Mauritius} ?
 SPARQL: SELECT ?answer WHERE { wd:Q725741 wdt:P20 ?answer . ?answer wdt:P530 wd:Q1027}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Daniel Dunglas Home', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Mauritius'}}

 Q: Which is the Scottish Football Association player ID of Matt Busby?
 SPARQL: select distinct ?answer where { wd:Q206237 wdt:P3049 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Matt Busby', 'p': 'Scottish Football Association player ID', 'o': '?x0'}

 Q: Which is the Fashion Model Directory photographer ID of Richard Avedon?
 SPARQL: select distinct ?answer where { wd:Q305497 wdt:P2485 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Richard Avedon', 'p': 'Fashion Model Directory photographer ID', 'o': '?x0'}

 Q: How many {place of publication} are to/by {Brasília} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P291 wd:Q2844 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'place of publication', 'o': 'Brasília'}

 Q: Is Ibn Taymiyyah's place of birth the country known as Harran?
 SPARQL: SELECT ?value WHERE { wd:Q491558 p:P19 ?s . ?s ps:P19 wd:Q199547 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ibn Taymiyyah', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of birth', 'o': 'Harran'}}}

 Q: How many {country for sport} are to/by {San Marino} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1532 wd:Q238 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'country for sport', 'o': 'San Marino'}

 Q: Die Hard is the narrative location of what county seat ?
 SPARQL:  select distinct ?obj where { wd:Q105598 wdt:P840 ?obj . ?obj wdt:P31 wd:Q62049 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Die Hard', 'p': 'narrative location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'county seat'}}

 Q: Which is {denomination} of {writers} of {Executive Order 3800} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19107125 wdt:P50 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'denomination', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Executive Order 3800', 'p': 'writer', 'o': '$y0'}}

 Q: Which is the ctext work ID for Romance of the Three Kingdoms?
 SPARQL: select distinct ?answer where { wd:Q70806 wdt:P4517 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Romance of the Three Kingdoms', 'p': 'ctext work ID', 'o': '?x0'}

 Q: tell me demographic profile replaced by early childhood  starts with letter b
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5932254 . ?sbj wdt:P1366 wd:Q3377398 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'demographic profile', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'early childhood'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: What is {nominated for} of {Montgomery Clift} that is {statement is subject of} is {24th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193102 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917184 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montgomery Clift', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '24th Academy Awards'}}}

 Q: Give me {embankment dam} that contains the word {hydro} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hydro')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'embankment dam'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hydro'}}

 Q: What are the Magnetic confinement fusion which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q939954 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Magnetic confinement fusion'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is <academic degree> of <Andrei Tupolev> ?
 SPARQL: select distinct ?answer where { wd:Q219734 wdt:P512 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andrei Tupolev', 'p': 'academic degree', 'o': '?x0'}

 Q: Was Barry Kooser a film crew member on The Lion King?
 SPARQL: ASK WHERE { wd:Q36479 wdt:P3092 wd:Q16204825 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Lion King', 'p': 'film crew member', 'o': '?x0', '?x0': 'Barry Kooser'}]

 Q: What is the {members have occupation} and the {said to be the same as} of {Coen_brothers} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q56095 wdt:P3989 ?ans_1 . wd:Q56095 wdt:P460 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Coen brothers', 'p': 'members have occupation', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Coen brothers', 'p': 'said to be the same as', 'o': '?x1'}]

 Q: Which  bodies of water basin category of Peace River ?
 SPARQL: select distinct ?answer where { wd:Q2220 wdt:P1200 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Peace River', 'p': 'bodies of water basin category', 'o': '?x0'}

 Q: Which is the kingdom of the country of Kingdom of Wessex?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q105313 . ?sbj wdt:P31 wd:Q417175 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Kingdom of Wessex', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kingdom'}}

 Q: what is the {transliteration} for {Śūnyatā} has {native label} as {শূন্যতা} ?
 SPARQL: SELECT ?value WHERE { wd:Q546054 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'শূন্যতা')) . ?s pq:P2440 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'transliteration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Śūnyatā', 'p': 'native label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'native label', 'o': 'শূন্যতা'}}}

 Q: What is {chairperson} of {member of} of {The Football Association} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9500 wdt:P463 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chairperson', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Football Association', 'p': 'member of', 'o': '$y0'}}

 Q: What is {position held} of {Athelstan} that is {start time} is {927-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q170017 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(?x,'927-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Athelstan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'start time', 'o': '927-0-0'}}}

 Q: Is the diameter of the Adiri equal to 0?
 SPARQL: ASK WHERE { wd:Q112516 wdt:P2386 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Adiri', 'p': 'diameter', 'o': '?x0', '?x0': '0'}

 Q: Which is the phase point for water?
 SPARQL: select distinct ?answer where { wd:Q283 wdt:P873 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'water', 'p': 'phase point', 'o': '?x0'}

 Q: Which means {location of formation} at {Apodaca} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P740 wd:Q1782406}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location of formation', 'o': 'Apodaca'}

 Q: What is the {county of California} for {contains administrative territorial entity} of {Los Angeles}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q65 . ?sbj wdt:P31 wd:Q13212489 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Los Angeles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'county of California'}}

 Q: What is <union of> of <galaxy group or cluster> ?
 SPARQL: select distinct ?answer where { wd:Q17512228 wdt:P2737 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'galaxy group or cluster', 'p': 'union of', 'o': '?x0'}

 Q: what is the {start time} for {Dally Messenger} has {member of sports team} as {Australia national rugby union team} ?
 SPARQL: SELECT ?value WHERE { wd:Q3012496 p:P54 ?s . ?s ps:P54 wd:Q622443 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dally Messenger', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Australia national rugby union team'}}}

 Q: What is the name of the painting that depicts Jesus Christ
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P180 wd:Q302 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'Jesus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: What was the population of New Jersey in the year 2001?
 SPARQL: SELECT ?obj WHERE { wd:Q785 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jersey', 'p': 'population', 'o': '?x0', 't': '2001'}

 Q: What is {next to} of {Tarapacá Region}, that has {has states} is {Sud Chichas Province} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2114 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1425463}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tarapacá Region', 'p': 'next to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has states', 'o': 'Sud Chichas Province'}}

 Q: "Which actor in The Godfather was educated at Hofstra University?
 SPARQL: SELECT ?answer WHERE { wd:Q47703 wdt:P161 ?answer . ?answer wdt:P69 wd:Q1623314}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Godfather', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'educated at', 'o': 'Hofstra University'}}

 Q: What is the {Wikimedia category} for {category of associated people} of {Manipur}
 SPARQL:  select distinct ?obj where { wd:Q1193 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Manipur', 'p': 'category of associated people', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cat'}}

 Q: Is the number of speakers of Sanskrit equal 2654.4?
 SPARQL: ASK WHERE { wd:Q11059 wdt:P1098 ?obj filter(?obj = 2654.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sanskrit', 'p': 'number of speakers', 'o': '?x0', '?x0': '2654.4'}

 Q: Is it true that the maximum operating altitude of the Airbus A400M equals to 11275?
 SPARQL: ASK WHERE { wd:Q6496 wdt:P2254 ?obj filter(?obj = 11275) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Airbus A400M', 'p': 'maximum operating altitude', 'o': '?x0', '?x0': '11275'}

 Q: What type kinship is a son-in-law?
 SPARQL: select distinct ?answer where { ?answer wdt:P1039 wd:Q3752578}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'kinship', 'o': 'son-in-law'}

 Q: Did {Goodfellas} {cast member} {Vincent Pastore} and {Peter Onorati} ?
 SPARQL: ASK WHERE { wd:Q42047 wdt:P161 wd:Q512986 . wd:Q42047 wdt:P161 wd:Q328409 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Goodfellas', 'p': 'cast member', 'o': '?x0', '?x0': 'Vincent Pastore'}, {'h': 'IS', 'v': '?x1', 's': 'Goodfellas', 'p': 'cast member', 'o': '?x1', '?x1': 'Peter Onorati'}]

 Q: What is {label} of {Lars Ulrich}, that has {date of commencement} is {1929-1-1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q106193 wdt:P264 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1929'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lars Ulrich', 'p': 'label', 'o': '?x0', 't': '1929'}

 Q: What is {formed out of} of {platinum}, that has {namesake} is {Francis Louis Sperry} ?
 SPARQL: SELECT ?answer WHERE { wd:Q880 wdt:P186 ?answer . ?answer wdt:P138 wd:Q27908788}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'platinum', 'p': 'formed out of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Francis Louis Sperry'}}

 Q: What is {member of sports team} of {Nicklas Lidström} that is {start time} is {1994-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q434200 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nicklas Lidström', 'p': 'team', 'o': '?x0', 't': '1994'}

 Q: What is a time of day that starts with the letter m.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'time of day'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What is <BPH journal ID> of <American Journal of Botany> ?
 SPARQL: select distinct ?answer where { wd:Q2664693 wdt:P4569 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Journal of Botany', 'p': 'BPH journal ID', 'o': '?x0'}

 Q: What award did Frances McDormand receive in 2018?
 SPARQL: SELECT ?obj WHERE { wd:Q204299 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frances McDormand', 'p': 'award', 'o': '?x0', 't': '2018'}

 Q: Tell me mineral supergroup whose name has the word tourmalines in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3977918 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tourmalines')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral supergroup'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tourmalines'}}

 Q: How many operating systems run on MS-DOS?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P306 wd:Q47604 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'operating system', 'o': 'MS-DOS'}

