 Q: what is the {statement is subject of} for {Shirley Booth} has {award received} as {Tony Award for Best Featured Actress in a Play} ?
 SPARQL: SELECT ?value WHERE { wd:Q253308 p:P166 ?s . ?s ps:P166 wd:Q627778 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shirley Booth', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Tony Award for Best Featured Actress in a Play'}}}

 Q: What is the {human} for {mother} of {Bill Gates}
 SPARQL:  select distinct ?obj where { wd:Q5284 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bill Gates', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is Lysimachus's noble title and who follows?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q32133 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lysimachus', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lysimachus', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is the {national library} with the {MIN(collection or exhibition size)} whose {instance of} is {national library}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22806 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q22806} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'collection or exhibition size', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national library'}}

 Q: What is {nominated for} of {F. Murray Abraham} that is {statement is subject of} is {57th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q181936 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q427425 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'F. Murray Abraham', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '57th Academy Awards'}}}

 Q: What is {local dialling code} of {publication region} of {The Dallas Morning News} ?
 SPARQL: SELECT ?answer WHERE { wd:Q889935 wdt:P291 ?X . ?X wdt:P473 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dialling code', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dallas Morning News', 'p': 'publication region', 'o': '$y0'}}

 Q: Is the end time for the spouse of Larry King 1967-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q213430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Larry King', 'p': 'spouse', 'o': '?x0', 't': '1967'}

 Q: What is {temperature} {on river} of {Iberian Peninsula} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12837 wdt:P206 ?X . ?X wdt:P2076 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'temperature', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iberian Peninsula', 'p': 'on river', 'o': '$y0'}}

 Q: Did {Joule} {measured physical quantity} {transparency} and {work} ?
 SPARQL: ASK WHERE { wd:Q25269 wdt:P111 wd:Q487623 . wd:Q25269 wdt:P111 wd:Q42213 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'J', 'p': 'measured physical quantity', 'o': '?x0', '?x0': 'transparency'}, {'h': 'IS', 'v': '?x1', 's': 'J', 'p': 'measured physical quantity', 'o': '?x1', '?x1': 'work'}]

 Q: Give me {nut} that contains the word {nut} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nut'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'nut'}}

 Q: Which isotope of indium has the most parity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q785466 . ?ent wdt:P1123 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'parity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of indium'}}

 Q: What was the price of gold in 2018-7-26?
 SPARQL: SELECT ?obj WHERE { wd:Q897 p:P2284 ?s . ?s ps:P2284 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'gold', 'p': 'price', 'o': '?x0', 't': '2018'}

 Q: What work did Jacques Brel publish in 1963?
 SPARQL: SELECT ?obj WHERE { wd:Q1666 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'1963')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacques Brel', 'p': 'work', 'o': '?x0', 't': '1963'}

 Q: What is {narrative location} of {North by Northwest} that is {filming location} is {California} ?
 SPARQL: SELECT ?obj WHERE { wd:Q223139 p:P840 ?s . ?s ps:P840 ?obj . ?s pq:P915 wd:Q99 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'narrative location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North by Northwest', 'p': 'narrative location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'filming location', 'o': 'California'}}}

 Q: Which is the poetry collection that has traditional Chinese characters as writing system?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q12308638 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'traditional Chinese characters', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'poetry collection'}}

 Q: What political party does Jacinda Ardern belong to?
 SPARQL:  select distinct ?obj where { wd:Q3606816 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jacinda Ardern', 'p': 'party', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: what is the {start time} for {Ahmedabad} has {located in the administrative territorial entity} as {Bombay Presidency} ?
 SPARQL: SELECT ?value WHERE { wd:Q1070 p:P131 ?s . ?s ps:P131 wd:Q891827 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ahmedabad', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Bombay Presidency'}}}

 Q: What award was received by Valeri Polyakov on April 4, 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q317792 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Valeri Polyakov', 'p': 'award', 'o': '?x0', 't': '2011'}

 Q: What is the {name} for {incarnation of} of {Jesus Christ}
 SPARQL:  select distinct ?obj where { wd:Q302 wdt:P3701 ?obj . ?obj wdt:P31 wd:Q82799 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jesus', 'p': 'incarnation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'name'}}

 Q: What is {nominated for} of {Close Encounters of the Third Kind} that is {nominee} is {John Williams} ?
 SPARQL: SELECT ?obj WHERE { wd:Q320588 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q131285 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Close Encounters of the Third Kind', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'John Williams'}}}

 Q: What is budget for Grand Theft Auto V?
 SPARQL: select distinct ?answer where { wd:Q17452 wdt:P2769 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Grand Theft Auto V', 'p': 'budget', 'o': '?x0'}

 Q: what is the {point in time} for {Samuel Beckett} has {nominated for} as {Nobel Prize in Literature} ?
 SPARQL: SELECT ?value WHERE { wd:Q37327 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Samuel Beckett', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: What is the connecting line of Chulalongkorn University?
 SPARQL: select distinct ?answer where { wd:Q855730 wdt:P81 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chulalongkorn University', 'p': 'connecting line', 'o': '?x0'}

 Q: Tell me hole that contains the word d
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20204151 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hole'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is {work location} of {Ruth Bernhard} that is {end time} is {1953-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2177580 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ruth Bernhard', 'p': 'work location', 'o': '?x0', 't': '1953'}

 Q: What is the {human} for {doctoral student} of {Niels Bohr}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P185 wd:Q7085 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'doctoral student', 'o': 'Niels Bohr', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {manufacturer of} of {user} of {solar energy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40015 wdt:P1535 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manufacturer of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'solar energy', 'p': 'user', 'o': '$y0'}}

 Q: Which is {position of head of government} of {service operator} {MiG-21} ?
 SPARQL: SELECT ?answer WHERE { wd:Q150609 wdt:P137 ?X . ?X wdt:P1313 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position of head of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'MiG-21', 'p': 'operator', 'o': '$y0'}}

 Q: What is {elected in} and {end cause} of {{Ramsay MacDonald} has {position held} as {Member of the 37th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 37th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 37th Parliament of the United Kingdom'}}}]

 Q: How many {officeholder} are for {United Nations Secretary-General} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q81066 wdt:P1308 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'United Nations Secretary-General', 'p': 'officeholder', 'o': '?x0'}

 Q: what is the {point in time} for {Lorin Maazel} has {award received} as {Grammy Award for Best Opera Recording} ?
 SPARQL: SELECT ?value WHERE { wd:Q117710 p:P166 ?s . ?s ps:P166 wd:Q5593843 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lorin Maazel', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best Opera Recording'}, 't': '?x0'}

 Q: Where was Grace Hopper educated at in 1930?
 SPARQL: SELECT ?obj WHERE { wd:Q11641 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Grace Hopper', 'p': 'educated at', 'o': '?x0', 't': '1930'}

 Q: What is <sports competition competed at> of <Olympic Games> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5249 wd:Q5389}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports competition competed at', 'o': 'Olympic Games'}

 Q: Give me {heavy metal band} that {mascot} {Eddie the Head} and which that starts with {'i'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj wdt:P822 wd:Q259261 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'heavy metal band', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mascot', 'o': 'Eddie the Head'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: "Who was the sister of Henry V, the Holy Roman Emperor during his death in the year of 1101-7-27"?
 SPARQL: SELECT ?answer WHERE { wd:Q151707 wdt:P3373 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1101'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henry V', 'p': 'sister', 'o': '?x0', 't': '1101'}

 Q: When was the {official trip} for {participant} of {Emmanuel Macron}?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q3052772 . ?sbj wdt:P31 wd:Q17561488 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Emmanuel Macron', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'official trip'}}

 Q: what is the {nominee} for {Casablanca} has {nominated for} as {Academy Award for Best Original Dramatic or Comedy Score} ?
 SPARQL: SELECT ?value WHERE { wd:Q132689 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P2453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Casablanca', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Original Dramatic or Comedy Score'}}}

 Q: What political party did Chen Shui-bian belong to in 1987-02-28?
 SPARQL: SELECT ?obj WHERE { wd:Q22368 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1987')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chen Shui-bian', 'p': 'party', 'o': '?x0', 't': '1987'}

 Q: What are the coachwork type which start with the letter van
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'van')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'coachwork type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'van'}}

 Q: What is {sister} of {George W. Bush}, that has {craft} is {entrepreneur} ?
 SPARQL: SELECT ?answer WHERE { wd:Q207 wdt:P3373 ?answer . ?answer wdt:P106 wd:Q131524}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George W. Bush', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'craft', 'o': 'entrepreneur'}}

 Q: What is {member of sports team} of {Rinus Michels} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rinus Michels', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rinus Michels', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is <series> of <1> ?
 SPARQL: select distinct ?answer where { wd:Q199 wdt:P179 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '1', 'p': 'series', 'o': '?x0'}

 Q: What are the weekly newspaper  which start with the letter e
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weekly newspaper'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'é'}}

 Q: Tell me the airline that starts with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is JewAge person ID for Ludwig von Mises ?
 SPARQL: select distinct ?answer where { wd:Q84233 wdt:P4116 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ludwig von Mises', 'p': 'JewAge person ID', 'o': '?x0'}

 Q: Who is the owner of Hon Hai Precision Industry?
 SPARQL: select distinct ?answer where { wd:Q463094 wdt:P1830 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hon Hai', 'p': 'owner of', 'o': '?x0'}

 Q: What Japanese TV series has the most number of seasons and was originally aired in Japanese?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21191019 . ?ent wdt:P2437 ?obj . ?ent wdt:P364 wd:Q5287 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of seasons', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Japanese TV series', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'original language', 'o': 'Japanese'}}}

 Q: Tell me  security agency whose name has the word state in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'state')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'security agency'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'state'}}

 Q: What is <OKTMO ID> of <Tolyatti> ?
 SPARQL: select distinct ?answer where { wd:Q1341 wdt:P764 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tolyatti', 'p': 'OKTMO ID', 'o': '?x0'}

 Q: Which son of Isaac has a son named Shuah?
 SPARQL: SELECT ?answer WHERE { wd:Q671872 wdt:P22 ?answer . ?answer wdt:P40 wd:Q369850}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isaac', 'p': 'son of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'son', 'o': 'Shuah'}}

 Q: what is the {start time} for {Athens} has {country} as {Greece} ?
 SPARQL: SELECT ?value WHERE { wd:Q1524 p:P17 ?s . ?s ps:P17 wd:Q41 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Athens', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Greece'}}}

 Q: What does it mean if you are convicted of desertion?
 SPARQL: select distinct ?answer where { ?answer wdt:P1399 wd:Q633339}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'convicted of', 'o': 'desertion'}

 Q: What is the {sacred language} for {follows} of {Ancient Greek}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P155 wd:Q35497 . ?sbj wdt:P31 wd:Q839470 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'follows', 'o': 'Ancient Greek', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sacred language'}}

 Q: What is {chairperson} of {Communist Party of China} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'chairperson', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0'}}]

 Q: What is the SpeedSkatingNews.info speed skater ID for Eric Heiden?
 SPARQL: select distinct ?answer where { wd:Q311289 wdt:P3694 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eric Heiden', 'p': 'SpeedSkatingNews.info speed skater ID', 'o': '?x0'}

 Q: Was Hirohito buried in Tokyo at the Mausoleum of the First Qin Emperor?
 SPARQL: ASK WHERE { wd:Q34479 wdt:P119 wd:Q1490 . wd:Q34479 wdt:P119 wd:Q910180 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Hirohito', 'p': 'buried in', 'o': '?x0', '?x0': 'Tokyo'}, {'h': 'IS', 'v': '?x1', 's': 'Hirohito', 'p': 'buried in', 'o': '?x1', '?x1': 'Mausoleum of the First Qin Emperor'}]

 Q: What are the ring system  which start with the letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ring system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: When did Saint Vincent and the Grenadines have a population of 108150?
 SPARQL: SELECT ?value WHERE { wd:Q757 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'108150.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Saint Vincent and the Grenadines', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '108150.0'}, 't': '?x0'}

 Q: What is the antonym of the profession's field of prosecutor?
 SPARQL: SELECT ?answer WHERE { wd:Q600751 wdt:P425 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'prosecutor', 'p': "profession's field", 'o': '$y0'}}

 Q: What represents the organization of the siblings of Louis Gigante?
 SPARQL: SELECT ?answer WHERE { wd:Q6687246 wdt:P3373 ?X . ?X wdt:P1268 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'represents', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis Gigante', 'p': 'sibling', 'o': '$y0'}}

 Q: What is {member of sports team} of {Eric Cantona} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q170328 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eric Cantona', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eric Cantona', 'p': 'team', 'o': '$y0'}}]

 Q: What is {publication date} and {place of publication} of {{Pac-Man} has {publisher} as {Midway Games}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q173626 p:P123 ?s . ?s ps:P123 wd:Q149947 . ?s pq:P577 ?value1 . ?s pq:P291 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pac-Man', 'p': 'publisher', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'publisher', 'o': 'Midway Games'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'place of publication', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pac-Man', 'p': 'publisher', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'publisher', 'o': 'Midway Games'}}}]

 Q: What is SCT's HomoloGene ID?
 SPARQL: select distinct ?answer where { wd:Q14820612 wdt:P593 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'SCT', 'p': 'HomoloGene ID', 'o': '?x0'}

 Q: What what is separation process discoverer or inventor Zosimos of Panopolis  and which that starts with d
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'separation process', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discoverer or inventor', 'o': 'Zosimos of Panopolis'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Is Paul Gascoigne a member of a sports team?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q13002 wdt:P54 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Paul Gascoigne', 'p': 'team', 'o': '?x0'}

 Q: Did {Frankenstein} {characters} {Frankenstein's monster} and {Elizabeth Lavenza} ?
 SPARQL: ASK WHERE { wd:Q150827 wdt:P674 wd:Q2021531 . wd:Q150827 wdt:P674 wd:Q5363105 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Frankenstein', 'p': 'characters', 'o': '?x0', '?x0': "Frankenstein's monster"}, {'h': 'IS', 'v': '?x1', 's': 'Frankenstein', 'p': 'characters', 'o': '?x1', '?x1': 'Elizabeth Lavenza'}]

 Q: which magazine starts with z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is {place of birth} of {Monica Bellucci} that is {located in the administrative territorial entity} is {Umbria} ?
 SPARQL: SELECT ?obj WHERE { wd:Q81819 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1280 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Monica Bellucci', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Umbria'}}}

 Q: What is {participant in conflict} of {Alfred Dreyfus}, that has {venue} is {Australia and Oceania} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171826 wdt:P607 ?answer . ?answer wdt:P276 wd:Q55643}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alfred Dreyfus', 'p': 'conflict', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Australia and Oceania'}}

 Q: What is {educated at} of {Hilary Mantel} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q465700 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hilary Mantel', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hilary Mantel', 'p': 'educated at', 'o': '$y0'}}]

 Q: What treatment is Neil Diamond getting for his health issues?
 SPARQL: SELECT ?answer WHERE { wd:Q294531 wdt:P1050 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neil Diamond', 'p': 'health issue', 'o': '$y0'}}

 Q: Is the individual tax rate in Sweden 25%?
 SPARQL: ASK WHERE { wd:Q34 wdt:P2834 ?obj filter(?obj = 25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sweden', 'p': 'individual tax rate', 'o': '?x0', '?x0': '25'}

 Q: What is Léopold Sédar Senghor's Dialnet author ID?
 SPARQL: select distinct ?answer where { wd:Q154545 wdt:P1607 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Léopold Sédar Senghor', 'p': 'Dialnet author ID', 'o': '?x0'}

 Q: Which is the AFL Tables coach ID for Ron Barassi?
 SPARQL: select distinct ?answer where { wd:Q3441366 wdt:P4885 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ron Barassi', 'p': 'AFL Tables coach ID', 'o': '?x0'}

 Q: Which is possessed by spirit by spirt?
 SPARQL: select distinct ?answer where { ?answer wdt:P4292 wd:Q193291}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'possessed by spirit', 'o': 'spirit'}

 Q: When did New Hampshire have a population of 491524?
 SPARQL: SELECT ?value WHERE { wd:Q759 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'491524.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'New Hampshire', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '491524.0'}, 't': '?x0'}

 Q: Tell me political party whose name has the word veritas in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veritas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'veritas'}}

 Q: what is the {point in time} for {Alec Guinness} has {nominated for} as {Academy Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q103894 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alec Guinness', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}, 't': '?x0'}

 Q: What is the {capital} for {twinned administrative body} of {Mumbai}
 SPARQL:  select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mumbai', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: What is {culture} of {Sawda bint Zamʿa}, that has {timeline of topic} is {history of the Arabs} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1943555 wdt:P172 ?answer . ?answer wdt:P2184 wd:Q48999793}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sawda bint Zamʿa', 'p': 'culture', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timeline of topic', 'o': 'history of the Arabs'}}

 Q: Who is {executive authority} of {play} {snowboard} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2000617 wdt:P641 ?X . ?X wdt:P797 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'authority', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'snowboard', 'p': 'play', 'o': '$y0'}}

 Q: What is {electoral district} and {represents} of {{Jacinda Ardern} has {position held} as {Member of the New Zealand House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3606816 p:P39 ?s . ?s ps:P39 wd:Q18145518 . ?s pq:P768 ?value1 . ?s pq:P1268 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacinda Ardern', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the New Zealand House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'represents', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacinda Ardern', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the New Zealand House of Representatives'}}}]

 Q: What is the military rank of the colonel?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q104680 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'military rank', 'o': 'colonel'}

 Q: Which is the historical nationality for the location of Bilbao?
 SPARQL:  select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q2736168 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bilbao', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical nationality'}}

