 Q: Is the vehicle range of INS Talwar equal to 4215?
 SPARQL: ASK WHERE { wd:Q175967 wdt:P2073 ?obj filter(?obj = 4215) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'INS Talwar', 'p': 'vehicle range', 'o': '?x0', '?x0': '4215'}

 Q: Who is the competitor for Battle of Breitenfeld(1631), that has language official as Italian?
 SPARQL: SELECT ?answer WHERE { wd:Q205379 wdt:P710 ?answer . ?answer wdt:P37 wd:Q652}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Battle of Breitenfeld', 'p': 'competitor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language official', 'o': 'Italian'}}

 Q: What is Anthony van Dyck's ECARTICO person ID?
 SPARQL: select distinct ?answer where { wd:Q150679 wdt:P2915 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anthony van Dyck', 'p': 'ECARTICO person ID', 'o': '?x0'}

 Q: What are the enterprise which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6881511 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is {human population} of {place of origin} of {culinary mustard} ?
 SPARQL: SELECT ?answer WHERE { wd:Q131748 wdt:P495 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mustard', 'p': 'place of origin', 'o': '$y0'}}

 Q: Which cricket team has Mahela Jayawardene as the head coach and also starts with the letter "i"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17376093 . ?sbj wdt:P286 wd:Q2739165 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cricket team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head coach', 'o': 'Mahela Jayawardene'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: What award did Richard Meier recieve on Janurary 1, 1988?
 SPARQL: SELECT ?obj WHERE { wd:Q159612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Richard Meier', 'p': 'award', 'o': '?x0', 't': '1988'}

 Q: What is the {animated film} for {film editor} of {Hayao Miyazaki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1040 wd:Q55400 . ?sbj wdt:P31 wd:Q202866 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'film editor', 'o': 'Hayao Miyazaki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated film'}}

 Q: What is {publication date} and {publisher} of {{Christopher Hitchens} has {notable work} as {God Is Not Great}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q24596 . ?s pq:P577 ?value1 . ?s pq:P123 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'God Is Not Great'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'publisher', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'God Is Not Great'}}}]

 Q: Who authored the Second Epistle of John, equivalent to John of Patmos?
 SPARQL: SELECT ?answer WHERE { wd:Q131453 wdt:P50 ?answer . ?answer wdt:P460 wd:Q2733634}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Second Epistle of John', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'equivalent to', 'o': 'John of Patmos'}}

 Q: What is the {posture} for {different from} of {sign language}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1889 wd:Q34228 . ?sbj wdt:P31 wd:Q8514257 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'different from', 'o': 'sign language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'posture'}}

 Q: Tell me the album which has The Tourist in the tracklist and starts with the letter c?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj wdt:P658 wd:Q16639859 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'album', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tracklist', 'o': 'The Tourist'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Tell me mythical human-animal hybrid that contains the word polkan in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'polkan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythical human-animal hybrid'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'polkan'}}

 Q: What are the space observatory which start with the letter x
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space observatory'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'x'}}

 Q: Tell me the sedative that starts with the letter n
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q847705 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sedative'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is the nominal GDP of La Rioja in the year 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q5727 p:P2131 ?s . ?s ps:P2131 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'La Rioja', 'p': 'nominal GDP', 'o': '?x0', 't': '2015'}

 Q: Does the number of losses of the 1924 British Lions tour to South Africa equal 9?
 SPARQL: ASK WHERE { wd:Q3535469 wdt:P1356 ?obj filter(?obj = 9) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '1924 British Lions tour to South Africa', 'p': 'number of losses', 'o': '?x0', '?x0': '9'}

 Q: what {pupil of} {gioachino Rossini} has a {career} as a {musicologist}
 SPARQL: SELECT ?answer WHERE { wd:Q9726 wdt:P1066 ?answer . ?answer wdt:P106 wd:Q14915627}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rossini', 'p': 'pupil of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'musicologist'}}

 Q: Is the pitting resistance equivalent number of the UNS S32760 / EN 1.4501 super duplex stainless steel more than 48?
 SPARQL: ASK WHERE { wd:Q55841586 wdt:P5624 ?obj filter(?obj > 48.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'UNS S32760 / EN 1.4501 super duplex stainless steel', 'p': 'pitting resistance equivalent number', 'o': '?x0', '?x0': '48.0'}

 Q: What Lebesgue integration etymology died in 1942-7-26?
 SPARQL: SELECT ?answer WHERE { wd:Q853831 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1942'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lebesgue integration', 'p': 'etymology', 'o': '?x0', 't': '1942'}

 Q: What position is referred to by the honorific prefix "Salman of Saudi Arabia"?
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P511 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'honorific prefix', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: Who is the {human} for {professional or sports partner} of {Scott Moir}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1327 wd:Q440940 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports partner', 'o': 'Scott Moir', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the administration head quarters of the twin city of Politecnico di Milano?
 SPARQL: SELECT ?answer WHERE { wd:Q392904 wdt:P159 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Politecnico di Milano', 'p': 'head quarters', 'o': '$y0'}}

 Q: What is {has grammatical person} of {uses language} of {PewDiePie} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13423853 wdt:P1412 ?X . ?X wdt:P5110 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical person', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'PewDiePie', 'p': 'language', 'o': '$y0'}}

 Q: What is {position held} of {Helmut Schmidt} that is {start time} is {1953-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2516 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Helmut Schmidt', 'p': 'position held', 'o': '?x0', 't': '1953'}

 Q: When was A.C. Milan retired from Head coach post?
 SPARQL: SELECT ?obj WHERE { wd:Q1543 p:P286 ?s . ?s ps:P286 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'A.C. Milan', 'p': 'coach', 'o': '?x0', 't': '2016'}

 Q: what is the {valid in period} for {Aix-en-Provence} has {located in time zone} as {UTC+02:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q47465 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aix-en-Provence', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+02:00'}}}

 Q: What is the {city} for {country} of {Roman Empire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q2277 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Roman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What are the historical event which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13418847 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical event'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Does Vince Vaughn have a residence in both Lake Forest and Buffalo Grove?
 SPARQL: ASK WHERE { wd:Q107730 wdt:P551 wd:Q575355 . wd:Q107730 wdt:P551 wd:Q967086 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Vince Vaughn', 'p': 'residence', 'o': '?x0', '?x0': 'Lake Forest'}, {'h': 'IS', 'v': '?x1', 's': 'Vince Vaughn', 'p': 'residence', 'o': '?x1', '?x1': 'Buffalo Grove'}]

 Q: What is the {God} for {incarnation of} of {Jesus Christ}
 SPARQL:  select distinct ?obj where { wd:Q302 wdt:P3701 ?obj . ?obj wdt:P31 wd:Q190 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jesus', 'p': 'incarnation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'God'}}

 Q: What is the {second family name in Spanish name} and the {position played on team / speciality} of {Diego_Maradona} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q17515 wdt:P1950 ?ans_1 . wd:Q17515 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Diego Maradona', 'p': 'second family name in Spanish name', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Diego Maradona', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: When was Gian Maria Volonté awarded the Silver Bear?
 SPARQL: SELECT ?value WHERE { wd:Q317110 p:P166 ?s . ?s ps:P166 wd:Q708135 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gian Maria Volonté', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Silver Bear'}, 't': '?x0'}

 Q: What is {has translation} of {originating source} of {Lê dynasty} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10800789 wdt:P248 ?X . ?X wdt:P747 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has translation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lê dynasty', 'p': 'originating source', 'o': '$y0'}}

 Q: Does the local dialling code for Houston include the country calling code +1?
 SPARQL: SELECT ?obj WHERE { wd:Q16555 p:P473 ?s . ?s ps:P473 ?obj . ?s pq:P474 ?x filter(contains(?x,'+1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dialling code', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Houston', 'p': 'dialling code', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country calling code', 'o': '+1'}}}

 Q: what is the {start time} for {Nebraska} has {motto text} as {Equality before the law} ?
 SPARQL: SELECT ?value WHERE { wd:Q1553 p:P1451 ?s . ?s ps:P1451 ?x filter(contains(?x,'Equality before the law')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nebraska', 'p': 'motto', 'o': '$y0'}}

 Q: Which bridge is maintained by Amtrak?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P126 wd:Q23239 . ?sbj wdt:P31 wd:Q12280 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'maintained by', 'o': 'Amtrak', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bridge'}}

 Q: What is {position held} of {Eisaku Satō} that is {replaced by} is {Kaneshichi Masuda} ?
 SPARQL: SELECT ?obj WHERE { wd:Q179871 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q11429351 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eisaku Sato', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Kaneshichi Masuda'}}}

 Q: What is Catalogus Professorum Lipsiensis ID for Peter Debye?
 SPARQL: select distinct ?answer where { wd:Q103835 wdt:P3409 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Peter Debye', 'p': 'Catalogus Professorum Lipsiensis ID', 'o': '?x0'}

 Q: Which is the part which is partially coincident with the curriculum?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1382 wd:Q207137 . ?sbj wdt:P31 wd:Q15989253 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'partially coincident with', 'o': 'curriculum', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'part'}}

 Q: What is {genetic association} of {regulates (molecular biology)} of {hsa-miR-7110-3p} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27594530 wdt:P128 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hsa-miR-7110-3p', 'p': 'regulates (molecular biology)', 'o': '$y0'}}

 Q: What is the {type of language} for {used by} of {human}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1535 wd:Q5 . ?sbj wdt:P31 wd:Q20829075 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'used by', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of language'}}

 Q: What is {followed by} and {follows} of {{Maroon 5} has {award received} as {Grammy Award for Best New Artist}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q182223 p:P166 ?s . ?s ps:P166 wd:Q1453643 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maroon 5', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best New Artist'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maroon 5', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best New Artist'}}}]

 Q: Does the brother of Fatimah have a Christian name of Abdullah?
 SPARQL: SELECT ?answer WHERE { wd:Q180123 wdt:P3373 ?answer . ?answer wdt:P735 wd:Q307578}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fatimah', 'p': 'bro', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Christian name', 'o': 'Abdullah'}}

 Q: What is printed by Johannes Gutenberg ?
 SPARQL: select distinct ?answer where { ?answer wdt:P872 wd:Q8958}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'printed by', 'o': 'Johannes Gutenberg'}

 Q: What is {series} of {Twenty Thousand Leagues Under the Sea} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q183565 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Twenty Thousand Leagues Under the Sea', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Twenty Thousand Leagues Under the Sea', 'p': 'series', 'o': '$y0'}}]

 Q: What was the population of Fes in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q80985 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fes', 'p': 'population', 'o': '?x0', 't': '2014'}

 Q: What is {location of work} of {Heinrich Schliemann}, that has {sister city} is {Amsterdam} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57106 wdt:P937 ?answer . ?answer wdt:P190 wd:Q9899}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Heinrich Schliemann', 'p': 'location of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Amsterdam'}}

 Q: What is {elected in} and {end cause} of {{Harold Macmillan} has {position held} as {Member of the 39th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582600 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 39th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 39th Parliament of the United Kingdom'}}}]

 Q: Which is the Instagram username for One Direction?
 SPARQL: select distinct ?answer where { wd:Q146027 wdt:P2003 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'One Direction', 'p': 'Instagram username', 'o': '?x0'}

 Q: Where is the place of death of Harry Mazer's wife?
 SPARQL: SELECT ?answer WHERE { wd:Q5670943 wdt:P26 ?X . ?X wdt:P20 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harry Mazer', 'p': 'wife', 'o': '$y0'}}

 Q: Which landlocked country follows the Islam religion?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P140 wd:Q432 . ?sbj wdt:P31 wd:Q123480 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'Islam', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landlocked country'}}

 Q: what is the {replaced by} for {Ma Ying-jeou} has {position held} as {Chairperson of the Kuomintang} ?
 SPARQL: SELECT ?value WHERE { wd:Q19216 p:P39 ?s . ?s ps:P39 wd:Q16056439 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ma Ying-jeou', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chairperson of the Kuomintang'}}}

 Q: what is the {point in time} for {Ivan Bunin} has {award received} as {Pushkin Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q46602 p:P166 ?s . ?s ps:P166 wd:Q840693 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ivan Bunin', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Pushkin Prize'}, 't': '?x0'}

 Q: What is the Routard.com place ID for Arches National Park?
 SPARQL: select distinct ?answer where { wd:Q223969 wdt:P4986 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arches National Park', 'p': 'Routard.com place ID', 'o': '?x0'}

 Q: Tell me ethnolect whose name has the word perkerdansk in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q951873 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'perkerdansk')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnolect'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'perkerdansk'}}

 Q: What is the {male given name} for {given name} of {King Arthur}
 SPARQL:  select distinct ?obj where { wd:Q45792 wdt:P735 ?obj . ?obj wdt:P31 wd:Q12308941 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'King Arthur', 'p': 'given name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'male given name'}}

 Q: Is it true that the slope of El Dorado Speedway equals to 14?
 SPARQL: ASK WHERE { wd:Q16559802 wdt:P4184 ?obj filter(?obj = 14) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'El Dorado Speedway', 'p': 'slope', 'o': '?x0', '?x0': '14'}

 Q: Do the number of cylinders of the Prussian S 6 equal 2?
 SPARQL: ASK WHERE { wd:Q316791 wdt:P1100 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Prussian S 6', 'p': 'number of cylinders', 'o': '?x0', '?x0': '2'}

 Q: which language that starts with u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What character role did cast member Burt Ward play in Batman?
 SPARQL: SELECT ?value WHERE { wd:Q1247201 p:P161 ?s . ?s ps:P161 wd:Q537747 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'character role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Batman', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Burt Ward'}}}

 Q: what is the {point in time} for {Tony Bennett} has {award received} as {Grammy Lifetime Achievement Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q296729 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tony Bennett', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Lifetime Achievement Award'}, 't': '?x0'}

 Q: What is JSTOR journal code for Foreign Affairs ?
 SPARQL: select distinct ?answer where { wd:Q1135577 wdt:P1230 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Foreign Affairs', 'p': 'JSTOR journal code', 'o': '?x0'}

 Q: Give me {economic sector} that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic sector'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: When did member of sports team of John Charles and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Charles', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Charles', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Planet Nine is the parent astronomical body of what Population I star?
 SPARQL:  select distinct ?obj where { wd:Q22133699 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3592493 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Planet Nine', 'p': 'parent astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Population I star'}}

 Q: What is {state headed by} of {is in the town of} of {Caraga} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13704 wdt:P131 ?X . ?X wdt:P35 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'state headed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Caraga', 'p': 'town', 'o': '$y0'}}

 Q: what is the {end cause} for {Dario Fo} has {spouse} as {Franca Rame} ?
 SPARQL: SELECT ?value WHERE { wd:Q765 p:P26 ?s . ?s ps:P26 wd:Q444509 . ?s pq:P1534 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dario Fo', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Franca Rame'}}}

 Q: what is the {end time} for {Shirley Temple} has {position held} as {United States Ambassador to Ghana} ?
 SPARQL: SELECT ?value WHERE { wd:Q182580 p:P39 ?s . ?s ps:P39 wd:Q7889302 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shirley Temple', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States Ambassador to Ghana'}}}

 Q: When did Bremen lose territory in the year 1949?
 SPARQL: SELECT ?obj WHERE { wd:Q1209 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1949')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bremen', 'p': 'in', 'o': '?x0', 't': '1949'}

 Q: what is the {number of points/goals/set scored} for {David Campese} has {member of sports team} as {Australia national rugby union team} ?
 SPARQL: SELECT ?value WHERE { wd:Q1173922 p:P54 ?s . ?s ps:P54 wd:Q622443 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Campese', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Australia national rugby union team'}}}

 Q: what is the {for work} for {John Barry} has {award received} as {Academy Award for Best Original Score, no Musical} ?
 SPARQL: SELECT ?value WHERE { wd:Q111074 p:P166 ?s . ?s ps:P166 wd:Q22752734 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Barry', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Original Score, no Musical'}}}

 Q: Did {influenza} {genetic association} {SLC15A1} and {COL28A1} ?
 SPARQL: ASK WHERE { wd:Q2840 wdt:P2293 wd:Q18031564 . wd:Q2840 wdt:P2293 wd:Q18055395 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'influenza', 'p': 'genetic association', 'o': '?x0', '?x0': 'SLC15A1'}, {'h': 'IS', 'v': '?x1', 's': 'influenza', 'p': 'genetic association', 'o': '?x1', '?x1': 'COL28A1'}]

 Q: Is the orbital eccentricity of Desdemona more than 0.000156?
 SPARQL: ASK WHERE { wd:Q15637 wdt:P1096 ?obj filter(?obj > 0.000156) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Desdemona', 'p': 'orbital eccentricity', 'o': '?x0', '?x0': '0.000156'}

 Q: What is {co-founded by} of {member of} of {Gianfranco Sanguinetti} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3105216 wdt:P463 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianfranco Sanguinetti', 'p': 'member of', 'o': '$y0'}}

 Q: Tell me logographic writing system whose name has the word script in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3953107 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'script')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'logographic writing system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'script'}}

 Q: What is the {medication} for {drug used for treatment} of {mental disorder}
 SPARQL:  select distinct ?obj where { wd:Q12135 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mental disorder', 'p': 'used for treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medication'}}

 Q: What is {has moon} of {parent body} of {Ring Nebula} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13969 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has moon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ring Nebula', 'p': 'parent body', 'o': '$y0'}}

 Q: What is {sister} of {child of} of {Charles de Valois, Duke of Angoulême} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1066613 wdt:P22 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles de Valois, Duke of Angoulême', 'p': 'child of', 'o': '$y0'}}

 Q: What is {sister city} of {birth place} of {Lisa Nowak} ?
 SPARQL: SELECT ?answer WHERE { wd:Q49264 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lisa Nowak', 'p': 'birth place', 'o': '$y0'}}

 Q: What is {genetic association} of {murder method} of {Alexander Woollcott} ?
 SPARQL: SELECT ?answer WHERE { wd:Q361859 wdt:P509 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Woollcott', 'p': 'murder method', 'o': '$y0'}}

 Q: Which family member of Luca Signorelli is a writer by profession? 

Name the family member of Luca Signorelli who is a writer by profession. 

Which of Luca Signorelli's relatives has a career in writing? 

Who is the relative of Luca Signorelli who has a career in writing?
 SPARQL: SELECT ?answer WHERE { wd:Q7031 wdt:P1038 ?answer . ?answer wdt:P106 wd:Q36180}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Luca Signorelli', 'p': 'relative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'profession', 'o': 'writer'}}

 Q: what is the {character role} for {ER} has {cast member} as {Noah Wyle} ?
 SPARQL: SELECT ?value WHERE { wd:Q207375 p:P161 ?s . ?s ps:P161 wd:Q315208 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ER', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Noah Wyle'}}}

