 Q: Does the degree of relation of a great grandfather equal 3.6?
 SPARQL: ASK WHERE { wd:Q2500621 wdt:P4500 ?obj filter(?obj = 3.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'great grandfather', 'p': 'family relationship degree', 'o': '?x0', '?x0': '3.6'}

 Q: What is {nominated for} of {Saint-John Perse} that is {point in time} is {1955-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q132684 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1955')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saint-John Perse', 'p': 'nominated for', 'o': '?x0', 't': '1955'}

 Q: which type of quantum particle that interaction  gravity starts with q
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22675015 . ?sbj wdt:P517 wd:Q11412 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'q')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'interaction', 'o': 'gravity'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'q'}}

 Q: Which is the honorific for the officeholder of Salman of Saudi Arabia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q1326966 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Salman of Saudi Arabia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'honorific'}}

 Q: What is {media} of {has product} of {In-N-Out Burger} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1205312 wdt:P1056 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'media', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'In-N-Out Burger', 'p': 'has product', 'o': '$y0'}}

 Q: What is <streaming media URL> of <Bjarne Stroustrup> ?
 SPARQL: select distinct ?answer where { wd:Q92620 wdt:P963 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bjarne Stroustrup', 'p': 'streaming media URL', 'o': '?x0'}

 Q: Does Seth's husband have sons?
 SPARQL: SELECT ?answer WHERE { wd:Q131795 wdt:P26 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seth', 'p': 'husband', 'o': '$y0'}}

 Q: What is {time of discovery or invention} and {discoverer or inventor} of {{Pan} has {uses} as {physical object}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q80174 p:P2283 ?s . ?s ps:P2283 wd:Q223557 . ?s pq:P575 ?value1 . ?s pq:P61 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discovered', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pan', 'p': 'uses', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'uses', 'o': 'object'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'discoverer or inventor', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pan', 'p': 'uses', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'uses', 'o': 'object'}}}]

 Q: Give me {political party} that {political ideology} {nationalism} and which contains the word {patriots} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj wdt:P1142 wd:Q6235 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'patriots')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'political ideology', 'o': 'nationalism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'patriots'}}

 Q: What is the {mortality rate} with the {MIN(incidence)} whose {location} is {Finland}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q58702 . ?ent wdt:P2844 ?obj . ?ent wdt:P276 wd:Q33} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'incidence', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mortality rate', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Finland'}}}

 Q: tell me  me award that conferred by {National Academy of Television Arts and Sciences  starts with letter a
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q618779 . ?sbj wdt:P1027 wd:Q2822443 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'conferred by', 'o': 'National Academy of Television Arts and Sciences'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: What is {has cities} of {Central Europe}, that has {correspondence at} is {National Archives} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27509 wdt:P150 ?answer . ?answer wdt:P485 wd:Q6970414}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Central Europe', 'p': 'has cities', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'correspondence at', 'o': 'National Archives'}}

 Q: Is the Bengali writing system Arabic script and Kolezhuthu?
 SPARQL: ASK WHERE { wd:Q9610 wdt:P282 wd:Q1828555 . wd:Q9610 wdt:P282 wd:Q6427218 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bengali', 'p': 'writing system', 'o': '?x0', '?x0': 'Arabic'}, {'h': 'IS', 'v': '?x1', 's': 'Bengali', 'p': 'writing system', 'o': '?x1', '?x1': 'Kolezhuthu'}]

 Q: What is {has daughter} of {James VII and II}, that has {is son of} is {Anne Hyde} ?
 SPARQL: SELECT ?answer WHERE { wd:Q126188 wdt:P40 ?answer . ?answer wdt:P25 wd:Q145609}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'James VII', 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'son of', 'o': 'Anne Hyde'}}

 Q: What is {prize money} and {together with} of {{Mairead Maguire} has {award received} as {Nobel Peace Prize}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q157655 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mairead Maguire', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Peace Prize'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mairead Maguire', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Peace Prize'}}}]

 Q: Who is the chief executive officer of Hewlett-Packard?
 SPARQL: select distinct ?answer where { wd:Q80978 wdt:P169 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hewlett-Packard', 'p': 'chief executive officer', 'o': '?x0'}

 Q: What is <Mutopia composer ID> of <Niccolò Paganini> ?
 SPARQL: select distinct ?answer where { wd:Q66075 wdt:P3674 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Niccolo Paganini', 'p': 'Mutopia composer ID', 'o': '?x0'}

 Q: Was Ramadan followed by Eid al-adha?
 SPARQL: ASK WHERE { wd:Q41662 wdt:P156 wd:Q514400 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ramadan', 'p': 'followed by', 'o': '?x0', '?x0': 'id al-adha'}]

 Q: How many {approved by} are for {Iraq War} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q545449 wdt:P790 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Iraq War', 'p': 'approved by', 'o': '?x0'}

 Q: What are theheavy equipment which start with the letter tractor
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q874311 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tractor')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'heavy equipment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tractor'}}

 Q: What is David Beckham's MLS player ID?
 SPARQL: select distinct ?answer where { wd:Q10520 wdt:P2398 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Beckham', 'p': 'MLS player ID', 'o': '?x0'}

 Q: What is {disease treated} of {epinephrine}, that has {medical speciality} is {infectious disease} ?
 SPARQL: SELECT ?answer WHERE { wd:Q132621 wdt:P2175 ?answer . ?answer wdt:P1995 wd:Q788926}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'epinephrine', 'p': 'disease treated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'medical speciality', 'o': 'infectious disease'}}

 Q: Is the cash of the Delta Air Lines more than 2313600000.0?
 SPARQL: ASK WHERE { wd:Q188920 wdt:P2232 ?obj filter(?obj > 2313600000.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Delta Air Lines', 'p': 'cash', 'o': '?x0', '?x0': '2313600000.0'}

 Q: what is the {series ordinal} for {J. Robert Oppenheimer} has {given name} as {Julius} ?
 SPARQL: SELECT ?value WHERE { wd:Q132537 p:P735 ?s . ?s ps:P735 wd:Q1102114 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Oppenheimer', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Julius'}}}

 Q: How many {season of club or team} are to/by {Toronto Argonauts} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P5138 wd:Q142349 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'season of club or team', 'o': 'Toronto Argonauts'}

 Q: What is the {film} for {executive producer} of {Hayao Miyazaki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1431 wd:Q55400 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'executive producer', 'o': 'Hayao Miyazaki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: what is the {end time} for {Lucille Ball} has {spouse} as {Gary Morton} ?
 SPARQL: SELECT ?value WHERE { wd:Q209662 p:P26 ?s . ?s ps:P26 wd:Q5525629 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divorced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lucille Ball', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Gary Morton'}}}

 Q: What is {film starring} of {fork of} of {Starfleet Academy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55169598 wdt:P144 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starring', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Starfleet Academy', 'p': 'fork of', 'o': '$y0'}}

 Q: What is the {fictional human} for {narrator} of {On the Road}
 SPARQL:  select distinct ?obj where { wd:Q743180 wdt:P2438 ?obj . ?obj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'On the Road', 'p': 'narrator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional human'}}

 Q: What is {recurring event} of {New Year's Day}, that has {prequel is} is {January 0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q196627 wdt:P837 ?answer . ?answer wdt:P155 wd:Q12481}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "New Year's Day", 'p': 'recurring event', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prequel is', 'o': 'January 0'}}

 Q: What is the position held by Benito Pérez Galdós whose electoral district is Guayama?
 SPARQL: SELECT ?obj WHERE { wd:Q189869 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q1870997 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benito Pérez Galdós', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'electoral district', 'o': 'Guayama'}}}

 Q: Did {Pi} {different from} {Π}?
 SPARQL: ASK WHERE { wd:Q167 wdt:P1889 wd:Q168 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Pi', 'p': 'different from', 'o': '?x0', '?x0': 'Pi'}]

 Q: Which is the sRGB color hex triplet for Cambrian?
 SPARQL: select distinct ?answer where { wd:Q79064 wdt:P465 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cambrian', 'p': 'sRGB color hex triplet', 'o': '?x0'}

 Q: Is the patronage of the Guiuan Airport equal to 1.2?
 SPARQL: ASK WHERE { wd:Q301648 wdt:P3872 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Guiuan Airport', 'p': 'patronage', 'o': '?x0', '?x0': '1.2'}

 Q: What is the {translation} for {edition or translation of} of {Hamlet}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P629 wd:Q41567 . ?sbj wdt:P31 wd:Q39811647 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition or translation of', 'o': 'Hamlet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'translated'}}

 Q: Who is the member of sports team of John Charles who started at 1950-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1950')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Charles', 'p': 'member of sports team', 'o': '?x0', 't': '1950'}

 Q: What is the {general election} with the {MAX(ballots cast)} whose {successful candidate} is {Thomas Playford}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1076105 . ?ent wdt:P1868 ?obj . ?ent wdt:P991 wd:Q528382 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ballots cast', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'general election', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'successful candidate', 'o': 'Thomas Playford'}}}

 Q: What is {position held} of {Alain Poher} that is {start time} is {1974-4-3} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12950 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alain Poher', 'p': 'position held', 'o': '?x0', 't': '1974'}

 Q: What is {twin cities} of {location born} of {Prince Aloys Franz de Paula Maria} ?
 SPARQL: SELECT ?answer WHERE { wd:Q85538 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin cities', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Prince Aloys Franz de Paula Maria', 'p': 'location born', 'o': '$y0'}}

 Q: Tell me which is the athletic conference which contains the word north in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2992826 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'north')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'athletic conference'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'north'}}

 Q: What is the {cause of death} and the {place of birth} of {Ansel_Adams} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q60809 wdt:P509 ?ans_1 . wd:Q60809 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Ansel Adams', 'p': 'cause of death', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Ansel Adams', 'p': 'place of birth', 'o': '?x1'}]
