 Q: what is the {located on terrain feature} for {Honshu} has {coordinates of easternmost point} as {39.533333333333 142.06666666667} ?
 SPARQL: SELECT ?value WHERE { wd:Q13989 p:P1334 ?s . ?s ps:P1334 ?x filter(contains(?x,'39.533333333333 142.06666666667')) . ?s pq:P706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honshu', 'p': 'coordinates of easternmost point', 'o': '$y0'}}

 Q: Which is Models.com person ID for Viola Davis?
 SPARQL: select distinct ?answer where { wd:Q229181 wdt:P2471 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Viola Davis', 'p': 'Models.com person ID', 'o': '?x0'}

 Q: what is the {end time} for {The Daily Show} has {cast member} as {Rachael Harris} ?
 SPARQL: SELECT ?value WHERE { wd:Q824192 p:P161 ?s . ?s ps:P161 wd:Q267400 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Daily Show', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Rachael Harris'}}}

 Q: What is {architecture firm} of {home water} of {Boston Celtics} ?
 SPARQL: SELECT ?answer WHERE { wd:Q131371 wdt:P115 ?X . ?X wdt:P84 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'architect', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boston Celtics', 'p': 'home water', 'o': '$y0'}}

 Q: what is the {valid in period} for {Oxford} has {located in time zone} as {Western European Time} ?
 SPARQL: SELECT ?value WHERE { wd:Q34217 p:P421 ?s . ?s ps:P421 wd:Q843589 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oxford', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'Western European Time'}}}

 Q: What is {eponym} of {becquerel}, that has {honorary title} is {Nobel Prize in Physics} ?
 SPARQL: SELECT ?answer WHERE { wd:Q102573 wdt:P138 ?answer . ?answer wdt:P166 wd:Q38104}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'becquerel', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'honorary title', 'o': 'Nobel Prize in Physics'}}

 Q: What is the award received by Amnesty International and the amount of the prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amnesty International', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amnesty International', 'p': 'award received', 'o': '$y0'}}]

 Q: What is the characters of the appears in of Stacy Warner ?
 SPARQL: SELECT ?answer WHERE { wd:Q2737645 wdt:P1441 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stacy Warner', 'p': 'appears in', 'o': '$y0'}}

 Q: Which monetary authority on the Singapore dollar has the lowest target interest rate ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q6899005 . ?ent wdt:P2661 ?obj . ?ent wdt:P38 wd:Q190951} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'target interest rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monetary authority', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Singapore dollar'}}}

 Q: What is {end time} and {start time} of {{Ruhollah Khomeini} has {position held} as {Supreme Leader of Iran}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q38823 p:P39 ?s . ?s ps:P39 wd:Q332486 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruhollah Khomeini', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Supreme Leader of Iran'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruhollah Khomeini', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Supreme Leader of Iran'}}}]

 Q: What is the {discoverer or inventor} and the {named after} of {Titanium} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P61 ?ans_1 . wd:Q716 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Ti', 'p': 'discoverer or inventor', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Ti', 'p': 'named after', 'o': '?x1'}]

 Q: What is <water as percent of area> of <Kentucky> ?
 SPARQL: select distinct ?answer where { wd:Q1603 wdt:P2927 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kentucky', 'p': 'water as percent of area', 'o': '?x0'}

 Q: Which Soyuz-T has the largest periapsis?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2637056 . ?ent wdt:P2244 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'periapsis', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Soyuz-T'}}

 Q: Who is the director of photography of Persona?
 SPARQL: select distinct ?answer where { wd:Q695255 wdt:P344 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Persona', 'p': 'director of photography', 'o': '?x0'}

 Q: What is {position held} of {Ahmad ibn Ibrihim al-Ghazi} that is {start time} is {1526-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q335728 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1526')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ahmad ibn Ibrihim al-Ghazi', 'p': 'position held', 'o': '?x0', 't': '1526'}

 Q: What is {educated at} of {Xi Jinping} that is {start time} is {1975-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q15031 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Xi Jinping', 'p': 'educated at', 'o': '?x0', 't': '1975'}

 Q: When is Louis Leakey received award of Hubbard Medal
 SPARQL: SELECT ?value WHERE { wd:Q14837 p:P166 ?s . ?s ps:P166 wd:Q4287207 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Louis Leakey', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Hubbard Medal'}, 't': '?x0'}

 Q: What is {died in} of {John Nevil Maskelyne}, that has {twin cities} is {Buenos Aires} ?
 SPARQL: SELECT ?answer WHERE { wd:Q965961 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1486}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Nevil Maskelyne', 'p': 'died in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Buenos Aires'}}

 Q: Who is the head of government of Delaware?
 SPARQL: select distinct ?answer where { wd:Q1393 wdt:P6 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Delaware', 'p': 'head of government', 'o': '?x0'}

 Q: Is Gwen Stefani's given name Belinda?
 SPARQL: ASK WHERE { wd:Q483379 wdt:P735 wd:Q1094239 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Gwen Stefani', 'p': 'given name', 'o': '?x0', '?x0': 'Belinda'}]

 Q: what is the {end time} for {Pedro Martinez} has {member of sports team} as {Boston Red Sox} ?
 SPARQL: SELECT ?value WHERE { wd:Q726918 p:P54 ?s . ?s ps:P54 wd:Q213959 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro Martinez', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Boston Red Sox'}}}

 Q: What award did Susan Sarandon receive in the year 1994?
 SPARQL: SELECT ?obj WHERE { wd:Q133050 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Susan Sarandon', 'p': 'award', 'o': '?x0', 't': '1994'}

 Q: what is the {point in time} for {James Prescott Joule} has {award received} as {Albert Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q8962 p:P166 ?s . ?s ps:P166 wd:Q4710826 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'James Prescott Joule', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Albert Medal'}, 't': '?x0'}

 Q: What is {on bay} of {Tsushima Island}, that has {tributary} is {Iwaki River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q52051 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5359180}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tsushima Island', 'p': 'on bay', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Iwaki River'}}

 Q: what is the {start time} for {Lucas Cranach the Elder} has {work location} as {Vienna} ?
 SPARQL: SELECT ?value WHERE { wd:Q191748 p:P937 ?s . ?s ps:P937 wd:Q1741 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lucas Cranach', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'Vienna'}}}

 Q: Did {Prince_George_of_Cambridge} {relative} {Charles, Prince of Wales} and {Pippa Middleton} ?
 SPARQL: ASK WHERE { wd:Q13590412 wdt:P1038 wd:Q43274 . wd:Q13590412 wdt:P1038 wd:Q232465 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Prince George of Cambridge', 'p': 'relative', 'o': '?x0', '?x0': 'Charles, Prince of Wales'}, {'h': 'IS', 'v': '?x1', 's': 'Prince George of Cambridge', 'p': 'relative', 'o': '?x1', '?x1': 'Pippa Middleton'}]

 Q: What is at the extreme point deepest of Guatemala, whose tributary is Riviere de Cavaillon?
 SPARQL: SELECT ?answer WHERE { wd:Q774 wdt:P1589 ?answer . ?answer wdt:P974 wd:Q7338932}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guatemala', 'p': 'extreme point deepest', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Riviere de Cavaillon'}}

 Q: What is Sanskrit's writing system?
 SPARQL: select distinct ?answer where { wd:Q11059 wdt:P282 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sanskrit', 'p': 'writing system', 'o': '?x0'}

 Q: What is {year established} of {developed by} of {Grand Theft Auto} ?
 SPARQL: SELECT ?answer WHERE { wd:Q132730 wdt:P178 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grand Theft Auto', 'p': 'developed by', 'o': '$y0'}}

 Q: What is {performer} of {Samus Aran} that is {language of work or name} is {Japanese} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12400 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P407 wd:Q5287 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'performer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Samus Aran', 'p': 'performer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'Japanese'}}}

 Q: What is {position held} of {Arthur Henderson} that is {replaces} is {Austen Chamberlain} ?
 SPARQL: SELECT ?obj WHERE { wd:Q208665 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q188999 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Henderson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Austen Chamberlain'}}}

 Q: What is {cat films shot} of {narrative set in} of {One Flew Over the Cuckoo's Nest} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171669 wdt:P840 ?X . ?X wdt:P1740 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cat films shot', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "One Flew Over the Cuckoo's Nest", 'p': 'narrative set in', 'o': '$y0'}}

 Q: Which is the soft drink, manufactured by the Coca Cola Company?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q3295867 . ?sbj wdt:P31 wd:Q147538 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufactured by', 'o': 'Coca Cola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'soft drink'}}

 Q: Which is the shooting handedness for Mario Lemieux?
 SPARQL: select distinct ?answer where { wd:Q316249 wdt:P423 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mario Lemieux', 'p': 'shooting handedness', 'o': '?x0'}

 Q: Who has the daughter and son of Aglaé Auguié ?
 SPARQL: SELECT ?answer WHERE { wd:Q2826888 wdt:P40 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aglaé Auguié', 'p': 'son', 'o': '$y0'}}

 Q: What's the capital of Ōtsu?
 SPARQL: select distinct ?answer where { ?answer wdt:P36 wd:Q202907}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Ōtsu'}

 Q: Which is a Index Fungorum ID of Neurospora crassa?
 SPARQL: select distinct ?answer where { wd:Q133459 wdt:P1391 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Neurospora crassa', 'p': 'Index Fungorum ID', 'o': '?x0'}

 Q: Was Srinivasa Ramanujan's field of work number theory?
 SPARQL: ASK WHERE { wd:Q83163 wdt:P101 wd:Q12479 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Srinivasa Ramanujan', 'p': 'field of work', 'o': '?x0', '?x0': 'number theory'}]

 Q: What is the {position played on team / speciality} and the {participant of} of {Isiah_Thomas} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q298512 wdt:P413 ?ans_1 . wd:Q298512 wdt:P1344 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Isiah Thomas', 'p': 'position played on team / speciality', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Isiah Thomas', 'p': 'participant of', 'o': '?x1'}]

 Q: What is {has immediate outcome} of {originated due to} of {Silvertown explosion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3960716 wdt:P828 ?X . ?X wdt:P1536 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'immediate outcome', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Silvertown explosion', 'p': 'due to', 'o': '$y0'}}

 Q: What are the chemical phenomenon which start with the letter corrosion
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3382117 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'corrosion')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical phenomenon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'corrosion'}}

 Q: What's the currency for the Ryukyu Kingdom?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q28025 wdt:P38 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Ryukyu Kingdom', 'p': 'currency', 'o': '?x0'}

 Q: what is the {ticker symbol} for {NEC} has {stock exchange} as {Nagoya Stock Exchange} ?
 SPARQL: SELECT ?value WHERE { wd:Q219203 p:P414 ?s . ?s ps:P414 wd:Q1188840 . ?s pq:P249 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ticker symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'NEC', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'stock exchange', 'o': 'Nagoya Stock Exchange'}}}

 Q: Did {Lionel_Richie} {occupation} {singer} and {Alexander Osminin} ?
 SPARQL: ASK WHERE { wd:Q26695 wdt:P106 wd:Q177220 . wd:Q26695 wdt:P106 wd:Q620773 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lionel Richie', 'p': 'occupation', 'o': '?x0', '?x0': 'singer'}, {'h': 'IS', 'v': '?x1', 's': 'Lionel Richie', 'p': 'occupation', 'o': '?x1', '?x1': 'Alexander Osminin'}]

 Q: Was Rafael Nadal nominated for Best Male Athlete ESPY Award?
 SPARQL: ASK WHERE { wd:Q10132 wdt:P1411 wd:Q4896724 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Rafael Nadal', 'p': 'nominated for', 'o': '?x0', '?x0': 'Best Male Athlete ESPY Award'}]

 Q: What is the {legal form} and the {located in the administrative territorial entity} of {Intel} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q248 wdt:P1454 ?ans_1 . wd:Q248 wdt:P131 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Intel', 'p': 'legal form', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Intel', 'p': 'in', 'o': '?x1'}]

 Q: When did John Wooden receive the Sports Illustrated Sportsperson of the Year award?
 SPARQL: SELECT ?value WHERE { wd:Q551032 p:P166 ?s . ?s ps:P166 wd:Q1653207 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'John Wooden', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Sports Illustrated Sportsperson of the Year'}, 't': '?x0'}

 Q: What is {place of burial} of {František Kupka} that is {catalog code} is {22696} ?
 SPARQL: SELECT ?obj WHERE { wd:Q167414 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P528 ?x filter(contains(?x,'22696')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of burial', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frantisek Kupka', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'catalog code', 'o': '22696'}}}

 Q: Which is the IUCN conservation status for Equus ferus przewalskii?
 SPARQL: select distinct ?answer where { wd:Q22712 wdt:P141 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Equus ferus przewalskii', 'p': 'IUCN conservation status', 'o': '?x0'}

 Q: What is {birth location} of {Arnold Rothstein}, that has {head of national government} is {Ardolph L. Kline} ?
 SPARQL: SELECT ?answer WHERE { wd:Q696052 wdt:P19 ?answer . ?answer wdt:P6 wd:Q4121154}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arnold Rothstein', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head of national government', 'o': 'Ardolph L. Kline'}}

 Q: What is the {principal organ of the United Nations} for {office held by head of the organisation} of {United Nations Secretary-General}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2388 wd:Q81066 . ?sbj wdt:P31 wd:Q15899789 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'United Nations Secretary-General', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'principal organ of the United Nations'}}

 Q: What is the number of manufacturers held by Daimler AG?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P176 wd:Q27530 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'Daimler AG'}

 Q: What is the {data set} for {currency} of {renminbi}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q39099 . ?sbj wdt:P31 wd:Q1172284 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'renminbi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'data set'}}

 Q: what is the {start time} for {Rennes} has {head of government} as {Henri Fréville} ?
 SPARQL: SELECT ?value WHERE { wd:Q647 p:P6 ?s . ?s ps:P6 wd:Q3131134 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rennes', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Henri Fréville'}}}

 Q: What is the {architectural structure} for {residence} of {Walter Scott}
 SPARQL:  select distinct ?obj where { wd:Q79025 wdt:P551 ?obj . ?obj wdt:P31 wd:Q811979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Walter Scott', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'architectural structure'}}

 Q: Who is the regulatory body of the official language of the Republic of Venice?
 SPARQL: SELECT ?answer WHERE { wd:Q4948 wdt:P37 ?X . ?X wdt:P1018 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'regulatory body', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Republic of Venice', 'p': 'official language', 'o': '$y0'}}

 Q: Which is the taxonomic type for Papilionidae?
 SPARQL: select distinct ?answer where { wd:Q59905 wdt:P427 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Papilionidae', 'p': 'taxonomic type', 'o': '?x0'}

 Q: What is {start time} and {end time} of {{Kim Novak} has {spouse} as {Richard Johnson}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q212879 p:P26 ?s . ?s ps:P26 wd:Q166422 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kim Novak', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Richard Johnson'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kim Novak', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Richard Johnson'}}}]

 Q: Chris Froome has how many points classifications?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3494 wd:Q319591 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'points classification', 'o': 'Chris Froome'}

 Q: Who is the {human} for {chief executive officer} of {Ford Motor Company}
 SPARQL:  select distinct ?obj where { wd:Q44294 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ford Motor Company', 'p': 'chief executive officer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is character role of Turandot ?
 SPARQL: select distinct ?answer where { ?answer wdt:P453 wd:Q207990}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'character role', 'o': 'Turandot'}

 Q: What is the {abjad} for {writing system} of {Hebrew}
 SPARQL:  select distinct ?obj where { wd:Q9288 wdt:P282 ?obj . ?obj wdt:P31 wd:Q185087 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hebrew', 'p': 'writing system', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abjad'}}

 Q: What is {educated at} of {Wilhelm Röntgen} that is {start time} is {1872-4-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q35149 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1872')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wilhelm Röntgen', 'p': 'education', 'o': '?x0', 't': '1872'}

 Q: What is {orbits} of {Dione}, that has {has moon} is {Mimas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15040 wdt:P397 ?answer . ?answer wdt:P398 wd:Q15034}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dione', 'p': 'orbits', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has moon', 'o': 'Mimas'}}

 Q: Tell me bell tower whose name has the word tower in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200334 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tower')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bell tower'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tower'}}

 Q: What island is farthest from the river mouth?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23442 . ?ent wdt:P2148 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'distance from river mouth', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'island'}}

 Q: What award did Bob Cousy receive in 1961?
 SPARQL: SELECT ?obj WHERE { wd:Q312643 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bob Cousy', 'p': 'award', 'o': '?x0', 't': '1961'}

 Q: what is the {coordinate location} for {National Aeronautics and Space Administration} has {headquarters location} as {Washington, D.C.} ?
 SPARQL: SELECT ?value WHERE { wd:Q23548 p:P159 ?s . ?s ps:P159 wd:Q61 . ?s pq:P625 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'National Aeronautics and Space Administration', 'p': 'headquarters location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'headquarters location', 'o': 'Washington, D.C.'}}}

 Q: What genre is the work of Sylvain Guyot?
 SPARQL: SELECT ?answer WHERE { wd:Q3665127 wdt:P800 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvain Guyot', 'p': 'work', 'o': '$y0'}}

 Q: What are the international parliament which start with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international parliament'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: Which is the periodical literature that has the edition of Rolling Stone?
 SPARQL:  select distinct ?obj where { wd:Q33511 wdt:P747 ?obj . ?obj wdt:P31 wd:Q1002697 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rolling Stone', 'p': 'edition', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'periodical'}}

 Q: What is the {Wikimedia list article} for {list of monuments} of {Paris}
 SPARQL:  select distinct ?obj where { wd:Q90 wdt:P1456 ?obj . ?obj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paris', 'p': 'list of monuments', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'list'}}

 Q: How many parent peaks does Ben Nevis have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3137 wd:Q104674 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'parent peak', 'o': 'Ben Nevis'}

 Q: What is {chief executive officer} of {BNP Paribas} that is {start time} is {2011-12-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q499707 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'BNP Paribas', 'p': 'chief executive officer', 'o': '?x0', 't': '2011'}

 Q: Is Lucille Ball a child of Desi Arnaz, Jr.?
 SPARQL: ASK WHERE { wd:Q209662 wdt:P40 wd:Q324882 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lucille Ball', 'p': 'child', 'o': '?x0', '?x0': 'Desi Arnaz, Jr.'}]

 Q: Who gave the  {has states} of {deathplace} of {Pyotr Zakharov-Chechenets} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2366448 wdt:P20 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has states', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pyotr Zakharov-Chechenets', 'p': 'deathplace', 'o': '$y0'}}

 Q: Who is the  {Wikidata qualifier} for {subject item of this property} of {syntax}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1629 wd:Q37437 . ?sbj wdt:P31 wd:Q15720608 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'item', 'o': 'syntax', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikidata qualifier'}}

 Q: What is {diplomatic relation} of {citizenship} of {Ajay Devgan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q146929 wdt:P27 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ajay Devgan', 'p': 'citizenship', 'o': '$y0'}}

 Q: What is the {federal state} for {country} of {Watergate scandal}
 SPARQL:  select distinct ?obj where { wd:Q42761 wdt:P17 ?obj . ?obj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Watergate scandal', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: What is the {archaeological site} for {place of death} of {Akhenaten}
 SPARQL:  select distinct ?obj where { wd:Q81794 wdt:P20 ?obj . ?obj wdt:P31 wd:Q839954 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Akhenaten', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archaeological site'}}

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Malcolm Allison} has {member of sports team} as {Charlton Athletic F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q1383862 p:P54 ?s . ?s ps:P54 wd:Q19462 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Allison', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Charlton Athletic F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Allison', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Charlton Athletic F.C.'}}}]

 Q: what is the {point in time} for {Burt Bacharach} has {award received} as {Grammy Trustees Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q212762 p:P166 ?s . ?s ps:P166 wd:Q5593916 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Burt Bacharach', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grammy Trustees Award'}, 't': '?x0'}

 Q: What is {population} of {Valladolid} that is {determination method} is {register office} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8356 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valladolid', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'register office'}}}

 Q: What is {partner} of {Mel Gibson} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q42229 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mel Gibson', 'p': 'partner', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'partner', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mel Gibson', 'p': 'partner', 'o': '$y0'}}]

 Q: What is {co-founded by} of {label} of {Scotty McCreery} ?
 SPARQL: SELECT ?answer WHERE { wd:Q255969 wdt:P264 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Scotty McCreery', 'p': 'label', 'o': '$y0'}}

 Q: Tell me the male organ that has lymphatic drainage of the Lumbar lymph nodes and contains the word testicle in it's name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25553355 . ?sbj wdt:P2288 wd:Q1662950 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'testicle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'male organ', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'lymphatic drainage', 'o': 'Lumbar lymph nodes'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'testicle'}}

 Q: Is 275-9-0 the end time for the position held by Aurelian?
 SPARQL: SELECT ?obj WHERE { wd:Q46780 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(?x,'275-9-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aurelian', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end time', 'o': '275-9-0'}}}

 Q: What is the {sovereign state} for {narrative location} of {Twenty Thousand Leagues Under the Sea}
 SPARQL:  select distinct ?obj where { wd:Q183565 wdt:P840 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Twenty Thousand Leagues Under the Sea', 'p': 'narrative location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

