 Q: Which spouse did Henry III of France have in 1589-8-2.
 SPARQL: SELECT ?obj WHERE { wd:Q53448 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1589')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henry III of France', 'p': 'spouse', 'o': '?x0', 't': '1589'}

 Q: Is the mean anomaly of the 4366 Venikagan equal to 0.58858?
 SPARQL: ASK WHERE { wd:Q153792 wdt:P2325 ?obj filter(?obj = 0.58858) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '4366 Venikagan', 'p': 'mean anomaly', 'o': '?x0', '?x0': '0.58858'}

 Q: What is the {island nation} for {currency} of {pound sterling}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q112099 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'pound sterling', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'island nation'}}

 Q: what is the {statement is subject of} for {Kosovo} has {shares border with} as {Albania} ?
 SPARQL: SELECT ?value WHERE { wd:Q1246 p:P47 ?s . ?s ps:P47 wd:Q222 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kosovo', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'border', 'o': 'Albania'}}}

 Q: What's the phase point of the critical point?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P873 wd:Q111059 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'phase point', 'o': 'critical point'}

 Q: what is the {place of marriage} for {William Blake} has {spouse} as {Catherine Blake} ?
 SPARQL: SELECT ?value WHERE { wd:Q41513 p:P26 ?s . ?s ps:P26 wd:Q5052545 . ?s pq:P2842 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Blake', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Catherine Blake'}}}

 Q: Name the capital city Aung San Suu Kyi lives in.
 SPARQL:  select distinct ?obj where { wd:Q36740 wdt:P551 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aung San Suu Kyi', 'p': 'lives in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: Has Jeremy Corbyn lived in Finsbury Park?
 SPARQL: ASK WHERE { wd:Q291169 wdt:P551 wd:Q122566 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jeremy Corbyn', 'p': 'lived in', 'o': '?x0', '?x0': 'Finsbury Park'}]

 Q: What is the zipcode William Stukeley died in?
 SPARQL: SELECT ?answer WHERE { wd:Q1381018 wdt:P20 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zipcode', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Stukeley', 'p': 'died in', 'o': '$y0'}}

 Q: What is Carly Simon's Songwriters Hall of Fame ID number?
 SPARQL: select distinct ?answer where { wd:Q181683 wdt:P4757 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carly Simon', 'p': 'Songwriters Hall of Fame ID', 'o': '?x0'}

 Q: what is the {determination method} for {hepatitis C} has {genetic association} as {DDRGK1} ?
 SPARQL: SELECT ?value WHERE { wd:Q154869 p:P2293 ?s . ?s ps:P2293 wd:Q18045902 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hepatitis C', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'DDRGK1'}}}

 Q: What is FIS cross-country skier ID for Marit Bjørgen?
 SPARQL: select distinct ?answer where { wd:Q216256 wdt:P2773 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marit Bjørgen', 'p': 'FIS cross-country skier ID', 'o': '?x0'}

 Q: What sport rewards the FIFA World Cup?
 SPARQL: select distinct ?answer where { wd:Q19317 wdt:P641 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'FIFA World Cup', 'p': 'sport', 'o': '?x0'}

 Q: What is the Neurolex ID for the parietal lobe?
 SPARQL: select distinct ?answer where { wd:Q815334 wdt:P696 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'parietal lobe', 'p': 'Neurolex ID', 'o': '?x0'}

 Q: What is {words by} of {Macarena}, that has {born as} is {Antonio Romero Márquez} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1149738 wdt:P676 ?answer . ?answer wdt:P1477 ?x FILTER(contains(?x,'Antonio Romero Márquez'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Macarena', 'p': 'words by', 'o': '?x0'}

 Q: When was Peter Zumthor awarded the Arts and Culture Prize of German Catholics?
 SPARQL: SELECT ?value WHERE { wd:Q123179 p:P166 ?s . ?s ps:P166 wd:Q1514013 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Peter Zumthor', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Arts and Culture Prize of German Catholics'}, 't': '?x0'}

 Q: what is the {point in time} for {Grateful Dead} has {award received} as {Grammy Lifetime Achievement Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q212533 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Grateful Dead', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Lifetime Achievement Award'}, 't': '?x0'}

 Q: Give me {Pavo} that contains the word {peacock} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'peacock')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Pavo'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'peacock'}}

 Q: What is Operissimo artist ID for Martina Arroyo?
 SPARQL: select distinct ?answer where { wd:Q1702112 wdt:P5366 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Martina Arroyo', 'p': 'Operissimo artist ID', 'o': '?x0'}

 Q: What is the {business} for {manufacturer} of {Commodore 64}
 SPARQL:  select distinct ?obj where { wd:Q99775 wdt:P176 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Commodore 64', 'p': 'manufacturer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is <Mackolik.com player ID> of <Ronaldo> ?
 SPARQL: select distinct ?answer where { wd:Q529207 wdt:P2458 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ronaldo', 'p': 'Mackolik.com player ID', 'o': '?x0'}

 Q: What is the pharmaceutical product for which cocaine is active ingredient?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3781 wd:Q41576 . ?sbj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'active ingredient', 'o': 'cocaine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: What is <National Library of Brazil ID> of <György Lukács> ?
 SPARQL: select distinct ?answer where { wd:Q151523 wdt:P4619 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'György Lukács', 'p': 'National Library of Brazil ID', 'o': '?x0'}

 Q: Is the production rate of Somontano the same as 144093.6
 SPARQL: ASK WHERE { wd:Q1938017 wdt:P2197 ?obj filter(?obj = 144093.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Somontano', 'p': 'production rate', 'o': '?x0', '?x0': '144093.6'}

 Q: what is the {point in time} for {John Frederick William Herschel} has {award received} as {Copley Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q14278 p:P166 ?s . ?s ps:P166 wd:Q28003 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'John Frederick William Herschel', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Copley Medal'}, 't': '?x0'}

 Q: Which inventor or discoverer with the profession of astronomer discovered 90377 Sedna?
 SPARQL: SELECT ?answer WHERE { wd:Q15610 wdt:P61 ?answer . ?answer wdt:P106 wd:Q11063}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '90377 Sedna', 'p': 'inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'profession', 'o': 'astronomer'}}

 Q: What is {voice actresses} of {part of series} of {Naked to the Limit, One More Time} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51164989 wdt:P179 ?X . ?X wdt:P725 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'voice actress', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Naked to the Limit, One More Time', 'p': 'part of series', 'o': '$y0'}}

 Q: Which mosque is named after Suleiman the Magnificent?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q8474 . ?sbj wdt:P31 wd:Q32815 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Suleiman the Magnificent', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mosque'}}

 Q: What is first described in tide with praenomen Gaius?
 SPARQL: SELECT ?answer WHERE { wd:Q23384 wdt:P61 ?answer . ?answer wdt:P2358 wd:Q5517401}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'tide', 'p': 'first described', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'praenomen', 'o': 'Gaius'}}

 Q: What association football league that starts with the letter "s" is organized by the Italian Football Federation?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991303 . ?sbj wdt:P664 wd:Q201897 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'association football league', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'organized by', 'o': 'Italian Football Federation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the {studio album} for {producer} of {David Bowie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P162 wd:Q5383 . ?sbj wdt:P31 wd:Q208569 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'producer', 'o': 'Bowie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'album'}}

 Q: "Where is the birthplace of Hugh Owen Thomas, which has the global point 53.293975° N, -4.376728° W?"
 SPARQL: SELECT ?answer WHERE { wd:Q1634494 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'53.293975 -4.376728'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hugh Owen Thomas', 'p': 'birthplace', 'o': '?x0'}

 Q: What is material used of water ?
 SPARQL: select distinct ?answer where { ?answer wdt:P186 wd:Q283}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'material used', 'o': 'water'}

 Q: What is {has towns} of {land} of {Taekyeung college} ?
 SPARQL: SELECT ?answer WHERE { wd:Q491524 wdt:P17 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has towns', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taekyeung college', 'p': 'land', 'o': '$y0'}}

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Zico} has {member of sports team} as {Kashima Antlers}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q47526 p:P54 ?s . ?s ps:P54 wd:Q16932 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of goals', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zico', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Kashima Antlers'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zico', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Kashima Antlers'}}}]

 Q: Does the argument of periapsis of 8680 Rone equal 1.080852?
 SPARQL: ASK WHERE { wd:Q644778 wdt:P2248 ?obj filter(?obj = 1.080852) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '8680 Rone', 'p': 'argument of periapsis', 'o': '?x0', '?x0': '1.080852'}

 Q: Tell me the component that has the shape of hyperboloid and starts with the letter c?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1310239 . ?sbj wdt:P1419 wd:Q505628 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'component', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shape', 'o': 'hyperboloid'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is the Turkish Football Federation player ID of Gheorghe Hagi?
 SPARQL: select distinct ?answer where { wd:Q189892 wdt:P2448 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gheorghe Hagi', 'p': 'Turkish Football Federation player ID', 'o': '?x0'}

 Q: Which is the significant event for A-League?
 SPARQL: select distinct ?answer where { ?answer wdt:P793 wd:Q219586}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'A-League'}

 Q: What {source material} is the {buff coat} {made from}?
 SPARQL: SELECT ?answer WHERE { wd:Q3373195 wdt:P186 ?X . ?X wdt:P1582 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'buff coat', 'p': 'made from', 'o': '?x0'}

 Q: Who are the children of Jens Breivik's husband?
 SPARQL: SELECT ?answer WHERE { wd:Q19376205 wdt:P26 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jens Breivik', 'p': 'husband', 'o': '$y0'}}

 Q: What is {number of out of school children} of {Central Asia} that is {point in time} is {2007-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q27275 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Central Asia', 'p': 'number of out of school children', 'o': '?x0', 't': '2007'}

 Q: What is {battle} of {branch} of {general} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5531647 wdt:P241 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'battle', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'general', 'p': 'branch', 'o': '$y0'}}

 Q: Are there more than 0.8 seasons of Supertrain?
 SPARQL: ASK WHERE { wd:Q367772 wdt:P2437 ?obj filter(?obj > 0.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Supertrain', 'p': 'seasons', 'o': '?x0', '?x0': '0.8'}

 Q: Which republic with the a minimal nominal GDP is a member of the International Finance Corporation?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7270 . ?ent wdt:P2131 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'nominal GDP', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Finance Corporation'}}}

 Q: Did Amitabh Bachchan speak the Hindi-Urdu language?
 SPARQL: ASK WHERE { wd:Q9570 wdt:P1412 wd:Q11051 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Amitabh Bachchan', 'p': 'language', 'o': '?x0', '?x0': 'Hindi-Urdu'}]

 Q: what is the {statement is subject of} for {Bette Davis} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q71206 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bette Davis', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: What is {government headed by} of {land} of {Arkhangelsk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1851 wdt:P17 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'government headed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arkhangelsk', 'p': 'land', 'o': '$y0'}}

 Q: Is William Wilde the father of Oscar Wilde?
 SPARQL: ASK WHERE { wd:Q30875 wdt:P22 wd:Q2540254 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Oscar Wilde', 'p': 'father', 'o': '?x0', '?x0': 'William Wilde'}]

 Q: What political party did Svetlana Savitskaya's become a member of in 1975?
 SPARQL: SELECT ?obj WHERE { wd:Q152318 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Svetlana Savitskaya', 'p': 'party', 'o': '?x0', 't': '1975'}

 Q: What pharmaceutical product has zinc as it's active ingredient?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3781 wd:Q758 . ?sbj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'active ingredient', 'o': 'zinc', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: What is the blood type of Jay Chou?
 SPARQL: select distinct ?answer where { wd:Q238819 wdt:P1853 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jay Chou', 'p': 'blood type', 'o': '?x0'}

 Q: What was the population of the Aland Islands in 1979?
 SPARQL: SELECT ?obj WHERE { wd:Q5689 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aland', 'p': 'population', 'o': '?x0', 't': '1979'}

 Q: Which is the capital of Tulunids?
 SPARQL: select distinct ?answer where { wd:Q726798 wdt:P36 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tulunids', 'p': 'capital', 'o': '?x0'}

 Q: What is {film genre} of {musician} of {Hold me in your arms (song)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26689546 wdt:P175 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hold me in your arms (song)', 'p': 'musician', 'o': '$y0'}}

 Q: What team did Sourav Ganguly play for starting in 2005?
 SPARQL: SELECT ?obj WHERE { wd:Q561487 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sourav Ganguly', 'p': 'team', 'o': '?x0', 't': '2005'}

 Q: Mention the award handed over to the daughter of Alexander II of Russia
 SPARQL: SELECT ?answer WHERE { wd:Q83171 wdt:P22 ?X . ?X wdt:P166 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander II of Russia', 'p': 'daughter of', 'o': '$y0'}}

 Q: What is the {place of death} and the {cause of death} of {Lewis_Carroll} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q38082 wdt:P20 ?ans_1 . wd:Q38082 wdt:P509 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Lewis Carroll', 'p': 'place of death', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Lewis Carroll', 'p': 'cause of death', 'o': '?x1'}]

 Q: What is {is the antonym of} of {event} of {Marcelo Ariel Gelman Schuberoff} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55222552 wdt:P793 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marcelo Ariel Gelman Schuberoff', 'p': 'event', 'o': '$y0'}}

 Q: What is {type of music} of {from work} of {Guitar Player} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42384429 wdt:P1441 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guitar Player', 'p': 'from work', 'o': '$y0'}}

 Q: What is <Kansas Sports Hall of Fame ID> of <Al Oerter> ?
 SPARQL: select distinct ?answer where { wd:Q52642 wdt:P4366 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Al Oerter', 'p': 'Kansas Sports Hall of Fame ID', 'o': '?x0'}

 Q: When did member of sports team of Ali Daei and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q159622 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ali Daei', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ali Daei', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is {position held} of {Gregory II} that is {series ordinal} is {89} ?
 SPARQL: SELECT ?obj WHERE { wd:Q103321 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter(contains(?x,'89')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gregory II', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '89'}}}

 Q: How many official religions are with {Goguryeo} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q28370 wdt:P3075 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Goguryeo', 'p': 'official religion', 'o': '?x0'}

 Q: How many occupations does Nancy Cartwright have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q229211 wdt:P106 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Nancy Cartwright', 'p': 'occupation', 'o': '?x0'}

 Q: What are the moon of Saturn which start with the letter titan
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1972 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'titan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'moon of Saturn'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'titan'}}

 Q: Which Android One has the largest maximum size or capacity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q18063397 . ?ent wdt:P3559 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum size or capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Android One'}}

 Q: What is the {human} for {cast member} of {60 Minutes}
 SPARQL:  select distinct ?obj where { wd:Q247869 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '60 Minutes', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When did spouse of Andriy Shevchenko and start time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q41244 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is the {nuclear explosion} for {designed by} of {Manhattan Project}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q127050 . ?sbj wdt:P31 wd:Q2656967 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Manhattan Project', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nuclear explosion'}}

 Q: What is {family name} of {Gerty Cori} that is {has cause} is {marriage} ?
 SPARQL: SELECT ?obj WHERE { wd:Q204733 p:P734 ?s . ?s ps:P734 ?obj . ?s pq:P828 wd:Q8445 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'family name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerty Cori', 'p': 'family name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'has cause', 'o': 'marriage'}}}

 Q: What is {nominated for} of {La Dolce Vita} that is {statement is subject of} is {34th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q18407 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917163 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'La Dolce Vita', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '34th Academy Awards'}}}

 Q: What is {borders} of {Kaifeng}, that has {has rural cities} is {Fengquan District} ?
 SPARQL: SELECT ?answer WHERE { wd:Q208471 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1198617}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kaifeng', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has rural cities', 'o': 'Fengquan District'}}

 Q: What is {part of constellation} of {orbited by} of {Milky Way} ?
 SPARQL: SELECT ?answer WHERE { wd:Q321 wdt:P398 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Milky Way', 'p': 'orbited by', 'o': '$y0'}}

 Q: what is the {start time} for {Aleksey Konstantinovich Tolstoy} has {spouse} as {Sofia Andreevna Bachmeteva} ?
 SPARQL: SELECT ?value WHERE { wd:Q212575 p:P26 ?s . ?s ps:P26 wd:Q4079844 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksey Konstantinovich Tolstoy', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Sofia Andreevna Bachmeteva'}}}

 Q: Who gave the{user} of {theme} of {Gingerbread Man} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15233326 wdt:P144 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'user', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gingerbread Man', 'p': 'theme', 'o': '$y0'}}

 Q: What country has The Star-Spangled Banner as its anthem?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P85 wd:Q44696 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'The Star-Spangled Banner', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: tell me fossil taxon name has the word velociraptor in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23038290 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'velociraptor')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fossil taxon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'velociraptor'}}

 Q: What is divided into the Chiba Prefecture, which has a gps coordinate of 140.367?
 SPARQL: SELECT ?answer WHERE { wd:Q80011 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'140.367'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chiba Prefecture', 'p': 'divided into', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'gps coordinate', 'o': '140.367'}}

 Q: What is <focal length> of <Very Large Telescope> ?
 SPARQL: select distinct ?answer where { wd:Q265628 wdt:P2151 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Very Large Telescope', 'p': 'focal length', 'o': '?x0'}

 Q: Give me {deity} that {wears} {himation} and which contains the word {christ} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178885 . ?sbj wdt:P3828 wd:Q781731 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'christ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wears', 'o': 'himation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'christ'}}

 Q: What award did Dave Brubeck receive in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q108597 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dave Brubeck', 'p': 'award', 'o': '?x0', 't': '1996'}

 Q: Which is the ICTV virus genome composition for HIV?
 SPARQL: select distinct ?answer where { wd:Q15787 wdt:P4628 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'HIV', 'p': 'ICTV virus genome composition', 'o': '?x0'}

 Q: what is the {start time} for {Pervez Musharraf} has {position held} as {Chairman Joint Chiefs of Staff Committee} ?
 SPARQL: SELECT ?value WHERE { wd:Q40495 p:P39 ?s . ?s ps:P39 wd:Q5068077 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pervez Musharraf', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chairman Joint Chiefs of Staff Committee'}}}

 Q: What is <participant of> of <Magnus Carlsen> ?
 SPARQL: select distinct ?answer where { wd:Q106807 wdt:P1344 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Magnus Carlsen', 'p': 'participant of', 'o': '?x0'}

 Q: What is the {scale of temperature} for {measured by} of {temperature}
 SPARQL:  select distinct ?obj where { wd:Q11466 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q2394680 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'temperature', 'p': 'measured by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scale of temperature'}}

 Q: Did {Louis_Armstrong} {record label} {Columbia Records} and {GRP Records} ?
 SPARQL: ASK WHERE { wd:Q1779 wdt:P264 wd:Q183387 . wd:Q1779 wdt:P264 wd:Q671097 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Louis Armstrong', 'p': 'record label', 'o': '?x0', '?x0': 'Columbia Records'}, {'h': 'IS', 'v': '?x1', 's': 'Louis Armstrong', 'p': 'record label', 'o': '?x1', '?x1': 'GRP Records'}]

 Q: What is the ortholog of RHO?
 SPARQL: select distinct ?answer where { wd:Q14859555 wdt:P684 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'RHO', 'p': 'ortholog', 'o': '?x0'}

 Q: How many defendants were there in the Nuremberg trials?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q80130 wdt:P1591 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Nuremberg trials', 'p': 'defendant', 'o': '?x0'}

 Q: what is the {number of matches played} for {Hidetoshi Nakata} has {member of sports team} as {Japan national under-17 football team} ?
 SPARQL: SELECT ?value WHERE { wd:Q128725 p:P54 ?s . ?s ps:P54 wd:Q3044339 . ?s pq:P1350 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hidetoshi Nakata', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Japan national under-17 football team'}}}

 Q: Is the metallicity of the Messier 30, -2.27?
 SPARQL: ASK WHERE { wd:Q13653 wdt:P2227 ?obj filter(?obj = -2.27) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Messier 30', 'p': 'metallicity', 'o': '?x0', '?x0': '-2.27'}

 Q: Who gave the  {ideology} of {member of} of {Lola Iturbe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9023549 wdt:P463 ?X . ?X wdt:P1142 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ideology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lola Iturbe', 'p': 'member of', 'o': '$y0'}}

 Q: Who is the {national association football team} for {home venue} of {Wembley Stadium}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P115 wd:Q128468 . ?sbj wdt:P31 wd:Q6979593 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'home venue', 'o': 'Wembley', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national association football team'}}

 Q: what is the {series ordinal} for {Adam Weishaupt} has {given name} as {Adam} ?
 SPARQL: SELECT ?value WHERE { wd:Q159481 p:P735 ?s . ?s ps:P735 wd:Q347181 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adam Weishaupt', 'p': 'first name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'first name', 'o': 'Adam'}}}

 Q: What is country for  human breast milk ?
 SPARQL: select distinct ?answer where { ?answer wdt:P17 wd:Q22728}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'human breast milk'}

