 Q: What is <Environmental Register code (Estonia)> of <Lake Peipus> ?
 SPARQL: select distinct ?answer where { wd:Q19253 wdt:P4689 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Peipus', 'p': 'Environmental Register code (Estonia)', 'o': '?x0'}

 Q: Who is the {theatre award} for {nominated for} of {Vanessa Redgrave}
 SPARQL:  select distinct ?obj where { wd:Q347879 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q15229229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vanessa Redgrave', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theatre award'}}

 Q: What is tarragon's PalDat plant ID?
 SPARQL: select distinct ?answer where { wd:Q155814 wdt:P4122 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tarragon', 'p': 'PalDat plant ID', 'o': '?x0'}

 Q: A marsh is what type of habitat?
 SPARQL: select distinct ?answer where { ?answer wdt:P2974 wd:Q30198}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'habitat', 'o': 'marsh'}

 Q: What is the {chemical compound} for {medical condition treated} of {major depressive disorder}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q42844 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'major depressive disorder', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Who is the {state university system} for {affiliation} of {Purdue University}
 SPARQL:  select distinct ?obj where { wd:Q217741 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q1075106 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Purdue University', 'p': 'affiliation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state university system'}}

 Q: Who is the nominee for Nirvana whose victor is Moby?
 SPARQL: SELECT ?answer WHERE { wd:Q11649 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q14045}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nirvana', 'p': 'nominee for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'victor', 'o': 'Moby'}}

 Q: What is the {Class IIIA combustible liquid} with the {MAX(vapor pressure)} whose {has part} is {chlorine}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009058 . ?ent wdt:P2119 ?obj . ?ent wdt:P527 wd:Q688 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'vapor pressure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IIIA combustible liquid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has part', 'o': 'chlorine'}}}

 Q: "Which characters on Friends have an end time for work at 2004-0-0?"
 SPARQL: SELECT ?answer WHERE { wd:Q79784 wdt:P674 ?answer . ?answer wdt:P2032 ?x FILTER(contains(YEAR(?x),'2004'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Friends', 'p': 'characters', 'o': '?x0', 't': '2004'}

 Q: Is it true that the disease burden of air pollution equals to 1001000?
 SPARQL: ASK WHERE { wd:Q131123 wdt:P2854 ?obj filter(?obj = 1001000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'air pollution', 'p': 'disease burden', 'o': '?x0', '?x0': '1001000'}

 Q: What is the {chemical compound} for {drug used for treatment} of {asthma}
 SPARQL:  select distinct ?obj where { wd:Q35869 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Asthma', 'p': 'used for treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: "Which is {manufactured from} of {lumber}, that has {user} is {wood carver} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q1370714 wdt:P186 ?answer . ?answer wdt:P1535 wd:Q6138343}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'lumber', 'p': 'manufactured from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'user', 'o': 'wood carver'}}

 Q: Which is the infectious disease that has effect on bacteria?
 SPARQL:  select distinct ?obj where { wd:Q10876 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q18123741 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'bacteria', 'p': 'has effect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'infectious disease'}}

 Q: What is {nominated for} of {The Weeknd} that is {for work} is {Kiss Land} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2121062 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q17018194 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Weeknd', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Kiss Land'}}}

 Q: Which is the capital of place of death of Mahatma Gandhi?
 SPARQL:  select distinct ?obj where { wd:Q1001 wdt:P20 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mahatma Gandhi', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: What award did William Faulkner receive in 1955?
 SPARQL: SELECT ?obj WHERE { wd:Q38392 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1955')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Faulkner', 'p': 'award', 'o': '?x0', 't': '1955'}

 Q: What is the partner city of Nice that has 315196 inhabitants?
 SPARQL: SELECT ?answer WHERE { wd:Q33959 wdt:P190 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'315196'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nice', 'p': 'partner city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '315196'}}

 Q: What award did The Beatles receive in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q1299 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Beatles', 'p': 'award', 'o': '?x0', 't': '1996'}

 Q: Which is the academic degree and the academic major of Maximilien Robespierre who was educated at the Lycée Louis-le-Grand?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q44197 p:P69 ?s . ?s ps:P69 wd:Q1059546 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maximilien Robespierre', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Lycée Louis-le-Grand'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maximilien Robespierre', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Lycée Louis-le-Grand'}}}]

 Q: What is {given name} of {Mary Pickford} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q104109 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mary Pickford', 'p': 'first name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: What is the artery of the has anatomical branch of trachea?
 SPARQL: SELECT ?answer WHERE { wd:Q175449 wdt:P3262 ?X . ?X wdt:P2286 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'artery', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'trachea', 'p': 'has anatomical branch', 'o': '$y0'}}

 Q: what is the {appointed by} for {Robert F. Kennedy} has {position held} as {United States Attorney General} ?
 SPARQL: SELECT ?value WHERE { wd:Q25310 p:P39 ?s . ?s ps:P39 wd:Q636207 . ?s pq:P748 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'appointed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert F. Kennedy', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States Attorney General'}}}

 Q: What is {spoken text audio} of {historic period} of {Marcus Vipsanius Agrippa} ?
 SPARQL: SELECT ?answer WHERE { wd:Q48174 wdt:P2348 ?X . ?X wdt:P989 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'spoken text audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marcus Vipsanius Agrippa', 'p': 'historic period', 'o': '$y0'}}

 Q: Is the arguement of periapsis of 1674 Groeneveld greater than 0.741504?
 SPARQL: ASK WHERE { wd:Q142191 wdt:P2248 ?obj filter(?obj > 0.741504) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '1674 Groeneveld', 'p': 'argument of periapsis', 'o': '?x0', '?x0': '0.741504'}

 Q: What are the institution of the European Union  which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748720 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'institution of the European Union'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'e'}}

 Q: What is {tributary} of {Neman River} that is {direction} is {right} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5622 p:P974 ?s . ?s ps:P974 ?obj . ?s pq:P560 wd:Q14565199 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neman River', 'p': 'tributary', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'direction', 'o': 'right'}}}

 Q: What is <work location> of <Jane Goodall> ?
 SPARQL: select distinct ?answer where { wd:Q184746 wdt:P937 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jane Goodall', 'p': 'work location', 'o': '?x0'}

 Q: Give the largest block size of block cipher?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q543151 . ?ent wdt:P2599 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'block size', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'block cipher'}}

 Q: What was Roger Martin du Gard nominated for on January 1, 1935?
 SPARQL: SELECT ?obj WHERE { wd:Q129155 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1935')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Roger Martin du Gard', 'p': 'nominated for', 'o': '?x0', 't': '1935'}

 Q: What is {MASL} of {twin town} of {Iași} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46852 wdt:P190 ?X . ?X wdt:P2044 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'MASL', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iași', 'p': 'twin town', 'o': '$y0'}}

 Q: Which award did Corin Tellado receive in the year 1998?
 SPARQL: SELECT ?obj WHERE { wd:Q1813126 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1998')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Corin Tellado', 'p': 'award', 'o': '?x0', 't': '1998'}

 Q: What is {subitem of} of {history of Switzerland}, that has {number of out of school children} is {69459.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q208761 wdt:P1269 ?answer . ?answer wdt:P2573 ?x FILTER(contains(?x,'69459.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Switzerland', 'p': 'subitem of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'number of out of school children', 'o': '69459.0'}}

 Q: What is the {island} for {language used} of {Norwegian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q23442 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Norwegian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'island'}}

 Q: IS THE ALEXA RANK OF THE PLURK GREATER THAN 1307.2
 SPARQL: ASK WHERE { wd:Q32111 wdt:P1661 ?obj filter(?obj > 1307.2) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'PLURK', 'p': 'Alexa rank', 'o': '?x0', '?x0': '1307.2'}

 Q: What is {makes use of} of {sports} of {European Poker Tour season 2 results} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3060792 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'makes use of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'European Poker Tour season 2 results', 'p': 'sport', 'o': '$y0'}}

 Q: What is on the shore of the Atlantic coastal plain with the Barranco de Tahodio tributary?
 SPARQL: SELECT ?answer WHERE { wd:Q756832 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5719981}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Atlantic coastal plain', 'p': 'on the shore of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Barranco de Tahodio'}}

 Q: When did church building for patron saint of Anthony of Padua?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q167477 . ?sbj wdt:P31 wd:Q16970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Anthony of Padua', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'church building'}}

 Q: What is the {natural script} for {writing system} of {Malayalam}
 SPARQL:  select distinct ?obj where { wd:Q36236 wdt:P282 ?obj . ?obj wdt:P31 wd:Q29517555 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Malayalam', 'p': 'writing system', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural script'}}

 Q: What are the social skills which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1413287 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social skills'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Give me {painting} that {exhibition history} {Mona Lisa Exhibition} and which that starts with {'l'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj wdt:P608 wd:Q15087813 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'exhibition history', 'o': 'Mona Lisa Exhibition'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Who is the role model of Henry Wadsworth Longfellow that is a member of Arte dei Medici e Speziali?
 SPARQL: SELECT ?answer WHERE { wd:Q152513 wdt:P737 ?answer . ?answer wdt:P463 wd:Q526004}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henry Wadsworth Longfellow', 'p': 'role model', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Arte dei Medici e Speziali'}}

 Q: Tell me about the discipline of Russian studies.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2578 wd:Q7737 . ?sbj wdt:P31 wd:Q11862829 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'Russian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discipline'}}

 Q: What is {is son of} of {Charles Dickens}, that has {kids} is {Alfred Lamert Dickens} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5686 wdt:P25 ?answer . ?answer wdt:P40 wd:Q4723042}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charles Dickens', 'p': 'is son of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child', 'o': 'Alfred Lamert Dickens'}}

 Q: What are theelectromagnetic radiationwhich start with the letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12969754 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'electromagnetic radiation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: What is the biological phase for DNA replication?
 SPARQL: select distinct ?answer where { wd:Q130996 wdt:P4774 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'DNA replication', 'p': 'biological phase', 'o': '?x0'}

 Q: What is the {political ideology} and the {religion} of {Nigel_Farage} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q318471 wdt:P1142 ?ans_1 . wd:Q318471 wdt:P140 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Nigel Farage', 'p': 'political ideology', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Nigel Farage', 'p': 'religion', 'o': '?x1'}]

 Q: Is the pressure of the T-34/85 equal to 8.96?
 SPARQL: ASK WHERE { wd:Q2720752 wdt:P2077 ?obj filter(?obj = 8.96) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'T-34/85', 'p': 'pressure', 'o': '?x0', '?x0': '8.96'}

 Q: What is {nominated for} of {Geraldine Page} that is {for work} is {You're a Big Boy Now} ?
 SPARQL: SELECT ?obj WHERE { wd:Q228650 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q858584 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Geraldine Page', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "You're a Big Boy Now"}}}

 Q: Are Mumbai and Los Angeles twin cities?
 SPARQL: ASK WHERE { wd:Q1156 wdt:P190 wd:Q65 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mumbai', 'p': 'twin cities', 'o': '?x0', '?x0': 'Los Angeles'}]

 Q: What is FC Barcelona's parent club?
 SPARQL: select distinct ?answer where { wd:Q7156 wdt:P831 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'FC Barcelona', 'p': 'parent club', 'o': '?x0'}

 Q: What is {headquarters location} of {Council of the European Union} that is {country} is {Belgium} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8896 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q31 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Council of the European Union', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Belgium'}}}

 Q: who is the {elected in} for {David Lloyd George} that has {position held} as {Member of the 35th Parliament of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q134982 p:P39 ?s . ?s ps:P39 wd:Q41582588 . ?s pq:P2715 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Lloyd George', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 35th Parliament of the United Kingdom'}}}

 Q: How many members were on Darren Bennett's teams?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q5224788 wdt:P54 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Darren Bennett', 'p': 'team', 'o': '?x0'}

 Q: What is {academic major} and {academic degree} of {{Zora Neale Hurston} has {educated at} as {Barnard College}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q220480 p:P69 ?s . ?s ps:P69 wd:Q167733 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zora Neale Hurston', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Barnard College'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zora Neale Hurston', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Barnard College'}}}]

 Q: what is the {statement is subject of} for {Anne Baxter} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q228906 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anne Baxter', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: What is {spouse} of {Jane Goodall} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q184746 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jane Goodall', 'p': 'married', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jane Goodall', 'p': 'married', 'o': '$y0'}}]

 Q: What academic degree if Mary Leakey earn in 1968?
 SPARQL: SELECT ?obj WHERE { wd:Q231111 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1968')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mary Leakey', 'p': 'academic degree', 'o': '?x0', 't': '1968'}

 Q: How many nicknames are for {Larry Bird} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q190152 wdt:P1449 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Larry Bird', 'p': 'nickname', 'o': '?x0'}

 Q: How many characters are in Os Lusíadas?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q781898 wdt:P674 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Os Lusíadas', 'p': 'characters', 'o': '?x0'}

 Q: Who was the spouse of Fyodor Tyutchev until August 27, 1838?
 SPARQL: SELECT ?obj WHERE { wd:Q37217 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1838')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fyodor Tyutchev', 'p': 'spouse', 'o': '?x0', 't': '1838'}

 Q: who type of quantum particle for discoverer or inventor of CERN?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P61 wd:Q42944 . ?sbj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'discoverer or inventor', 'o': 'CERN', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: When was Henri Moissan nominated for a Nobel Prize in Chemistry?
 SPARQL: SELECT ?value WHERE { wd:Q102804 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Henri Moissan', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Chemistry'}, 't': '?x0'}

 Q: what is the {start time} for {Frederick William, Elector of Brandenburg} has {spouse} as {Countess Louise Henriette of Nassau} ?
 SPARQL: SELECT ?value WHERE { wd:Q152727 p:P26 ?s . ?s ps:P26 wd:Q196301 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Countess Louise Henriette of Nassau'}}}

 Q: Who is the central bank/issuer of Russian ruble?
 SPARQL: select distinct ?answer where { wd:Q41044 wdt:P562 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russian ruble', 'p': 'central bank/issuer', 'o': '?x0'}

 Q: What is the {prime number} with the {MAX(numeric value)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q49008 . ?ent wdt:P1181 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'numeric value', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'prime number'}}

 Q: What is on shore of Olympic Peninsula whose tributary is Maria Linda River?
 SPARQL: SELECT ?answer WHERE { wd:Q780293 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5937883}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Olympic Peninsula', 'p': 'on shore of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Maria Linda River'}}

 Q: What is the {human} for {architect} of {Flatiron Building}
 SPARQL:  select distinct ?obj where { wd:Q220728 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Flatiron Building', 'p': 'architect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: which force starts with the letter f
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11402 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'force'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: What is NSK ID for Dario Fo?
 SPARQL: select distinct ?answer where { wd:Q765 wdt:P1375 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dario Fo', 'p': 'NSK ID', 'o': '?x0'}

 Q: what is the {academic major} for {Kenneth Arrow} has {educated at} as {Columbia University} ?
 SPARQL: SELECT ?value WHERE { wd:Q192592 p:P69 ?s . ?s ps:P69 wd:Q49088 . ?s pq:P812 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kenneth Arrow', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Columbia University'}}}

 Q: What award did Mikhail Prokhorov receive on 01/01/2006?
 SPARQL: SELECT ?obj WHERE { wd:Q233581 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mikhail Prokhorov', 'p': 'award', 'o': '?x0', 't': '2006'}

 Q: What was the area code of Cần Thơ in July 16th 2017?
 SPARQL: SELECT ?obj WHERE { wd:Q216075 p:P473 ?s . ?s ps:P473 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cần Thơ', 'p': 'area code', 'o': '?x0', 't': '2017'}

 Q: What characters are part of the series called A Fish Called Selma?
 SPARQL: SELECT ?answer WHERE { wd:Q2740476 wdt:P179 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'A Fish Called Selma', 'p': 'part of the series', 'o': '$y0'}}

 Q: What is diplomatic relation for sovereign state of Jabalpur ?
 SPARQL: SELECT ?answer WHERE { wd:Q200878 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jabalpur', 'p': 'sovereign state', 'o': '$y0'}}

 Q: What is {educated at} of {Gene Amdahl} that is {academic major} is {theoretical physics} ?
 SPARQL: SELECT ?obj WHERE { wd:Q62890 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q18362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gene Amdahl', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic major', 'o': 'theoretical physics'}}}

 Q: What is {location of death} of {Pius VI}, that has {borders} is {Saint-Marcel-lès-Valence} ?
 SPARQL: SELECT ?answer WHERE { wd:Q128019 wdt:P20 ?answer . ?answer wdt:P47 wd:Q632251}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pius VI', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Saint-Marcel-lès-Valence'}}

 Q: What is {has case} of {language of expression} of {Francis Bacon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37388 wdt:P1412 ?X . ?X wdt:P2989 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has case', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francis Bacon', 'p': 'language', 'o': '$y0'}}

 Q: What is the deathplace of Philip II of Spain, that has the coordinates of 40.418888888889 -3.6919444444444?
 SPARQL: SELECT ?answer WHERE { wd:Q34417 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'40.418888888889 -3.6919444444444'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Philip II of Spain', 'p': 'deathplace', 'o': '?x0'}

 Q: What is the gross tonnage of the Bluenose II, 191?
 SPARQL: ASK WHERE { wd:Q2714647 wdt:P1093 ?obj filter(?obj = 191) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Bluenose II', 'p': 'gross tonnage', 'o': '?x0', '?x0': '191'}

 Q: What award did Christina Aguilera receive on January 1, 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q41594 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Christina Aguilera', 'p': 'award', 'o': '?x0', 't': '2000'}

 Q: what is the {start time} for {Ted Kaczynski} has {educated at} as {Harvard University} ?
 SPARQL: SELECT ?value WHERE { wd:Q222134 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ted Kaczynski', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}

 Q: Who was Paul Keating's spouse when their marriage ended in 2008?
 SPARQL: SELECT ?obj WHERE { wd:Q242654 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paul Keating', 'p': 'spouse', 'o': '?x0', 't': '2008'}

 Q: What is {position held} of {Juan Ponce de León} that is {end time} is {1511-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q185974 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1511')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Juan Ponce de León', 'p': 'position held', 'o': '?x0', 't': '1511'}

 Q: What is <ARCHON code> of <Amherst College> ?
 SPARQL: select distinct ?answer where { wd:Q49165 wdt:P3642 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amherst College', 'p': 'ARCHON code', 'o': '?x0'}

 Q: What is the {human} for {plaintiff} of {Obergefell v. Hodges}
 SPARQL:  select distinct ?obj where { wd:Q19866992 wdt:P1620 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Obergefell v. Hodges', 'p': 'plaintiff', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {competition class} are to/by {women's sports} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2094 wd:Q920057 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'competition class', 'o': "women's sports"}

 Q: Did {Steve_Jobs} {lifestyle} {Pescetarianism}?
 SPARQL: ASK WHERE { wd:Q19837 wdt:P1576 wd:Q1500138 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Steve Jobs', 'p': 'lifestyle', 'o': '?x0', '?x0': 'pescetarian'}]

 Q: Whats is the trans-Neptunian object discovered by Jan Oort that contains the word "cloud" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6592 . ?sbj wdt:P61 wd:Q309861 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cloud')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'trans-Neptunian object', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discovered by', 'o': 'Jan Oort'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cloud'}}

 Q: Is the Euler characteristic of the genus-two surface less than -2.4?
 SPARQL: ASK WHERE { wd:Q5533830 wdt:P6438 ?obj filter(?obj < -2.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'genus-two surface', 'p': 'Euler characteristic', 'o': '?x0', '?x0': '-2.4'}

 Q: what is the {for work} for {Alain Resnais} has {nominated for} as {César Award for Best Adaptation} ?
 SPARQL: SELECT ?value WHERE { wd:Q218022 p:P1411 ?s . ?s ps:P1411 wd:Q832120 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alain Resnais', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'César Award for Best Adaptation'}}}

 Q: Who is the {student of} the {student} of {Michael_Faraday} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8750 wdt:P1066 ?ans_1 . wd:Q8750 wdt:P802 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Faraday', 'p': 'student of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Faraday', 'p': 'student', 'o': '?x1'}]

