 Q: What is the {war} for {participant} of {Soviet Union}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q15180 . ?sbj wdt:P31 wd:Q198 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'war'}}

 Q: When did Vyacheslav Molotov received the Order of Lenin award?
 SPARQL: SELECT ?value WHERE { wd:Q132899 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Vyacheslav Molotov', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of Lenin'}, 't': '?x0'}

 Q: What was the population of Maharashtra in the year 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q1191 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maharashtra', 'p': 'population', 'o': '?x0', 't': '2011'}

 Q: What is developed by SPICE that has working languages in English?
 SPARQL: SELECT ?answer WHERE { wd:Q174907 wdt:P178 ?answer . ?answer wdt:P2936 wd:Q1860}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'SPICE', 'p': 'developed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'working languages', 'o': 'English'}}

 Q: What is a significant event that Matthias Corvinus was apart of and  what was the location of that event?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q188634 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matthias Corvinus', 'p': 'significant event', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'significant event', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matthias Corvinus', 'p': 'significant event', 'o': '$y0'}}]

 Q: IS THE COMPULSORY EDUCATION MAXIMUM AGE OF THE SPAIN EQUALS 16
 SPARQL: ASK WHERE { wd:Q29 wdt:P3271 ?obj filter(?obj = 16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Spain', 'p': 'compulsory education (maximum age)', 'o': '?x0', '?x0': '16'}

 Q: What is the {aircraft model} with the {MAX(takeoff roll)} whose {significant event} is {Seville A400M crash}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj . ?ent wdt:P793 wd:Q19882906 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'takeoff roll', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Seville A400M crash'}}}

 Q: Where is the head office location of Miss World, whose twin city is Los Angeles?
 SPARQL: SELECT ?answer WHERE { wd:Q173402 wdt:P159 ?answer . ?answer wdt:P190 wd:Q65}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Miss World', 'p': 'head office location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Los Angeles'}}

 Q: How many {head of state} are for {Ukraine} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q212 wdt:P35 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Ukraine', 'p': 'head of state', 'o': '?x0'}

 Q: Which is the fictional analog of the source of inspiration of Captain Ahab?
 SPARQL: SELECT ?answer WHERE { wd:Q2630009 wdt:P941 ?X . ?X wdt:P1074 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fictional analog of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Captain Ahab', 'p': 'source of inspiration', 'o': '$y0'}}

 Q: What is Sandbox-Item of The Last Supper ?
 SPARQL: select distinct ?answer where { wd:Q128910 wdt:P369 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Last Supper', 'p': 'Sandbox-Item', 'o': '?x0'}

 Q: What is {position held} of {François Guizot} that is {electoral district} is {Calvados} ?
 SPARQL: SELECT ?obj WHERE { wd:Q157324 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q3249 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'François Guizot', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'electoral district', 'o': 'Calvados'}}}

 Q: what is the {end time} for {Prince Harry, Duke of Sussex} has {partner} as {Chelsy Davy} ?
 SPARQL: SELECT ?value WHERE { wd:Q152316 p:P451 ?s . ?s ps:P451 wd:Q529485 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Prince Harry, Duke of Sussex', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Chelsy Davy'}}}

 Q: Which is the capital for the official residence of the Parthian Empire?
 SPARQL:  select distinct ?obj where { wd:Q1986139 wdt:P263 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Parthian Empire', 'p': 'official residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: What is {publication date} and {publisher} of {{Christopher Hitchens} has {notable work} as {Hitch-22}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q3138625 . ?s pq:P577 ?value1 . ?s pq:P123 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Hitch-22'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'publisher', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Hitch-22'}}}]

 Q: What is {year written} of {historical period} of {Zeno} ?
 SPARQL: SELECT ?answer WHERE { wd:Q183452 wdt:P2348 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'year written', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zeno', 'p': 'historical period', 'o': '$y0'}}

 Q: What is the name of the capital of Estonia whose first letter is T ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P1376 wd:Q191 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital of', 'o': 'Estonia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What skill contains the word "suction" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'suction')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skill'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'suction'}}

 Q: What is {subsidiary entities} of {Islamic Azad University}, that has {is in the department of} is {Bukan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2661844 wdt:P355 ?answer . ?answer wdt:P131 wd:Q606564}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Islamic Azad University', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is in the department of', 'o': 'Bukan'}}

 Q: What is {native label} of {Sangha} that is {Revised Romanization} is {seungga} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193944 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P2001 ?x filter(contains(?x,'seungga')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'native label', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sangha', 'p': 'native label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'Revised Romanization', 'o': 'seungga'}}}

 Q: What is the {has edition} and the {author} of {Pied_Piper_of_Hamelin} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q111502 wdt:P747 ?ans_1 . wd:Q111502 wdt:P50 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Pied Piper of Hamelin', 'p': 'edition', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Pied Piper of Hamelin', 'p': 'author', 'o': '?x1'}]

 Q: Who were the Amazons that were killed by Heracles?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q134154 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'killed by', 'o': 'Heracles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Amazons'}}

 Q: What is {award received} of {Dune} that is {followed by} is {Babel-17} ?
 SPARQL: SELECT ?obj WHERE { wd:Q190192 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 wd:Q2722309 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dune', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'followed by', 'o': 'Babel-17'}}}

 Q: Which communications protocol contains the word zmodem in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132364 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zmodem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'communications protocol'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zmodem'}}

 Q: Is air pollution caused by methane and volcanic eruption?
 SPARQL: ASK WHERE { wd:Q131123 wdt:P828 wd:Q37129 . wd:Q131123 wdt:P828 wd:Q7692360 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'air pollution', 'p': 'cause', 'o': '?x0', '?x0': 'methane'}, {'h': 'IS', 'v': '?x1', 's': 'air pollution', 'p': 'cause', 'o': '?x1', '?x1': 'volcanic eruption'}]

 Q: What is the {human} for {lyrics by} of {Auld Lang Syne}
 SPARQL:  select distinct ?obj where { wd:Q211939 wdt:P676 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Auld Lang Syne', 'p': 'lyrics by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {point in time} for {Alexander Ovechkin} has {award received} as {gold medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q311374 p:P166 ?s . ?s ps:P166 wd:Q406039 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alexander Ovechkin', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'gold medal'}, 't': '?x0'}

 Q: Mariano Rajoy is a member of what political party?
 SPARQL:  select distinct ?obj where { wd:Q10819 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mariano Rajoy', 'p': 'party', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: Which extinct human group starts with the letter w?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55208590 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'extinct human group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Tell me condiment whose name has the word yondu in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2596997 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yondu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'condiment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yondu'}}

 Q: What is the {railway} for {owned by} of {Milwaukee}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q37836 . ?sbj wdt:P31 wd:Q22667 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'Milwaukee', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway'}}

 Q: what is the {number of points/goals/set scored} for {Liverpool F.C.} has {participant of} as {1950 FA Cup Final} ?
 SPARQL: SELECT ?value WHERE { wd:Q1130849 p:P1344 ?s . ?s ps:P1344 wd:Q4484491 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Liverpool F.C.', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'participant of', 'o': '1950 FA Cup Final'}}}

 Q: What is {died in} of {Jacques Mesrine}, that has {county seat of} is {Neustria} ?
 SPARQL: SELECT ?answer WHERE { wd:Q520852 wdt:P20 ?answer . ?answer wdt:P1376 wd:Q106577}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacques Mesrine', 'p': 'died in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat of', 'o': 'Neustria'}}

 Q: Tell me the name of the female idol group whose name contains the word zero?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11446438 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zero')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'female idol group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zero'}}

 Q: What is {inflation rate} of {Colombia} that is {point in time} is {1995-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q739 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1995')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Colombia', 'p': 'inflation rate', 'o': '?x0', 't': '1995'}

 Q: What television program is produced by Ellen DeGeneres?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P162 wd:Q483325 . ?sbj wdt:P31 wd:Q15416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'produced by', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television program'}}

 Q: Tell medisputed territory whose name has the word triangle in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15239622 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'triangle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disputed territory'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'triangle'}}

 Q: Which is the combination classification for Chris Froome?
 SPARQL: select distinct ?answer where { ?answer wdt:P4324 wd:Q319591}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'combination classification', 'o': 'Chris Froome'}

 Q: What is the {Wikimedia disambiguation page} for {participant} of {Diplo}
 SPARQL:  select distinct ?obj where { wd:Q533781 wdt:P710 ?obj . ?obj wdt:P31 wd:Q4167410 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Diplo', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia disambiguation page'}}

 Q: tell  me mineral species that streak color black that name has  the word tenorite in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj wdt:P534 wd:Q23445 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tenorite')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral species', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'streak color', 'o': 'black'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tenorite'}}

 Q: How many are designed by Niklaus Wirth?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P287 wd:Q92604 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Niklaus Wirth'}

 Q: what is the {electoral district} for {Tommy Douglas} has {position held} as {member of the House of Commons of Canada} ?
 SPARQL: SELECT ?value WHERE { wd:Q359653 p:P39 ?s . ?s ps:P39 wd:Q15964890 . ?s pq:P768 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tommy Douglas', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the House of Commons of Canada'}}}

 Q: which painting movement that contains the word verismo in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3326867 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'verismo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting movement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'verismo'}}

 Q: what is the {cast member} for {Boris Godunov} has {date of first performance} as {1874-1-27} ?
 SPARQL: SELECT ?value WHERE { wd:Q386846 p:P1191 ?s . ?s ps:P1191 ?x filter(contains(YEAR(?x),'1874')) . ?s pq:P161 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cast member', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boris Godunov', 'p': 'date of first performance', 'o': '$y0'}}

 Q: What is {position held} of {Spencer Perceval} that is {end time} is {1812-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q233992 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1812')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spencer Perceval', 'p': 'position held', 'o': '?x0', 't': '1812'}

 Q: Is it true that the total fertility rate of Luxembourg is 1.55?
 SPARQL: ASK WHERE { wd:Q32 wdt:P4841 ?obj filter(?obj = 1.55) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Luxembourg', 'p': 'total fertility rate', 'o': '?x0', '?x0': '1.55'}

 Q: What is {start time} and {end time} of {{Gerard Reve} has {spouse} as {Hanny Michaelis}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q364153 p:P26 ?s . ?s ps:P26 wd:Q2090463 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerard Reve', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Hanny Michaelis'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerard Reve', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Hanny Michaelis'}}}]

 Q: What is the {federal state} for {foundational text} of {U.S. Declaration of Independence}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P457 wd:Q127912 . ?sbj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'foundational text', 'o': 'Declaration of Independence', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: what is the {point in time} for {Yasser Arafat} has {award received} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q34211 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Yasser Arafat', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: What is total fertility rate  in the principal area of Libertador General Bernardo O'Higgins Region
 SPARQL: SELECT ?answer WHERE { wd:Q2133 wdt:P131 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "O'Higgins Region", 'p': 'in', 'o': '$y0'}}

 Q: What is the currency used in Norman conquest of England} ?
 SPARQL: SELECT ?answer WHERE { wd:Q200485 wdt:P276 ?X . ?X wdt:P38 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'currency', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Norman conquest of England', 'p': 'location', 'o': '$y0'}}

 Q: What is pronunciation audio of plays of kayak ?
 SPARQL: SELECT ?answer WHERE { wd:Q179246 wdt:P641 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'kayak', 'p': 'play', 'o': '$y0'}}

 Q: On 1-1-1678 William Petty, 2nd Earl of Shelburne founded what party membership
 SPARQL: SELECT ?answer WHERE { wd:Q312573 wdt:P102 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1678'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Petty, 2nd Earl of Shelburne', 'p': 'party', 'o': '?x0', 't': '1678'}

 Q: Which are the YouTube Play Buttons that are conferred by YouTube?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1027 wd:Q866 . ?sbj wdt:P31 wd:Q18157145 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conferred by', 'o': 'YouTube', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'YouTube Play Buttons'}}

 Q: What is the M.49 code of Eastern Europe?
 SPARQL: select distinct ?answer where { wd:Q27468 wdt:P2082 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eastern Europe', 'p': 'M.49 code', 'o': '?x0'}

 Q: What is the {fictional vehicle} for {present in work} of {Star Wars Episode V: The Empire Strikes Back}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q181795 . ?sbj wdt:P31 wd:Q20871196 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Star Wars Episode V: The Empire Strikes Back', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional vehicle'}}

 Q: Which is the anatomical location for mumps?
 SPARQL: select distinct ?answer where { wd:Q176741 wdt:P927 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mumps', 'p': 'anatomical location', 'o': '?x0'}

 Q: Tell me bank whose name has the word unicredit in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22687 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'unicredit')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bank'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'unicredit'}}

 Q: What is {owned by} of {NTV} that is {start time} is {2001-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q574625 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'NTV', 'p': 'owned by', 'o': '?x0', 't': '2001'}

 Q: Archbasilica of St. John Lateran architectural style?
 SPARQL: select distinct ?answer where { wd:Q84090 wdt:P149 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Archbasilica of St. John Lateran', 'p': 'architectural style', 'o': '?x0'}

 Q: Did Jimmy Carter received an award in the 2008 Grammy Awards?
 SPARQL: ASK WHERE { wd:Q23685 wdt:P166 wd:Q1518357 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jimmy Carter', 'p': 'award', 'o': '?x0', '?x0': '2008 Grammy Awards'}]

 Q: How many medical conditions did Ludwig van Beethoven have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q255 wdt:P1050 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Ludwig van Beethoven', 'p': 'medical condition', 'o': '?x0'}

 Q: "Which Christian name from Charles I of Hungary, is close to the name Carl?"
 SPARQL: SELECT ?answer WHERE { wd:Q213061 wdt:P735 ?answer . ?answer wdt:P460 wd:Q2529610}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charles I of Hungary', 'p': 'Christian name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'close to', 'o': 'Carl'}}

 Q: What is {head office location} of {International Chamber of Commerce}, that has {next to} is {Issy-les-Moulineaux} ?
 SPARQL: SELECT ?answer WHERE { wd:Q848633 wdt:P159 ?answer . ?answer wdt:P47 wd:Q135265}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'International Chamber of Commerce', 'p': 'head office location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'next to', 'o': 'Issy-les-Moulineaux'}}

 Q: What is the {human} for {voice actor} of {Aqua Teen Hunger Force}
 SPARQL:  select distinct ?obj where { wd:Q622946 wdt:P725 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aqua Teen Hunger Force', 'p': 'voice actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is describes a project that uses of Urban Dictionary ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4510 wd:Q310004}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'describes a project that uses', 'o': 'Urban Dictionary'}

 Q: What is {date of birth} and {date of death} of {{Abigail Adams} has {child} as {Charles Adams}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles Adams'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles Adams'}}}]

 Q: Is the natural abundance of samarium-152 equal to .321?
 SPARQL: ASK WHERE { wd:Q2288129 wdt:P2374 ?obj filter(?obj = 0.321) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'samarium-152', 'p': 'natural abundance', 'o': '?x0', '?x0': '0.321'}

 Q: Who has children with Domnall mac Ailpín, who is buried at Iona?
 SPARQL: SELECT ?answer WHERE { wd:Q312589 wdt:P40 ?answer . ?answer wdt:P119 wd:Q610}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Domnall mac Ailpín', 'p': 'child', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'buried at', 'o': 'Iona'}}

 Q: How many {anatomical location} are to/by {heart} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P927 wd:Q1072 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'heart'}

 Q: What is <PubMed ID> of <tuberculosis> ?
 SPARQL: select distinct ?answer where { wd:Q12204 wdt:P698 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tuberculosis', 'p': 'PubMed ID', 'o': '?x0'}

 Q: Tell me the noble family who has the son of Georgina Kennard?
 SPARQL: SELECT ?answer WHERE { wd:Q5548261 wdt:P25 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'family', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georgina Kennard', 'p': 'son of', 'o': '$y0'}}

 Q: what is the {production date} for {Arthur Sullivan} has {notable work} as {The Yeomen of the Guard} ?
 SPARQL: SELECT ?value WHERE { wd:Q212692 p:P800 ?s . ?s ps:P800 wd:Q499778 . ?s pq:P2754 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'production date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Sullivan', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'The Yeomen of the Guard'}}}

 Q: Did {Goldie_Hawn} {ethnic group} {Hispanic and Latino Americans}?
 SPARQL: ASK WHERE { wd:Q188459 wdt:P172 wd:Q58669 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Goldie Hawn', 'p': 'ethnic group', 'o': '?x0', '?x0': 'Hispanic and Latino Americans'}]

 Q: What is the genetic association of leprosy?
 SPARQL: select distinct ?answer where { wd:Q36956 wdt:P2293 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'leprosy', 'p': 'genetic association', 'o': '?x0'}

 Q: What book by Siegfried has the famous work Tristan und Isolde?
 SPARQL: SELECT ?answer WHERE { wd:Q333146 wdt:P87 ?answer . ?answer wdt:P800 wd:Q1324254}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Siegfried', 'p': 'book by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'work', 'o': 'Tristan und Isolde'}}

 Q: What is {part of constellation} of {orbits} of {HD 45364 b} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5174324 wdt:P397 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'HD 45364 b', 'p': 'orbits', 'o': '$y0'}}

 Q: Give me {political party} that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is in Angles, whose partner city is Hyōgo Prefecture?
 SPARQL: SELECT ?answer WHERE { wd:Q104238 wdt:P276 ?answer . ?answer wdt:P190 wd:Q130290}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Angles', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'Hyōgo Prefecture'}}

 Q: What is the FilmAffinity ID for Sherlock?
 SPARQL: select distinct ?answer where { wd:Q192837 wdt:P480 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sherlock', 'p': 'FilmAffinity ID', 'o': '?x0'}

 Q: Name an infectious disease that afflicts liver and that contains the word "hepatitis" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18123741 . ?sbj wdt:P689 wd:Q9368 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hepatitis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'infectious disease', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'afflicts', 'o': 'liver'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hepatitis'}}

 Q: Which is the Cycling Database ID for Lance Armstrong?
 SPARQL: select distinct ?answer where { wd:Q2172 wdt:P1664 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lance Armstrong', 'p': 'Cycling Database ID', 'o': '?x0'}

 Q: Which is the taxon rank for class?
 SPARQL: select distinct ?answer where { ?answer wdt:P105 wd:Q37517}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'taxon rank', 'o': 'class'}

 Q: Give me {taxon} that {taxon rank} {family} and which contains the word {xyridaceae} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj wdt:P105 wd:Q35409 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xyridaceae')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon rank', 'o': 'family'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'xyridaceae'}}

 Q: What is {diameter} of {5.56×45mm NATO} that is {applies to part} is {base} ?
 SPARQL: SELECT ?obj WHERE { wd:Q238456 p:P2386 ?s . ?s ps:P2386 ?obj . ?s pq:P518 wd:Q29841371 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diameter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '5.56×45mm NATO', 'p': 'diameter', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'base'}}}

