 Q: What is {start time} and {end time} of {{Charles I of England} has {position held} as {monarch of Scotland}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q81506 p:P39 ?s . ?s ps:P39 wd:Q18810063 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles I of England', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of Scotland'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'until', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles I of England', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of Scotland'}}}]

 Q: What are interdisciplinary science which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1665984 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'interdisciplinary science'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {made from} of {Sichuan pepper}, that has {taxon parent} is {Zanthoxylum} ?
 SPARQL: SELECT ?answer WHERE { wd:Q756800 wdt:P1582 ?answer . ?answer wdt:P171 wd:Q147050}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sichuan pepper', 'p': 'made from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon parent', 'o': 'Zanthoxylum'}}

 Q: What disputed territory in Levant is located on terrain feature?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P706 wd:Q81483 . ?sbj wdt:P31 wd:Q15239622 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Levant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disputed territory'}}

 Q: Who is the thunder god that appears as Artemis?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4675 wd:Q39503 . ?sbj wdt:P31 wd:Q842697 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'appears as', 'o': 'Artemis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'thunder god'}}

 Q: What is <place of death> of <Las Vegas> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P20 wd:Q23768}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Las Vegas'}

 Q: What is the {canal} for {terminus location} of {Bruges}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P609 wd:Q12994 . ?sbj wdt:P31 wd:Q12284 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'terminus location', 'o': 'Bruges', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'canal'}}

 Q: Which is the bibliography for the list of works of Jessica Lange?
 SPARQL:  select distinct ?obj where { wd:Q173585 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q1631107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jessica Lange', 'p': 'list of works', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bibliography'}}

 Q: What is the circle of Cornelius Jansen?
 SPARQL: select distinct ?answer where { ?answer wdt:P1776 wd:Q318943}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'circle of', 'o': 'Cornelius Jansen'}

 Q: What is the gender of Sancho Panza, who is often confused with being a man?
 SPARQL: SELECT ?answer WHERE { wd:Q630823 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sancho Panza', 'p': 'gender', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'confused with', 'o': 'man'}}

 Q: What is {higher taxon} of {budgerigar}, that has {common name} is {Budgerigar} ?
 SPARQL: SELECT ?answer WHERE { wd:Q121221 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Budgerigar'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'budgerigar', 'p': 'higher taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'common name', 'o': 'budgerigar'}}

 Q: What is the {chemical compound} for {medical condition treated} of {bipolar disorder}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q131755 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'bipolar disorder', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is the {historical country} for {replaced by} of {Joseon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1366 wd:Q28179 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Joseon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: What is {notable event} of {papers at} of {KLM} ?
 SPARQL: SELECT ?answer WHERE { wd:Q181912 wdt:P485 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'notable event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'KLM', 'p': 'papers at', 'o': '$y0'}}

 Q: What is {disciple} of {Zeno of Citium}, that has {dead} is {-232-1-1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171303 wdt:P802 ?answer . ?answer wdt:P570 ?x FILTER(contains(?x,'-232-1-1'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zeno of Citium', 'p': 'disciple', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'dead', 'o': '-232-1-1'}}

 Q: What is the {pureblood} for {characters} of {Harry Potter}
 SPARQL:  select distinct ?obj where { wd:Q8337 wdt:P674 ?obj . ?obj wdt:P31 wd:Q12372870 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Harry Potter', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pureblood'}}

 Q: Tell me slave rebellion whose name have the word war in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1155622 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'slave rebellion'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'war'}}

 Q: Is the lower flammable limit of the hydrogen cyanide equal to 5.6?
 SPARQL: ASK WHERE { wd:Q26075 wdt:P2202 ?obj filter(?obj = 5.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'hydrogen cyanide', 'p': 'lower flammable limit', 'o': '?x0', '?x0': '5.6'}

 Q: Does the number of injured of the Monbar Hotel attack equals 1?
 SPARQL: ASK WHERE { wd:Q15255064 wdt:P1339 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Monbar Hotel attack', 'p': 'number of injured', 'o': '?x0', '?x0': '1'}

 Q: What is {characters} of {Faust}, that has {female} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29478 wdt:P674 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Faust', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'man', 'o': 'male'}}

 Q: what is geographic region that starts with s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82794 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'š')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geographic region'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'š'}}

 Q: Mount Rushmore is in what mountain range?
 SPARQL: select distinct ?answer where { wd:Q83497 wdt:P4552 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mount Rushmore', 'p': 'mountain range', 'o': '?x0'}

 Q: How many {this taxon is source of} are to/by {Sichuan pepper} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1672 wd:Q756800 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'this taxon is source of', 'o': 'Sichuan pepper'}

 Q: who is the art movement for movement of John Cage?
 SPARQL:  select distinct ?obj where { wd:Q180727 wdt:P135 ?obj . ?obj wdt:P31 wd:Q968159 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Cage', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art movement'}}

 Q: Is it true that the Duvall Earthquake's aftershocks equalled 54.0?
 SPARQL: ASK WHERE { wd:Q5317612 wdt:P2320 ?obj filter(?obj = 54.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Duvall earthquake', 'p': 'aftershocks', 'o': '?x0', '?x0': '54.0'}

 Q: what is the {series ordinal} for {The Lord of the Rings} has {award received} as {NPR Top 100 Science Fiction and Fantasy Books} ?
 SPARQL: SELECT ?value WHERE { wd:Q15228 p:P166 ?s . ?s ps:P166 wd:Q20899118 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Lord of the Rings', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'NPR Top 100 Science Fiction and Fantasy Books'}}}

 Q: What is {date of death} and {date of birth} of {{Frederick William I of Prussia} has {child} as {Prince Augustus Ferdinand of Prussia}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q50922 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Prince Augustus Ferdinand of Prussia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'birth date', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Prince Augustus Ferdinand of Prussia'}}}]

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Alan Shearer} has {member of sports team} as {England B national football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q483583 p:P54 ?s . ?s ps:P54 wd:Q1110944 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Shearer', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England B'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Shearer', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England B'}}}]

 Q: What is <Gewässerkennzahl> of <Morava> ?
 SPARQL: select distinct ?answer where { wd:Q179251 wdt:P1183 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Morava', 'p': 'Gewässerkennzahl', 'o': '?x0'}

 Q: Give me {azane} that {safety classification and labelling} {NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response} and which contains the word {hydrazine} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4832226 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hydrazine')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'azane', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'safety classification and labelling', 'o': 'NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hydrazine'}}

 Q: Who was the spouse of Myrna Loy in 1944?
 SPARQL: SELECT ?obj WHERE { wd:Q105941 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1944')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Myrna Loy', 'p': 'spouse', 'o': '?x0', 't': '1944'}

 Q: What is meant by flattening of the Earth?
 SPARQL: select distinct ?answer where { wd:Q2 wdt:P1102 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Earth', 'p': 'flattening', 'o': '?x0'}

 Q: Tell me which is the agricultural deity which starts with the letter s?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24284226 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'agricultural deity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Where is the capital that is adjacent to the Rewari district?
 SPARQL: SELECT ?answer WHERE { wd:Q2301759 wdt:P47 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rewari district', 'p': 'adjacent to', 'o': '$y0'}}

 Q: What is {nominated for} of {Stagecoach} that is {nominee} is {W. Franke Harling} ?
 SPARQL: SELECT ?obj WHERE { wd:Q50714 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q331123 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stagecoach', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'W. Franke Harling'}}}

 Q: What is {elected in} and {end cause} of {{Clement Attlee} has {position held} as {Member of the 38th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 wd:Q41582597 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement Attlee', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 38th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement Attlee', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 38th Parliament of the United Kingdom'}}}]

 Q: what is the {point in time} for {Karl Malone} has {award received} as {All-NBA Team} ?
 SPARQL: SELECT ?value WHERE { wd:Q199896 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Karl Malone', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'All-NBA Team'}, 't': '?x0'}

 Q: What is {educated at} of {Jacques Lacan} that is {end time} is {1919-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q169906 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1919')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacques Lacan', 'p': 'educated at', 'o': '?x0', 't': '1919'}

 Q: Can you describe the state of Hagia Sophia in 1931?
 SPARQL: SELECT ?obj WHERE { wd:Q12506 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1931')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hagia Sophia', 'p': 'type', 'o': '?x0', 't': '1931'}

 Q: Tell me the federal states that starts with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43702 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the area of engineering in the field of work of Claude Shannon?
 SPARQL:  select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q12015335 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Claude Shannon', 'p': 'field of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'area of engineering'}}

 Q: What is {continues from} of {county seat for} of {Erfurt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1729 wdt:P1376 ?X . ?X wdt:P1365 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continues from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Erfurt', 'p': 'county seat of', 'o': '$y0'}}

 Q: What is the {drug} with the {MAX(speed of sound)} whose {found in taxon} is {Homo sapiens}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12140 . ?ent wdt:P2075 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'speed of sound', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'drug', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'found in taxon', 'o': 'Homo sapiens'}}}

 Q: Is the flattening of the moon 0.00125?
 SPARQL: ASK WHERE { wd:Q405 wdt:P1102 ?obj filter(?obj = 0.00125) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'moon', 'p': 'flattening', 'o': '?x0', '?x0': '0.00125'}

 Q: Name the asteroid belonging to an asteroid belt with the highest mean anomaly.
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2325 ?obj . ?ent wdt:P196 wd:Q2179 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'mean anomaly', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asteroid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'minor planet group', 'o': 'asteroid belt'}}}

 Q: Tell me  meteorological phenomenon   whose name has the word WIND IN IT
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16332653 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wind')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'meteorological phenomenon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wind'}}

 Q: What is the {human} for {stepparent} of {Jiang Zemin}
 SPARQL:  select distinct ?obj where { wd:Q16597 wdt:P3448 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jiang Zemin', 'p': 'stepparent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What are the prediction which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748250 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'prediction'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {start time} and {end time} of {{Alfred Marshall} has {residence} as {Marshall House, Cambridge}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q13529 p:P551 ?s . ?s ps:P551 wd:Q6773623 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Marshall', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Marshall House, Cambridge'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'until', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Marshall', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Marshall House, Cambridge'}}}]

 Q: How many notable works did Muriel Spark create?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q233956 wdt:P800 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Muriel Spark', 'p': 'notable work', 'o': '?x0'}

 Q: Which is the takeoff roll for Typhoon?
 SPARQL: select distinct ?answer where { wd:Q151384 wdt:P2430 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Typhoon', 'p': 'takeoff roll', 'o': '?x0'}

 Q: Did {abortion} {has cause} {sexual intercourse} and {vaginal intercourse} ?
 SPARQL: ASK WHERE { wd:Q8452 wdt:P828 wd:Q5873 . wd:Q8452 wdt:P828 wd:Q164654 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'abortion', 'p': 'cause', 'o': '?x0', '?x0': 'sexual intercourse'}, {'h': 'IS', 'v': '?x1', 's': 'abortion', 'p': 'cause', 'o': '?x1', '?x1': 'vaginal intercourse'}]

 Q: What is {publication date} of {Team Fortress 2} that is {distribution} is {retail software} ?
 SPARQL: SELECT ?obj WHERE { wd:Q382108 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P437 wd:Q7316614 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Team Fortress 2', 'p': 'published', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'distribution', 'o': 'retail software'}}}

 Q: How many {field of work} are to/by {Middle Ages} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P101 wd:Q12554 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'fields', 'o': 'Middle Ages'}

 Q: What is the {war} for {participant} of {Allies}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q329888 . ?sbj wdt:P31 wd:Q198 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Allies', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'war'}}

 Q: What is {this taxon is the source of} of {higher taxon} of {Dioscorea cubijensis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55846241 wdt:P171 ?X . ?X wdt:P1672 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'this taxon is the source of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dioscorea cubijensis', 'p': 'higher taxon', 'o': '$y0'}}

 Q: What is the painting of the pendant to Le feu aux poudres?
 SPARQL: SELECT ?answer WHERE { wd:Q19966700 wdt:P1639 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'painting of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Le feu aux poudres', 'p': 'pendant to', 'o': '$y0'}}

 Q: What is the {galaxy} for {child astronomical body} of {Andromeda Galaxy}
 SPARQL:  select distinct ?obj where { wd:Q2469 wdt:P398 ?obj . ?obj wdt:P31 wd:Q318 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andromeda', 'p': 'child astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'galaxy'}}

 Q: What is {award received} of {Brno} where {point in time} is {2008-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q14960 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Brno', 'p': 'award received', 'o': '?x0', 't': '2008'}

 Q: What is {mother tongue} of {Chris Hansen}, that has {has case} is {nominative case} ?
 SPARQL: SELECT ?answer WHERE { wd:Q562448 wdt:P103 ?answer . ?answer wdt:P2989 wd:Q131105}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chris Hansen', 'p': 'mother tongue', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has case', 'o': 'nominative case'}}

 Q: Which {academic major} and {academic degree} of {{Henry Cabot Lodge} was {educated at} as {Harvard University}}?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q174037 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Cabot Lodge', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Cabot Lodge', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}]

 Q: Who is the member of the political party and also the participant of Fedor Emelianenko?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q205953 wdt:P102 ?ans_1 . wd:Q205953 wdt:P1344 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Fedor Emelianenko', 'p': 'party', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Fedor Emelianenko', 'p': 'participant of', 'o': '?x1'}]

 Q: What is the {class of award} for {nominated for} of {Ron Howard}
 SPARQL:  select distinct ?obj where { wd:Q103646 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q38033430 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ron Howard', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'class of award'}}

 Q: who  is the sculpture for collection of Venice?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P195 wd:Q641 . ?sbj wdt:P31 wd:Q860861 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'collection', 'o': 'Venice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sculpture'}}

 Q: Which is indigenous to Liguria?
 SPARQL: select distinct ?answer where { ?answer wdt:P2341 wd:Q1256}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'indigenous to', 'o': 'Liguria'}

 Q: What is {written by} of {prequel of} of {The Structures of Everyday Life} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55399602 wdt:P156 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'written by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Structures of Everyday Life', 'p': 'prequel of', 'o': '$y0'}}

 Q: Which is the ASMP member ID of Jean Tirole?
 SPARQL: select distinct ?answer where { wd:Q173994 wdt:P5362 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean Tirole', 'p': 'ASMP member ID', 'o': '?x0'}

 Q: what is the {character role} for {Lost} has {cast member} as {Yunjin Kim} ?
 SPARQL: SELECT ?value WHERE { wd:Q23567 p:P161 ?s . ?s ps:P161 wd:Q229389 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lost', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Yunjin Kim'}}}

 Q: Which company owns Walt Disney Parks and Resorts?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q1431781 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owns', 'o': 'Disney Parks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'company'}}

 Q: What is the voting round with the  maximum number of abstentions whose office contested is State Vice Governor of Brazil?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5043 ?obj . ?ent wdt:P541 wd:Q51334165 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of abstentions', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'voting round', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'office contested', 'o': 'State Vice Governor of Brazil'}}}

 Q: What is the {national railway} for {location of formation} of {Paris}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P740 wd:Q90 . ?sbj wdt:P31 wd:Q2324835 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'formed in', 'o': 'Paris', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national railway'}}

 Q: Which is a fictional universe described in Bleach?
 SPARQL: select distinct ?answer where { ?answer wdt:P1445 wd:Q904}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fictional universe described in', 'o': 'Bleach'}

 Q: Mobutu Sese Seko is the chairperson for which political party?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q164535 . ?sbj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Mobutu Sese Seko', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: When was the language of the digital signal processor created?
 SPARQL: SELECT ?answer WHERE { wd:Q106370 wdt:P277 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'created', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'digital signal processor', 'p': 'language', 'o': '$y0'}}

 Q: How many were killed by Giovanni Falcone?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q207073 wdt:P157 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Giovanni Falcone', 'p': 'killed by', 'o': '?x0'}

 Q: How many sports are for the {draughts} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P641 wd:Q1293 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'draughts'}

 Q: what is the {determination method} for {Bari} has {population} as {324198.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q3519 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'324198.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bari', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '324198.0'}}}

 Q: what is the {start time} for {Fritz Walter} has {member of sports team} as {Germany national football team} ?
 SPARQL: SELECT ?value WHERE { wd:Q22717 p:P54 ?s . ?s ps:P54 wd:Q43310 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fritz Walter', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Germany national football team'}}}

 Q: What is the reason for Sophocles death on January 1st, 405 BCE?
 SPARQL: SELECT ?value WHERE { wd:Q7235 p:P570 ?s . ?s ps:P570 ?x filter(contains(?x,'-405-1-1')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sophocles', 'p': 'death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'death', 'o': '-405-1-1'}}}

 Q: Which is the animated feature film where David Spade is a voice actor?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q298658 . ?sbj wdt:P31 wd:Q29168811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'David Spade', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated feature film'}}

 Q: "Which exchange of Nokia, is shown in Die Hard with a Vengeance?"
 SPARQL: SELECT ?answer WHERE { wd:Q1418 wdt:P414 ?answer . ?answer wdt:P1441 wd:Q106871}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nokia', 'p': 'exchange', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is shown in', 'o': 'Die Hard with a Vengeance'}}

 Q: Which cultural area has the lowest total imports from the significant event Harrying of the North
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q518261 . ?ent wdt:P2136 ?obj . ?ent wdt:P793 wd:Q1703402} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'total imports', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cultural area', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Harrying of the North'}}}

 Q: What is the {doctoral thesis} for {doctoral thesis} of {Stephen Hawking}
 SPARQL:  select distinct ?obj where { wd:Q17714 wdt:P1026 ?obj . ?obj wdt:P31 wd:Q187685 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stephen Hawking', 'p': 'thesis', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'doctoral thesis'}}

 Q: What is {environment} of {Five Nights at Freddy's}, that has {licence} is {GNU General Public License} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19847113 wdt:P400 ?answer . ?answer wdt:P275 wd:Q7603}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Five Nights at Freddy's", 'p': 'environment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'licence', 'o': 'GNU General Public License'}}

