
 Q: What is the {periodical literature} for {mouthpiece} of {Delta Air Lines}
 SPARQL:  select distinct ?obj where { wd:Q188920 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Delta Air Lines', 'p': 'mouthpiece', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'periodical'}}

 Q: What is {prequel of} of {phase of matter} of {Galinstan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q675176 wdt:P515 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prequel of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Galinstan', 'p': 'phase of matter', 'o': '$y0'}}

 Q: Which is the operating income for Qantas?
 SPARQL: select distinct ?answer where { wd:Q32491 wdt:P3362 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Qantas', 'p': 'operating income', 'o': '?x0'}

 Q: which cola starts with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cola'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: Is the right ascension of malin 1 less than 15.1398?
 SPARQL: ASK WHERE { wd:Q4180017 wdt:P6257 ?obj filter(?obj < 15.1398) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Malin 1', 'p': 'right ascension', 'o': '?x0', '?x0': '15.1398'}

 Q: What is the {discography} for {discography} of {Jerry Lee Lewis}
 SPARQL:  select distinct ?obj where { wd:Q202729 wdt:P358 ?obj . ?obj wdt:P31 wd:Q273057 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jerry Lee Lewis', 'p': 'discography', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discography'}}

 Q: What is {prizewinner} of {sequel is} of {1885 Wimbledon Championships – Gentlemen's Singles} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1356316 wdt:P156 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "1885 Wimbledon Championships – Gentlemen's Singles", 'p': 'sequel is', 'o': '$y0'}}

 Q: Is it true that the carbon footprint of the iPhone X Max is 106?
 SPARQL: ASK WHERE { wd:Q56599233 wdt:P5991 ?obj filter(?obj = 106) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'iPhone Xs Max', 'p': 'carbon footprint', 'o': '?x0', '?x0': '106'}

 Q: Give me {female beauty pageant} that {operating area} {all countries} and which contains the word {model} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'female beauty pageant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operating area', 'o': 'all countries'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'model'}}

 Q: Did {Lindsey_Vonn} {participant of} {FIS Alpine World Ski Championships 1999} and {FIS Alpine World Ski Championships 2019} ?
 SPARQL: ASK WHERE { wd:Q10068 wdt:P1344 wd:Q1428251 . wd:Q10068 wdt:P1344 wd:Q15263420 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lindsey Vonn', 'p': 'participant of', 'o': '?x0', '?x0': 'FIS Alpine World Ski Championships 1999'}, {'h': 'IS', 'v': '?x1', 's': 'Lindsey Vonn', 'p': 'participant of', 'o': '?x1', '?x1': 'FIS Alpine World Ski Championships 2019'}]

 Q: What is {position held} of {Angela Merkel} that is {start time} is {1994-11-10} ?
 SPARQL: SELECT ?obj WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Angela Merkel', 'p': 'position held', 'o': '?x0', 't': '1994'}

 Q: What is {population} of {Spokane} that is {point in time} is {2007-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q187805 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spokane', 'p': 'population', 'o': '?x0', 't': '2007'}

 Q: What is the {essential medicine} for {medical condition treated} of {leprosy}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q36956 . ?sbj wdt:P31 wd:Q35456 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'leprosy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essential medicine'}}

 Q: Which is HanCinema person ID for Zhang Ziyi?
 SPARQL: select distinct ?answer where { wd:Q180852 wdt:P3045 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zhang Ziyi', 'p': 'HanCinema person ID', 'o': '?x0'}

 Q: What is the boiling point of pressure copper as 4703.0?
 SPARQL: SELECT ?value WHERE { wd:Q753 p:P2102 ?s . ?s ps:P2102 ?x filter(contains(?x,'4703.0')) . ?s pq:P2077 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'copper', 'p': 'boiling point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'boiling point', 'o': '4703.0'}}}

 Q: What is {played by} of {succeded by} of {Sleepwalking} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7539946 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sleepwalking', 'p': 'succeded by', 'o': '$y0'}}

 Q: What did Clifton Chenier get nominated for in 1983-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q1101377 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Clifton Chenier', 'p': 'nominated for', 'o': '?x0', 't': '1983'}

 Q: What is <wears> of <Ambrose Burnside> ?
 SPARQL: select distinct ?answer where { wd:Q355444 wdt:P3828 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ambrose Burnside', 'p': 'wears', 'o': '?x0'}

 Q: Which Class IB flammable liquid has the least lower flammable limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2202 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'lower flammable limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IB flammable liquid'}}

 Q: What is the material used and approved by Mojito?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q487338 wdt:P186 ?ans_1 . wd:Q487338 wdt:P790 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Mojito', 'p': 'material used', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Mojito', 'p': 'approved by', 'o': '?x1'}]

 Q: What is the {history of a country or state} for {history of topic} of {Korea}
 SPARQL:  select distinct ?obj where { wd:Q18097 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q17544377 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Korea', 'p': 'history of topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'history of a country or state'}}

 Q: Is Kevin Costner owner of Fielders Stadium?
 SPARQL: ASK WHERE { wd:Q11930 wdt:P1830 wd:Q5447154 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kevin Costner', 'p': 'owner of', 'o': '?x0', '?x0': 'Fielders Stadium'}]

 Q: Which is the YouTube channel ID for Miley Cyrus?
 SPARQL: select distinct ?answer where { wd:Q4235 wdt:P2397 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miley Cyrus', 'p': 'YouTube channel ID', 'o': '?x0'}

 Q: What is a skill that starts with the letter s.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skill'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: How many {from fictional universe} are for {Captain America} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q190679 wdt:P1080 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Captain America', 'p': 'universe', 'o': '?x0'}

 Q: What award did Danila Kozlovsky receive in 2017?
 SPARQL: SELECT ?obj WHERE { wd:Q3015088 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Danila Kozlovsky', 'p': 'award', 'o': '?x0', 't': '2017'}

 Q: Who is the student that coined the Euler-Lagrange equation?
 SPARQL: SELECT ?answer WHERE { wd:Q875744 wdt:P61 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'student', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Euler-Lagrange equation', 'p': 'coined', 'o': '$y0'}}

 Q: What is the {website} for {subsidiary} of {Twitch}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P355 wd:Q4555537 . ?sbj wdt:P31 wd:Q35127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'Twitch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'website'}}

 Q: Is the minimal lethal dose of the benzene equal to 170000?
 SPARQL: ASK WHERE { wd:Q2270 wdt:P2300 ?obj filter(?obj = 170000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'benzene', 'p': 'minimal lethal dose', 'o': '?x0', '?x0': '170000'}

 Q: Who is the person that was a student of Ivan Pavlov?
 SPARQL:  select distinct ?obj where { wd:Q42985 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ivan Pavlov', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: is the clock speed of the Watara Supervision smaller than 3.2?
 SPARQL: ASK WHERE { wd:Q732683 wdt:P2149 ?obj filter(?obj < 3.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Watara Supervision', 'p': 'clock speed', 'o': '?x0', '?x0': '3.2'}

 Q: What is the {sovereign state} for {diplomatic relation} of {African Union}
 SPARQL:  select distinct ?obj where { wd:Q7159 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'African Union', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who works for the accused Mariposa Folk Festival 1974?
 SPARQL: SELECT ?answer WHERE { wd:Q54554872 wdt:P710 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'works for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mariposa Folk Festival 1974', 'p': 'accused', 'o': '$y0'}}

 Q: What is the {neighborhood} for {shares border with} of {Los Angeles}
 SPARQL:  select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q123705 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Los Angeles', 'p': 'shares border with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'neighborhood'}}

 Q: What sister city was born in of Zakhar Oskotsky?
 SPARQL: SELECT ?answer WHERE { wd:Q4338004 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zakhar Oskotsky', 'p': 'born in', 'o': '$y0'}}

 Q: Tell me the name of a fantastique genre that starts with the letter s.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20076756 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fantastique genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the {medal} for {award received} of {Angela Lansbury}
 SPARQL:  select distinct ?obj where { wd:Q206856 wdt:P166 ?obj . ?obj wdt:P31 wd:Q131647 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Angela Lansbury', 'p': 'award received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medal'}}

 Q: What is the musical score by Missa Solemnis that has mother Maria Magdalena van Beethoven?
 SPARQL: SELECT ?answer WHERE { wd:Q723790 wdt:P86 ?answer . ?answer wdt:P25 wd:Q14507972}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Missa Solemnis', 'p': 'musical score by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mother', 'o': 'Maria Magdalena van Beethoven'}}

 Q: what is the {point in time} for {Robert De Niro} has {residence} as {Marbletown} ?
 SPARQL: SELECT ?value WHERE { wd:Q36949 p:P551 ?s . ?s ps:P551 wd:Q3708911 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert De Niro', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Marbletown'}, 't': '?x0'}

 Q: Tell me organization whose name has the word  zollkriminalamt  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zollkriminalamt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zollkriminalamt'}}

 Q: Which member state of the International Centre for Settlement of Investment Disputes has the maximum inflation rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7275 . ?ent wdt:P1279 ?obj . ?ent wdt:P463 wd:Q899770 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'inflation rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Centre for Settlement of Investment Disputes'}}}

 Q: Was Brittany Murphy a citizen of the USA?
 SPARQL: ASK WHERE { wd:Q168847 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Brittany Murphy', 'p': 'citizen of', 'o': '?x0', '?x0': 'USA'}]

 Q: Who is the partner and the spouse of Hank Azaria?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q202056 wdt:P451 ?ans_1 . wd:Q202056 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hank Azaria', 'p': 'partner', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hank Azaria', 'p': 'spouse', 'o': '?x1'}]

 Q: Does St. Peters Junior School maximum age equal to 11?
 SPARQL: ASK WHERE { wd:Q60298462 wdt:P4135 ?obj filter(?obj = 11) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "St Peter's Junior School", 'p': 'maximum age', 'o': '?x0', '?x0': '11'}

 Q: Which country has highest individual tax rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2834 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'individual tax rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: what is the {point in time} for {James Thomas Farrell} has {award received} as {St. Louis Literary Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q1371154 p:P166 ?s . ?s ps:P166 wd:Q7589655 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'James Thomas Farrell', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'St. Louis Literary Award'}, 't': '?x0'}

 Q: what is the {end time} for {Pablo Picasso} has {partner} as {Fernande Olivier} ?
 SPARQL: SELECT ?value WHERE { wd:Q5593 p:P451 ?s . ?s ps:P451 wd:Q453775 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pablo Picasso', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Fernande Olivier'}}}

 Q: What are the coordinates for the geographic center of Michigan, as determined by the center of gravity of the surface?
 SPARQL: SELECT ?obj WHERE { wd:Q1166 p:P5140 ?s . ?s ps:P5140 ?obj . ?s pq:P459 wd:Q53329492 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'geographic center', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michigan', 'p': 'geographic center', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determined by', 'o': 'center of gravity of the surface'}}}

 Q: Is the life expectancy of Indonesia 55.3528?
 SPARQL: ASK WHERE { wd:Q252 wdt:P2250 ?obj filter(?obj = 55.3528) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Indonesia', 'p': 'life expectancy', 'o': '?x0', '?x0': '55.3528'}

 Q: what is the {start time} for {Emmerson Mnangagwa} has {educated at} as {University of Zambia} ?
 SPARQL: SELECT ?value WHERE { wd:Q510523 p:P69 ?s . ?s ps:P69 wd:Q2096836 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmerson Mnangagwa', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Zambia'}}}

 Q: what is hypothetical protein ecia139-4120 habitat of found in species?
 SPARQL: SELECT ?answer WHERE { wd:Q22226273 wdt:P703 ?X . ?X wdt:P2974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'habitat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hypothetical protein', 'p': 'found in species', 'o': '$y0'}}

 Q: What sovereign state replaced the Kingdom of Great Britain?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1365 wd:Q161885 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced', 'o': 'Great Britain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Of the century breaks of the Colm Gilcreest equal less than 9.6?
 SPARQL: ASK WHERE { wd:Q671965 wdt:P4912 ?obj filter(?obj < 9.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Colm Gilcreest', 'p': 'century breaks', 'o': '?x0', '?x0': '9.6'}

 Q: What is the {historical country} for {country} of {Golden Horde}
 SPARQL:  select distinct ?obj where { wd:Q79965 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Golden Horde', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Located in the Central District, what is the county seat whose twin cities include Feodosiya?
 SPARQL: SELECT ?answer WHERE { wd:Q188785 wdt:P36 ?answer . ?answer wdt:P190 wd:Q158491}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Central District', 'p': 'county seat', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin cities', 'o': 'Feodosiya'}}

 Q: When did Nicaragua count a population of 3.87732e+06 inhabitants?
 SPARQL: SELECT ?value WHERE { wd:Q811 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'3.87732e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nicaragua', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '3.87732e+06'}, 't': '?x0'}

 Q: What is <statement is subject of> of <emigration> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P805 wd:Q187668}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'statement is subject of', 'o': 'emigration'}

 Q: Which is the meta-organization that is regulated by the football association?
 SPARQL:  select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q37178026 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'football', 'p': 'regulated by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'meta-organization'}}

 Q: When was the spouse divorced Nero in 9-6-68
 SPARQL: SELECT ?obj WHERE { wd:Q1413 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(?x,'68-6-9')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'spouse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nero', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'divorced', 'o': '68-6-9'}}}

 Q: What is the {written work} for {has edition} of {Septuagint}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P747 wd:Q29334 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'Septuagint', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is {award} of {Art Spiegelman}, that has {champ} is {Francisco X. Alarcón} ?
 SPARQL: SELECT ?answer WHERE { wd:Q325945 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q5484051}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Art Spiegelman', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'champion', 'o': 'Francisco X. Alarcón'}}

 Q: Are there more than 0 survivors of the Charkhi Dadri mid-air collision
 SPARQL: ASK WHERE { wd:Q118373 wdt:P1561 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Charkhi Dadri mid-air collision', 'p': 'survivors', 'o': '?x0', '?x0': '0'}

 Q: what is the {point in time} for {Secretariat} has {award received} as {Triple Crown Trophy} ?
 SPARQL: SELECT ?value WHERE { wd:Q1151926 p:P166 ?s . ?s ps:P166 wd:Q7843370 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Secretariat', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Triple Crown Trophy'}, 't': '?x0'}

 Q: Which borders of borders of Riverside have a start date of 1984-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q49243 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1984'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Riverside', 'p': 'border', 'o': '?x0', 't': '1984'}

 Q: Which is the facility of the defensive wall?
 SPARQL: select distinct ?answer where { ?answer wdt:P912 wd:Q57346}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'facility', 'o': 'defensive wall'}

 Q: What is  in the IHO Hydrographic Dictionary (S-32) Number of lighthouse ?
 SPARQL: select distinct ?answer where { wd:Q39715 wdt:P2480 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'lighthouse', 'p': 'IHO Hydrographic Dictionary (S-32) Number', 'o': '?x0'}

 Q: Which is the fictional analog of Hippocampus?
 SPARQL: select distinct ?answer where { ?answer wdt:P1074 wd:Q74363}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fictional analog of', 'o': 'Hippocampus'}

 Q: Give me {cause of death} that {medical examinations} {computed tomography} and which that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1931388 . ?sbj wdt:P923 wd:Q32566 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cause of death', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'medical examinations', 'o': 'CT scan'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is established by Archbishop of Canterbury, who is a male?
 SPARQL: SELECT ?answer WHERE { wd:Q29282 wdt:P112 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Archbishop of Canterbury', 'p': 'established by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'male'}}

 Q: what is the {Commons category} for {Fernandel} has {place of burial} as {Passy Cemetery} ?
 SPARQL: SELECT ?value WHERE { wd:Q129092 p:P119 ?s . ?s ps:P119 wd:Q1092107 . ?s pq:P373 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Commons category', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fernandel', 'p': 'buried at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'buried at', 'o': 'Passy Cemetery'}}}

 Q: What is {namesake} of {cayenne pepper}, that has {construction date} is {1664-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6598 wdt:P138 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1664'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cayenne pepper', 'p': 'namesake', 'o': '?x0', 't': '1664'}

 Q: Is the throughput of the Vest-vassdraget equal to 2697.672?
 SPARQL: ASK WHERE { wd:Q58370919 wdt:P2957 ?obj filter(?obj = 2697.672) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vest-vassdraget', 'p': 'throughput', 'o': '?x0', '?x0': '2697.672'}

 Q: What method did the census use to determine the population of Taguig?
 SPARQL: SELECT ?obj WHERE { wd:Q1643 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taguig', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'method', 'o': 'census'}}}

 Q: What award did Olga Tokarczuk receive in 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q254032 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Olga Tokarczuk', 'p': 'award', 'o': '?x0', 't': '2015'}

 Q: What is <present in work> of <Porky Pig> ?
 SPARQL: select distinct ?answer where { wd:Q937186 wdt:P1441 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Porky Pig', 'p': 'present in work', 'o': '?x0'}

 Q: Was Aleister Crowley educated at Trinity College and Eton College?
 SPARQL: ASK WHERE { wd:Q172684 wdt:P69 wd:Q332342 . wd:Q172684 wdt:P69 wd:Q192088 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Aleister Crowley', 'p': 'educated at', 'o': '?x0', '?x0': 'Trinity College'}, {'h': 'IS', 'v': '?x1', 's': 'Aleister Crowley', 'p': 'educated at', 'o': '?x1', '?x1': 'Eton College'}]

 Q: What is {location of narrative} of {Infinite Jest}, that has {next to} is {Quincy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1077445 wdt:P840 ?answer . ?answer wdt:P47 wd:Q49143}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Infinite Jest', 'p': 'location of narrative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'next to', 'o': 'Quincy'}}

 Q: what is the {conferred by} for {Eric Hobsbawm} has {award received} as {doctor honoris causa} ?
 SPARQL: SELECT ?value WHERE { wd:Q34933 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P1027 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conferred by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eric Hobsbawm', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'honorary doctor'}}}

 Q: What was the last team Allan Border belonged to in the year 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q1392194 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Allan Border', 'p': 'team', 'o': '?x0', 't': '1980'}

 Q: Give me {film character} that {from fictional universe} {Marvel Universe} and which that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'universe', 'o': 'Marvel Universe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {fictional universe} for {fictional universe described in} of {The Matrix}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1445 wd:Q83495 . ?sbj wdt:P31 wd:Q559618 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fictional universe described in', 'o': 'The Matrix', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional universe'}}

 Q: What is {award received} of {Hans Krebs} where {point in time} is {1966-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q57191 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hans Krebs', 'p': 'award received', 'o': '?x0', 't': '1966'}

 Q: Which record label signed Janet Jackson?
 SPARQL:  select distinct ?obj where { wd:Q131324 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Janet Jackson', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record label'}}

 Q: What is Tanzania's total reserves?
 SPARQL: select distinct ?answer where { wd:Q924 wdt:P2134 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tanzania', 'p': 'total reserves', 'o': '?x0'}

 Q: Does the slope rating of the Merion Golf Club equal 149
 SPARQL: ASK WHERE { wd:Q3962734 wdt:P3840 ?obj filter(?obj = 149) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Merion Golf Club', 'p': 'slope rating', 'o': '?x0', '?x0': '149'}

 Q: What is the density of hydrogen peroxide at a temperature of 20.0?
 SPARQL: SELECT ?obj WHERE { wd:Q171877 p:P2054 ?s . ?s ps:P2054 ?obj . ?s pq:P2076 ?x filter(contains(?x,'20.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'density', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hydrogen peroxide', 'p': 'density', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'temperature', 'o': '20.0'}}}

 Q: What is {architecture firm} of {home field} of {New York Centaurs} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16845909 wdt:P115 ?X . ?X wdt:P84 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'architect', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'New York Centaurs', 'p': 'home field', 'o': '$y0'}}

 Q: Which { meansseason starts} in {February} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4794 wd:Q109}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'season starts', 'o': 'February'}

 Q: Who is {champ} of {prize awarded} {Lily Tomlin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q229271 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lily Tomlin', 'p': 'award', 'o': '$y0'}}

 Q: What is {cartridge} of {Minigun}, that has {participated in conflict} is {Vietnam War} ?
 SPARQL: SELECT ?answer WHERE { wd:Q864060 wdt:P739 ?answer . ?answer wdt:P607 wd:Q8740}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Minigun', 'p': 'ammunition', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'war', 'o': 'Vietnam War'}}

 Q: Tell me every horse breed whose name starts with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'horse breed'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: The University of Florida is a member of which coalition?
 SPARQL:  select distinct ?obj where { wd:Q501758 wdt:P463 ?obj . ?obj wdt:P31 wd:Q124964 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Florida', 'p': 'member of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'coalition'}}

 Q: What is {brother-in-law} of {writer} of {Quran} ?
 SPARQL: SELECT ?answer WHERE { wd:Q428 wdt:P50 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'brother-in-law', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Quran', 'p': 'writer', 'o': '$y0'}}

 Q: What is <New Zealand Gazetteer place ID> of <Auckland> ?
 SPARQL: select distinct ?answer where { wd:Q37100 wdt:P5104 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Auckland', 'p': 'New Zealand Gazetteer place ID', 'o': '?x0'}

 Q: What is {represents} of {Grande Odalisque}, that has {DRTL} is {backwards} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1978815 wdt:P180 ?answer . ?answer wdt:P654 wd:Q16938807}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Grande Odalisque', 'p': 'represents', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'DRTL', 'o': 'backwards'}}

