 Q: What is the national necropolis in France with the highest quantity buried whose located in the administrative territorial entity is Souain-Perthes-lès-Hurlus?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19951362 . ?ent wdt:P2324 ?obj . ?ent wdt:P131 wd:Q544505 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'quantity buried', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national necropolis in France', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Souain-Perthes-lès-Hurlus'}}}

 Q: What is the {country} for {participant} of {Battle of France}
 SPARQL:  select distinct ?obj where { wd:Q151340 wdt:P710 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Battle of France', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'countries'}}

 Q: Give me {TV production company} that contains the word {tv} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10689397 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tv')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'production company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tv'}}

 Q: what is the {statement is subject of} for {Angela Lansbury} has {award received} as {Tony Award for Best Actress in a Musical} ?
 SPARQL: SELECT ?value WHERE { wd:Q206856 p:P166 ?s . ?s ps:P166 wd:Q1537996 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angela Lansbury', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Tony Award for Best Actress in a Musical'}}}

 Q: What is the higher taxon of Mammut, whose vernacular name is Mastodonty?
 SPARQL: SELECT ?answer WHERE { wd:Q192272 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Mastodonty'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mammut', 'p': 'higher taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': 'mastodonty'}}

 Q: Who was the significant person during the trial Brown v. Board of Education?
 SPARQL: select distinct ?answer where { wd:Q875738 wdt:P3342 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brown v. Board of Education', 'p': 'significant person', 'o': '?x0'}

 Q: Give me {ice hockey team} that {league} {National Hockey League} and which contains the word {ottawa} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P118 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ottawa')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hockey team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'league', 'o': 'NHL'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ottawa'}}

 Q: Tell me national cuisine whose name has the word mex in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national cuisine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'mex'}}

 Q: What is the {referendums in Ireland} with the {MIN(number of spoilt votes)} whose {follows} is {Eighth Amendment of the Constitution of Ireland}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q54086790 . ?ent wdt:P5044 ?obj . ?ent wdt:P155 wd:Q4126745} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of spoilt votes', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'referendums in Ireland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'follows', 'o': 'Eighth Amendment of the Constitution of Ireland'}}}

 Q: How many Doctor Who spin-offs are there?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q34316 wdt:P2512 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Doctor Who', 'p': 'spin-offs', 'o': '?x0'}

 Q: What is {academic field for} of {scientific area} of {Zdzisław Szymański} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9389874 wdt:P101 ?X . ?X wdt:P2578 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic field for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zdzisław Szymański', 'p': 'area', 'o': '$y0'}}

 Q: Which in {battle} {has daughter} of {Yeon Taejo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q703988 wdt:P40 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'battle', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yeon Taejo', 'p': 'daughter', 'o': '$y0'}}

 Q: What is the height record held by Renaud Lavillenie?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1742 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P2048 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'height', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Renaud Lavillenie', 'p': 'record held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'record held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Renaud Lavillenie', 'p': 'record held', 'o': '$y0'}}]

 Q: What was the population of Burundi in 1992?
 SPARQL: SELECT ?obj WHERE { wd:Q967 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Burundi', 'p': 'population', 'o': '?x0', 't': '1992'}

 Q: Was Aristotle a student of Heraclitus?
 SPARQL: ASK WHERE { wd:Q868 wdt:P1066 wd:Q41155 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Aristotle', 'p': 'student of', 'o': '?x0', '?x0': 'Heraclitus'}]

 Q: What is {member of sports team} of {Kenny Dalglish} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q187198 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kenny Dalglish', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kenny Dalglish', 'p': 'team', 'o': '$y0'}}]

 Q: what is the {start time} for {Nicolás Maduro} has {position held} as {Secretary General of the Non-Aligned Movement} ?
 SPARQL: SELECT ?value WHERE { wd:Q58132 p:P39 ?s . ?s ps:P39 wd:Q15647601 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nicolás Maduro', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary General of the Non-Aligned Movement'}}}

 Q: Which is the CPU of Pac-Man?
 SPARQL: select distinct ?answer where { wd:Q173626 wdt:P880 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pac-Man', 'p': 'CPU', 'o': '?x0'}

 Q: Which is FAO 2007 genetic resource ID for Hereford?
 SPARQL: select distinct ?answer where { wd:Q737173 wdt:P3380 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hereford', 'p': 'FAO 2007 genetic resource ID', 'o': '?x0'}

 Q: Which is the RKDartists ID of Donatello?
 SPARQL: select distinct ?answer where { wd:Q37562 wdt:P650 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Donatello', 'p': 'RKDartists ID', 'o': '?x0'}

 Q: What film production company was founded by Oprah Winfrey?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P112 wd:Q55800 . ?sbj wdt:P31 wd:Q1762059 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Oprah Winfrey', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film production company'}}

 Q: Tell me numeric writing system whose name has the word numerals in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q140774 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'numerals')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'numeric writing system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'numerals'}}

 Q: What is {developer of} of {continent} of {Amundsen Sea} ?
 SPARQL: SELECT ?answer WHERE { wd:Q72154 wdt:P30 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'developer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amundsen Sea', 'p': 'continent', 'o': '$y0'}}

 Q: What is the birth place of Annie Oakley, is it correct that it has 52501.0 inhabitants?
 SPARQL: SELECT ?answer WHERE { wd:Q230935 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'52501.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Annie Oakley', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '52501.0'}}

 Q: What is the {member of sports team} and the {position played on team / speciality} of {Thierry_Henry} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q45901 wdt:P54 ?ans_1 . wd:Q45901 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Thierry Henry', 'p': 'team', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Thierry Henry', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: What is the {supplementary intercardinal direction} with the {MAX(position angle)} whose {opposite of} is {east-northeast}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22809326 . ?ent wdt:P2211 ?obj . ?ent wdt:P461 wd:Q12593409 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'position angle', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'supplementary intercardinal direction', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'opposite of', 'o': 'east-northeast'}}}

 Q: Which port has the highest production rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q44782 . ?ent wdt:P2197 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'production rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'port'}}

 Q: Tell me sport discipline whose name has the word  wheelchair in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wheelchair')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport discipline'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wheelchair'}}

 Q: Give me {place with town rights and privileges} that {list of monuments} {listed objects in Salzburg} and which contains the word {salzburg} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P1456 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'salzburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'place with town rights and privileges', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'list of monuments', 'o': 'listed objects in Salzburg'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'salzburg'}}

 Q: Did {Mark_David_Chapman} {place of detention} {Attica Correctional Facility} and {Wende Correctional Facility} ?
 SPARQL: ASK WHERE { wd:Q80462 wdt:P2632 wd:Q758034 . wd:Q80462 wdt:P2632 wd:Q7982352 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mark David Chapman', 'p': 'place of detention', 'o': '?x0', '?x0': 'Attica Correctional Facility'}, {'h': 'IS', 'v': '?x1', 's': 'Mark David Chapman', 'p': 'place of detention', 'o': '?x1', '?x1': 'Wende Correctional Facility'}]

 Q: What member of the Ranjitsinhji sports team joined in 1893 ?
 SPARQL: SELECT ?obj WHERE { wd:Q2757835 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1893')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ranjitsinhji', 'p': 'team', 'o': '?x0', 't': '1893'}

 Q: What is {composed by} of {preceded by} of {All We Know} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2315956 wdt:P155 ?X . ?X wdt:P86 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'composer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'All We Know', 'p': 'preceded by', 'o': '$y0'}}

 Q: Name the record label behind the surge of Suge Knight
 SPARQL:  select distinct ?obj where { wd:Q455880 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Suge Knight', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record label'}}

 Q: Who is the member of Münster since 1993-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q2742 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Münster', 'p': 'member of', 'o': '?x0', 't': '1993'}

 Q: What is American Airlines airline hub for the international airport
 SPARQL:  select distinct ?obj where { wd:Q32396 wdt:P113 ?obj . ?obj wdt:P31 wd:Q644371 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Airlines', 'p': 'airline hub', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international airport'}}

 Q: When Rowan Atkinson attended Queen's College, what was his academic major and degree?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q23760 p:P69 ?s . ?s ps:P69 wd:Q73094 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rowan Atkinson', 'p': 'attended', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'attended', 'o': "Queen's College"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rowan Atkinson', 'p': 'attended', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'attended', 'o': "Queen's College"}}}]

 Q: Name a {subsidiary company} that {manager/director} {Daniel Schwartz} that starts with the letter {'b'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q658255 . ?sbj wdt:P1037 wd:Q28229358 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'subsidiary', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'manager', 'o': 'Daniel Schwartz'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: Which is the Florentine musea catalogue ID for Primavera?
 SPARQL: select distinct ?answer where { wd:Q549847 wdt:P2242 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Primavera', 'p': 'Florentine musea catalogue ID', 'o': '?x0'}

 Q: what is the {start time} for {Lily Tomlin} has {spouse} as {Jane Wagner} ?
 SPARQL: SELECT ?value WHERE { wd:Q229271 p:P26 ?s . ?s ps:P26 wd:Q13560376 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lily Tomlin', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Jane Wagner'}}}

 Q: What is {educated at} of {Mao Zedong} that is {start time} is {1912-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5816 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1912')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mao Zedong', 'p': 'educated at', 'o': '?x0', 't': '1912'}

 Q: Where is the resting place of dedication of the Church of St Peter?
 SPARQL: SELECT ?answer WHERE { wd:Q17528903 wdt:P825 ?X . ?X wdt:P119 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'resting place', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Church of St Peter', 'p': 'dedication', 'o': '$y0'}}

 Q: What is {sister town} of {deathplace} of {Hafsa bint Umar} ?
 SPARQL: SELECT ?answer WHERE { wd:Q263791 wdt:P20 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hafsa bint Umar', 'p': 'deathplace', 'o': '$y0'}}

 Q: Who is the parent company of the label of Carabao?
 SPARQL: SELECT ?answer WHERE { wd:Q1035286 wdt:P264 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent company of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carabao', 'p': 'label', 'o': '$y0'}}

 Q: What is the {author} and the {cover artist} of {Treasure_Island} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q185118 wdt:P50 ?ans_1 . wd:Q185118 wdt:P736 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Treasure Island', 'p': 'author', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Treasure Island', 'p': 'cover artist', 'o': '?x1'}]

 Q: which series ordinal of osmium tetroxide has ionization energy of 12.6?
 SPARQL: SELECT ?value WHERE { wd:Q422021 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'12.6')) . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'osmium tetroxide', 'p': 'ionization energy', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ionization energy', 'o': '12.6'}}}

 Q: What was Christian Lous Lange nominated for in 1919?
 SPARQL: SELECT ?obj WHERE { wd:Q206446 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1919')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Christian Lous Lange', 'p': 'nominated for', 'o': '?x0', 't': '1919'}

 Q: What is Mikhail Botvinnik's Israel Chess Federation player ID?
 SPARQL: select distinct ?answer where { wd:Q178865 wdt:P3867 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mikhail Botvinnik', 'p': 'Israel Chess Federation player ID', 'o': '?x0'}

 Q: What is {member of sports team} of {Tom Finney} that is {number of matches played} is {433.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q352338 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'433.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tom Finney', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '433.0'}}}

 Q: What is {ultimate cause} of {participant in conflict} of {Vasily Blyukher} ?
 SPARQL: SELECT ?answer WHERE { wd:Q48129 wdt:P607 ?X . ?X wdt:P828 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vasily Blyukher', 'p': 'conflict', 'o': '$y0'}}

 Q: tell me aspect of history name has the word propaganda it it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'propaganda')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of history'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'propaganda'}}

 Q: How many architects worked on the St. Peter's Basilica?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q12512 wdt:P84 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': "St. Peter's Basilica", 'p': 'architect', 'o': '?x0'}

 Q: Did Miles Davis record and label the RCA and Capitol Records?
 SPARQL: ASK WHERE { wd:Q93341 wdt:P264 wd:Q202585 . wd:Q93341 wdt:P264 wd:Q193023 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Miles Davis', 'p': 'label', 'o': '?x0', '?x0': 'RCA'}, {'h': 'IS', 'v': '?x1', 's': 'Miles Davis', 'p': 'label', 'o': '?x1', '?x1': 'Capitol Records'}]

 Q: What is <union of> of <administrative territorial entity> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2737 wd:Q56061}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'union of', 'o': 'administrative territorial entity'}

 Q: What is {inhabitants} of {state} of {Mbuji-Mayi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q319660 wdt:P17 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mbuji-Mayi', 'p': 'state', 'o': '$y0'}}

 Q: What is the {confederation} for {head of government} of {Jefferson Davis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q162269 . ?sbj wdt:P31 wd:Q170156 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Jefferson Davis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'confederation'}}

 Q: Who did Diane von Furstenberg marry in 1969MacGraw
 SPARQL: SELECT ?obj WHERE { wd:Q272438 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Diane von Furstenberg', 'p': 'marry', 'o': '?x0', 't': '1969'}

 Q: What is {commodity} of {built by} of {HH-60 Jayhawk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1892024 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'commodity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jayhawk', 'p': 'built by', 'o': '$y0'}}

 Q: Who is the sibling of Subutai?
 SPARQL: select distinct ?answer where { ?answer wdt:P3373 wd:Q162217}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Subutai'}

 Q: What is {dubbed by} of {series} of {Pretty, Pretty Dresses} ?
 SPARQL: SELECT ?answer WHERE { wd:Q32825539 wdt:P179 ?X . ?X wdt:P725 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dubbed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pretty, Pretty Dresses', 'p': 'series', 'o': '$y0'}}

 Q: What is the subdivided into  of the land of Dubrovka ?
 SPARQL: SELECT ?answer WHERE { wd:Q4903 wdt:P17 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divided into', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dubrovka', 'p': 'land', 'o': '$y0'}}

 Q: What is {date of death} of {Akiva ben Joseph} that is {instance of} is {statement with Gregorian date earlier than 1584} ?
 SPARQL: SELECT ?obj WHERE { wd:Q310821 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Akiva', 'p': 'death date', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'statement with Gregorian date earlier than 1584'}}}

 Q: What are the municipality of Spain that contains the word zumaia in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2074737 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zumaia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Spain'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zumaia'}}

 Q: who Wikimedia category for category for employees of the organization of Columbia University?
 SPARQL:  select distinct ?obj where { wd:Q49088 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Columbia University', 'p': 'category for employees of the organization', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: what is the {location} for {Louis VI of France} has {place of death} as {Château de la Douye} ?
 SPARQL: SELECT ?value WHERE { wd:Q165883 p:P20 ?s . ?s ps:P20 wd:Q48622322 . ?s pq:P276 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis VI of France', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Château de la Douye'}}}

 Q: What is <number of processor cores> of <Xbox One> ?
 SPARQL: select distinct ?answer where { wd:Q13361286 wdt:P1141 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Xbox One', 'p': 'processor cores', 'o': '?x0'}

 Q: What songs are on the tracklist of Led Zeppelin IV?
 SPARQL:  select distinct ?obj where { wd:Q201940 wdt:P658 ?obj . ?obj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Led Zeppelin IV', 'p': 'tracklist', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: What is {parent company of} of {State University of New York}, that has {co-ords} is {43.0062 -76.1973} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1140241 wdt:P355 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'43.0062 -76.1973'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'State University of New York', 'p': 'parent company of', 'o': '?x0'}

 Q: Give me {ice hockey tournament} that contains the word {trophy} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18325242 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ice hockey tournament'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'trophy'}}

 Q: What career uses a fishing reel?
 SPARQL: SELECT ?answer WHERE { wd:Q14373 wdt:P106 ?answer . ?answer wdt:P2283 wd:Q1572168}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'fishing', 'p': 'career', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'fishing reel'}}

 Q: Is the inflation rate of Japan equal to -0.6?
 SPARQL: ASK WHERE { wd:Q17 wdt:P1279 ?obj filter(?obj = -0.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Japan', 'p': 'inflation rate', 'o': '?x0', '?x0': '-0.6'}

 Q: What is the {solvent} for {manifestation of} of {water}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q283 . ?sbj wdt:P31 wd:Q146505 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'water', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'solvent'}}

 Q: Where is the anatomical location of the cerebellum?
 SPARQL: select distinct ?answer where { ?answer wdt:P927 wd:Q130983}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'cerebellum'}

 Q: What is the {written work} for {edition or translation of} of {1}
 SPARQL:  select distinct ?obj where { wd:Q199 wdt:P629 ?obj . ?obj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '1', 'p': 'edition or translation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What sister of Jean Shrimpton has brown eyes?
 SPARQL: SELECT ?answer WHERE { wd:Q20119 wdt:P3373 ?answer . ?answer wdt:P1340 wd:Q17122705}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jean Shrimpton', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'eyes', 'o': 'brown'}}

 Q: what is the {for work} for {Russell Crowe} has {nominated for} as {Academy Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q129817 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Russell Crowe', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}}}

 Q: Give me {vegetation zone} that {continent} {Europe} and which that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj wdt:P30 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vegetation zone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Europe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {human} for {notable work} of {The Count of Monte Cristo}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P800 wd:Q191838 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'notable work', 'o': 'The Count of Monte Cristo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {language of work or name} for {soup} has {pronunciation audio} as {Ru-суп.ogg} ?
 SPARQL: SELECT ?value WHERE { wd:Q41415 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Ru-суп.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'soup', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'ru-суп.ogg'}}}

 Q: In what country was Adelaide founded on 12-28-1836?
 SPARQL: SELECT ?obj WHERE { wd:Q5112 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1836')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Adelaide', 'p': 'country', 'o': '?x0', 't': '1836'}

 Q: What is the {codon} for {encoded by} of {L-Tyrosine}
 SPARQL:  select distinct ?obj where { wd:Q188017 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'L-Tyrosine', 'p': 'encoded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'codon'}}

 Q: What is the name of the music festival that is based on Sanremo Music Festival and that starts with the letter "c"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q868557 . ?sbj wdt:P144 wd:Q206959 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'music festival', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'Sanremo Music Festival'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {personal name} of {David Eddings}, that has {said to be different from} is {Taavet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q354888 wdt:P735 ?answer . ?answer wdt:P460 wd:Q22222753}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'David Eddings', 'p': 'personal name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be different from', 'o': 'Taavet'}}

 Q: What is the {human} for {sibling} of {George II of Great Britain}
 SPARQL:  select distinct ?obj where { wd:Q131981 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George II of Great Britain', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What twinned administrative body of Queensland started on October 10th, 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q36074 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Queensland', 'p': 'twinned administrative body', 'o': '?x0', 't': '1984'}

 Q: was the 2013 german federal election canadidacy age 21.6?
 SPARQL: ASK WHERE { wd:Q555931 wdt:P2998 ?obj filter(?obj < 21.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': '2013 German federal election', 'p': 'age of candidacy', 'o': '?x0', '?x0': '21.6'}

