 Q: what is the {point in time} for {Jan Brueghel the Elder} has {work location} as {Prague} ?
 SPARQL: SELECT ?value WHERE { wd:Q209050 p:P937 ?s . ?s ps:P937 wd:Q1085 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jan Brueghel the Elder', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'Prague'}, 't': '?x0'}

 Q: How many series are with Metroid} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P179 wd:Q12397 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Metroid'}

 Q: Which is the Diamond League athlete ID for Ezekiel Kemboi?
 SPARQL: select distinct ?answer where { wd:Q1677 wdt:P3923 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ezekiel Kemboi', 'p': 'Diamond League athlete ID', 'o': '?x0'}

 Q: What is {discharge} of {Canadian River} that is {location} is {Whitefield} ?
 SPARQL: SELECT ?obj WHERE { wd:Q597753 p:P2225 ?s . ?s ps:P2225 ?obj . ?s pq:P276 wd:Q2380417 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discharge', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Canadian River', 'p': 'discharge', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'location', 'o': 'Whitefield'}}}

 Q: What is {famous works} of {Isabelle Adjani}, that has {inspiring artist} is {Alexandre Dumas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q106383 wdt:P800 ?answer . ?answer wdt:P1877 wd:Q38337}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isabelle Adjani', 'p': 'work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inspiring artist', 'o': 'Alexandre Dumas'}}

 Q: What is {has towns} of {Tottori Prefecture}, that has {point on the globe} is {133.43} ?
 SPARQL: SELECT ?answer WHERE { wd:Q133935 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'133.43'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tottori Prefecture', 'p': 'has towns', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'point on the globe', 'o': '133.43'}}

 Q: which construction has starts with z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q811430 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'construction'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is <Lafonoteca artist ID> of <Miguel Bosé> ?
 SPARQL: select distinct ?answer where { wd:Q356762 wdt:P5295 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miguel Bosé', 'p': 'Lafonoteca artist ID', 'o': '?x0'}

 Q: what is the {start time} for {John McEnroe} has {spouse} as {Patty Smyth} ?
 SPARQL: SELECT ?value WHERE { wd:Q16474 p:P26 ?s . ?s ps:P26 wd:Q444096 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John McEnroe', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Patty Smyth'}}}

 Q: Who was the spouse of Cher in 1979?
 SPARQL: SELECT ?obj WHERE { wd:Q12003 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cher', 'p': 'spouse', 'o': '?x0', 't': '1979'}

 Q: What is the {native language} and the {history of topic} of {Romani_people} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8060 wdt:P103 ?ans_1 . wd:Q8060 wdt:P2184 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Romani', 'p': 'native language', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Romani', 'p': 'history of topic', 'o': '?x1'}]

 Q: What is {member of} of {sovereign state} of {Uppsala University} ?
 SPARQL: SELECT ?answer WHERE { wd:Q185246 wdt:P17 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Uppsala University', 'p': 'sovereign state', 'o': '$y0'}}

 Q: Tell me me a unit of energy whose name consist of the word "joule" and whose based on metre
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2916980 . ?sbj wdt:P144 wd:Q11573 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'joule')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of energy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'metre'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'joule'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Ian Rush} has {member of sports team} as {Liverpool F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q219354 p:P54 ?s . ?s ps:P54 wd:Q1130849 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ian Rush', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Liverpool F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ian Rush', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Liverpool F.C.'}}}]

 Q: What is {aspect of} of {domain} of {filter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3072260 wdt:P2579 ?X . ?X wdt:P1269 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'aspect of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'filter', 'p': 'domain', 'o': '$y0'}}

 Q: Which drug has the highest heat capacity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12140 . ?ent wdt:P2056 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'heat capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'drug'}}

 Q: what is the {point in time} for {Audrey Hepburn} has {award received} as {Grammy Award for Best Spoken Word Album for Children} ?
 SPARQL: SELECT ?value WHERE { wd:Q42786 p:P166 ?s . ?s ps:P166 wd:Q3113382 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Audrey Hepburn', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best Spoken Word Album for Children'}, 't': '?x0'}

 Q: What is the {song} for {present in work} of {hard rock}
 SPARQL:  select distinct ?obj where { wd:Q83270 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hard rock', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: What is the {sovereign state} for {foundational text} of {U.S. Declaration of Independence}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P457 wd:Q127912 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'foundational text', 'o': 'Declaration of Independence', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: tell me border whose name has the starts with I in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133346 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'border'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: "What instrument does Frank Sinatra play that was created by Manuel Nunes?"
 SPARQL: SELECT ?answer WHERE { wd:Q40912 wdt:P1303 ?answer . ?answer wdt:P61 wd:Q21850546}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frank Sinatra', 'p': 'instrument', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'created by', 'o': 'Manuel Nunes'}}

 Q: What is {member of sports team} of {Abby Wambach} that is {number of matches played} is {39.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q233112 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'39.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abby Wambach', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '39.0'}}}

 Q: What are the possible examinations of the murder method of Rattana Pestonji?
 SPARQL: SELECT ?answer WHERE { wd:Q6585331 wdt:P509 ?X . ?X wdt:P923 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'possible examinations', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rattana Pestonji', 'p': 'murder method', 'o': '$y0'}}

 Q: How many students are there in the {Constantin Brâncuși} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q153048 wdt:P802 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Constantin Brâncuși', 'p': 'student', 'o': '?x0'}

 Q: tell me medical attribute whose name starts with w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44476427 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical attribute'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {religious text} for {present in work} of {David}
 SPARQL:  select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: How many {offers view on} are to/by {Grand Canyon} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3173 wd:Q118841 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'offers view on', 'o': 'Grand Canyon'}

 Q: What is the {profession} for {occupation} of {William Shakespeare}
 SPARQL:  select distinct ?obj where { wd:Q692 wdt:P106 ?obj . ?obj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'William Shakespeare', 'p': 'occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: who symbol of quantity of cord ?
 SPARQL: SELECT ?answer WHERE { wd:Q920297 wdt:P111 ?X . ?X wdt:P416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cord', 'p': 'quantity', 'o': '$y0'}}

 Q: What is the {festival} for {language used} of {Hungarian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9067 . ?sbj wdt:P31 wd:Q132241 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Hungarian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'festival'}}

 Q: Who was the head of government of Saarbrücken that ended at 2004-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q1724 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saarbrücken', 'p': 'head of government', 'o': '?x0', 't': '2004'}

 Q: what is the {statement is subject of} for {Helen Hayes} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q213302 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Helen Hayes', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Is the wheelbase of the Lunar Roving Vehicle equal to 2.3?
 SPARQL: ASK WHERE { wd:Q275816 wdt:P3039 ?obj filter(?obj = 2.3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lunar Roving Vehicle', 'p': 'wheelbase', 'o': '?x0', '?x0': '2.3'}

 Q: What is the name of the person that the Euler equations are named for, that died in Saint Petersburg?
 SPARQL: SELECT ?answer WHERE { wd:Q375175 wdt:P138 ?answer . ?answer wdt:P20 wd:Q656}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Euler equations', 'p': 'named for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'died in', 'o': 'Saint Petersburg'}}

 Q: Who is the chief operating officers of the builders of the Nintendo DS?
 SPARQL: SELECT ?answer WHERE { wd:Q170323 wdt:P176 ?X . ?X wdt:P1789 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chief operating officer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nintendo DS', 'p': 'builder', 'o': '$y0'}}

 Q: What is based in the Arab Revolt that resulted in inflation rate of consumer price index of 34.2?
 SPARQL: SELECT ?answer WHERE { wd:Q239060 wdt:P276 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'34.2'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arab Revolt', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '34.2'}}

 Q: Does the vertical depth of the Pervomayskaya equal 0?
 SPARQL: ASK WHERE { wd:Q3900622 wdt:P4511 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Pervomayskaya', 'p': 'vertical depth', 'o': '?x0', '?x0': '0'}

 Q: What is {performer} of {Superman} that is {of} is {Superman} ?
 SPARQL: SELECT ?obj WHERE { wd:Q79015 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q2405659 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'performer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Superman', 'p': 'performer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'Superman'}}}

 Q: What is <industry> of <e-commerce> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P452 wd:Q484847}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'industry', 'o': 'e-commerce'}

 Q: What is {eponym} of {Marxism}, that has {employment} is {poet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7264 wdt:P138 ?answer . ?answer wdt:P106 wd:Q49757}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marxism', 'p': 'eponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'employment', 'o': 'poet'}}

 Q: What is {position held} of {Hu Jintao} that is {parliamentary term} is {9th National People's Congress} ?
 SPARQL: SELECT ?obj WHERE { wd:Q15029 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2937 wd:Q4646623 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hu Jintao', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'parliamentary term', 'o': "9th National People's Congress"}}}

 Q: What is the {shipwrecking} with the {MIN(number of casualties)} whose {vessel} is {RMS Titanic}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q906512 . ?ent wdt:P1590 ?obj . ?ent wdt:P1876 wd:Q25173} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of casualties', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'shipwreck', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'ship', 'o': 'RMS Titanic'}}}

 Q: What is <website account on> of <Twitch> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P553 wd:Q4555537}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'website account on', 'o': 'Twitch'}

 Q: What is {has administrative divisions} of {citizenship} of {Gummo Marx} ?
 SPARQL: SELECT ?answer WHERE { wd:Q504548 wdt:P27 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has administrative divisions', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gummo Marx', 'p': 'citizenship', 'o': '$y0'}}

 Q: What is {plant taxon in botanical garden} of {administrator} of {Toronto Zoo Domain Ride} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7826576 wdt:P137 ?X . ?X wdt:P1990 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'plant taxon in botanical garden', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Toronto Zoo Domain Ride', 'p': 'administrator', 'o': '$y0'}}

 Q: Is the heart rate of a horse equal to 40.8?
 SPARQL: ASK WHERE { wd:Q726 wdt:P3395 ?obj filter(?obj = 40.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'horse', 'p': 'heart rate', 'o': '?x0', '?x0': '40.8'}

 Q: What is the mass of deuterium oxide?
 SPARQL: select distinct ?answer where { wd:Q155890 wdt:P2067 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'deuterium oxide', 'p': 'mass', 'o': '?x0'}

 Q: When did Ohio have the population of 9.7064e+06?
 SPARQL: SELECT ?value WHERE { wd:Q1397 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'9.7064e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ohio', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '9.7064e+06'}, 't': '?x0'}

 Q: What is the EPCR player ID for Jonah Lomu?
 SPARQL: select distinct ?answer where { wd:Q363717 wdt:P3666 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jonah Lomu', 'p': 'EPCR player ID', 'o': '?x0'}

 Q: What is the position held by Emmanuel Joseph Sieyès born at 1795-4-20?
 SPARQL: SELECT ?obj WHERE { wd:Q294344 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1795')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Emmanuel Joseph Sieyès', 'p': 'position held', 'o': '?x0', 't': '1795'}

 Q: What is the {country} for {head of state} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q22686 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Which is the ethnic group which contains the word zambo in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zambo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zambo'}}

 Q: what is the {start time} for {Amsterdam} has {instance of} as {settlement} ?
 SPARQL: SELECT ?value WHERE { wd:Q727 p:P31 ?s . ?s ps:P31 ?x filter(contains(?x,'http://dbpedia.org/ontology/Settlement')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amsterdam', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'http'}}}

 Q: What chemical compound has a significant drug interaction with astemizole starts with the letter t?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11173 . ?sbj wdt:P769 wd:Q423437 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant drug interaction', 'o': 'astemizole'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {antonym of} of {subject in} of {compressible flow} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2705141 wdt:P1269 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'compressible flow', 'p': 'subject in', 'o': '$y0'}}

 Q: what is the {start time} for {Richard Attenborough} has {spouse} as {Sheila Sim} ?
 SPARQL: SELECT ?value WHERE { wd:Q51506 p:P26 ?s . ?s ps:P26 wd:Q4419444 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richard Attenborough', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Sheila Sim'}}}

 Q: What town was lived in by Aristotle, whose partner town is Cali?
 SPARQL: SELECT ?answer WHERE { wd:Q868 wdt:P551 ?answer . ?answer wdt:P190 wd:Q51103}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aristotle', 'p': 'lived in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Cali'}}

 Q: What was the primary profession of the author of "The Road to Serfdom?"
 SPARQL: SELECT ?answer WHERE { wd:Q1638194 wdt:P50 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Road to Serfdom', 'p': 'author', 'o': '$y0'}}

 Q: What is {informed by} of {authors} of {Needle in the Groove} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6986611 wdt:P50 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'informed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Needle in the Groove', 'p': 'author', 'o': '$y0'}}

 Q: What lake of São Jorge Island has the Curoca River, a tributary?
 SPARQL: SELECT ?answer WHERE { wd:Q743362 wdt:P206 ?answer . ?answer wdt:P974 wd:Q10361834}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'São Jorge Island', 'p': 'lake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Curoca River'}}

 Q: What award did Emile Berliner receive on 1-1-1929?
 SPARQL: SELECT ?obj WHERE { wd:Q71004 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1929')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Emile Berliner', 'p': 'award', 'o': '?x0', 't': '1929'}

 Q: What is {because} of {bone fracture}, that has {medical specialty} is {traumatology} ?
 SPARQL: SELECT ?answer WHERE { wd:Q68833 wdt:P828 ?answer . ?answer wdt:P1995 wd:Q376680}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'bone fracture', 'p': 'cause', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'medical specialty', 'o': 'traumatology'}}

 Q: What are the low-cost airline which start with the letter vueling
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190915 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vueling')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'low-cost airline'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vueling'}}

 Q: What is {instrument played} of {citation} of {Clustering of scientific citations in Wikipedia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26857876 wdt:P2860 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clustering of scientific citations in Wikipedia', 'p': 'citation', 'o': '$y0'}}

 Q: Tell me which is the single-family detached home which contains the word villa in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'villa')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single-family detached home'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'villa'}}

 Q: What is the name of the ethical theory of movement by Jeremy Bentham?
 SPARQL:  select distinct ?obj where { wd:Q60887 wdt:P135 ?obj . ?obj wdt:P31 wd:Q58927801 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jeremy Bentham', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethical theory'}}

 Q: What is {discovered} of {plays} of {Émile Waldteufel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q286616 wdt:P1303 ?X . ?X wdt:P575 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discovered', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Émile Waldteufel', 'p': 'plays', 'o': '$y0'}}

 Q: Mention the border participants of Livonian War?
 SPARQL: SELECT ?answer WHERE { wd:Q246863 wdt:P710 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Livonian War', 'p': 'participant', 'o': '$y0'}}

 Q: Does the short term exposure limit of benzene get greater than 2.4?
 SPARQL: ASK WHERE { wd:Q2270 wdt:P2407 ?obj filter(?obj > 2.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'benzene', 'p': 'short-term exposure limit', 'o': '?x0', '?x0': '2.4'}

 Q: What is the CPU with the fastest FSB speed?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2150 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'FSB speed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'CPU'}}

 Q: Are Kelsey and Allen given names of Kelsey Grammer?
 SPARQL: ASK WHERE { wd:Q196560 wdt:P735 wd:Q16277805 . wd:Q196560 wdt:P735 wd:Q18118122 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kelsey Grammer', 'p': 'given name', 'o': '?x0', '?x0': 'Kelsey'}, {'h': 'IS', 'v': '?x1', 's': 'Kelsey Grammer', 'p': 'given name', 'o': '?x1', '?x1': 'Allen'}]

 Q: What is the {flag} for {applies to jurisdiction} of {Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q220 . ?sbj wdt:P31 wd:Q14660 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flag'}}

 Q: What is UIC numerical country code for Albania ?
 SPARQL: select distinct ?answer where { wd:Q222 wdt:P2982 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albania', 'p': 'UIC numerical country code', 'o': '?x0'}

 Q: What is Bill Falkinder's branch mascot?
 SPARQL: SELECT ?answer WHERE { wd:Q4908944 wdt:P241 ?X . ?X wdt:P822 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mascot', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bill Falkinder', 'p': 'branch', 'o': '$y0'}}

 Q: Is it true that the mean lifetime of W or Z boson equals to 0.0000000000000000000000003?
 SPARQL: ASK WHERE { wd:Q211922 wdt:P2645 ?obj filter(?obj = 0.0000000000000000000000003) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'W or Z boson', 'p': 'mean lifetime', 'o': '?x0', '?x0': '0.0000000000000000000000003'}

 Q: What river is a tributary for the Hertfordshire?
 SPARQL:  select distinct ?obj where { wd:Q3410 wdt:P974 ?obj . ?obj wdt:P31 wd:Q4022 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hertfordshire', 'p': 'tributary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: Where is the location of birth of Antónia Ferreira subdivided into Galafura e Covelinhas?
 SPARQL: SELECT ?answer WHERE { wd:Q591755 wdt:P19 ?answer . ?answer wdt:P150 wd:Q25438947}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antónia Ferreira', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Galafura e Covelinhas'}}

 Q: Was Andy Kaufman a comedian and showman for an occupation?
 SPARQL: ASK WHERE { wd:Q299983 wdt:P106 wd:Q245068 . wd:Q299983 wdt:P106 wd:Q355242 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Andy Kaufman', 'p': 'occupation', 'o': '?x0', '?x0': 'comedian'}, {'h': 'IS', 'v': '?x1', 's': 'Andy Kaufman', 'p': 'occupation', 'o': '?x1', '?x1': 'showman'}]

 Q: What is the {literary character} for {narrator} of {On the Road}
 SPARQL:  select distinct ?obj where { wd:Q743180 wdt:P2438 ?obj . ?obj wdt:P31 wd:Q3658341 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'On the Road', 'p': 'narrator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary character'}}

 Q: For what award was Jo Van Fleet nominated for in 1958?
 SPARQL: SELECT ?obj WHERE { wd:Q233832 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1958')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jo Van Fleet', 'p': 'nominated for', 'o': '?x0', 't': '1958'}

 Q: What is {position held} of {Philip Noel-Baker, Baron Noel-Baker} that is {end time} is {1964-9-25} ?
 SPARQL: SELECT ?obj WHERE { wd:Q211856 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1964')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Philip Noel-Baker, Baron Noel-Baker', 'p': 'position held', 'o': '?x0', 't': '1964'}

 Q: Who was the chairman of the event producer in the 2017 Masters?
 SPARQL: SELECT ?answer WHERE { wd:Q28114247 wdt:P664 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chair', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2017 Masters', 'p': 'event producer', 'o': '$y0'}}

 Q: what is the {start time} for {Alan García} has {position held} as {President of Peru} ?
 SPARQL: SELECT ?value WHERE { wd:Q167211 p:P39 ?s . ?s ps:P39 wd:Q5708511 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan García', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Peru'}}}

 Q: In Exodus, a mountain serves as a narrative location--where is it?
 SPARQL:  select distinct ?obj where { wd:Q9190 wdt:P840 ?obj . ?obj wdt:P31 wd:Q8502 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Exodus', 'p': 'narrative location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mountain'}}

 Q: Is the boiling point of eicosane equal to 344.1?
 SPARQL: ASK WHERE { wd:Q150925 wdt:P2102 ?obj filter(?obj = 344.1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'eicosane', 'p': 'boiling point', 'o': '?x0', '?x0': '344.1'}

 Q: What is the {barque} with the {MAX(number of masts)} whose {instance of} is {barque}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q216057 . ?ent wdt:P1099 ?obj . ?ent wdt:P31 wd:Q216057 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of masts', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'barque'}}

 Q: What is {found in species} of {methanol}, that has {common name} is {Manusia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14982 wdt:P703 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Manusia'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'methanol', 'p': 'found in species', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'common name', 'o': 'manusia'}}

 Q: what is the {end time} for {Saxony-Anhalt} has {head of government} as {Reinhard Höppner} ?
 SPARQL: SELECT ?value WHERE { wd:Q1206 p:P6 ?s . ?s ps:P6 wd:Q78414 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saxony-Anhalt', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Reinhard Höppner'}}}

 Q: What is {date of death} and {date of birth} of {{Philip II of France} has {child} as {Philip I}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q34428 p:P40 ?s . ?s ps:P40 wd:Q19007 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip II of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Philip I'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip II of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Philip I'}}}]

