 Q: What is the woman in Ernst Wilimowski whose acronym is чол?
 SPARQL: SELECT ?answer WHERE { wd:Q559779 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'чол'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ernst Wilimowski', 'p': 'man', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'acronym', 'o': 'чол'}}

 Q: What is the {metropolis} for {residence} of {Aung San Suu Kyi}
 SPARQL:  select distinct ?obj where { wd:Q36740 wdt:P551 ?obj . ?obj wdt:P31 wd:Q200250 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aung San Suu Kyi', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolis'}}

 Q: What is Laut.de artist ID for Blondie?
 SPARQL: select distinct ?answer where { wd:Q202741 wdt:P5356 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Blondie', 'p': 'Laut.de artist ID', 'o': '?x0'}

 Q: Which is the Iconclass notation of the aquarium?
 SPARQL: select distinct ?answer where { wd:Q45782 wdt:P1256 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aquarium', 'p': 'Iconclass notation', 'o': '?x0'}

 Q: what is Colorado Sports Hall of Fame ID forJack Dempsey
 SPARQL: select distinct ?answer where { wd:Q313686 wdt:P4642 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jack Dempsey', 'p': 'Colorado Sports Hall of Fame ID', 'o': '?x0'}

 Q: what is the {instance of} for {Ghent Altarpiece} has {inception} as {1432-1-1} ?
 SPARQL: SELECT ?value WHERE { wd:Q734834 p:P571 ?s . ?s ps:P571 ?x filter(contains(YEAR(?x),'1432')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ghent Altarpiece', 'p': 'inception', 'o': '$y0'}}

 Q: What is the chef-lieu of Xia dynasty whose post code is 452470?
 SPARQL: SELECT ?answer WHERE { wd:Q169705 wdt:P36 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'452470'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Xia dynasty', 'p': 'chef-lieu', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'post code', 'o': '452470'}}

 Q: What is SBFI occupation code for truck driver?
 SPARQL: select distinct ?answer where { wd:Q508846 wdt:P1024 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'truck driver', 'p': 'SBFI occupation code', 'o': '?x0'}

 Q: What is <GujLit Person ID> of <Mahatma Gandhi> ?
 SPARQL: select distinct ?answer where { wd:Q1001 wdt:P4180 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mahatma Gandhi', 'p': 'GujLit Person ID', 'o': '?x0'}

 Q: What is the {human} for {creator} of {Batman}
 SPARQL:  select distinct ?obj where { wd:Q2695156 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Batman', 'p': 'created', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who gave the {type of taxon} of {higher taxon} of {×Triticale} ?
 SPARQL: SELECT ?answer WHERE { wd:Q380329 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of taxon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '×Triticale', 'p': 'higher taxon', 'o': '$y0'}}

 Q: Tell me me a ethnic group whose name consist of the word "sioux" and whose language used Sioux
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj wdt:P2936 wd:Q13268 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sioux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic group', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Sioux'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'sioux'}}

 Q: what is the {conferred by} for {Peter Scholze} has {award received} as {fellow} ?
 SPARQL: SELECT ?value WHERE { wd:Q98034 p:P166 ?s . ?s ps:P166 wd:Q1404101 . ?s pq:P1027 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conferred by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Scholze', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'fellow'}}}

 Q: Is the total liabilities of the Dalmoreprodukt equal to 1477000000?
 SPARQL: ASK WHERE { wd:Q4154217 wdt:P2138 ?obj filter(?obj = 1477000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Dalmoreprodukt', 'p': 'total liabilities', 'o': '?x0', '?x0': '1477000000'}

 Q: What is {academic major} and {academic degree} of {{Vladimir Nabokov} has {educated at} as {Trinity College}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36591 p:P69 ?s . ?s ps:P69 wd:Q332342 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Nabokov', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Trinity College'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Nabokov', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Trinity College'}}}]

 Q: What is sports season of league or competition for college football ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3450 wd:Q1109032}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports season of league or competition', 'o': 'college football'}

 Q: Which means {armament} from {grenade} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P520 wd:Q173517}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'armament', 'o': 'grenade'}

 Q: what is the {point in time} for {Casey Affleck} has {nominated for} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q270730 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Casey Affleck', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}, 't': '?x0'}

 Q: What is the geographic region with the highest number of out of school children whose part of is Asia ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q82794 . ?ent wdt:P2573 ?obj . ?ent wdt:P361 wd:Q48 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of out of school children', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geographic region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'part of', 'o': 'Asia'}}}

 Q: Which  is origin of the watercourse of Mittelland Canal ?
 SPARQL: select distinct ?answer where { wd:Q48480 wdt:P885 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mittelland Canal', 'p': 'origin of the watercourse', 'o': '?x0'}

 Q: What is the inverse of pleasure whose treatment is topiramate?
 SPARQL: SELECT ?answer WHERE { wd:Q208195 wdt:P461 ?answer . ?answer wdt:P2176 wd:Q221174}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pleasure', 'p': 'inverse', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'treatment', 'o': 'topiramate'}}

 Q: What is the position held by David Packard born at 1969-1-24?
 SPARQL: SELECT ?obj WHERE { wd:Q380484 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'David Packard', 'p': 'position held', 'o': '?x0', 't': '1969'}

 Q: Who was the winner of the Arlene Raven Award that was bestowed by the Women's Caucus for Art?
 SPARQL: SELECT ?answer WHERE { wd:Q4792169 wdt:P166 ?answer . ?answer wdt:P1027 wd:Q8030842}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arlene Raven', 'p': 'win', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'bestowed by', 'o': "Women's Caucus for Art"}}

 Q: Is the apparent magnitude of the Crab Nebula equal to 6.72?
 SPARQL: ASK WHERE { wd:Q10934 wdt:P1215 ?obj filter(?obj = 6.72) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Crab Nebula', 'p': 'apparent magnitude', 'o': '?x0', '?x0': '6.72'}

 Q: Who is a graduate of Sam Rockwell, that has the location {40.7533 - 73.9905} ?
 SPARQL: SELECT ?answer WHERE { wd:Q316446 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'40.7533 -73.9905'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sam Rockwell', 'p': 'graduate of', 'o': '?x0'}

 Q: who archipelago for official language of norwegian?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q9043 . ?sbj wdt:P31 wd:Q33837 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'no', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archipelago'}}

 Q: is iPhone XR carbon footprint less than 91.2?
 SPARQL: ASK WHERE { wd:Q56599334 wdt:P5991 ?obj filter(?obj < 91.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'iPhone XR', 'p': 'carbon footprint', 'o': '?x0', '?x0': '91.2'}

 Q: Which is the evaluation of the pulse?
 SPARQL: select distinct ?answer where { ?answer wdt:P5134 wd:Q191733}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'evaluation of', 'o': 'pulse'}

 Q: What are the  railroad line which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railroad line'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the {free software} for {programming language} of {PHP}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P277 wd:Q59 . ?sbj wdt:P31 wd:Q341 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'written in', 'o': 'PHP', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'free software'}}

 Q: What is {residence} of {Lionel Trilling} that is {end time} is {1975-11-5} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1827287 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lionel Trilling', 'p': 'residence', 'o': '?x0', 't': '1975'}

 Q: What is {member of sports team} of {Alan Shearer} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q483583 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Shearer', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Shearer', 'p': 'team', 'o': '$y0'}}]

 Q: What is the {sporting event} for {competition class} of {high jump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2094 wd:Q165704 . ?sbj wdt:P31 wd:Q16510064 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'competition class', 'o': 'high jump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sporting event'}}

 Q: What is Arminius' middle name in Latin script?
 SPARQL: SELECT ?answer WHERE { wd:Q68880 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arminius', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'script', 'o': 'Latin script'}}

 Q: what is the {end cause} for {Henry II of England} has {position held} as {monarch of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q102140 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1534 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry II of England', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of England'}}}

 Q: Did {Mel_Gibson} {partner} {Oksana Grigorieva}?
 SPARQL: ASK WHERE { wd:Q42229 wdt:P451 wd:Q4149360 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mel Gibson', 'p': 'partner', 'o': '?x0', '?x0': 'Oksana Grigorieva'}]

 Q: Are there 2 parts to the work of art, "Schwanda the Bagpiper"
 SPARQL: ASK WHERE { wd:Q80934 wdt:P2635 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Schwanda the Bagpiper', 'p': 'number of parts of this work', 'o': '?x0', '?x0': '2'}

 Q: Septuagint is an edition of which literary work ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P747 wd:Q29334 . ?sbj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'Septuagint', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: Which is the number of pages for The Tale of Peter Rabbit?
 SPARQL: select distinct ?answer where { wd:Q580463 wdt:P1104 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Tale of Peter Rabbit', 'p': 'number of pages', 'o': '?x0'}

 Q: What is {speakers of language} of {language spoken} of {L. Ron Hubbard} ?
 SPARQL: SELECT ?answer WHERE { wd:Q216896 wdt:P1412 ?X . ?X wdt:P1098 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'speakers of language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'L. Ron Hubbard', 'p': 'language spoken', 'o': '$y0'}}

 Q: How many patron saints are with the {Gabriel} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P417 wd:Q81989 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Gabriel'}

 Q: What is the group of chemical substances with the lowest ultimate tensile strength whose topic's main category is Category:Nylon ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q17339814 . ?ent wdt:P5479 ?obj . ?ent wdt:P910 wd:Q55272807} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'ultimate tensile strength', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group of chemical substances', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': "topic's main category", 'o': 'Category:Nylon'}}}

 Q: what is the {for work} for {Peter Carey} has {award received} as {Miles Franklin Literary Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q313254 p:P166 ?s . ?s ps:P166 wd:Q996 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Carey', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Miles Franklin Literary Award'}}}

 Q: What is {nominated for} of {The Social Network} that is {nominee} is {Scott Rudin} ?
 SPARQL: SELECT ?obj WHERE { wd:Q185888 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q461529 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Social Network', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'Scott Rudin'}}}

 Q: What position held by Fritz Lang was succeeded by Olivia de Havilland?
 SPARQL: SELECT ?obj WHERE { wd:Q19504 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q95068 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fritz Lang', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'succeeded by', 'o': 'Olivia de Havilland'}}}

 Q: Which is the radius of Earth?
 SPARQL: select distinct ?answer where { wd:Q2 wdt:P2120 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Earth', 'p': 'radius', 'o': '?x0'}

 Q: Tell me hypothesis whose name has the word substratum in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41719 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'substratum')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hypothesis'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'substratum'}}

 Q: Which stratovolcano has the most topographic prominence?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q169358 . ?ent wdt:P2660 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'topographic prominence', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stratovolcano'}}

 Q: What is {notable books} of {Francis Ford Coppola}, that has {nomination received} is {Academy Award for Best Writing, Adapted Screenplay} ?
 SPARQL: SELECT ?answer WHERE { wd:Q56094 wdt:P800 ?answer . ?answer wdt:P1411 wd:Q107258}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Francis Ford Coppola', 'p': 'notable books', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'nomination received', 'o': 'Academy Award for Best Writing, Adapted Screenplay'}}

 Q: What is  in the TLG author ID of Thucydides ?
 SPARQL: select distinct ?answer where { wd:Q41683 wdt:P3576 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thucydides', 'p': 'TLG author ID', 'o': '?x0'}

 Q: Name the inventor of deuterium who worked at Columbia University.
 SPARQL: SELECT ?answer WHERE { wd:Q102296 wdt:P61 ?answer . ?answer wdt:P108 wd:Q49088}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'deuterium', 'p': 'inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worked at', 'o': 'Columbia University'}}

 Q: Give me {film production company} that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762059 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film production company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {chronology of topic} of {based in} of {Watsons, Ontario} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7974891 wdt:P131 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chronology of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Watsons, Ontario', 'p': 'in', 'o': '$y0'}}

 Q: How many publications are published in The Economist?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1433 wd:Q180089 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'The Economist'}

 Q: What is the county seat of Naypyidaw, which has a CPI inflation rate of 8.9?
 SPARQL: SELECT ?answer WHERE { wd:Q37400 wdt:P1376 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'8.9'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Naypyidaw', 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '8.9'}}

 Q: Jim Henson was the director of which film?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P57 wd:Q191037 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Jim Henson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: What is the {type of quantum particle} for {antiparticle} of {photon}
 SPARQL:  select distinct ?obj where { wd:Q3198 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'photon', 'p': 'antiparticle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: How many will be replaced by the Fatimid caliphate?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1366 wd:Q160307 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Fatimid caliphate'}

 Q: What is the {human} for {professional or sports partner} of {Kristi Yamaguchi}
 SPARQL:  select distinct ?obj where { wd:Q237651 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kristi Yamaguchi', 'p': 'sports partner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Was Benedict Cumberbatch nominated for an Evening Standard Award?
 SPARQL: ASK WHERE { wd:Q244674 wdt:P1411 wd:Q5416631 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Benedict Cumberbatch', 'p': 'nominated for', 'o': '?x0', '?x0': 'Evening Standard Award'}]

 Q: Who is the co-driver for Sébastien Ogier?
 SPARQL: select distinct ?answer where { wd:Q368793 wdt:P2095 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sébastien Ogier', 'p': 'co-driver', 'o': '?x0'}

 Q: What is <Scottish Poetry Library poet ID> of <James Hogg> ?
 SPARQL: select distinct ?answer where { wd:Q941810 wdt:P5470 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Hogg', 'p': 'Scottish Poetry Library poet ID', 'o': '?x0'}

 Q: Mention the predecessor and the successor of Star Wars Episode VI: Return of the Jedi in Star Wars series
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q181803 p:P179 ?s . ?s ps:P179 wd:Q22092344 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'predecessor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Return of the Jedi', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'successor', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Return of the Jedi', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars'}}}]

 Q: What is {guilty of} of {executive power headed by} of {Munich} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1726 wdt:P6 ?X . ?X wdt:P1399 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'guilty of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Munich', 'p': 'executive power headed by', 'o': '$y0'}}

 Q: Give me {unit of energy} that contains the word {zettajoule} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2916980 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zettajoule')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of energy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zettajoule'}}

 Q: Is the refractive index of silver chloride equal to 2.0224?
 SPARQL: ASK WHERE { wd:Q216918 wdt:P1109 ?obj filter(?obj = 2.0224) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'silver chloride', 'p': 'refractive index', 'o': '?x0', '?x0': '2.0224'}

 Q: What is the start time for Axel Springer, husband of Martha Else Meyer?
 SPARQL: SELECT ?value WHERE { wd:Q216183 p:P26 ?s . ?s ps:P26 wd:Q1903037 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Axel Springer', 'p': 'husband', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'husband', 'o': 'Martha Else Meyer'}}}

 Q: The conjugate acid of ammonia has what chemical compound?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q4087 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'ammonia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: The vici.org ID of Palmyra is?
 SPARQL: select distinct ?answer where { wd:Q5747 wdt:P1481 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Palmyra', 'p': 'vici.org ID', 'o': '?x0'}

 Q: Which is the Species Profile and Threats Database ID of numbat?
 SPARQL: select distinct ?answer where { wd:Q242419 wdt:P2455 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'numbat', 'p': 'Species Profile and Threats Database ID', 'o': '?x0'}

 Q: What is {birthdate} of {discoverer of} of {permaculture} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4572 wdt:P61 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthdate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'permaculture', 'p': 'discoverer', 'o': '$y0'}}

 Q: What award did Lise Meitner receive in 1960 ?
 SPARQL: SELECT ?obj WHERE { wd:Q56189 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1960')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lise Meitner', 'p': 'award', 'o': '?x0', 't': '1960'}

 Q: What is the {London Underground station} with the {MIN(patronage)} whose {connecting line} is {District line}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q14562709 . ?ent wdt:P3872 ?obj . ?ent wdt:P81 wd:Q211265} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'passengers', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'London Underground station', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'connecting line', 'o': 'District line'}}}

 Q: What is {total fertility rate} of {Solomon Islands} that is {point in time} is {2004-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q685 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Solomon Islands', 'p': 'total fertility rate', 'o': '?x0', 't': '2004'}

 Q: What is {is in the administrative region of} of {graduate of} of {William M. Bass} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2579797 wdt:P69 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William M. Bass', 'p': 'graduate of', 'o': '$y0'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Clarence Seedorf} has {member of sports team} as {Inter Milan}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 wd:Q631 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Inter Milan'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Inter Milan'}}}]

 Q: What is {twinned administrative body} of {Ōsaka Prefecture} that is {start time} is {1987-7-21} ?
 SPARQL: SELECT ?obj WHERE { wd:Q122723 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1987')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Osaka Prefecture', 'p': 'twinned administrative body', 'o': '?x0', 't': '1987'}

 Q: tell me cattle breed which name has the word wagtu in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12045585 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wagyu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cattle breed'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wagyu'}}

 Q: What is USATF athlete ID for Ashton Eaton ?
 SPARQL: select distinct ?answer where { wd:Q1789 wdt:P3926 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ashton Eaton', 'p': 'USATF athlete ID', 'o': '?x0'}

 Q: What is the {minor basilica} for {place of burial} of {Anthony of Padua}
 SPARQL:  select distinct ?obj where { wd:Q167477 wdt:P119 ?obj . ?obj wdt:P31 wd:Q120560 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anthony of Padua', 'p': 'burial place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'minor basilica'}}

 Q: What is Rfam ID for transfer RNA ?
 SPARQL: select distinct ?answer where { wd:Q201448 wdt:P3523 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'transfer RNA', 'p': 'Rfam ID', 'o': '?x0'}

 Q: what is the {point in time} for {Gerard Reve} has {award received} as {Prijs der Nederlandse Letteren} ?
 SPARQL: SELECT ?value WHERE { wd:Q364153 p:P166 ?s . ?s ps:P166 wd:Q2063896 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gerard Reve', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Prijs der Nederlandse Letteren'}, 't': '?x0'}

 Q: Tell me the name of armed forces which starts with "w"
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772547 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'armed forces'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which constellation includes the star NGC 6723 ?
 SPARQL: SELECT ?answer WHERE { wd:Q612606 wdt:P397 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'NGC 6723', 'p': 'star', 'o': '$y0'}}

 Q: What is {size} of {hometown} of {Rashi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26456 wdt:P551 ?X . ?X wdt:P2046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'size', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rashi', 'p': 'hometown', 'o': '$y0'}}

 Q: What is {member of sports team} of {Landon Donovan} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q202237 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Landon Donovan', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Landon Donovan', 'p': 'team', 'o': '$y0'}}]

 Q: What is {disease treated} of {niacin}, that has {used for treatment} is {cerivastatin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q134658 wdt:P2175 ?answer . ?answer wdt:P2176 wd:Q423439}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'niacin', 'p': 'disease treated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'used for treatment', 'o': 'cerivastatin'}}

 Q: What premier of Ontario was born on 1953-5-21?
 SPARQL: SELECT ?answer WHERE { wd:Q1904 wdt:P6 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1953'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ontario', 'p': 'premier', 'o': '?x0', 't': '1953'}

 Q: what is the {start time} for {Republic of Dagestan} has {head of government} as {Vladimir Vasilyev} ?
 SPARQL: SELECT ?value WHERE { wd:Q5118 p:P6 ?s . ?s ps:P6 wd:Q4104566 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Republic of Dagestan', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Vladimir Vasilyev'}}}

 Q: Which is the FACR player ID of Josef Bican?
 SPARQL: select distinct ?answer where { wd:Q352017 wdt:P3050 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Josef Bican', 'p': 'FACR player ID', 'o': '?x0'}

 Q: What is {commodity} of {subsidiary entities} of {Harman International Industries} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1585599 wdt:P355 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'commodity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harman International Industries', 'p': 'subsidiary', 'o': '$y0'}}

 Q: what is the {for work} for {David Fincher} has {award received} as {BAFTA Award for Best Direction} ?
 SPARQL: SELECT ?value WHERE { wd:Q184903 p:P166 ?s . ?s ps:P166 wd:Q787131 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Fincher', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'BAFTA Award for Best Direction'}}}

