 Q: What is {elected in} and {end cause} of {{James Matheson} has {position held} as {Member of the 15th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q4870843 p:P39 ?s . ?s ps:P39 wd:Q41582555 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Matheson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 15th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Matheson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 15th Parliament of the United Kingdom'}}}]

 Q: Who is the cast member for the role of Bunny Lebowski in the Big Lebowski?
 SPARQL: SELECT ?obj WHERE { wd:Q337078 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q55717001 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cast member', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Big Lebowski', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'role', 'o': 'Bunny Lebowski'}}}

 Q: What is {writer} of {collaborator on} of {Chris Odom} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24898980 wdt:P3919 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'writer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chris Odom', 'p': 'collaborator on', 'o': '$y0'}}

 Q: what is the {format as a regular expression} for {red} has {short name} as {R} ?
 SPARQL: SELECT ?value WHERE { wd:Q3142 p:P1813 ?s . ?s ps:P1813 ?x filter(contains(?x,'R')) . ?s pq:P1793 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'regular expression', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'red', 'p': 'short name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'short name', 'o': 'r'}}}

 Q: What is the location of the Honda headquarters with the postal code 107-8556?
 SPARQL: SELECT ?obj WHERE { wd:Q9584 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'107-8556')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honda', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'postal code', 'o': '107-8556'}}}

 Q: What are the comics character which start with the letter viper
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'viper')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comics character'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'viper'}}

 Q: What is the {human} for {author} of {Strange Case of Dr Jekyll and Mr Hyde}
 SPARQL:  select distinct ?obj where { wd:Q217352 wdt:P50 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Strange Case of Dr Jekyll and Mr Hyde', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who are the children and siblings of Alan Alda?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q310394 wdt:P3373 ?ans_1 . wd:Q310394 wdt:P40 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Alan Alda', 'p': 'sibling', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Alan Alda', 'p': 'child', 'o': '?x1'}]

 Q: How many sponsors are for Juventus F.C.?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1422 wdt:P859 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Juventus F.C.', 'p': 'sponsor', 'o': '?x0'}

 Q: Does the elevation above sea level of the Beemster equal 4?
 SPARQL: ASK WHERE { wd:Q9900 wdt:P2044 ?obj filter(?obj = -4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Beemster', 'p': 'elevation above sea level', 'o': '?x0', '?x0': '-4'}

 Q: What is the {human} for {mother} of {Nicole Richie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P25 wd:Q232495 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'mother', 'o': 'Nicole Richie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the type of procedure for the taxonomy of Durio
 SPARQL:  select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Durio', 'p': 'type', 'o': '?x0', '?x0': 'taxon'}]

 Q: Who is the  {political party} for {member of political party} of {Fidel Castro}
 SPARQL:  select distinct ?obj where { wd:Q11256 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Castro', 'p': 'member of political party', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: Give me {minor basilica} that {architectural style} {Italian Gothic architecture} and which that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120560 . ?sbj wdt:P149 wd:Q2245489 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'minor basilica', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'architecture', 'o': 'Italian Gothic architecture'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is in the  airline hub of Qantas ?
 SPARQL: select distinct ?answer where { wd:Q32491 wdt:P113 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Qantas', 'p': 'airline hub', 'o': '?x0'}

 Q: How many basic forms of government are there in Syria?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q858 wdt:P122 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Syria', 'p': 'government', 'o': '?x0'}

 Q: Tell me public company whose name has the word yandex in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yandex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yandex'}}

 Q: What is {award received} of {Sherlock} that is {winner} is {Andrew Scott} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192837 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q507322 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sherlock', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'winner', 'o': 'Andrew Scott'}}}

 Q: Is the lighthouse range of South Channel Pile Light less than 2.4?
 SPARQL: ASK WHERE { wd:Q7566786 wdt:P2929 ?obj filter(?obj < 2.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'South Channel Pile Light', 'p': 'lighthouse range', 'o': '?x0', '?x0': '2.4'}

 Q: What was Carol Ann Duffy nominated for in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q237994 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carol Ann Duffy', 'p': 'nominated for', 'o': '?x0', 't': '2011'}

 Q: What genre of music is in the series titled Bound?
 SPARQL: SELECT ?answer WHERE { wd:Q50845803 wdt:P179 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bound', 'p': 'series', 'o': '$y0'}}

 Q: In 1939, what country did Marlene Dietrich become a citizen of?
 SPARQL: SELECT ?obj WHERE { wd:Q4612 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1939')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marlene Dietrich', 'p': 'citizen of', 'o': '?x0', 't': '1939'}

 Q: Which is the cuisine for the veganism cuisine?
 SPARQL:  select distinct ?obj where { wd:Q181138 wdt:P2012 ?obj . ?obj wdt:P31 wd:Q1778821 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'veganism', 'p': 'cuisine', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cuisine'}}

 Q: What is the {property} for {studies} of {biology}
 SPARQL:  select distinct ?obj where { wd:Q420 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q937228 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'biology', 'p': 'studies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'property'}}

 Q: what is the {start time} for {Ernest Renan} has {member of} as {Hungarian Academy of Sciences} ?
 SPARQL: SELECT ?value WHERE { wd:Q157155 p:P463 ?s . ?s ps:P463 wd:Q265058 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ernest Renan', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Hungarian Academy of Sciences'}}}

 Q: What is {prescribed drug} of {academic field for} of {oncology} ?
 SPARQL: SELECT ?answer WHERE { wd:Q162555 wdt:P2578 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prescribed drug', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'oncology', 'p': 'academic field for', 'o': '$y0'}}

 Q: What is the kinship with the lowest family relationship degree whose series is Ahnentafel ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q171318 . ?ent wdt:P4500 ?obj . ?ent wdt:P179 wd:Q267388} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'family relationship degree', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kinship', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Ahnentafel'}}}

 Q: What is {label in sign language} of {February} that is {language of work or name} is {Catalan Sign Language} ?
 SPARQL: SELECT ?obj WHERE { wd:Q109 p:P2919 ?s . ?s ps:P2919 ?obj . ?s pq:P407 wd:Q35768 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sign', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'February', 'p': 'sign', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'Catalan Sign Language'}}}

 Q: Tillandsia usneoides has a basionym of what?
 SPARQL: select distinct ?answer where { wd:Q311524 wdt:P566 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tillandsia usneoides', 'p': 'basionym', 'o': '?x0'}

 Q: What is the {biblical episode} for {significant person} of {Jesus Christ}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3342 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Jesus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical episode'}}

 Q: What is {member of sports team} of {Carlos Alberto Torres} that is {number of points/goals/set scored} is {4.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q295262 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter(contains(?x,'4.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carlos Alberto Torres', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '4.0'}}}

 Q: Who is the party chief representing Shaanxi?
 SPARQL: select distinct ?answer where { wd:Q47974 wdt:P210 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shaanxi', 'p': 'party chief', 'o': '?x0'}

 Q: What is {region} of {competes in} of {Leo Visser} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46104 wdt:P1344 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leo Visser', 'p': 'competes in', 'o': '$y0'}}

 Q: Is the total expenditure of the Central Catholic High School 4169127.6?
 SPARQL: ASK WHERE { wd:Q5060518 wdt:P2402 ?obj filter(?obj = 4169127.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Central Catholic High School', 'p': 'total expenditure', 'o': '?x0', '?x0': '4169127.6'}

 Q: What is the {work location} and the {location of formation} of {Gloria_Estefan} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q184697 wdt:P937 ?ans_1 . wd:Q184697 wdt:P740 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Gloria Estefan', 'p': 'work location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Gloria Estefan', 'p': 'location of formation', 'o': '?x1'}]

 Q: What is the {architectural structure} for {place of death} of {Walter Scott}
 SPARQL:  select distinct ?obj where { wd:Q79025 wdt:P20 ?obj . ?obj wdt:P31 wd:Q811979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Walter Scott', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'architectural structure'}}

 Q: How many {astronaut mission} are for {Yury Romanenko} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q446720 wdt:P450 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Yury Romanenko', 'p': 'astronaut mission', 'o': '?x0'}

 Q: Tell me  the mantra that contains the word mantra in their name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mantra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mantra'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'mantra'}}

 Q: How many input methods does Minecraft possess?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q49740 wdt:P479 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Minecraft', 'p': 'input method', 'o': '?x0'}

 Q: What date disbanded for label Calvin Harris ?
 SPARQL: SELECT ?answer WHERE { wd:Q81637 wdt:P264 ?X . ?X wdt:P576 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date disbanded', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Calvin Harris', 'p': 'label', 'o': '$y0'}}

 Q: what is the {end time} for {Alexander Graham Bell} has {spouse} as {Mabel Gardiner Hubbard} ?
 SPARQL: SELECT ?value WHERE { wd:Q34286 p:P26 ?s . ?s ps:P26 wd:Q6721445 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Graham Bell', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Mabel Gardiner Hubbard'}}}

 Q: What is KINENOTE person ID for Jean-Paul Belmondo ?
 SPARQL: select distinct ?answer where { wd:Q106255 wdt:P3305 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean-Paul Belmondo', 'p': 'KINENOTE person ID', 'o': '?x0'}

 Q: What award did Alvaro Siza Vieira receive in 1988?
 SPARQL: SELECT ?obj WHERE { wd:Q251365 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alvaro Siza', 'p': 'award', 'o': '?x0', 't': '1988'}

 Q: Tell me circumstellar disk whose name has the word belt in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3235978 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'belt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'circumstellar disk'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'belt'}}

 Q: What is <category for films shot at this location> of <A Coruña> ?
 SPARQL: select distinct ?answer where { wd:Q8757 wdt:P1740 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'A Coruña', 'p': 'category for films shot at this location', 'o': '?x0'}

 Q: How many {supports programming language} are to/by {Logo} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3985 wd:Q201436 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'supports programming language', 'o': 'Logo'}

 Q: Tell me excipient whose name has the word xylitol in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xylitol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'excipient'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'xylitol'}}

 Q: Give me {mineral species} that {crystal system} {cubic crystal system} and which that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj wdt:P556 wd:Q473227 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral species', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'crystal system', 'o': 'cubic crystal system'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is the time of the day in year of Easter?
 SPARQL: SELECT ?answer WHERE { wd:Q21196 wdt:P837 ?X . ?X wdt:P585 ?answer}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Easter', 'p': 'day in year', 'o': '$y0', 't': '?x0'}

 Q: How many game modes are by a MMO game?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P404 wd:Q862490 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'game mode', 'o': 'MMO'}

 Q: How many people have a facet of their Suriname?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1269 wd:Q730 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Suriname'}

 Q: What is {host} of {found in species} of {hypothetical protein Mb0514} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23257938 wdt:P703 ?X . ?X wdt:P2975 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'host', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hypothetical protein Mb0514', 'p': 'found in species', 'o': '$y0'}}

 Q: What is the {from fictional universe} and the {creator} of {Green_Lantern} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q32884 wdt:P1080 ?ans_1 . wd:Q32884 wdt:P170 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Green Lantern', 'p': 'universe', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Green Lantern', 'p': 'creator', 'o': '?x1'}]

 Q: What is the {enterprise} for {operator} of {American Broadcasting Company}
 SPARQL:  select distinct ?obj where { wd:Q169889 wdt:P137 ?obj . ?obj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Broadcasting Company', 'p': 'operator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What is {part of series} of {preceded by} of {Opie's Newspaper} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51231142 wdt:P155 ?X . ?X wdt:P179 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'part of series', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Opie's Newspaper", 'p': 'preceded by', 'o': '$y0'}}

 Q: What is birth name of Charles Simonyi ?
 SPARQL: select distinct ?answer where { wd:Q49819 wdt:P1477 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Simonyi', 'p': 'birth name', 'o': '?x0'}

 Q: Did {Lauren_Bacall} {ethnic group} {Arab} and {Ashkenazi Jews} ?
 SPARQL: ASK WHERE { wd:Q104000 wdt:P172 wd:Q35323 . wd:Q104000 wdt:P172 wd:Q34069 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lauren Bacall', 'p': 'ethnic group', 'o': '?x0', '?x0': 'Arab'}, {'h': 'IS', 'v': '?x1', 's': 'Lauren Bacall', 'p': 'ethnic group', 'o': '?x1', '?x1': 'Ashkenazi Jews'}]

 Q: What is {member of sports team} of {Abedi Pele} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q336916 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abedi Pele', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abedi Pele', 'p': 'team', 'o': '$y0'}}]

 Q: Is the time index of the Thout more than 0.8?
 SPARQL: ASK WHERE { wd:Q577200 wdt:P4895 ?obj filter(?obj > 0.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Thout', 'p': 'time index', 'o': '?x0', '?x0': '0.8'}

 Q: The Kingdom of Hawaii utilizes the base currency of which government or authority?
 SPARQL: SELECT ?answer WHERE { wd:Q156418 wdt:P38 ?X . ?X wdt:P562 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'authority', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kingdom of Hawaii', 'p': 'currency', 'o': '$y0'}}

 Q: What is the {award} for {winner} of {Loretta Lynn}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1346 wd:Q272931 . ?sbj wdt:P31 wd:Q618779 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Loretta Lynn', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award'}}

 Q: Did Ryan Gosling receive an award at 19th Satellite Awards?
 SPARQL: ASK WHERE { wd:Q193815 wdt:P166 wd:Q18603311 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ryan Gosling', 'p': 'award', 'o': '?x0', '?x0': '19th Satellite Awards'}]

 Q: Which is the Eurovision Song Contest song ID for Celine Dion?
 SPARQL: select distinct ?answer where { wd:Q5105 wdt:P3736 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Celine Dion', 'p': 'Eurovision Song Contest song ID', 'o': '?x0'}

 Q: Which county seat of Lan Xang has STD code of 071?
 SPARQL: SELECT ?answer WHERE { wd:Q853477 wdt:P36 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'071'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lan Xang', 'p': 'county seat', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'STD code', 'o': '071'}}

 Q: What is {musical score by} of {The Rite of Spring}, that has {home town} is {New York City} ?
 SPARQL: SELECT ?answer WHERE { wd:Q206015 wdt:P86 ?answer . ?answer wdt:P551 wd:Q60}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Rite of Spring', 'p': 'musical score by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'home town', 'o': 'New York City'}}

 Q: Who is appointed by the United Nations Secretary-General?
 SPARQL: select distinct ?answer where { wd:Q81066 wdt:P748 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'United Nations Secretary-General', 'p': 'appointed by', 'o': '?x0'}

 Q: what is the {statement is subject of} for {Grace Kelly} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q3925 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grace Kelly', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Best Actress'}}}

 Q: what is the {applies to part} for {Jubba River} has {coordinate location} as {4.1783333333333 42.08} ?
 SPARQL: SELECT ?value WHERE { wd:Q138491 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'4.1783333333333 42.08')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jubba River', 'p': 'coordinate location', 'o': '$y0'}}

 Q: Which award was Kiefer Sutherland nominated for in 2002?
 SPARQL: SELECT ?obj WHERE { wd:Q103946 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kiefer Sutherland', 'p': 'nominated for', 'o': '?x0', 't': '2002'}

 Q: Which is DORIS ID for loggerhead sea turtle?
 SPARQL: select distinct ?answer where { wd:Q192095 wdt:P4630 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'loggerhead sea turtle', 'p': 'DORIS ID', 'o': '?x0'}

 Q: Is the electronegativity of the selenium equal to 2.55?
 SPARQL: ASK WHERE { wd:Q876 wdt:P1108 ?obj filter(?obj = 2.55) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'selenium', 'p': 'electronegativity', 'o': '?x0', '?x0': '2.55'}

 Q: Name the church monument where Paul was the patron saint
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Paul', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'church'}}

 Q: What is {nominated for} of {Robert Donat} that is {for work} is {Goodbye, Mr. Chips} ?
 SPARQL: SELECT ?obj WHERE { wd:Q116983 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q43228 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Donat', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Goodbye, Mr. Chips'}}}

 Q: What country uses the sterling pound as its currency?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'pound', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is {educated at} of {Henry Cabot Lodge} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q174037 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Cabot Lodge', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Cabot Lodge', 'p': 'educated at', 'o': '$y0'}}]

 Q: Is it true that the suicide rate of Nara Prefecture equals to 20.736?
 SPARQL: ASK WHERE { wd:Q131287 wdt:P3864 ?obj filter(?obj = 20.736) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nara Prefecture', 'p': 'suicide rate', 'o': '?x0', '?x0': '20.736'}

 Q: In what historical period was Ancient Rome set ?
 SPARQL:  select distinct ?obj where { wd:Q1747689 wdt:P2348 ?obj . ?obj wdt:P31 wd:Q11514315 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ancient Rome', 'p': 'historical period', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical period'}}

 Q: What are the analytic function which start with the letter function
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215084 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'function')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'analytic function'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'function'}}

 Q: Which is the product or the material produced of tomato juice?
 SPARQL: select distinct ?answer where { ?answer wdt:P1056 wd:Q787325}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'material produced', 'o': 'tomato juice'}

 Q: Which is the AlloCiné person ID for Leslie Howard?
 SPARQL: select distinct ?answer where { wd:Q156178 wdt:P1266 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leslie Howard', 'p': 'AlloCiné person ID', 'o': '?x0'}

 Q: Which is the Daum Encyclopedia ID for Brexit?
 SPARQL: select distinct ?answer where { wd:Q7888194 wdt:P5184 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brexit', 'p': 'Daum Encyclopedia ID', 'o': '?x0'}

 Q: What is {genetic association} of {regulates (molecular biology)} of {hsa-miR-4323} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27593997 wdt:P128 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hsa-miR-4323', 'p': 'regulates (molecular biology)', 'o': '$y0'}}

 Q: Did {Nina_Simone} {record label} {Bethlehem Records} and {Collectables Records} ?
 SPARQL: ASK WHERE { wd:Q174957 wdt:P264 wd:Q831335 . wd:Q174957 wdt:P264 wd:Q2097467 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Nina Simone', 'p': 'record label', 'o': '?x0', '?x0': 'Bethlehem Records'}, {'h': 'IS', 'v': '?x1', 's': 'Nina Simone', 'p': 'record label', 'o': '?x1', '?x1': 'Collectables Records'}]

 Q: What takes place on Rosh Hashanah in the month of Tishrei?
 SPARQL: SELECT ?answer WHERE { wd:Q131028 wdt:P837 ?answer . ?answer wdt:P2922 wd:Q217782}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rosh Hashanah', 'p': 'takes place on', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'month', 'o': 'Tishrei'}}

 Q: What is the {sovereign state} for {head of state} of {Emmanuel Macron}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q3052772 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Emmanuel Macron', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the monument with the highest luminous intensity whose heritage designation is Rijksmonument?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4989906 . ?ent wdt:P3041 ?obj . ?ent wdt:P1435 wd:Q916333 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'luminous intensity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monument', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'heritage designation', 'o': 'Rijksmonument'}}}

 Q: What is <playing range image> of <alto saxophone> ?
 SPARQL: select distinct ?answer where { wd:Q445275 wdt:P2343 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'alto saxophone', 'p': 'playing range image', 'o': '?x0'}

 Q: How many {speaker} are to/by {Ronald Reagan} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P823 wd:Q9960 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'speaker', 'o': 'Ronald Reagan'}

 Q: What is the {polytheism} for {religion} of {Etruschi}
 SPARQL:  select distinct ?obj where { wd:Q17161 wdt:P140 ?obj . ?obj wdt:P31 wd:Q9163 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Etruschi', 'p': 'religion', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'polytheism'}}

 Q: What is {film starring} of {Miami Vice}, that has {birthyear} is {1949-12-15} ?
 SPARQL: SELECT ?answer WHERE { wd:Q559321 wdt:P161 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1949'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Miami Vice', 'p': 'starring', 'o': '?x0', 't': '1949'}

 Q: Which is the listed ingredient for vitamin E?
 SPARQL: select distinct ?answer where { ?answer wdt:P4543 wd:Q141180}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'listed ingredient', 'o': 'vitamin E'}

 Q: Who is the player that participated in Barbora Spotakova?
 SPARQL: SELECT ?answer WHERE { wd:Q6419 wdt:P1344 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'player', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbora Spotakova', 'p': 'participated in', 'o': '$y0'}}

 Q: Tell me the method for determining hypertension with a CACNB2 genetic association?
 SPARQL: SELECT ?value WHERE { wd:Q41861 p:P2293 ?s . ?s ps:P2293 wd:Q17854978 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hypertension', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'CACNB2'}}}

 Q: Is it true that the highest break of Jak Jones equals to 139?
 SPARQL: ASK WHERE { wd:Q549519 wdt:P6590 ?obj filter(?obj = 139) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Jak Jones', 'p': 'highest break', 'o': '?x0', '?x0': '139'}

