 Q: What is {member of} of {first described} of {NGC 5548} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1120968 wdt:P61 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'NGC 5548', 'p': 'first described', 'o': '$y0'}}

 Q: What is the {location of final assembly} and the {operator} of {Boeing_787_Dreamliner} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q6428 wdt:P1071 ?ans_1 . wd:Q6428 wdt:P137 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Boeing 787 Dreamliner', 'p': 'location of final assembly', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Boeing 787 Dreamliner', 'p': 'operator', 'o': '?x1'}]

 Q: what is the {start time} for {Bibi Andersson} has {spouse} as {Per Ahlmark} ?
 SPARQL: SELECT ?value WHERE { wd:Q234921 p:P26 ?s . ?s ps:P26 wd:Q1347731 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bibi Andersson', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': 'Per Ahlmark'}}}

 Q: What is {nominated for} of {Bernard Herrmann} that is {statement is subject of} is {14th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q296804 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508406 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernard Herrmann', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subject of', 'o': '14th Academy Awards'}}}

 Q: Which is the ammunition for Minigun?
 SPARQL: select distinct ?answer where { wd:Q864060 wdt:P739 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Minigun', 'p': 'ammunition', 'o': '?x0'}

 Q: What are the pseudovector which start with the letter angular
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q621476 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'angular')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pseudovector'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'angular'}}

 Q: During what time did Stanley Bruce receive an award for Companion of Honour?
 SPARQL: SELECT ?value WHERE { wd:Q23358 p:P166 ?s . ?s ps:P166 wd:Q16947520 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Stanley Bruce', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Companion of Honour'}, 't': '?x0'}

 Q: What king of Antigua and Barbuda was awarded the the Order of Saints Olga and Sophia?
 SPARQL: SELECT ?answer WHERE { wd:Q781 wdt:P35 ?answer . ?answer wdt:P166 wd:Q682749}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antigua and Barbuda', 'p': 'king', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'award', 'o': 'Order of Saints Olga and Sophia'}}

 Q: Which is the origin of the watercourse of Aconcagua?
 SPARQL: select distinct ?answer where { ?answer wdt:P885 wd:Q39739}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'origin of the watercourse', 'o': 'Aconcagua'}

 Q: Which is ADAGP artist ID for Andy Warhol?
 SPARQL: select distinct ?answer where { wd:Q5603 wdt:P3901 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andy Warhol', 'p': 'ADAGP artist ID', 'o': '?x0'}

 Q: Which is the BoF person ID for Alicia Vikander?
 SPARQL: select distinct ?answer where { wd:Q439314 wdt:P3814 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alicia Vikander', 'p': 'BoF person ID', 'o': '?x0'}

 Q: What is the {city} for {shares border with} of {Ottawa}
 SPARQL:  select distinct ?obj where { wd:Q1930 wdt:P47 ?obj . ?obj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ottawa', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is {population} of {Granada} that is {determination method} is {register office} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8810 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Granada', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'register office'}}}

 Q: What is the {position} for {appointed by} of {United Nations General Assembly}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P748 wd:Q47423 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'appointed by', 'o': 'United Nations General Assembly', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is <stereoisomer of> of <L-Phenylalanine> ?
 SPARQL: select distinct ?answer where { wd:Q170545 wdt:P3364 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'L-Phe', 'p': 'stereoisomer of', 'o': '?x0'}

 Q: What is the {association football club} for {member of sports team} of {Lionel Messi}
 SPARQL:  select distinct ?obj where { wd:Q615 wdt:P54 ?obj . ?obj wdt:P31 wd:Q476028 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lionel Messi', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'association football club'}}

 Q: What is {twinned administrative body} of {Cairo Governorate} that is {start time} is {1990-10-23} ?
 SPARQL: SELECT ?obj WHERE { wd:Q30805 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cairo Governorate', 'p': 'twinned administrative body', 'o': '?x0', 't': '1990'}

 Q: What is the label of Exile on Main St., that was co-founded by Nik Powell?
 SPARQL: SELECT ?answer WHERE { wd:Q217248 wdt:P264 ?answer . ?answer wdt:P112 wd:Q7034649}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Exile on Main St.', 'p': 'label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Nik Powell'}}

 Q: What is the {type of quantum particle} with the {MAX(decay width)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2223 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'decay width', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: what is the {end time} for {Fort-de-France} has {head of government} as {Raymond Saint-Louis-Augustin} ?
 SPARQL: SELECT ?value WHERE { wd:Q81621 p:P6 ?s . ?s ps:P6 wd:Q16266685 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fort-de-France', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Raymond Saint-Louis-Augustin'}}}

 Q: What is {nominated for} of {George Bernard Shaw} that is {point in time} is {1925-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19185 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1925')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Bernard Shaw', 'p': 'nominated for', 'o': '?x0', 't': '1925'}

 Q: Dortmund is located on terrain feature of what type?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1295 wdt:P706 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Dortmund', 'p': 'location', 'o': '?x0'}

 Q: What is <Rockipedia area ID> of <Bergen> ?
 SPARQL: select distinct ?answer where { wd:Q26793 wdt:P5173 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bergen', 'p': 'Rockipedia area ID', 'o': '?x0'}

 Q: Which is the international airport for the place served by transport hub of Los Angeles?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P931 wd:Q65 . ?sbj wdt:P31 wd:Q644371 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place served by transport hub', 'o': 'Los Angeles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international airport'}}

 Q: What is {electoral district} and {elected in} of {{Kevin Rudd} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q43135 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P768 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kevin Rudd', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kevin Rudd', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: Is the thermal conductivity of titanium carbide equal to 17.76?
 SPARQL: ASK WHERE { wd:Q426498 wdt:P2068 ?obj filter(?obj = 17.76) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'tantalum carbide', 'p': 'thermal conductivity', 'o': '?x0', '?x0': '17.76'}

 Q: What are the republic which start with the letter zimbabwe
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zimbabwe')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zimbabwe'}}

 Q: What are the {transliteration for the {Zhongshan} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q59223 wdt:P2440 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Zhongshan', 'p': 'transliteration', 'o': '?x0'}

 Q: What are the film studio which start with the letter studios
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q375336 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'studios')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film studio'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'studios'}}

 Q: What is <motto> of <Pakistan> ?
 SPARQL: select distinct ?answer where { wd:Q843 wdt:P1546 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pakistan', 'p': 'motto', 'o': '?x0'}

 Q: Is the Ivy League in the country teh United States of America?
 SPARQL: ASK WHERE { wd:Q49113 wdt:P17 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ivy League', 'p': 'country', 'o': '?x0', '?x0': 'United States of America'}]

 Q: What is The Black Book ID of Otto Strasser ?
 SPARQL: select distinct ?answer where { wd:Q76640 wdt:P4248 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Otto Strasser', 'p': 'The Black Book ID', 'o': '?x0'}

 Q: Give me {city of Iran} that contains the word {zaviyeh} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56557504 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zaviyeh')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city of Iran'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zaviyeh'}}

 Q: How much is the mass of potassium ferricyanide?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q408810 wdt:P2067 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'potassium ferricyanide', 'p': 'mass', 'o': '?x0'}

 Q: Give me {recurring tournament} that {competition class} {men's golf} and which contains the word {championship} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15259995 . ?sbj wdt:P2094 wd:Q55864193 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'championship')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring tournament', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'competition class', 'o': "men's golf"}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'championship'}}

 Q: Name a colonial empire that starts with the letter I
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790360 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'colonial empire'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: When did spouse of Faye Dunaway and start time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q168721 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faye Dunaway', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faye Dunaway', 'p': 'spouse', 'o': '$y0'}}]

 Q: what is the isotope of tin has the highest spin quantum number?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q687521 . ?ent wdt:P1122 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'spin quantum number', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of tin'}}

 Q: How many spouses did Rezā Shāh have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q182921 wdt:P26 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Rezā Shāh', 'p': 'spouse', 'o': '?x0'}

 Q: Tell me childbirth whose name has the word jesus in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34581 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'jesus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'childbirth'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'jesus'}}

 Q: What was the academic major of Larry Page who was educated at Stanford University?
 SPARQL: SELECT ?value WHERE { wd:Q4934 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P812 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Larry Page', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Stanford University'}}}

 Q: What is the {atomic bomb} for {product or material produced} of {Manhattan Project}
 SPARQL:  select distinct ?obj where { wd:Q127050 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q650051 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Manhattan Project', 'p': 'product or material produced', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'atomic bomb'}}

 Q: what is the {determination method} for {lung cancer} has {genetic association} as {MTMR3} ?
 SPARQL: SELECT ?value WHERE { wd:Q47912 p:P2293 ?s . ?s ps:P2293 wd:Q18033514 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'lung cancer', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'MTMR3'}}}

 Q: who is the markup language for based on of HTML5?
 SPARQL:  select distinct ?obj where { wd:Q2053 wdt:P144 ?obj . ?obj wdt:P31 wd:Q37045 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'HTML5', 'p': 'based on', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'markup language'}}

 Q: Who is the sculptor of the ring theory, whose death date was 9-10-1948?
 SPARQL: SELECT ?answer WHERE { wd:Q1208658 wdt:P170 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1948'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'ring theory', 'p': 'sculptor', 'o': '?x0', 't': '1948'}

 Q: How many {student of} are for {Wilhelm Furtwängler} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q57285 wdt:P1066 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Wilhelm Furtwängler', 'p': 'student of', 'o': '?x0'}

 Q: What was located in Tangier starting in 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q126148 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tangier', 'p': 'in', 'o': '?x0', 't': '2015'}

 Q: "Where is {deathplace} of {Robert Knox}, which has {partner city} is {New Delhi} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q352109 wdt:P20 ?answer . ?answer wdt:P190 wd:Q987}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Robert Knox', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'New Delhi'}}

 Q: What is {founder} of {builder} of {Lancashire Witch} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6483054 wdt:P176 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lancashire Witch', 'p': 'builder', 'o': '$y0'}}

 Q: which aircraft model with the lowest takeoff roll whose instance is airrcraft model?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj . ?ent wdt:P31 wd:Q15056995} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'takeoff roll', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft model'}}

 Q: Where is the position of office held by head of the organisation of World Trade Organization
 SPARQL:  select distinct ?obj where { wd:Q7825 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'World Trade Organization', 'p': 'office held by head of the organisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is the {political organisation} for {members have occupation} of {Xi Jinping}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3989 wd:Q15031 . ?sbj wdt:P31 wd:Q7210356 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'members have occupation', 'o': 'Xi Jinping', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political organization'}}

 Q: What is {award received} of {Andy Lau} that is {for work} is {A Simple Life} ?
 SPARQL: SELECT ?obj WHERE { wd:Q16766 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q167432 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andy Lau', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'A Simple Life'}}}

 Q: What was the population of Staten Island on July 1st, 2013?
 SPARQL: SELECT ?obj WHERE { wd:Q18432 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Staten Island', 'p': 'population', 'o': '?x0', 't': '2013'}

 Q: Was Stephen Hawking influenced by Karl Popper?
 SPARQL: ASK WHERE { wd:Q17714 wdt:P737 wd:Q81244 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Stephen Hawking', 'p': 'influenced by', 'o': '?x0', '?x0': 'Karl Popper'}]

 Q: Which city is the capital of Maurya Empire?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1376 wd:Q62943 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital of', 'o': 'Maurya Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is the operating system for PlayStation 3?
 SPARQL: select distinct ?answer where { wd:Q10683 wdt:P306 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'PlayStation 3', 'p': 'operating system', 'o': '?x0'}

 Q: What is <time period> of <Early Middle Ages> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2348 wd:Q202763}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'Early Middle Ages'}

 Q: Which is {CPI inflation rate} of {citizen of} {Asa Griggs Candler} ?
 SPARQL: SELECT ?answer WHERE { wd:Q744866 wdt:P27 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asa Griggs Candler', 'p': 'citizen of', 'o': '$y0'}}

 Q: What are thebookkeeping system which start with the letter stathmography
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60158614 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'stathmography')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bookkeeping system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'stathmography'}}

 Q: What is the {located in the administrative territorial entity} and the {twinned administrative body} of {Edmonton} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q2096 wdt:P131 ?ans_1 . wd:Q2096 wdt:P190 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Edmonton', 'p': 'located in the administrative territorial entity', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Edmonton', 'p': 'twinned administrative body', 'o': '?x1'}]

 Q: What is the {media player} for {operating system} of {MS-DOS}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q210337 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operating system', 'o': 'MS-DOS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'media player'}}

 Q: What is the {Chinese character} with the {MIN(stroke count)} whose {grade of kanji} is {grade 4 kyōiku kanji}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj . ?ent wdt:P5277 wd:Q53785305} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'stroke count', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Chinese character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'grade of kanji', 'o': 'grade 4 kanji'}}}

 Q: What is {uses} of {killer whale} that is {determination method} is {mirror test} ?
 SPARQL: SELECT ?obj WHERE { wd:Q26843 p:P2283 ?s . ?s ps:P2283 ?obj . ?s pq:P459 wd:Q1430725 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'uses', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'killer whale', 'p': 'uses', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'mirror test'}}}

 Q: When was the inflation rate in Vanuatu at 5.1?
 SPARQL: SELECT ?value WHERE { wd:Q686 p:P1279 ?s . ?s ps:P1279 ?x filter(contains(?x,'5.1')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Vanuatu', 'p': 'inflation rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'inflation rate', 'o': '5.1'}, 't': '?x0'}

 Q: What award did Milton Friedman receive in 1976?
 SPARQL: SELECT ?obj WHERE { wd:Q47426 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Milton Friedman', 'p': 'award', 'o': '?x0', 't': '1976'}

 Q: At what time did L'Hospitalet de Llobregat have a population of 250,536?
 SPARQL: SELECT ?value WHERE { wd:Q15470 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'250536.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': "L'Hospitalet de Llobregat", 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '250536.0'}, 't': '?x0'}

 Q: Which is the EDb film ID of Rear Window?
 SPARQL: select distinct ?answer where { wd:Q34414 wdt:P3141 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rear Window', 'p': 'EDb film ID', 'o': '?x0'}

 Q: How many {edition or translation of} are to/by {Meditations} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P629 wd:Q1152283 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'edition or translation of', 'o': 'Meditations'}

 Q: Give me {mythical creature} that starts with {'ş'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2239243 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ş')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythical creature'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ş'}}

 Q: What is the {spouse} and the {position played on team / speciality} of {Derek_Jeter} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q353511 wdt:P26 ?ans_1 . wd:Q353511 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Derek Jeter', 'p': 'spouse', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Derek Jeter', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: what is the {of} for {photon} has {mass} as {0.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q3198 p:P2067 ?s . ?s ps:P2067 ?x filter(contains(?x,'0.0')) . ?s pq:P642 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'photon', 'p': 'weight', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'weight', 'o': '0.0'}}}

 Q: What is {award received} of {Komsomolskaya Pravda} that is {point in time} is {1957-12-6} ?
 SPARQL: SELECT ?obj WHERE { wd:Q849047 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Komsomolskaya Pravda', 'p': 'award', 'o': '?x0', 't': '1957'}

 Q: What is {main food source} of {tiger} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19939 p:P1034 ?s . ?s ps:P1034 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'main food source', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'tiger', 'p': 'main food source', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'c'}}}

 Q: What is the {GUI toolkit or framework} and the {programming language} of {Skype} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q40984 wdt:P1414 ?ans_1 . wd:Q40984 wdt:P277 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Skype', 'p': 'GUI toolkit or framework', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Skype', 'p': 'programming language', 'o': '?x1'}]

 Q: What is the {human} for {father} of {Akbar}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P22 wd:Q8597 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'father', 'o': 'Akbar', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which chemical compound has the highest acceptable daily intake?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2542 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'acceptable daily intake', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Which is the dynasty of the country of the Roman Empire?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q2277 . ?sbj wdt:P31 wd:Q164950 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Roman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dynasty'}}

 Q: What is {location of work} of {Patrick Swayze}, that has {also known as} is {Welthauptstadt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q49004 wdt:P937 ?answer . ?answer wdt:P1449 ?x FILTER(contains(?x,'Welthauptstadt'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Patrick Swayze', 'p': 'location of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'also known as', 'o': 'welthauptstadt'}}

 Q: What is {is son of} of {written by} of {Devi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q640276 wdt:P86 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Devi', 'p': 'written by', 'o': '$y0'}}

 Q: What is the {human} for {author} of {Things Fall Apart}
 SPARQL:  select distinct ?obj where { wd:Q622400 wdt:P50 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Things Fall Apart', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: In which year Fredrik Bajer was nominated for Nobel Peace Prize award?
 SPARQL: SELECT ?value WHERE { wd:Q191016 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Fredrik Bajer', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: Tacloban belongs to which electorate?
 SPARQL: select distinct ?answer where { wd:Q40626 wdt:P1831 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tacloban', 'p': 'electorate', 'o': '?x0'}

 Q: What is {award received} of {Marvin Hamlisch} that is {statement is subject of} is {46th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q337206 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q570921 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marvin Hamlisch', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '46th Academy Awards'}}}

 Q: What is {sister city} of {Sagamihara}, that has {inhabitants} is {2731571} ?
 SPARQL: SELECT ?answer WHERE { wd:Q209779 wdt:P190 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'2731571'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sagamihara', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '2731571'}}

 Q: What is the {notable work} and the {field of work} of {Jordan_Peterson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q6276882 wdt:P800 ?ans_1 . wd:Q6276882 wdt:P101 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Jordan Peterson', 'p': 'notable work', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Jordan Peterson', 'p': 'field of work', 'o': '?x1'}]

 Q: what is the {point in time} for {Christopher Lloyd} has {award received} as {Independent Spirit Award for Best Supporting Male} ?
 SPARQL: SELECT ?value WHERE { wd:Q109324 p:P166 ?s . ?s ps:P166 wd:Q2294693 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Christopher Lloyd', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Independent Spirit Award for Best Supporting Male'}, 't': '?x0'}

 Q: What is {governor} of {Jersey}, that has {has mother} is {Queen Elizabeth The Queen Mother} ?
 SPARQL: SELECT ?answer WHERE { wd:Q785 wdt:P35 ?answer . ?answer wdt:P25 wd:Q10633}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jersey', 'p': 'governor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mother', 'o': 'Queen Elizabeth The Queen Mother'}}

 Q: Which is the EAGLE id of Hadrian?
 SPARQL: select distinct ?answer where { wd:Q1427 wdt:P1900 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hadrian', 'p': 'EAGLE id', 'o': '?x0'}

 Q: What are the health profession which start with the letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3922583 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'health profession'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

