 Q: What left office is from the temporal range start of Sturtian glaciation?
 SPARQL: SELECT ?answer WHERE { wd:Q1450075 wdt:P523 ?X . ?X wdt:P582 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'left office', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sturtian glaciation', 'p': 'temporal range start', 'o': '$y0'}}

 Q: What is {subsidiary entities} of {works for} of {Buzz Aldrin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2252 wdt:P108 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Buzz Aldrin', 'p': 'works for', 'o': '$y0'}}

 Q: What place with a NW zipcode is the admin HQ of Arsenal F.C.?
 SPARQL: SELECT ?answer WHERE { wd:Q9617 wdt:P159 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'NW'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arsenal F.C.', 'p': 'HQ', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'zipcode', 'o': 'nw'}}

 Q: what is the {winner} for {Gloria Estefan} has {award received} as {Latin Grammy Award for Best Tropical Song} ?
 SPARQL: SELECT ?value WHERE { wd:Q184697 p:P166 ?s . ?s ps:P166 wd:Q6496398 . ?s pq:P1346 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gloria Estefan', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Latin Grammy Award for Best Tropical Song'}}}

 Q: Give me {United States federal executive department} that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q910252 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'United States federal executive department'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Which is the Unicode hex codepoint for smiley?
 SPARQL: select distinct ?answer where { wd:Q11241 wdt:P4213 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'smiley', 'p': 'Unicode hex codepoint', 'o': '?x0'}

 Q: Is the Wikidata time precision of the minute equal to 13?
 SPARQL: ASK WHERE { wd:Q7727 wdt:P2803 ?obj filter(?obj = 13) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'minute', 'p': 'Wikidata time precision', 'o': '?x0', '?x0': '13'}

 Q: Were the House of Lancaster and the House of Neville participants in the Wars of the Roses?
 SPARQL: ASK WHERE { wd:Q127751 wdt:P710 wd:Q2364167 . wd:Q127751 wdt:P710 wd:Q105278 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Wars of the Roses', 'p': 'participant', 'o': '?x0', '?x0': 'House of Neville'}, {'h': 'IS', 'v': '?x1', 's': 'Wars of the Roses', 'p': 'participant', 'o': '?x1', '?x1': 'House of Lancaster'}]

 Q: WHat treaty serves as the main regulatory text in Soviet Union
 SPARQL:  select distinct ?obj where { wd:Q15180 wdt:P92 ?obj . ?obj wdt:P31 wd:Q131569 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Soviet Union', 'p': 'main regulatory text', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'treaty'}}

 Q: Is QCOM the stock exchange ticker symbol for Qualcomm?
 SPARQL: SELECT ?obj WHERE { wd:Q544847 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'QCOM')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stock exchange', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Qualcomm', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ticker symbol', 'o': 'qcom'}}}

 Q: what is the {point in time} for {Marion Cotillard} has {award received} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q8927 p:P166 ?s . ?s ps:P166 wd:Q103618 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Marion Cotillard', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Actress'}, 't': '?x0'}

 Q: Who did Alejandro Sanz marry on May 26, 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q276170 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alejandro Sanz', 'p': 'marry', 'o': '?x0', 't': '2012'}

 Q: What is {co-founded by} of {developed by} of {The Sims: Hot Date} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1991302 wdt:P178 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Sims: Hot Date', 'p': 'developed by', 'o': '$y0'}}

 Q: What sovereign state starts with the letter "y"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is the {human} for {conflict} of {World War II}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P607 wd:Q362 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'World War II', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {date of death} and {date of birth} of {{Abigail Adams} has {child} as {Abigail Adams Smith}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams Smith'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Abigail Adams Smith'}}}]

 Q: What was Leo Tolstoy nominated for in 1905?
 SPARQL: SELECT ?obj WHERE { wd:Q7243 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1905')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leo Tolstoy', 'p': 'nominated for', 'o': '?x0', 't': '1905'}

 Q: Give me {state of Australia} that contains the word {victoria} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5852411 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'victoria')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state of Australia'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'victoria'}}

 Q: What edition of "On the Origin of Species" was published in 1906?
 SPARQL: SELECT ?obj WHERE { wd:Q20124 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'1906')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'On the Origin of Species', 'p': 'edition', 'o': '?x0', 't': '1906'}

 Q: What is the {Wikimedia list article} for {published in} of {Rolling Stone}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'Rolling Stone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia list article'}}

 Q: What is {head of government} of {North Rhine-Westphalia} that is {start time} is {1956-2-20} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1198 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'North Rhine-Westphalia', 'p': 'head of government', 'o': '?x0', 't': '1956'}

 Q: What was the Human Development Index of Chile in 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q298 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chile', 'p': 'Human Development Index', 'o': '?x0', 't': '2012'}

 Q: what is the {point in time} for {Ginger Lynn} has {award received} as {AVN Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q233596 p:P166 ?s . ?s ps:P166 wd:Q824540 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ginger Lynn', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'AVN Award'}, 't': '?x0'}

 Q: How many work locations are for Hans Hofmann?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q215461 wdt:P937 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Hans Hofmann', 'p': 'work location', 'o': '?x0'}

 Q: Name the honorary title given to Jack Kilby whose leader is Herwig Kogelnik?
 SPARQL: SELECT ?answer WHERE { wd:Q182031 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q1528517}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jack Kilby', 'p': 'honorary title', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'leader', 'o': 'Herwig Kogelnik'}}

 Q: What is <inventory number> of <Guernica> ?
 SPARQL: select distinct ?answer where { wd:Q175036 wdt:P217 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Guernica', 'p': 'inventory number', 'o': '?x0'}

 Q: What is {differs from} of {Great Commandment}, that has {created on language} is {English} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51641 wdt:P1889 ?answer . ?answer wdt:P364 wd:Q1860}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Great Commandment', 'p': 'differs from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'created on language', 'o': 'English'}}

 Q: Did {Al_Pacino} {educated at} {Hurst Lodge School}?
 SPARQL: ASK WHERE { wd:Q41163 wdt:P69 wd:Q15227061 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Al Pacino', 'p': 'educated at', 'o': '?x0', '?x0': 'Hurst Lodge School'}]

 Q: What is the {Juno Award} for {winner} of {The Weeknd}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1346 wd:Q2121062 . ?sbj wdt:P31 wd:Q507057 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'The Weeknd', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Juno Award'}}

 Q: Is the residence time of the water in the Sea of Galilee 4.8?
 SPARQL: ASK WHERE { wd:Q126982 wdt:P3020 ?obj filter(?obj = 4.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sea of Galilee', 'p': 'residence time of water', 'o': '?x0', '?x0': '4.8'}

 Q: What is {human population} of {principal place} of {Roman Republic} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17167 wdt:P36 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roman Republic', 'p': 'capital', 'o': '$y0'}}

 Q: What is the Christian name of James Hetfield that is the same as Jacques?
 SPARQL: SELECT ?answer WHERE { wd:Q484302 wdt:P735 ?answer . ?answer wdt:P460 wd:Q941049}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'James Hetfield', 'p': 'Christian name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Jacques'}}

 Q: Give me {Magnetic confinement fusion} that contains the word {tokamak} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q939954 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tokamak')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Magnetic confinement fusion'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tokamak'}}

 Q: what is the due to of the death cause of Edwin Kagin?
 SPARQL: SELECT ?answer WHERE { wd:Q5346572 wdt:P509 ?X . ?X wdt:P828 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edwin Kagin', 'p': 'death cause', 'o': '$y0'}}

 Q: When did Rolf-Dieter Heuer stop being the director of CERN?
 SPARQL: SELECT ?value WHERE { wd:Q42944 p:P1037 ?s . ?s ps:P1037 wd:Q65092 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'CERN', 'p': 'director', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'director', 'o': 'Rolf-Dieter Heuer'}}}

 Q: Which is the RxNorm CUI for palladium?
 SPARQL: select distinct ?answer where { wd:Q1089 wdt:P3345 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'palladium', 'p': 'RxNorm CUI', 'o': '?x0'}

 Q: What is {position held} of {Helen Clark} that is {start time} is {1981-11-28} ?
 SPARQL: SELECT ?obj WHERE { wd:Q180383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Helen Clark', 'p': 'position held', 'o': '?x0', 't': '1981'}

 Q: How many CEOs does Apple, Inc., have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q312 wdt:P169 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Apple', 'p': 'CEO', 'o': '?x0'}

 Q: What is {heraldic emblem} of {twin cities} of {Changsha} ?
 SPARQL: SELECT ?answer WHERE { wd:Q174091 wdt:P190 ?X . ?X wdt:P94 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'heraldic emblem', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Changsha', 'p': 'twin cities', 'o': '$y0'}}

 Q: what is the {end time} for {Geneva} has {capital of} as {Republic of Geneva} ?
 SPARQL: SELECT ?value WHERE { wd:Q71 p:P1376 ?s . ?s ps:P1376 wd:Q23366230 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Geneva', 'p': 'capital of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital of', 'o': 'Republic of Geneva'}}}

 Q: Who is the author of The Merchant of Venice and who are it's characters?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q206400 wdt:P674 ?ans_1 . wd:Q206400 wdt:P50 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Merchant of Venice', 'p': 'characters', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Merchant of Venice', 'p': 'author', 'o': '?x1'}]

 Q: Is the number of registered contributors of Project Euler 485867?
 SPARQL: ASK WHERE { wd:Q168430 wdt:P1833 ?obj filter(?obj = 485867) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Project Euler', 'p': 'number of registered users/contributors', 'o': '?x0', '?x0': '485867'}

 Q: Who is the doctoral supervisor and founder of clinical psychology?
 SPARQL: SELECT ?answer WHERE { wd:Q199906 wdt:P112 ?X . ?X wdt:P184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral supervisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'clinical psychology', 'p': 'founder', 'o': '$y0'}}

 Q: Give me {profession} that {facet of} {female dominance} and which contains the word {dominatrix} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28640 . ?sbj wdt:P1269 wd:Q1404482 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dominatrix')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'female dominance'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dominatrix'}}

 Q: what is the {start time} for {Robert Evans} has {spouse} as {Ali MacGraw} ?
 SPARQL: SELECT ?value WHERE { wd:Q1826885 p:P26 ?s . ?s ps:P26 wd:Q229983 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Evans', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Ali MacGraw'}}}

 Q: What is <color index> of <Alpha Centauri> ?
 SPARQL: select distinct ?answer where { wd:Q12176 wdt:P1458 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alpha Centauri', 'p': 'color index', 'o': '?x0'}

 Q: Is the maximum Strahler number of Black Creek equal to 3?
 SPARQL: ASK WHERE { wd:Q4920591 wdt:P1548 ?obj filter(?obj = 3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Black Creek', 'p': 'maximum Strahler number', 'o': '?x0', '?x0': '3'}

 Q: What is {zipcode} of {sister town} of {Volgograd} ?
 SPARQL: SELECT ?answer WHERE { wd:Q914 wdt:P190 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zipcode', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Volgograd', 'p': 'sister town', 'o': '$y0'}}

 Q: What is <less than> of <Uranus> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5136 wd:Q324}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'less than', 'o': 'Uranus'}

 Q: Is the data size of The Elder Scrolls: Legends equal to 3448098816?
 SPARQL: ASK WHERE { wd:Q20538679 wdt:P3575 ?obj filter(?obj = 3448098816) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'The Elder Scrolls: Legends', 'p': 'data size', 'o': '?x0', '?x0': '3448098816'}

 Q: What is {educated at} of {Indra Nooyi} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q264913 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Indra Nooyi', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Indra Nooyi', 'p': 'educated at', 'o': '$y0'}}]

 Q: What film genre is pupil of Carl Reinecke ?
 SPARQL: SELECT ?answer WHERE { wd:Q159569 wdt:P1066 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Reinecke', 'p': 'pupil of', 'o': '$y0'}}

 Q: How many residences are there for Mikhail Bulgakov?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q835 wdt:P551 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Mikhail Bulgakov', 'p': 'residence', 'o': '?x0'}

 Q: Did {Osama_bin_Laden} {residence} {Osama bin Laden's house in Khartoum}?
 SPARQL: ASK WHERE { wd:Q1317 wdt:P551 wd:Q7105667 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Osama bin Laden', 'p': 'residence', 'o': '?x0', '?x0': "Osama bin Laden's house in Khartoum"}]

 Q: What is {subject in} of {interaction} of {top quark} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6778 wdt:P517 ?X . ?X wdt:P1269 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'top quark', 'p': 'interaction', 'o': '$y0'}}

 Q: What is {spouse} of {Alexander Hamilton} that is {place of marriage} is {Schuyler Mansion} ?
 SPARQL: SELECT ?obj WHERE { wd:Q178903 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q1666617 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'marry', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Hamilton', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of marriage', 'o': 'Schuyler Mansion'}}}

 Q: what is the {end time} for {Sigismund} has {position held} as {King of Bohemia} ?
 SPARQL: SELECT ?value WHERE { wd:Q57124 p:P39 ?s . ?s ps:P39 wd:Q45341328 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sigismund', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of Bohemia'}}}

 Q: Is 65 the retirement age in Czech Republic?
 SPARQL: ASK WHERE { wd:Q213 wdt:P3001 ?obj filter(?obj = 65) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Czech Republic', 'p': 'retirement age', 'o': '?x0', '?x0': '65'}

 Q: "Where is {grave at} of {James Bond}, which {partner town} is {Incheon} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q241031 wdt:P119 ?answer . ?answer wdt:P190 wd:Q20934}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'James Bond', 'p': 'grave at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Incheon'}}

 Q: What is {population} of {Rhode Island} that is {determination method} is {census} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1387 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rhode Island', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: Which is the volcanic rock which contains the word trachyte in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q108689 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trachyte')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'volcanic rock'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'trachyte'}}

 Q: What is {discipline of sport} of {coach} of {Nina Dumbadze} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50878 wdt:P286 ?X . ?X wdt:P2416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline of sport', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nina Dumbadze', 'p': 'coach', 'o': '$y0'}}

 Q: Who is record producer Vento del sud married to?
 SPARQL: SELECT ?answer WHERE { wd:Q4009726 wdt:P162 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'married to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vento del sud', 'p': 'producer', 'o': '$y0'}}

 Q: Tell me highly urbanized city whose name has the word valenzuela in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'valenzuela')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'highly urbanized city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'valenzuela'}}

 Q: What is {science, that studies} of {moveable object location} of {cell cycle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q188941 wdt:P276 ?X . ?X wdt:P2579 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'science, that studies', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cell cycle', 'p': 'location', 'o': '$y0'}}

 Q: What is the {sporting event} with the {MAX(event distance)} whose {winner} is {Rudolf Caracciola}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16510064 . ?ent wdt:P3157 ?obj . ?ent wdt:P1346 wd:Q57365 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'event distance', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sporting event', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'champion', 'o': 'Rudolf Caracciola'}}}

 Q: What is {head quarters} of {member of} of {Georg Rabuse} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1505690 wdt:P102 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georg Rabuse', 'p': 'member of', 'o': '$y0'}}

 Q: Did {Muhammad} {conflict} {Caravan raids}?
 SPARQL: ASK WHERE { wd:Q9458 wdt:P607 wd:Q3079899 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Muhammad', 'p': 'conflict', 'o': '?x0', '?x0': 'Caravan raids'}]

 Q: What shape is a rectangle?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1419 wd:Q209 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'shape', 'o': 'rectangle'}

 Q: Is it true that the thickness of the "Portrait of a Man" is less than .72"?
 SPARQL: ASK WHERE { wd:Q28016117 wdt:P2610 ?obj filter(?obj < 0.72) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Portrait of a Man', 'p': 'thickness', 'o': '?x0', '?x0': '0.72'}

 Q: How many {partner} are to/by {Iron Man} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P451 wd:Q180704 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Iron Man'}

 Q: What is {county seat for} of {workplace} of {La Monte Young} ?
 SPARQL: SELECT ?answer WHERE { wd:Q432822 wdt:P937 ?X . ?X wdt:P1376 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'county seat for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'La Monte Young', 'p': 'workplace', 'o': '$y0'}}

 Q: What is {start time} and {end time} of {{Barnaul} has {located in the administrative territorial entity} as {West Siberian Krai}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q6014 p:P131 ?s . ?s ps:P131 wd:Q4186485 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barnaul', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'West Siberian Krai'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barnaul', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'West Siberian Krai'}}}]

 Q: Which is the cultural region that is located in Bilbao?
 SPARQL:  select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q3502482 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bilbao', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cultural region'}}

 Q: What is {sister city} of {Eindhoven}, that has {gps co-ordinate} is {53.116666666667 23.166666666667} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9832 wdt:P190 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'53.116666666667 23.166666666667'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Eindhoven', 'p': 'sister city', 'o': '?x0'}

 Q: What is {doctoral supervisor} of {rector} of {Imperial St. Petersburg University} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28729082 wdt:P1075 ?X . ?X wdt:P184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral supervisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Imperial St. Petersburg University', 'p': 'rector', 'o': '$y0'}}

 Q: What is {shape} of {CompactFlash}, that has {base} is {rectangle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q678615 wdt:P1419 ?answer . ?answer wdt:P3263 wd:Q209}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'CompactFlash', 'p': 'shape', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'base', 'o': 'rectangle'}}

 Q: What is {preceded by} of {epoch} of {Selkirk Mountains} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1420547 wdt:P2348 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'preceded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Selkirk Mountains', 'p': 'epoch', 'o': '$y0'}}

 Q: Give me {band} that {discography} {Nightwish discography} and which contains the word {nightwish} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj wdt:P358 wd:Q960630 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nightwish')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'band', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discography', 'o': 'Nightwish discography'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'nightwish'}}

 Q: What is Thomas Aquinas' profession?
 SPARQL:  select distinct ?obj where { wd:Q9438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thomas Aquinas', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: What is the Who's Who UK ID of Albert Einstein?
 SPARQL: select distinct ?answer where { wd:Q937 wdt:P4789 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albert Einstein', 'p': "Who's Who UK ID", 'o': '?x0'}

 Q: Which is the BnF ID for planetary nebula?
 SPARQL: select distinct ?answer where { wd:Q13632 wdt:P268 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'planetary nebula', 'p': 'BnF ID', 'o': '?x0'}

 Q: Is the kinematic viscosity of Unleaded 91 equal to 0.475?
 SPARQL: ASK WHERE { wd:Q50740556 wdt:P2118 ?obj filter(?obj = 0.475) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Unleaded 91', 'p': 'kinematic viscosity', 'o': '?x0', '?x0': '0.475'}

 Q: Is the solubility of ethylene dichloride less than 1.08?
 SPARQL: ASK WHERE { wd:Q161480 wdt:P2177 ?obj filter(?obj < 1.08) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'ethylene dichloride', 'p': 'solubility', 'o': '?x0', '?x0': '1.08'}

 Q: What is {time of publication} of {environment} of {Grand Theft Auto III} ?
 SPARQL: SELECT ?answer WHERE { wd:Q149106 wdt:P400 ?X . ?X wdt:P577 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time of publication', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grand Theft Auto III', 'p': 'environment', 'o': '$y0'}}

 Q: What is the {Soyuz-TMA} with the {MAX(apoapsis)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2425489 . ?ent wdt:P2243 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'apoapsis', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Soyuz-TMA'}}

 Q: What is the {directory service} with the {MAX(port)} whose {instance of} is {directory service}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q756230 . ?ent wdt:P1641 ?obj . ?ent wdt:P31 wd:Q756230 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'port', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'directory service'}}

 Q: What is {mouth of the watercourse} of {Mississippi River} that is {statement is subject of} is {Mississippi River Delta} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1497 p:P403 ?s . ?s ps:P403 ?obj . ?s pq:P805 wd:Q1528035 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mouth of the watercourse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mississippi River', 'p': 'mouth of the watercourse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Mississippi River Delta'}}}

 Q: How many {significant person} are for {Rumi} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q43347 wdt:P3342 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Rumi', 'p': 'significant person', 'o': '?x0'}

 Q: How many {chairperson} are for {Musée d'Orsay} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q23402 wdt:P488 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': "Musée d'Orsay", 'p': 'chairperson', 'o': '?x0'}

 Q: What is the {concept} for {studied by} of {social science}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2579 wd:Q34749 . ?sbj wdt:P31 wd:Q151885 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'social science', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'concept'}}

 Q: What is {cohabitant} of {Courteney Cox}, that has {career} is {record producer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58912 wdt:P451 ?answer . ?answer wdt:P106 wd:Q183945}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Courteney Cox', 'p': 'cohabitant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'record producer'}}

 Q: Who has kids with Kanye West, whose brother-in-law is Kris Jenner?
 SPARQL: SELECT ?answer WHERE { wd:Q15935 wdt:P40 ?answer . ?answer wdt:P1038 wd:Q1138235}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kanye West', 'p': 'kid', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'brother-in-law', 'o': 'Kris Jenner'}}

