 Q: Which is the WSJ topic ID for Al Sharpton?
 SPARQL: select distinct ?answer where { wd:Q380433 wdt:P3183 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Al Sharpton', 'p': 'WSJ topic ID', 'o': '?x0'}

 Q: Are the points awarded int he 2018 AFL Women's season equal to 4?
 SPARQL: ASK WHERE { wd:Q48523108 wdt:P3260 ?obj filter(?obj = 4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "2018 AFL Women's season", 'p': 'points awarded', 'o': '?x0', '?x0': '4'}

 Q: What is {location born} of {Herbert Jasper}, that has {adjacent to} is {Idaho} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1348488 wdt:P19 ?answer . ?answer wdt:P47 wd:Q1221}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Herbert Jasper', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'next to', 'o': 'Idaho'}}

 Q: What is the {mausoleum} for {commemorates} of {Sun Yat-sen}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P547 wd:Q8573 . ?sbj wdt:P31 wd:Q162875 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commemorates', 'o': 'Sun Yat-sen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mausoleum'}}

 Q: Which is the official language for Republic of Adygea?
 SPARQL: select distinct ?answer where { wd:Q3734 wdt:P37 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Republic of Adygea', 'p': 'official language', 'o': '?x0'}

 Q: Who is the son of the parent of Myat Phaya?
 SPARQL: SELECT ?answer WHERE { wd:Q6946802 wdt:P25 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Myat Phaya', 'p': 'parent', 'o': '?x0'}

 Q: What is the {anthropomorphic character} for {present in work} of {Looney Tunes}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q622435 . ?sbj wdt:P31 wd:Q27921916 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Looney Tunes', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anthropomorphic character'}}

 Q: Who is {role model} of {subject in} {biography of Friedrich Nietzsche} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2401955 wdt:P1269 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role model', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'biography of Friedrich Nietzsche', 'p': 'subject in', 'o': '$y0'}}

 Q: Is the maximum viable temperature of the Pseudomonas putida KT2440 equal to 55?
 SPARQL: ASK WHERE { wd:Q21079489 wdt:P3252 ?obj filter(?obj = 55) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Pseudomonas putida KT2440', 'p': 'maximum viable temperature', 'o': '?x0', '?x0': '55'}

 Q: Which is the TMDb person ID for Nick Offerman?
 SPARQL: select distinct ?answer where { wd:Q1985488 wdt:P4985 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nick Offerman', 'p': 'TMDb person ID', 'o': '?x0'}

 Q: what is the {applies to part} for {Le Déjeuner sur l'herbe} has {depicts} as {woman} ?
 SPARQL: SELECT ?value WHERE { wd:Q152509 p:P180 ?s . ?s ps:P180 wd:Q467 . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Le Déjeuner sur l'herbe", 'p': 'depicts', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'depicts', 'o': 'woman'}}}

 Q: What is {zipcode} of {alumnus of} of {Hobey Baker} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1348425 wdt:P69 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zipcode', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hobey Baker', 'p': 'alumnus of', 'o': '$y0'}}

 Q: What is {co-founder} of {series} of {1925 Monte Carlo Rally} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20689352 wdt:P179 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'co-founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '1925 Monte Carlo Rally', 'p': 'series', 'o': '$y0'}}

 Q: what is the {start time} for {Mike Nichols} has {spouse} as {Diane Sawyer} ?
 SPARQL: SELECT ?value WHERE { wd:Q51537 p:P26 ?s . ?s ps:P26 wd:Q236402 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mike Nichols', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Diane Sawyer'}}}

 Q: According to Wikipedia, what is the reserve currency with the lowest price?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q756202 . ?ent wdt:P2284 ?obj . ?ent wdt:P5008 wd:Q5460604} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'price', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'reserve currency', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'on focus list of Wikimedia project', 'o': 'Wikipedia:Vital articles'}}}

 Q: which procedural programming language contains the word visual in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28922885 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'visual')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'procedural programming language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'visual'}}

 Q: Is Keira Knightley's given name Keira?
 SPARQL: ASK WHERE { wd:Q42581 wdt:P735 wd:Q6383805 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Keira Knightley', 'p': 'given name', 'o': '?x0', '?x0': 'Keira'}]

 Q: What is the aircraft in fleet of the user of T-54/55?
 SPARQL: SELECT ?answer WHERE { wd:Q328272 wdt:P1535 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fleet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'T-54/55', 'p': 'user', 'o': '$y0'}}

 Q: What is <manufacturer> of <Toyota> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P176 wd:Q201117}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'Toyota'}

 Q: Tell me biblical episode whose name has the word woman in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22704077 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'woman')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical episode'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'woman'}}

 Q: What is {champion} of {award} of {Joseph Lister, 1st Baron Lister} ?
 SPARQL: SELECT ?answer WHERE { wd:Q155768 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Lister, 1st Baron Lister', 'p': 'award', 'o': '$y0'}}

 Q: What is the  musical composition for composer of  Pyotr Ilyich Tchaikovsky
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q7315 . ?sbj wdt:P31 wd:Q207628 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composer', 'o': 'Pyotr Ilyich Tchaikovsky', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical composition'}}

 Q: What position is held by the head of state of Ottoman Empire?
 SPARQL:  select distinct ?obj where { wd:Q12560 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ottoman Empire', 'p': 'head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is the position of political office held by a member of Augustus' family?
 SPARQL: SELECT ?answer WHERE { wd:Q1405 wdt:P1038 ?X . ?X wdt:P39 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'political office held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Augustus', 'p': 'family', 'o': '$y0'}}

 Q: What is the {physical quantity} for {measured by} of {joule}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1880 wd:Q25269 . ?sbj wdt:P31 wd:Q107715 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'joule', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical quantity'}}

 Q: Which is the distance from Earth for Messier 81?
 SPARQL: select distinct ?answer where { wd:Q14024 wdt:P2583 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Messier 81', 'p': 'distance from Earth', 'o': '?x0'}

 Q: what is the end time for Titian has a work location as Augsburg ?
 SPARQL: SELECT ?value WHERE { wd:Q47551 p:P937 ?s . ?s ps:P937 wd:Q2749 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Titian', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'Augsburg'}}}

 Q: What is {place of birth} of {Hans Holbein} that is {located in the administrative territorial entity} is {Duchy of Bavaria} ?
 SPARQL: SELECT ?obj WHERE { wd:Q48319 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q47261 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Holbe', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Duchy of Bavaria'}}}

 Q: Give me {biblical character} that {present in work} {Isaiah} and which contains the word {leviathan} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12405827 . ?sbj wdt:P1441 wd:Q131458 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'leviathan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Isaiah'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'leviathan'}}

 Q: When Jimmy Cliff was awarded Grammy Award for Best Reggae Album?
 SPARQL: SELECT ?value WHERE { wd:Q109063 p:P166 ?s . ?s ps:P166 wd:Q1542180 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jimmy Cliff', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grammy Award for Best Reggae Album'}, 't': '?x0'}

 Q: Tell me the religious concept that facet of Hinduism and which that starts with the letter  y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious concept', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Hinduism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is {death count} of {outcome} of {thunderstorm} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2857578 wdt:P1542 ?X . ?X wdt:P1120 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'deaths', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'thunderstorm', 'p': 'outcome', 'o': '$y0'}}

 Q: Whose father of Prince Aly Khan ?
 SPARQL: select distinct ?answer where { wd:Q450229 wdt:P22 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Prince Aly Khan', 'p': 'father', 'o': '?x0'}

 Q: When did award received of Pat Summitt and together with
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q460394 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pat Summitt', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pat Summitt', 'p': 'award received', 'o': '$y0'}}]

 Q: What is {followed by} and {follows} of {{Jeremiah} has {series} as {Nevi'im}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q131590 p:P179 ?s . ?s ps:P179 wd:Q216383 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'successor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeremiah', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "Nevi'im"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'predecessor', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeremiah', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "Nevi'im"}}}]

 Q: Are there 36.0 prisoners in Azkaban?
 SPARQL: ASK WHERE { wd:Q715509 wdt:P5630 ?obj filter(?obj = 36.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Azkaban', 'p': 'prisoner count', 'o': '?x0', '?x0': '36.0'}

 Q: What is route map of Milan Metro?
 SPARQL: select distinct ?answer where { wd:Q735559 wdt:P15 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Milan Metro', 'p': 'route map', 'o': '?x0'}

 Q: What is the {national association football league} with the {MAX(frequency of event)} whose {season starts} is {July}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15991303 . ?ent wdt:P2257 ?obj . ?ent wdt:P4794 wd:Q121 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'frequency of event', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'association football league', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'season starts', 'o': 'July'}}}

 Q: Was the work of Victor Hugo influenced by Plato and Miguel de Cervantes?
 SPARQL: ASK WHERE { wd:Q535 wdt:P737 wd:Q859 . wd:Q535 wdt:P737 wd:Q5682 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Victor Hugo', 'p': 'influenced by', 'o': '?x0', '?x0': 'Plato'}, {'h': 'IS', 'v': '?x1', 's': 'Victor Hugo', 'p': 'influenced by', 'o': '?x1', '?x1': 'Miguel de Cervantes'}]

 Q: What is {diplomatic relation} of {Vietnam} that is {statement is subject of} is {Japan–Vietnam relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q881 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q1051802 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vietnam', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Japan–Vietnam relations'}}}

 Q: Does Alexei Kudashov have more than 0.0 total assists in his career?
 SPARQL: ASK WHERE { wd:Q688108 wdt:P6545 ?obj filter(?obj > 0.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Alexei Kudashov', 'p': 'total assists in career', 'o': '?x0', '?x0': '0.0'}

 Q: Which is the final sport of Australian rules football?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P641 wd:Q50776 . ?sbj wdt:P31 wd:Q1366722 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'Australian rules football', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'final'}}

 Q: Is the employment by economic sector of Amsterdam less than 152?
 SPARQL: ASK WHERE { wd:Q9899 wdt:P2297 ?obj filter(?obj < 152.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Amsterdam', 'p': 'employment by economic sector', 'o': '?x0', '?x0': '152.0'}

 Q: what is the {academic major} for {Norman Foster} has {educated at} as {Yale School of Architecture} ?
 SPARQL: SELECT ?value WHERE { wd:Q104898 p:P69 ?s . ?s ps:P69 wd:Q1514480 . ?s pq:P812 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Norman Foster', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Yale School of Architecture'}}}

 Q: What is the {political scandal} for {defendant} of {Hillary Clinton}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1591 wd:Q6294 . ?sbj wdt:P31 wd:Q934744 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'defendant', 'o': 'Hillary Clinton', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political scandal'}}

 Q: what is the {series ordinal} for {Hiram Johnson} has {position held} as {Governor of California} ?
 SPARQL: SELECT ?value WHERE { wd:Q143644 p:P39 ?s . ?s ps:P39 wd:Q887010 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hiram Johnson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Governor of California'}}}

 Q: Which is the short-track speed skater ISU ID for Bonnie Blair?
 SPARQL: select distinct ?answer where { wd:Q231513 wdt:P3693 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bonnie Blair', 'p': 'short-track speed skater ISU ID', 'o': '?x0'}

 Q: What is the {biopharmaceutical} with the {MAX(defined daily dose)} whose {has part} is {carbon}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q679692 . ?ent wdt:P4250 ?obj . ?ent wdt:P527 wd:Q623 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'defined daily dose', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biopharmaceutical', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has part', 'o': 'carbon'}}}

 Q: Who is the {dominion of the British Empire} for {history of topic} of {history of Australia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2184 wd:Q174825 . ?sbj wdt:P31 wd:Q223832 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'history of topic', 'o': 'history of Australia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dominion of the British Empire'}}

 Q: Tell me syllable whose name has the word sen in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8188 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'syllable'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'sen'}}

 Q: Did Jesse James have Frank James and Archie Samuel as siblings?
 SPARQL: ASK WHERE { wd:Q213626 wdt:P3373 wd:Q711243 . wd:Q213626 wdt:P3373 wd:Q4786782 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jesse James', 'p': 'sibling', 'o': '?x0', '?x0': 'Frank James'}, {'h': 'IS', 'v': '?x1', 's': 'Jesse James', 'p': 'sibling', 'o': '?x1', '?x1': 'Archie Samuel'}]

 Q: Is it true that the width of the Jochenstein is equal to 0.015?
 SPARQL: ASK WHERE { wd:Q23192 wdt:P2049 ?obj filter(?obj = 0.015) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Jochenstein', 'p': 'width', 'o': '?x0', '?x0': '0.015'}

 Q: What is <incidence> of <hepatitis C> ?
 SPARQL: select distinct ?answer where { wd:Q154869 wdt:P2844 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hepatitis C', 'p': 'incidence', 'o': '?x0'}

 Q: When did Reese Witherspoon receive the British Academy of Film and Television Arts award?
 SPARQL: SELECT ?value WHERE { wd:Q44063 p:P166 ?s . ?s ps:P166 wd:Q159661 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Reese Witherspoon', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'British Academy of Film and Television Arts'}, 't': '?x0'}

 Q: Who is the writer of Cloud Atlas that has a last name of Mitchell?
 SPARQL: SELECT ?answer WHERE { wd:Q40205 wdt:P50 ?answer . ?answer wdt:P734 wd:Q179205}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cloud Atlas', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'last name', 'o': 'Mitchell'}}

 Q: How many {category combines topics} are to/by {Georgia} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P971 wd:Q230 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'category combines topics', 'o': 'Georgia'}

 Q: Which is the Google Maps CID for Empire State Building?
 SPARQL: select distinct ?answer where { wd:Q9188 wdt:P3749 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire State Building', 'p': 'Google Maps CID', 'o': '?x0'}

 Q: What is {deathplace} of {Nelson Algren}, that has {point on a map} is {-75.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q547914 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-75.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nelson Algren', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'point on a map', 'o': '-75.0'}}

 Q: What is GNIS Antarctica ID for Antarctica ?
 SPARQL: select distinct ?answer where { wd:Q51 wdt:P804 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Antarctica', 'p': 'GNIS Antarctica ID', 'o': '?x0'}

 Q: What is the sister city of the birthplace of Nikita Telenkov?
 SPARQL: SELECT ?answer WHERE { wd:Q7035115 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nikita Telenkov', 'p': 'birthplace', 'o': '$y0'}}

 Q: What is the {human} for {student of} of {Bindusara}
 SPARQL:  select distinct ?obj where { wd:Q315526 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bindusara', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who is the son of Charles Lucien Bonaparte's wife?
 SPARQL: SELECT ?answer WHERE { wd:Q157521 wdt:P26 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Lucien Bonaparte', 'p': 'wife', 'o': '$y0'}}

 Q: Tell me peace treaty whose name has the word treaty in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q625298 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'treaty')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'peace treaty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'treaty'}}

 Q: What is <Gedbas genealogy person ID> of <Albert Einstein> ?
 SPARQL: select distinct ?answer where { wd:Q937 wdt:P4108 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albert Einstein', 'p': 'Gedbas genealogy person ID', 'o': '?x0'}

 Q: What is <office held by head of government> of <Quintana Roo> ?
 SPARQL: select distinct ?answer where { wd:Q80245 wdt:P1313 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Quintana Roo', 'p': 'office held by head of government', 'o': '?x0'}

 Q: What is <French Olympic Committee athlete ID> of <Nikola Karabatić> ?
 SPARQL: select distinct ?answer where { wd:Q157809 wdt:P4050 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nikola Karabatić', 'p': 'French Olympic Committee athlete ID', 'o': '?x0'}

 Q: What is the {television program} for {inspired by} of {Eurovision Song Contest}
 SPARQL:  select distinct ?obj where { wd:Q276 wdt:P941 ?obj . ?obj wdt:P31 wd:Q15416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eurovision', 'p': 'inspired by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television program'}}

 Q: /who is nominated for of Benedict XV that of point in time is 1915-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q4448 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1915')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Benedict XV', 'p': 'nominated for', 'o': '?x0', 't': '1915'}

 Q: What is the {human} with the {MAX(points for)} whose {instance of} is {human}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1358 ?obj . ?ent wdt:P31 wd:Q5 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'points for', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: Who is the husband of the choreographer of Slaughter on Tenth Avenue?
 SPARQL: SELECT ?answer WHERE { wd:Q7539051 wdt:P1809 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husband', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Slaughter on Tenth Avenue', 'p': 'choreographer', 'o': '$y0'}}

 Q: what is the {replaced by} for {Baibars} has {position held} as {Sultan of Egypt} ?
 SPARQL: SELECT ?value WHERE { wd:Q192960 p:P39 ?s . ?s ps:P39 wd:Q4115925 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Baibars', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Sultan of Egypt'}}}

 Q: What is {diplomatic relation} of {land} of {1948 Czechoslovak coup d'état} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1137957 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "1948 Czechoslovak coup d'état", 'p': 'land', 'o': '$y0'}}

 Q: Give me {office building} that {located on street} {34th Street} and which contains the word {building} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1021645 . ?sbj wdt:P669 wd:Q110049 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'building')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'office building', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located on street', 'o': '34th Street'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'building'}}

 Q: Which is the Lega Pallavolo Serie A player ID of Giba?
 SPARQL: select distinct ?answer where { wd:Q455738 wdt:P4303 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Giba', 'p': 'Lega Pallavolo Serie A player ID', 'o': '?x0'}

 Q: What was the determining method for Magellan and the Chilean Antarctic Region's population?
 SPARQL: SELECT ?value WHERE { wd:Q2189 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'166533')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Magellan and the Chilean Antarctic Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '166533'}}}

 Q: What is the material used in most of the Young's modulus?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5480 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': "Young's modulus", 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'material'}}

 Q: Alexander Pushkin is a member of which literary society?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P463 wd:Q7200 . ?sbj wdt:P31 wd:Q497893 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Alexander Pushkin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary society'}}

 Q: What is the Kemler code of ethanol?
 SPARQL: select distinct ?answer where { wd:Q153 wdt:P700 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethanol', 'p': 'Kemler code', 'o': '?x0'}

 Q: What is the {party chair} for {position held} of {Xi Jinping}
 SPARQL:  select distinct ?obj where { wd:Q15031 wdt:P39 ?obj . ?obj wdt:P31 wd:Q2746259 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Xi Jinping', 'p': 'position held', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'party chair'}}

 Q: What is <Revised Hepburn romanization> of <Waseda University> ?
 SPARQL: select distinct ?answer where { wd:Q274486 wdt:P2125 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Waseda University', 'p': 'Revised Hepburn romanization', 'o': '?x0'}

 Q: Who was the chairperson of Free Software Foundation in 1985-10-4?
 SPARQL: SELECT ?obj WHERE { wd:Q48413 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1985')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Free Software Foundation', 'p': 'chairperson', 'o': '?x0', 't': '1985'}

 Q: What ethnic group is Karl Weierstraß?
 SPARQL: select distinct ?answer where { wd:Q57103 wdt:P172 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Karl Weierstraß', 'p': 'ethnic group', 'o': '?x0'}

 Q: what is the {start time} for {Tuscany} has {contains administrative territorial entity} as {Metropolitan City of Florence} ?
 SPARQL: SELECT ?value WHERE { wd:Q1273 p:P150 ?s . ?s ps:P150 wd:Q18288148 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tuscany', 'p': 'contains administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'contains administrative territorial entity', 'o': 'Metropolitan City of Florence'}}}

 Q: Who is the actor in the series The Two Mrs. Sheffields?
 SPARQL: SELECT ?answer WHERE { wd:Q51228874 wdt:P179 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Two Mrs. Sheffields', 'p': 'series', 'o': '$y0'}}

 Q: Which territory was claimed by Taiwan?
 SPARQL: select distinct ?answer where { wd:Q865 wdt:P1336 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Taiwan', 'p': 'claimed by', 'o': '?x0'}

 Q: Which is the medical specialty of the murder method of Paul Kruger?
 SPARQL: SELECT ?answer WHERE { wd:Q244407 wdt:P509 ?X . ?X wdt:P1995 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'medical specialty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Kruger', 'p': 'murder method', 'o': '$y0'}}

 Q: Which is Drouot artist ID for René Magritte?
 SPARQL: select distinct ?answer where { wd:Q7836 wdt:P5309 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'René Magritte', 'p': 'Drouot artist ID', 'o': '?x0'}

 Q: When did Cincinnati start the twinned administrative body in the year 1989?
 SPARQL: SELECT ?obj WHERE { wd:Q43196 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cincinnati', 'p': 'twinned administrative body', 'o': '?x0', 't': '1989'}

 Q: Is the width of Bullenkuhle less than 0.018?
 SPARQL: ASK WHERE { wd:Q1004288 wdt:P2049 ?obj filter(?obj < 0.018) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Bullenkuhle', 'p': 'width', 'o': '?x0', '?x0': '0.018'}

 Q: what is the {start time} for {Iraq} has {member of} as {International Development Association} ?
 SPARQL: SELECT ?value WHERE { wd:Q796 p:P463 ?s . ?s ps:P463 wd:Q827525 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iraq', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'International Development Association'}}}

 Q: What is the {taxon} for {parent taxon} of {Piper nigrum}
 SPARQL:  select distinct ?obj where { wd:Q43084 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Piper nigrum', 'p': 'parent taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is the {nickname} for {officeholder} of {Salman of Saudi Arabia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q49614 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Salman of Saudi Arabia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nickname'}}

 Q: What is <BFI Films, TV and people ID> of <Jaws> ?
 SPARQL: select distinct ?answer where { wd:Q189505 wdt:P4438 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jaws', 'p': 'BFI Films, TV and people ID', 'o': '?x0'}

