 Q: What is {outflows} of {Lake Albert}, that has {tributary} is {Kidepo River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q125888 wdt:P201 ?answer . ?answer wdt:P974 wd:Q4788736}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lake Albert', 'p': 'outflows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Kidepo River'}}

 Q: What what is project objective of project or mission nuclear weapon and also which starts with letter m
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170584 . ?sbj wdt:P3712 wd:Q12802 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'project', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'objective', 'o': 'nuclear weapon'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Tell me about noble title of Pepin the Short and follows
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q81212 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pepin the Short', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pepin the Short', 'p': 'noble title', 'o': '$y0'}}]

 Q: what is the {end time} for {L. Ron Hubbard} has {spouse} as {Sara Northrup Hollister} ?
 SPARQL: SELECT ?value WHERE { wd:Q216896 p:P26 ?s . ?s ps:P26 wd:Q7421728 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'L. Ron Hubbard', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Sara Northrup Hollister'}}}

 Q: What is the population of Aleutian Islands in the year 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q119285 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aleutian Islands', 'p': 'population', 'o': '?x0', 't': '2000'}

 Q: what is the {conferred by} for {Andrey Kolmogorov} has {academic degree} as {Doctor of Sciences in Physics and Mathematics} ?
 SPARQL: SELECT ?value WHERE { wd:Q153224 p:P512 ?s . ?s ps:P512 wd:Q17281097 . ?s pq:P1027 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conferred by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andrey Kolmogorov', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'Doctor of Sciences in Physics and Mathematics'}}}

 Q: What is the {Vidhan Sabha} for {executive body} of {Manipur}
 SPARQL:  select distinct ?obj where { wd:Q1193 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Manipur', 'p': 'executive body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Vidhan Sabha'}}

 Q: What is Watt based on the way to measure the physical quantity?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q25236 wdt:P111 ?ans_1 . wd:Q25236 wdt:P144 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'W', 'p': 'quantity', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'W', 'p': 'based on', 'o': '?x1'}]

 Q: Which is {member of} {sovereign state} of {province of China} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1615742 wdt:P17 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'province of China', 'p': 'sovereign state', 'o': '$y0'}}

 Q: what is the {end time} for {Nnamdi Azikiwe} has {position held} as {President of Nigeria} ?
 SPARQL: SELECT ?value WHERE { wd:Q181782 p:P39 ?s . ?s ps:P39 wd:Q500282 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nnamdi Azikiwe', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Nigeria'}}}

 Q: What portable computer had MS-DOS as the operating system?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q1820120 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operating system', 'o': 'MS-DOS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'portable computer'}}

 Q: What is {followed by} and {follows} of {{Chrysler Building} has {series} as {history of the world's tallest buildings}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q11274 p:P179 ?s . ?s ps:P179 wd:Q3698493 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chrysler Building', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "history of the world's tallest buildings"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chrysler Building', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "history of the world's tallest buildings"}}}]

 Q: When did Eduardo Frei Ruiz-Tagle receive an award as Lagun Onari?
 SPARQL: SELECT ?value WHERE { wd:Q326 p:P166 ?s . ?s ps:P166 wd:Q3381638 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Eduardo Frei Ruiz-Tagle', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Lagun Onari'}, 't': '?x0'}

 Q: Which is the novella that contains the word švabica in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q149537 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'švabica')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'novella'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'švabica'}}

 Q: what is the {point in time} for {PewDiePie} has {award received} as {Shorty Awards} ?
 SPARQL: SELECT ?value WHERE { wd:Q13423853 p:P166 ?s . ?s ps:P166 wd:Q7502282 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'PewDiePie', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Shorty Awards'}, 't': '?x0'}

 Q: What is {mission} of {national of} of {Mary Higgins Clark} ?
 SPARQL: SELECT ?answer WHERE { wd:Q231736 wdt:P27 ?X . ?X wdt:P1451 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mission', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mary Higgins Clark', 'p': 'national of', 'o': '$y0'}}

 Q: what is the {valid in period} for {France} has {anthem} as {La Marseillaise} ?
 SPARQL: SELECT ?value WHERE { wd:Q142 p:P85 ?s . ?s ps:P85 wd:Q41180 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'France', 'p': 'anthem', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'anthem', 'o': 'La Marseillaise'}}}

 Q: How many {designed by} are to/by {Isambard Kingdom Brunel} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P287 wd:Q207380 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Isambard Kingdom Brunel'}

 Q: What is the {cultural region} for {history of topic} of {history of China}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2184 wd:Q82972 . ?sbj wdt:P31 wd:Q3502482 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'history of topic', 'o': 'history of China', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cultural region'}}

 Q: What is {participant in conflict} of {depiction of} of {Statue of the Viscount Slim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21451665 wdt:P180 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Statue of the Viscount Slim', 'p': 'depiction of', 'o': '$y0'}}

 Q: Is Houston the twinned administrative body of Luanda and Guayaquil?
 SPARQL: ASK WHERE { wd:Q16555 wdt:P190 wd:Q3897 . wd:Q16555 wdt:P190 wd:Q43509 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Houston', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Luanda'}, {'h': 'IS', 'v': '?x1', 's': 'Houston', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Guayaquil'}]

 Q: At what private university did the employer of Linus Pauling work in?
 SPARQL:  select distinct ?obj where { wd:Q48983 wdt:P108 ?obj . ?obj wdt:P31 wd:Q902104 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Linus Pauling', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private university'}}

 Q: What are the list of characters for the Doctor Who} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q34316 wdt:P1881 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Doctor Who', 'p': 'list of characters', 'o': '?x0'}

 Q: Which is the license plate code for Greece?
 SPARQL: select distinct ?answer where { wd:Q41 wdt:P395 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Greece', 'p': 'license plate code', 'o': '?x0'}

 Q: Who is {disciple} and {supervisor} of {David Ward-Steinman} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5240827 wdt:P1066 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disciple', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Ward-Steinman', 'p': 'supervisor', 'o': '$y0'}}

 Q: Is the focal length of the large binocular telescope 14.808?
 SPARQL: ASK WHERE { wd:Q845304 wdt:P2151 ?obj filter(?obj = 14.808) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Large Binocular Telescope', 'p': 'focal length', 'o': '?x0', '?x0': '14.808'}

 Q: Who is the alumna of wives of Rebecca West?
 SPARQL: SELECT ?answer WHERE { wd:Q236669 wdt:P26 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'alumna of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rebecca West', 'p': 'wives', 'o': '$y0'}}

 Q: What is {notable books} of {created by} of {Portrait of Louise Vernet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29855620 wdt:P170 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'notable books', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Portrait of Louise Vernet', 'p': 'created by', 'o': '$y0'}}

 Q: What is the {disease} for {studied by} of {psychotherapy}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2579 wd:Q183257 . ?sbj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'psychotherapy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: Which isotope of lead has the least mass excess which decays to thallium-185?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1372384 . ?ent wdt:P2160 ?obj . ?ent wdt:P816 wd:Q18883276} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'mass excess', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of lead', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'decays to', 'o': 'thallium-185'}}}

 Q: How many authors are written the {Carl Chun} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P50 wd:Q62747 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Carl Chun'}

 Q: What is the speed limit in the Netherlands?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q55 wdt:P3086 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Netherlands', 'p': 'speed limit', 'o': '?x0'}

 Q: What is {made by} of {from narrative} of {Equatorial Kundu} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23826237 wdt:P1441 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'made by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kundu', 'p': 'from narrative', 'o': '$y0'}}

 Q: What is {profession} of {Erich Salomon}, that has {field of this profession} is {photography} ?
 SPARQL: SELECT ?answer WHERE { wd:Q65454 wdt:P106 ?answer . ?answer wdt:P425 wd:Q11633}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Erich Salomon', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'field of this profession', 'o': 'photography'}}

 Q: what is the {burial plot reference} for {Claude Bernard} has {place of burial} as {Père Lachaise Cemetery} ?
 SPARQL: SELECT ?value WHERE { wd:Q208230 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'burial plot reference', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Claude Bernard', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of burial', 'o': 'Pere Lachaise'}}}

 Q: What is {followed by} and {follows} of {{The Lion King} has {series} as {list of Walt Disney Animation Studios films}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36479 p:P179 ?s . ?s ps:P179 wd:Q6603742 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Lion King', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'list of Walt Disney Animation Studios films'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Lion King', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'list of Walt Disney Animation Studios films'}}}]

 Q: How many wears for Michael Jordan?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q41421 wdt:P3828 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Michael Jordan', 'p': 'wears', 'o': '?x0'}

 Q: What are the scores measured by the intelligence quotient (I.Q.)?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q170277 wdt:P1880 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'intelligence quotient', 'p': 'measured by', 'o': '?x0'}

 Q: What {item is used} in {sports} of {breaststroke} ?
 SPARQL: SELECT ?answer WHERE { wd:Q326163 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'breaststroke', 'p': 'sport', 'o': '$y0'}}

 Q: Who is the child of Mahmoud Abbas?
 SPARQL: select distinct ?answer where { wd:Q127998 wdt:P40 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mahmoud Abbas', 'p': 'child', 'o': '?x0'}

 Q: Is the target interest rate of the Bank of Israel equal to 0.08?
 SPARQL: ASK WHERE { wd:Q244411 wdt:P2661 ?obj filter(?obj = 0.08) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Bank of Israel', 'p': 'target interest rate', 'o': '?x0', '?x0': '0.08'}

 Q: what is the {for work} for {Toni Morrison} has {award received} as {NAACP Image Award for Outstanding Literary Work, Fiction} ?
 SPARQL: SELECT ?value WHERE { wd:Q72334 p:P166 ?s . ?s ps:P166 wd:Q6952062 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Toni Morrison', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'NAACP Image Award for Outstanding Literary Work, Fiction'}}}

 Q: Which is the test method for intelligence quotient?
 SPARQL: select distinct ?answer where { wd:Q170277 wdt:P4988 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'intelligence quotient', 'p': 'test method', 'o': '?x0'}

 Q: Which is MyDramaList title ID of Seven Samurai?
 SPARQL: select distinct ?answer where { wd:Q189540 wdt:P3868 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Seven Samurai', 'p': 'MyDramaList title ID', 'o': '?x0'}

 Q: Give me {moon of Saturn} that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1972 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'moon of Saturn'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which is the handedness of Bruce Willis?
 SPARQL: select distinct ?answer where { wd:Q2680 wdt:P552 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bruce Willis', 'p': 'handedness', 'o': '?x0'}

 Q: Which is the fictional universe of the fictional universe described in Star Trek?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1445 wd:Q1092 . ?sbj wdt:P31 wd:Q559618 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fictional universe described in', 'o': 'Star Trek', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional universe'}}

 Q: Does the student count of the Heilbronn School of Business equal 128?
 SPARQL: ASK WHERE { wd:Q1513916 wdt:P2196 ?obj filter(?obj = 128) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Heilbronn Business School', 'p': 'student count', 'o': '?x0', '?x0': '128'}

 Q: Who is the chairperson of Coptic Orthodox Church of Alexandria?
 SPARQL:  select distinct ?obj where { wd:Q198998 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Coptic Orthodox Church of Alexandria', 'p': 'chairperson', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What {on the shore of} the {Mid-Atlantic Ridge}, is a {tributary} of the {Albemarle Sound}
 SPARQL: SELECT ?answer WHERE { wd:Q207313 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1441345}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mid-Atlantic Ridge', 'p': 'on the shore of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Albemarle Sound'}}

 Q: What is the {specialty} for {field of work} of {Sigmund Freud}
 SPARQL:  select distinct ?obj where { wd:Q9215 wdt:P101 ?obj . ?obj wdt:P31 wd:Q1047113 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sigmund Freud', 'p': 'field of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'specialty'}}

 Q: Which is the Indonesian Small Islands Directory ID for Krakatau?
 SPARQL: select distinct ?answer where { wd:Q82613 wdt:P4227 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Krakatau', 'p': 'Indonesian Small Islands Directory ID', 'o': '?x0'}

 Q: where is the located in the administrative territorial entity and who is the category of associated people of Hollywood?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q34006 wdt:P131 ?ans_1 . wd:Q34006 wdt:P1792 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hollywood', 'p': 'located in the administrative territorial entity', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hollywood', 'p': 'category of associated people', 'o': '?x1'}]

 Q: When did Pavel Nakhimov receive the Order of St. George, 2nd class award?
 SPARQL: SELECT ?value WHERE { wd:Q345365 p:P166 ?s . ?s ps:P166 wd:Q14905807 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Pavel Nakhimov', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of St. George, 2nd class'}, 't': '?x0'}

 Q: What is the {imprint} for {record label} of {Suge Knight}
 SPARQL:  select distinct ?obj where { wd:Q455880 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Suge Knight', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'imprint'}}

 Q: What is {won by} of {prize received} of {John le Carré} ?
 SPARQL: SELECT ?answer WHERE { wd:Q209641 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'won by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John le Carré', 'p': 'prize received', 'o': '$y0'}}

 Q: Give me {God} that {worshipped by} {Jehovah's Witnesses} and which contains the word {yahweh} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190 . ?sbj wdt:P1049 wd:Q35269 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yahweh')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'God', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': "Jehovah's Witnesses"}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yahweh'}}

 Q: Is the highest break of the Joe Swail equal to 142?
 SPARQL: ASK WHERE { wd:Q722094 wdt:P6590 ?obj filter(?obj = 142) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Joe Swail', 'p': 'highest break', 'o': '?x0', '?x0': '142'}

 Q: How many {charge} are for {Nuremberg trials} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q80130 wdt:P1595 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Nuremberg trials', 'p': 'charge', 'o': '?x0'}

 Q: What is the {brand} for {headquarters location} of {Barcelona}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q1492 . ?sbj wdt:P31 wd:Q431289 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Barcelona', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'brand'}}

 Q: At what point in time did Dnipro have a population of 1189000?
 SPARQL: SELECT ?value WHERE { wd:Q48256 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.189e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dnipro', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.189e+06'}, 't': '?x0'}

 Q: Name a landmark located in the administrative territorial entity of Old Toronto that starts with letter C
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2319498 . ?sbj wdt:P131 wd:Q919169 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landmark', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Old Toronto'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Did {German} {country} {Seychelles} and {Republic of the Congo} ?
 SPARQL: ASK WHERE { wd:Q188 wdt:P17 wd:Q1042 . wd:Q188 wdt:P17 wd:Q971 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'German', 'p': 'country', 'o': '?x0', '?x0': 'Seychelles'}, {'h': 'IS', 'v': '?x1', 's': 'German', 'p': 'country', 'o': '?x1', '?x1': 'Republic of Congo'}]

 Q: Who had a son named Timur, and whose interment was in Shahrisabz?
 SPARQL: SELECT ?answer WHERE { wd:Q8462 wdt:P40 ?answer . ?answer wdt:P119 wd:Q569766}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Timur', 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'interment', 'o': 'Shahrisabz'}}

 Q: Who is the {Wikimedia category} for {category for films shot at this location} of {Shanghai}
 SPARQL:  select distinct ?obj where { wd:Q8686 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shanghai', 'p': 'category for films shot at this location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: what is the {end time} for {John Hume} has {position held} as {Member of the Parliament of Northern Ireland} ?
 SPARQL: SELECT ?value WHERE { wd:Q193630 p:P39 ?s . ?s ps:P39 wd:Q19462434 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hume', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Parliament of Northern Ireland'}}}

 Q: What is the {human} for {composer} of {The Magic Flute}
 SPARQL:  select distinct ?obj where { wd:Q5064 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Magic Flute', 'p': 'composer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is the Polish scientist ID for Lech Kaczyński?
 SPARQL: select distinct ?answer where { wd:Q2757 wdt:P3124 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lech Kaczyński', 'p': 'Polish scientist ID', 'o': '?x0'}

 Q: "What is {main topic} of {history of Afghanistan}, which has {governor} is {Mohammed Nadir Shah} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q188872 wdt:P1269 ?answer . ?answer wdt:P35 wd:Q355610}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Afghanistan', 'p': 'main topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'governor', 'o': 'Mohammed Nadir Shah'}}

 Q: What is {aspect of} of {history of Latin America}, that has {science, that studies} is {Latin American studies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2365406 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q28617}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Latin America', 'p': 'aspect of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'science, that studies', 'o': 'Latin American studies'}}

 Q: What is {spouse} of {Barbara Walters} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q231417 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbara Walters', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbara Walters', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is the {stainless steel} with the {MAX(toughness)} whose {use} is {chemical industry}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q172587 . ?ent wdt:P5520 ?obj . ?ent wdt:P366 wd:Q207652 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'toughness', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stainless steel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'use', 'o': 'chemical industry'}}}

 Q: which is the name in native language of Antonio Inoki that of  name in kana is {アントニオ いのき ?
 SPARQL: SELECT ?obj WHERE { wd:Q45207 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P1814 ?x filter(contains(?x,'アントニオ いのき')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antonio Inoki', 'p': 'name in native language', 'o': '?x0'}

 Q: Is Triton's orbital eccentricity 0.000016?
 SPARQL: ASK WHERE { wd:Q3359 wdt:P1096 ?obj filter(?obj = 0.000016) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Triton', 'p': 'orbital eccentricity', 'o': '?x0', '?x0': '0.000016'}

 Q: What female is not the same as Kevin Durant who is male?
 SPARQL: SELECT ?answer WHERE { wd:Q29545 wdt:P1889 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kevin Durant', 'p': 'is not', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'male'}}

 Q: Which strain has the highest viable temperature?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3253 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'optimum viable temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'strain'}}

 Q: Which place of detention for  Elie Wiesel ?
 SPARQL: select distinct ?answer where { wd:Q18391 wdt:P2632 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Elie Wiesel', 'p': 'place of detention', 'o': '?x0'}

 Q: Where was Alexander buried in Freising Cathedral?
 SPARQL: SELECT ?value WHERE { wd:Q80028 p:P119 ?s . ?s ps:P119 wd:Q262769 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alexander', 'p': 'buried in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'buried in', 'o': 'Freising Cathedral'}, 't': '?x0'}

 Q: Joko Widodo is the head of government of which sovereign state ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q3318231 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Joko Widodo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: "What is {eponym} of {Gödel, Escher, Bach}, which has {working place} is {Institute for Advanced Study} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q831517 wdt:P138 ?answer . ?answer wdt:P108 wd:Q635642}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gödel, Escher, Bach', 'p': 'eponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'working place', 'o': 'Institute for Advanced Study'}}

 Q: what is the {sourcing circumstances} for {Zeno of Elea} has {date of birth} as {-490-0-0} ?
 SPARQL: SELECT ?value WHERE { wd:Q132157 p:P569 ?s . ?s ps:P569 ?x filter(contains(?x,'-490-0-0')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zeno of Elea', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'date of birth', 'o': '-490-0-0'}}}

 Q: Who is the role model of the author of The Iron Duke?
 SPARQL: SELECT ?answer WHERE { wd:Q7742590 wdt:P50 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role model', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Iron Duke', 'p': 'author', 'o': '$y0'}}

 Q: What is {themed after} of {successor} of {Manual for Civilization} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18615410 wdt:P156 ?X . ?X wdt:P144 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'theme', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Manual for Civilization', 'p': 'successor', 'o': '$y0'}}

 Q: What is <copyright owner> of <Triumph of the Will> ?
 SPARQL: select distinct ?answer where { wd:Q156497 wdt:P3931 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Triumph of the Will', 'p': 'copyright owner', 'o': '?x0'}

 Q: What is the {talk show} for {creator} of {Ellen DeGeneres}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q483325 . ?sbj wdt:P31 wd:Q622812 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'creator', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'talk show'}}

 Q: Who is starring in the film series The Heather Biblow Story?
 SPARQL: SELECT ?answer WHERE { wd:Q51228928 wdt:P179 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starring', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Heather Biblow Story', 'p': 'series', 'o': '$y0'}}

 Q: what is the {end time} for {John Russell, 1st Earl Russell} has {position held} as {Lord President of the Council} ?
 SPARQL: SELECT ?value WHERE { wd:Q157259 p:P39 ?s . ?s ps:P39 wd:Q943379 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Russell, 1st Earl Russell', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Lord President of the Council'}}}

 Q: What is {head of government} of {Nizhny Novgorod} that is {start time} is {2015-10-7} ?
 SPARQL: SELECT ?obj WHERE { wd:Q891 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nizhny Novgorod', 'p': 'head of government', 'o': '?x0', 't': '2015'}

 Q: Who gave the{this taxon is the source of} of {higher taxon} of {Brassica rapa subvar. esculenta} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1494125 wdt:P171 ?X . ?X wdt:P1672 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'this taxon is the source of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brassica rapa subvar. esculenta', 'p': 'higher taxon', 'o': '$y0'}}

