 Q: What is the {feature film} for {director} of {Jim Henson}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P57 wd:Q191037 . ?sbj wdt:P31 wd:Q24869 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Jim Henson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'feature film'}}

 Q: What is {partner} of {characters} of {Disney's Magical Quest 3 Starring Mickey & Donald} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3030325 wdt:P674 ?X . ?X wdt:P451 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'partner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Disney's Magical Quest 3 Starring Mickey & Donald", 'p': 'characters', 'o': '$y0'}}

 Q: What is {has moon} of {topic of} of {heliosphere} ?
 SPARQL: SELECT ?answer WHERE { wd:Q131687 wdt:P1269 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has moon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'heliosphere', 'p': 'topic of', 'o': '$y0'}}

 Q: What is the sister city of Antwerp, that has cities in Minhang District?
 SPARQL: SELECT ?answer WHERE { wd:Q12892 wdt:P190 ?answer . ?answer wdt:P150 wd:Q661695}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antwerp', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'Minhang District'}}

 Q: where is mouth of the watercourse of Neva that is of is Gulf of Finland ?
 SPARQL: SELECT ?obj WHERE { wd:Q645 p:P403 ?s . ?s ps:P403 ?obj . ?s pq:P642 wd:Q14686 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mouth of the watercourse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neva', 'p': 'mouth of the watercourse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'Gulf of Finland'}}}

 Q: what is the {number of matches played} for {Eric Cantona} has {member of sports team} as {FC Martigues} ?
 SPARQL: SELECT ?value WHERE { wd:Q170328 p:P54 ?s . ?s ps:P54 wd:Q1132418 . ?s pq:P1350 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eric Cantona', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'FC Martigues'}}}

 Q: What is {played by} of {sequel is} of {Healing Hands} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1633950 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Healing Hands', 'p': 'sequel is', 'o': '$y0'}}

 Q: What is {has administrative divisions} of {originates} of {As the World Turns} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1261578 wdt:P495 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has administrative divisions', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'As the World Turns', 'p': 'originates from', 'o': '$y0'}}

 Q: Which is the end period for the old age?
 SPARQL: select distinct ?answer where { wd:Q191089 wdt:P3416 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'old age', 'p': 'end period', 'o': '?x0'}

 Q: Is the number of spoilt votes of the Passo Fundo mayoral election, 2016 3968?
 SPARQL: ASK WHERE { wd:Q61868913 wdt:P5044 ?obj filter(?obj = 3968) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Passo Fundo mayoral election, 2016', 'p': 'number of spoilt votes', 'o': '?x0', '?x0': '3968'}

 Q: Give me {folk religion} that {foundational text} {Nihon Shoki} and which contains the word {shinto} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1068640 . ?sbj wdt:P457 wd:Q813935 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shinto')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'folk religion', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'foundational text', 'o': 'Nihon Shoki'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'shinto'}}

 Q: What are the ancient city which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15661340 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is {has moon} of {star} of {Tarantula Nebula} ?
 SPARQL: SELECT ?answer WHERE { wd:Q224145 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has moon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tarantula Nebula', 'p': 'star', 'o': '$y0'}}

 Q: What is <LIBRIS editions> of <New Scientist> ?
 SPARQL: select distinct ?answer where { wd:Q525592 wdt:P1182 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'New Scientist', 'p': 'LIBRIS editions', 'o': '?x0'}

 Q: What is {sister or brother} of {Caligula}, that has {public office} is {quaestor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1409 wdt:P3373 ?answer . ?answer wdt:P39 wd:Q189430}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Caligula', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'public office', 'o': 'quaestor'}}

 Q: What is <ECHA InfoCard ID> of <starch> ?
 SPARQL: select distinct ?answer where { wd:Q41534 wdt:P2566 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'starch', 'p': 'ECHA InfoCard ID', 'o': '?x0'}

 Q: what is the {end time} for {Pyotr Ilyich Tchaikovsky} has {educated at} as {Saint Petersburg Conservatory} ?
 SPARQL: SELECT ?value WHERE { wd:Q7315 p:P69 ?s . ?s ps:P69 wd:Q178416 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pyotr Ilyich Tchaikovsky', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Saint Petersburg Conservatory'}}}

 Q: what is the {end time} for {Kyrgyzstan} has {head of state} as {Kurmanbek Bakiyev} ?
 SPARQL: SELECT ?value WHERE { wd:Q813 p:P35 ?s . ?s ps:P35 wd:Q484816 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kyrgyzstan', 'p': 'head of state', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of state', 'o': 'Kurmanbek Bakiyev'}}}

 Q: Which is the direct-controlled municipality which contains the word tianjin in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1208802 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tianjin')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'direct-controlled municipality'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tianjin'}}

 Q: What is {works at} of {writer} of {Metal-induced pre-organisation for anion recognition in a neutral platinum-containing receptor.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q43262021 wdt:P50 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'works at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Metal-induced pre-organisation for anion recognition in a neutral platinum-containing receptor.', 'p': 'writer', 'o': '$y0'}}

 Q: Which language is the stable version of Android?
 SPARQL: SELECT ?answer WHERE { wd:Q94 wdt:P277 ?X . ?X wdt:P348 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'version', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Android', 'p': 'language', 'o': '$y0'}}

 Q: Which is the ISO 639-5 code of Aramaic?
 SPARQL: select distinct ?answer where { wd:Q28602 wdt:P1798 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aramaic', 'p': 'ISO 639-5 code', 'o': '?x0'}

 Q: What is the {republic} with the {MAX(Human Development Index)} whose {member of} is {International Centre for Settlement of Investment Disputes}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7270 . ?ent wdt:P1081 ?obj . ?ent wdt:P463 wd:Q899770 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Human Development Index', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Centre for Settlement of Investment Disputes'}}}

 Q: What award did David Foster win in 2003?
 SPARQL: SELECT ?obj WHERE { wd:Q77112 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'David Foster', 'p': 'award', 'o': '?x0', 't': '2003'}

 Q: Mention the film based on the description of Batman
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P144 wd:Q2695156 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'Batman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: Which is the {country of citizenship} and the {occupation} of {Deadpool} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1631090 wdt:P27 ?ans_1 . wd:Q1631090 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Deadpool', 'p': 'country of citizenship', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Deadpool', 'p': 'occupation', 'o': '?x1'}]

 Q: What is {inflation rate of consumer price index} of {findspot} of {magnesium} ?
 SPARQL: SELECT ?answer WHERE { wd:Q660 wdt:P189 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'magnesium', 'p': 'findspot', 'o': '$y0'}}

 Q: What team did Yao Ming play for in 2002?
 SPARQL: SELECT ?obj WHERE { wd:Q58590 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yao Ming', 'p': 'team', 'o': '?x0', 't': '2002'}

 Q: What arch bridge is named after Paul von Hindenburg?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q2667 . ?sbj wdt:P31 wd:Q158438 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Paul von Hindenburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'arch bridge'}}

 Q: what is the {for work} for {Helen Hunt} has {nominated for} as {Academy Award for Best Supporting Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q170574 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Helen Hunt', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actress'}}}

 Q: Nale a low-cost airline that operates Boeing 737-800 and that contains the word "Ryanair" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190915 . ?sbj wdt:P121 wd:Q12476717 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ryanair')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'low-cost airline', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operates', 'o': 'Boeing 737-800'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ryanair'}}

 Q: Which is the main subject for history of religions?
 SPARQL: select distinct ?answer where { ?answer wdt:P921 wd:Q846742}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'main subject', 'o': 'history of religions'}

 Q: Which award did Leon Festinger receive in 1959?
 SPARQL: SELECT ?obj WHERE { wd:Q315916 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1959')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leon Festinger', 'p': 'award', 'o': '?x0', 't': '1959'}

 Q: who is daddy of movie director for Valentine's Day ?
 SPARQL: SELECT ?answer WHERE { wd:Q27671399 wdt:P57 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dad', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Valentine's Day", 'p': 'director', 'o': '$y0'}}

 Q: what is the {sourcing circumstances} for {Lady Godiva} has {date of death} as {1067-9-10} ?
 SPARQL: SELECT ?value WHERE { wd:Q106077 p:P570 ?s . ?s ps:P570 ?x filter(contains(YEAR(?x),'1067')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lady Godiva', 'p': 'death', 'o': '$y0'}}

 Q: How many teams are participating for {Chicago Bulls} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1923 wd:Q128109 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'teams', 'o': 'Chicago Bulls'}

 Q: what is the {end time} for {Abu Bakr} has {position held} as {Rashidun Caliphate} ?
 SPARQL: SELECT ?value WHERE { wd:Q334923 p:P39 ?s . ?s ps:P39 wd:Q12490507 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abu Bakr', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Rashidun Caliphate'}}}

 Q: Which is the VIAF ID for Tom Holland?
 SPARQL: select distinct ?answer where { wd:Q2023710 wdt:P214 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tom Holland', 'p': 'VIAF ID', 'o': '?x0'}

 Q: what is the star has the highest proper motion?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q523 . ?ent wdt:P2215 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'proper motion', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'star'}}

 Q: What is {time of foundation or creation} of {awards received} of {Penélope Cruz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q39666 wdt:P166 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'foundation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Penélope Cruz', 'p': 'awards', 'o': '$y0'}}

 Q: Which is the currency that has a location of final assembly the Royal Mint and contains the word pound in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj wdt:P1071 wd:Q951830 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pound')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'currency', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of final assembly', 'o': 'Royal Mint'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pound'}}

 Q: what is the {position played on team / speciality} for {Jim Brown} has {member of sports team} as {Syracuse Orange football} ?
 SPARQL: SELECT ?value WHERE { wd:Q927916 p:P54 ?s . ?s ps:P54 wd:Q7663046 . ?s pq:P413 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position played on team / speciality', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jim Brown', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Syracuse Orange football'}}}

 Q: Who was Howard Hughes spouse in December 1957?
 SPARQL: SELECT ?obj WHERE { wd:Q189081 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Howard Hughes', 'p': 'spouse', 'o': '?x0', 't': '1957'}

 Q: What award did Anna Politkovskaya receive in 2003-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q131240 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anna Politkovskaya', 'p': 'award', 'o': '?x0', 't': '2003'}

 Q: What is {suffers from} of {Joseph Kibweteere}, that has {genetic association} is {DLC1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3185163 wdt:P1050 ?answer . ?answer wdt:P2293 wd:Q18035350}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Kibweteere', 'p': 'ailment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'DLC1'}}

 Q: How many official religions are there for the {Protestantism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3075 wd:Q23540 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'official religion', 'o': 'Protestantism'}

 Q: Who is the partner/spouse of Manuel Ferrara?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q715159 wdt:P451 ?ans_1 . wd:Q715159 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Manuel Ferrara', 'p': 'partner', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Manuel Ferrara', 'p': 'spouse', 'o': '?x1'}]

 Q: What award did Henry Dunant receive that granted him $75,391 in prize money?
 SPARQL: SELECT ?obj WHERE { wd:Q12091 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'75391.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Dunant', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '75391.0'}}}

 Q: Who gave the {has grammatical person} of {language} of {Franz Kline} ?
 SPARQL: SELECT ?answer WHERE { wd:Q374492 wdt:P1412 ?X . ?X wdt:P5110 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical person', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Kline', 'p': 'language', 'o': '$y0'}}

 Q: Who is the member of Neymar's sports team and what is their start time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q142794 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neymar', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neymar', 'p': 'team', 'o': '$y0'}}]

 Q: When did Kaunas have the area of 157?
 SPARQL: SELECT ?value WHERE { wd:Q4115712 p:P2046 ?s . ?s ps:P2046 ?x filter(contains(?x,'157.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kaunas', 'p': 'area', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'area', 'o': '157.0'}, 't': '?x0'}

 Q: What is {child body} of {Milky Way}, that has {light-travel distance} is {33600.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q321 wdt:P398 ?answer . ?answer wdt:P2583 ?x FILTER(contains(?x,'33600.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Milky Way', 'p': 'child body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'light-travel distance', 'o': '33600.0'}}

 Q: What is {plays} of {participated in} of {Ieva Januškevičiūtė} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15676906 wdt:P1344 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'play', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ieva Januškevičiūtė', 'p': 'participated in', 'o': '$y0'}}

 Q: what is the {series ordinal} for {Edmund Gwenn} has {given name} as {Edmund} ?
 SPARQL: SELECT ?value WHERE { wd:Q344750 p:P735 ?s . ?s ps:P735 wd:Q401836 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edmund Gwenn', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Edmund'}}}

 Q: What is the {strain} with the {MAX(maximum viable temperature)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3252 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum viable temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'strain'}}

 Q: Who gave the{mayor} of {mediatised to} of {Government of the 1st Dáil} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5589360 wdt:P1366 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mayor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Government of the 1st Dáil', 'p': 'mediatised to', 'o': '$y0'}}

 Q: DC-3 is operated by which airline?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P121 wd:Q190211 . ?sbj wdt:P31 wd:Q46970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operated', 'o': 'DC-3', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline'}}

 Q: What was the partner town of Toulon that was first recorded in 766-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q44160 wdt:P190 ?answer . ?answer wdt:P1249 ?x FILTER(contains(?x,'766-0-0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Toulon', 'p': 'partner town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first recorded in', 'o': '766-0-0'}}

 Q: In 1967, what city was the twinned administrative body of Skopje?
 SPARQL: SELECT ?obj WHERE { wd:Q384 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Skopje', 'p': 'twinned administrative body', 'o': '?x0', 't': '1967'}

 Q: What desalination plant material has the greatest yield strength?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5529 ?obj . ?ent wdt:P366 wd:Q51932686 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'yield strength', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'material', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'as', 'o': 'desalination plant'}}}

 Q: What is the outcome of  the antonym  of plasma recombination?
 SPARQL: SELECT ?answer WHERE { wd:Q4392902 wdt:P461 ?X . ?X wdt:P1542 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'outcome', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'plasma recombination', 'p': 'antonym', 'o': '$y0'}}

 Q: What is <conifers.org ID> of <Ginkgo biloba> ?
 SPARQL: select distinct ?answer where { wd:Q43284 wdt:P1940 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ginkgo biloba', 'p': 'conifers.org ID', 'o': '?x0'}

 Q: What is the TA98 Latin term of epidermis?
 SPARQL: select distinct ?answer where { wd:Q212743 wdt:P3982 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'epidermi', 'p': 'TA98 Latin term', 'o': '?x0'}

 Q: What is the {protein} for {encodes} of {INS}
 SPARQL:  select distinct ?obj where { wd:Q21163221 wdt:P688 ?obj . ?obj wdt:P31 wd:Q8054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'INS', 'p': 'encodes', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protein'}}

 Q: What is {not the same as} of {moorland}, that has {geographic coordinate} is {55.9439} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1092661 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'55.9439'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'moorland', 'p': 'not the same as', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'geographic coordinate', 'o': '55.9439'}}

 Q: What is the ISO 639-3 code for Tagalog?
 SPARQL: select distinct ?answer where { wd:Q34057 wdt:P220 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tagalog', 'p': 'ISO 639-3 code', 'o': '?x0'}

 Q: What is the architectural style of Gothic art?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P149 wd:Q46825 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'Gothic art'}

 Q: Tell me sports league whose name has the word shield in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q623109 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shield')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sports league'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'shield'}}

 Q: Is the upper flammable limit of the toulene less than 8.52?
 SPARQL: ASK WHERE { wd:Q15779 wdt:P2203 ?obj filter(?obj < 8.52) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'toluene', 'p': 'upper flammable limit', 'o': '?x0', '?x0': '8.52'}

 Q: How many {sexual orientation} are to/by {heterosexuality} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P91 wd:Q1035954 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sexual orientation', 'o': 'heterosexuality'}

 Q: What is the {studio album} for {tracklist} of {Stairway to Heaven}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P658 wd:Q192023 . ?sbj wdt:P31 wd:Q208569 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'tracklist', 'o': 'Stairway to Heaven', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'album'}}

 Q: What is the {book review} with the {MAX(number of pages)} whose {published in} is {The Archaeological Journal}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q637866 . ?ent wdt:P1104 ?obj . ?ent wdt:P1433 wd:Q7714165 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of pages', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book review', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'The Archaeological Journal'}}}

 Q: What is the dimension of works by Jean Racine?
 SPARQL: SELECT ?answer WHERE { wd:Q742 wdt:P800 ?X . ?X wdt:P2043 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dimension', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean Racine', 'p': 'work', 'o': '$y0'}}

 Q: Is the cruise speed of the Airbus A340 equal to 905?
 SPARQL: ASK WHERE { wd:Q6481 wdt:P2217 ?obj filter(?obj = 905) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Airbus A340', 'p': 'cruise speed', 'o': '?x0', '?x0': '905'}

 Q: When did character from Star Wars for killed by of Luke Skywalker?
 SPARQL:  select distinct ?obj where { wd:Q51746 wdt:P157 ?obj . ?obj wdt:P31 wd:Q33125444 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Luke Skywalker', 'p': 'killed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'character from Star Wars'}}

 Q: What is {member of} of {Richard Hofstadter}, that has {specialism} is {American studies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q982698 wdt:P463 ?answer . ?answer wdt:P101 wd:Q470125}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Richard Hofstadter', 'p': 'member of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'American studies'}}

 Q: What is The Merchant of Venice's genre and characters?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q206400 wdt:P136 ?ans_1 . wd:Q206400 wdt:P674 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Merchant of Venice', 'p': 'genre', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Merchant of Venice', 'p': 'characters', 'o': '?x1'}]

 Q: what is the {valid in period} for {Bologna} has {located in time zone} as {UTC+02:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q1891 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bologna', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+02:00'}}}

 Q: What is {place of death} of {Carl Theodor Dreyer} that is {country} is {Denmark} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51127 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q35 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Theodor Dreyer', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Denmark'}}}

 Q: What university is located in Karachi?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q8660 . ?sbj wdt:P31 wd:Q3918 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is located in', 'o': 'Karachi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university'}}

 Q: What is the {human} for {chief operating officer} of {Nintendo}
 SPARQL:  select distinct ?obj where { wd:Q8093 wdt:P1789 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nintendo', 'p': 'chief operating officer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {end time} for {Bradley Wiggins} has {member of sports team} as {Wiggins} ?
 SPARQL: SELECT ?value WHERE { wd:Q193876 p:P54 ?s . ?s ps:P54 wd:Q18786386 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bradley Wiggins', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Wiggins'}}}

 Q: What is Orthodox Encyclopedia ID for Elizabeth of Russia?
 SPARQL: select distinct ?answer where { wd:Q130752 wdt:P5002 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Elizabeth of Russia', 'p': 'Orthodox Encyclopedia ID', 'o': '?x0'}

 Q: What was the amount of female population of Sana'a in 2004-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q2471 p:P1539 ?s . ?s ps:P1539 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sana', 'p': 'female population', 'o': '?x0', 't': '2004'}

 Q: Which is the bite force quotient for sun bear?
 SPARQL: select distinct ?answer where { wd:Q144923 wdt:P3485 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'sun bear', 'p': 'bite force quotient', 'o': '?x0'}

 Q: What is the {Chinese dynasty} for {capital of} of {Nanjing}
 SPARQL:  select distinct ?obj where { wd:Q16666 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q12857432 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nanjing', 'p': 'capital of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Chinese dynasty'}}

 Q: What is {follows} and {followed by} of {{Amy Winehouse} has {award received} as {Grammy Award for Best New Artist}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q15897 p:P166 ?s . ?s ps:P166 wd:Q1453643 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amy Winehouse', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best New Artist'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amy Winehouse', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best New Artist'}}}]

 Q: What is the {student of} and the {student} of {Pablo_Picasso} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q5593 wdt:P1066 ?ans_1 . wd:Q5593 wdt:P802 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Pablo Picasso', 'p': 'student of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Pablo Picasso', 'p': 'student', 'o': '?x1'}]

 Q: What is {toponym} of {Mensa}, that has {continent} is {Africa} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9289 wdt:P138 ?answer . ?answer wdt:P30 wd:Q15}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mensa', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Africa'}}

 Q: Which is the distribution map for Yue Chinese?
 SPARQL: select distinct ?answer where { wd:Q7033959 wdt:P1846 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yue Chinese', 'p': 'distribution map', 'o': '?x0'}

 Q: What is {buried in} of {discoverer} of {lutetium} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1857 wdt:P61 ?X . ?X wdt:P119 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'buried in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'lutetium', 'p': 'discoverer', 'o': '$y0'}}

