 Q: what is the {replaced by} for {Maurice Maeterlinck} has {member of} as {Belgium Royal Academy of French language and literature} ?
 SPARQL: SELECT ?value WHERE { wd:Q49747 p:P463 ?s . ?s ps:P463 wd:Q2166029 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maurice Maeterlinck', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Belgium Royal Academy of French language and literature'}}}

 Q: What is the {influenced by} and the {genre} of {Joy_Division} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q172763 wdt:P737 ?ans_1 . wd:Q172763 wdt:P136 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Joy Division', 'p': 'influenced by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Joy Division', 'p': 'genre', 'o': '?x1'}]

 Q: What is the {data controller (GDPR)} for {operator} of {Facebook}
 SPARQL:  select distinct ?obj where { wd:Q355 wdt:P137 ?obj . ?obj wdt:P31 wd:Q59859818 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Facebook', 'p': 'operator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'data controller'}}

 Q: What are Mira Sorvino's gender and religion?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q212026 wdt:P21 ?ans_1 . wd:Q212026 wdt:P140 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Mira Sorvino', 'p': 'gender', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Mira Sorvino', 'p': 'religion', 'o': '?x1'}]

 Q: What is the namesake of Hall effect whose craft is university teacher?
 SPARQL: SELECT ?answer WHERE { wd:Q10656 wdt:P138 ?answer . ?answer wdt:P106 wd:Q1622272}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hall effect', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'craft', 'o': 'university teacher'}}

 Q: Which active ingredient is the duty of Vivelle?
 SPARQL: SELECT ?answer WHERE { wd:Q48826042 wdt:P3781 ?X . ?X wdt:P2868 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'duty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vivelle', 'p': 'active ingredient', 'o': '$y0'}}

 Q: What is <Dharma Drum Buddhist College place ID> of <Mount Song> ?
 SPARQL: select distinct ?answer where { wd:Q1140980 wdt:P1188 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mount Song', 'p': 'Dharma Drum Buddhist College place ID', 'o': '?x0'}

 Q: What is Movieplayer TV-series ID for Supernatural ?
 SPARQL: select distinct ?answer where { wd:Q130585 wdt:P4784 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Supernatural', 'p': 'Movieplayer TV-series ID', 'o': '?x0'}

 Q: what is the {start time} for {Palestine} has {instance of} as {historical region} ?
 SPARQL: SELECT ?value WHERE { wd:Q23792 p:P31 ?s . ?s ps:P31 wd:Q1620908 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Palestine', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'historical region'}}}

 Q: When did Uganda have an inflation rate of 146.7?
 SPARQL: SELECT ?value WHERE { wd:Q1036 p:P1279 ?s . ?s ps:P1279 ?x filter(contains(?x,'146.7')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Uganda', 'p': 'inflation rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'inflation rate', 'o': '146.7'}, 't': '?x0'}

 Q: What is the {creative work} for {has edition} of {HTML5}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q17537576 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'HTML5', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'creative work'}}

 Q: what is the {start time} for {David Susskind} has {spouse} as {Joyce Davidson} ?
 SPARQL: SELECT ?value WHERE { wd:Q4408937 p:P26 ?s . ?s ps:P26 wd:Q6297452 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Susskind', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Joyce Davidson'}}}

 Q: what is the {series ordinal} for {Camillo Benso di Cavour} has {given name} as {Paolo} ?
 SPARQL: SELECT ?value WHERE { wd:Q166092 p:P735 ?s . ?s ps:P735 wd:Q15731774 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Camillo Benso di Cavour', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Paolo'}}}

 Q: Which is the Collective Biographies of Women ID of Catherine of Aragon?
 SPARQL: select distinct ?answer where { wd:Q162819 wdt:P4539 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Catherine of Aragon', 'p': 'Collective Biographies of Women ID', 'o': '?x0'}

 Q: What is {award received} of {Midnight's Children} that is {follows} is {Rites of Passage} ?
 SPARQL: SELECT ?obj WHERE { wd:Q625764 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q3937279 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Midnight's Children", 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'Rites of Passage'}}}

 Q: who first language of executive power headed by of North Rhine-Westphalia?
 SPARQL: SELECT ?answer WHERE { wd:Q1198 wdt:P6 ?X . ?X wdt:P103 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North Rhine-Westphalia', 'p': 'executive power headed by', 'o': '$y0'}}

 Q: What was the allegiance of Wernher von Braun at the beginning of 1937?
 SPARQL: SELECT ?obj WHERE { wd:Q57384 p:P945 ?s . ?s ps:P945 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1937')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wernher von Braun', 'p': 'allegiance', 'o': '?x0', 't': '1937'}

 Q: what is the {start time} for {Technical University of Munich} has {member of} as {German Universities Excellence Initiative} ?
 SPARQL: SELECT ?value WHERE { wd:Q157808 p:P463 ?s . ?s ps:P463 wd:Q705657 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Technical University of Munich', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'German Universities Excellence Initiative'}}}

 Q: what is the {language of work or name} for {egg} has {pronunciation audio} as {Sv-ägg.ogg} ?
 SPARQL: SELECT ?value WHERE { wd:Q17147 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Sv-ägg.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'egg', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'sv-ägg.ogg'}}}

 Q: How many {cast member} are for {Bicycle Thieves} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q172837 wdt:P161 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Bicycle Thieves', 'p': 'cast member', 'o': '?x0'}

 Q: How many {type of orbit} are to/by {geosynchronous orbit} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P522 wd:Q472251 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'orbit', 'o': 'geosynchronous orbit'}

 Q: What is <At the Circulating Library ID> of <Charles Dickens> ?
 SPARQL: select distinct ?answer where { wd:Q5686 wdt:P1564 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Dickens', 'p': 'At the Circulating Library ID', 'o': '?x0'}

 Q: What is {human population} of {comes from} of {Foreigner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q275059 wdt:P495 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Foreigner', 'p': 'comes from', 'o': '$y0'}}

 Q: Which is the CRIStin ID for Finn E. Kydland?
 SPARQL: select distinct ?answer where { wd:Q211097 wdt:P2287 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Finn E. Kydland', 'p': 'CRIStin ID', 'o': '?x0'}

 Q: which dwarf planet has the highest rotation period?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2199 . ?ent wdt:P2147 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'rotation period', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dwarf planet'}}

 Q: What is {location born} of {Henri Poincaré}, that has {is in the shire of} is {Meurthe-et-Moselle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q81082 wdt:P19 ?answer . ?answer wdt:P131 wd:Q12626}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henri Poincare', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Meurthe-et-Moselle'}}

 Q: What are technical specification which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20819677 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'technical specification'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Is the quantity buried of the Forest Lawn Memorial Park equal to 119216?
 SPARQL: ASK WHERE { wd:Q1302545 wdt:P2324 ?obj filter(?obj = 119216) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Forest Lawn Memorial Park', 'p': 'quantity buried', 'o': '?x0', '?x0': '119216'}

 Q: Who is the referee for Earl Strom?
 SPARQL: select distinct ?answer where { ?answer wdt:P1652 wd:Q735731}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'referee', 'o': 'Earl Strom'}

 Q: What is the {river} for {located in or next to body of water} of {Shanghai}
 SPARQL:  select distinct ?obj where { wd:Q8686 wdt:P206 ?obj . ?obj wdt:P31 wd:Q4022 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shanghai', 'p': 'located in or next to body of water', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: Give me {soft drink} that {country of origin} {North America} and which that starts with {'b'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q147538 . ?sbj wdt:P495 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'soft drink', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'North America'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: How many {set in period} are to/by {World War II} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2408 wd:Q362 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'era', 'o': 'World War II'}

 Q: What is <safety classification and labelling> of <hydrochloric acid> ?
 SPARQL: select distinct ?answer where { wd:Q2409 wdt:P4952 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hydrochloric acid', 'p': 'safety classification and labelling', 'o': '?x0'}

 Q: Where is the Crux constellation?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P59 wd:Q10542 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Crux'}

 Q: Who is the {human} for {student} of {Francis Bacon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P802 wd:Q37388 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'student', 'o': 'Francis Bacon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {profession} of {first described} of {(225088) 2007 OR10} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6587 wdt:P61 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'job', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '(225088) 2007 OR10', 'p': 'first described', 'o': '$y0'}}

 Q: What is the {milestone} for {commemorates} of {Jefferson Davis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P547 wd:Q162269 . ?sbj wdt:P31 wd:Q10145 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commemorates', 'o': 'Jefferson Davis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'milestone'}}

 Q: What is the type of kinship Ana Boyer Preysler has as a relative of Enrique Iglesias?
 SPARQL: SELECT ?value WHERE { wd:Q47122 p:P1038 ?s . ?s ps:P1038 wd:Q27665550 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Enrique Iglesias', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Ana Boyer Preysler'}}}

 Q: Which is the Internet Wrestling Database ID for John Cena?
 SPARQL: select distinct ?answer where { wd:Q44437 wdt:P2829 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Cena', 'p': 'Internet Wrestling Database ID', 'o': '?x0'}

 Q: What award did Tom Holland receive in the year 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q2023710 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tom Holland', 'p': 'award', 'o': '?x0', 't': '2012'}

 Q: When is {end time} and {start time} of {{Leontien van Moorsel} has {member of sports team} as {Farm Frites - Hartol}}?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q234158 p:P54 ?s . ?s ps:P54 wd:Q2694122 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leontien van Moorsel', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Farm Frites - Hartol'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leontien van Moorsel', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Farm Frites - Hartol'}}}]

 Q: Is the net profit of the Eastern-Siberian Inland Navigation Company equal to 5,578,000?
 SPARQL: ASK WHERE { wd:Q639310 wdt:P2295 ?obj filter(?obj = 5578800.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'The Eastern-Siberian Inland Navigation Company', 'p': 'net profit', 'o': '?x0', '?x0': '5578800.0'}

 Q: What is {music by} of {Symphony No. 2}, that has {L1 speaker of} is {Swedish} ?
 SPARQL: SELECT ?answer WHERE { wd:Q210577 wdt:P86 ?answer . ?answer wdt:P103 wd:Q9027}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Symphony No. 2', 'p': 'music by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'L1 speaker of', 'o': 'Swedish'}}

 Q: What is {member of sports team} of {Javier Zanetti} that is {end time} is {1995-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q52876 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1995')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Javier Zanetti', 'p': 'member of sports team', 'o': '?x0', 't': '1995'}

 Q: What is {date of foundation or creation} of {citizen of} of {Alan Bond} ?
 SPARQL: SELECT ?answer WHERE { wd:Q550179 wdt:P27 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'created', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Bond', 'p': 'citizen of', 'o': '$y0'}}

 Q: What is the {siege} for {conflict} of {Cardinal Richelieu}
 SPARQL:  select distinct ?obj where { wd:Q26702 wdt:P607 ?obj . ?obj wdt:P31 wd:Q188055 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardinal Richelieu', 'p': 'battle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'siege'}}

 Q: What is {favorite player} of {writer} of {Think Like a Freak} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18786735 wdt:P50 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'favorite player', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Think Like a Freak', 'p': 'writer', 'o': '$y0'}}

 Q: Which is the flag carrier which contains the word qantas in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q721639 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'qantas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flag carrier'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'qantas'}}

 Q: what is the {start time} for {Plácido Domingo} has {spouse} as {Marta Domingo} ?
 SPARQL: SELECT ?value WHERE { wd:Q130853 p:P26 ?s . ?s ps:P26 wd:Q18206431 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Placido Domingo', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Marta Domingo'}}}

 Q: What is the genetic association with the {post-traumatic stress disorder} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q202387 wdt:P2293 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'post-traumatic stress disorder', 'p': 'genetic association', 'o': '?x0'}

 Q: What is {located in time zone} of {Rhodes} that is {valid in period} is {daylight saving time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43048 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rhodes', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'daylight saving time'}}}

 Q: What is the {business} for {parent organization} of {American Airlines}
 SPARQL:  select distinct ?obj where { wd:Q32396 wdt:P749 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Airlines', 'p': 'parent organization', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: what is the {follows} for {Princess Mononoke} has {award received} as {Animation Kobe Theatrical Film Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q186572 p:P166 ?s . ?s ps:P166 wd:Q19830564 . ?s pq:P155 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Princess Mononoke', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Animation Kobe Theatrical Film Award'}}}

 Q: What is {position held} of {Austen Chamberlain} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q188999 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Austen Chamberlain', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Austen Chamberlain', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {nominated for} of {Carole Lombard} that is {for work} is {My Man Godfrey} ?
 SPARQL: SELECT ?obj WHERE { wd:Q207739 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1811134 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carole Lombard', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'My Man Godfrey'}}}

 Q: What is the {high-speed railway line} with the {MAX(speed limit)} whose {owned by} is {Réseau Ferré de France}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q858485 . ?ent wdt:P3086 ?obj . ?ent wdt:P127 wd:Q1071978 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'speed limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'high-speed railway line', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'Reseau Ferre de France'}}}

 Q: What is {civilisation} of {place of activity} of {Clement XI} ?
 SPARQL: SELECT ?answer WHERE { wd:Q129967 wdt:P937 ?X . ?X wdt:P2596 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'civilisation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement XI', 'p': 'place of activity', 'o': '$y0'}}

 Q: Which is the place of birth for Chengguan District?
 SPARQL: select distinct ?answer where { ?answer wdt:P19 wd:Q1026100}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of birth', 'o': 'Chengguan District'}

 Q: What is Laura Kenny's Cycling Quotient female cyclist ID?
 SPARQL: select distinct ?answer where { wd:Q272598 wdt:P2709 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Laura Kenny', 'p': 'Cycling Quotient female cyclist ID', 'o': '?x0'}

 Q: What is <Queensland place ID> of <Brisbane> ?
 SPARQL: select distinct ?answer where { wd:Q34932 wdt:P3257 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brisbane', 'p': 'Queensland place ID', 'o': '?x0'}

 Q: What is {position held} of {Stephen of England} that is {start time} is {1141-11-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q60849 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1141')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Stephen of England', 'p': 'position held', 'o': '?x0', 't': '1141'}

 Q: What was Svante August Arrhenius nominated for in 1912?
 SPARQL: SELECT ?obj WHERE { wd:Q80956 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1912')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Svante August Arrhenius', 'p': 'nominated for', 'o': '?x0', 't': '1912'}

 Q: what is the {for work} for {J. K. Simmons} has {award received} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q150482 p:P166 ?s . ?s ps:P166 wd:Q106291 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'J. K. Simmons', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: what is the {point in time} for {Camilo José Cela} has {award received} as {Princess of Asturias Literary Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q132589 p:P166 ?s . ?s ps:P166 wd:Q3332454 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Camilo José Cela', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Princess of Asturias Literary Prize'}, 't': '?x0'}

 Q: What is the {conflict} for {time period} of {World War II}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2348 wd:Q362 . ?sbj wdt:P31 wd:Q180684 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'WWII', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conflict'}}

 Q: What is {assembly method} of {antonym of} of {daylight} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16491 wdt:P461 ?X . ?X wdt:P2079 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'assembly method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'daylight', 'p': 'antonym', 'o': '$y0'}}

 Q: What genre in film is Lisa Marie Presley in, that started in 1-1-1950?
 SPARQL: SELECT ?answer WHERE { wd:Q237324 wdt:P136 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1950'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lisa Marie Presley', 'p': 'genre', 'o': '?x0', 't': '1950'}

 Q: What is the {residence} and the {occupation} of {Martin_Garrix} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q14544318 wdt:P551 ?ans_1 . wd:Q14544318 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Martin Garrix', 'p': 'residence', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Martin Garrix', 'p': 'occupation', 'o': '?x1'}]

 Q: What is the {British crown dependency} for {currency} of {pound sterling}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q185086 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'pound sterling', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'British crown dependency'}}

 Q: Which is the route of administration of erythromycin?
 SPARQL: select distinct ?answer where { wd:Q213511 wdt:P636 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'erythromycin', 'p': 'route of administration', 'o': '?x0'}

 Q: was William III of England religion Protestantism cassock?
 SPARQL: ASK WHERE { wd:Q129987 wdt:P140 wd:Q23540 . wd:Q129987 wdt:P140 wd:Q324708 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'William III', 'p': 'religion', 'o': '?x0', '?x0': 'Protestantism'}, {'h': 'IS', 'v': '?x1', 's': 'William III', 'p': 'religion', 'o': '?x1', '?x1': 'cassock'}]

 Q: Who is the  {plantation} for {architect} of {Thomas Jefferson}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q11812 . ?sbj wdt:P31 wd:Q188913 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Thomas Jefferson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'plantation'}}

 Q: What is {elected in} and {electoral district} of {{Edmund Barton} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q23342 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value1 . ?s pq:P768 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edmund Barton', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'electoral district', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edmund Barton', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: What is the {Christian Church} for {office held by head of the organisation} of {pope}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2388 wd:Q19546 . ?sbj wdt:P31 wd:Q34651 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'pope', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian Church'}}

 Q: Give me {fertility deity} that {official residence} {Mount Olympus} and which that starts with {'h'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015914 . ?sbj wdt:P263 wd:Q80344 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fertility deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official residence', 'o': 'Mount Olympus'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What is SlideShare username of Kennedy Space Center ?
 SPARQL: select distinct ?answer where { wd:Q48821 wdt:P4016 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kennedy Space Center', 'p': 'SlideShare username', 'o': '?x0'}

 Q: Tell me the dialect of the writing system of written Cantonese that contains the word cantonese in it's name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj wdt:P282 wd:Q2472605 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cantonese')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'written Cantonese'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cantonese'}}

 Q: What is the {literary work} for {language of work or name} of {English}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: What research institute is a subsidiary of Brown University?
 SPARQL:  select distinct ?obj where { wd:Q49114 wdt:P355 ?obj . ?obj wdt:P31 wd:Q31855 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brown University', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'research institute'}}

 Q: What is the {primary color} for {color} of {ruby}
 SPARQL:  select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q166902 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ruby', 'p': 'color', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'primary color'}}

 Q: Is it true that Wikidata time precision of the million years equals to 3.6?
 SPARQL: ASK WHERE { wd:Q24004475 wdt:P2803 ?obj filter(?obj = 3.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'million years', 'p': 'Wikidata time precision', 'o': '?x0', '?x0': '3.6'}

 Q: What is {pronunciation audio} of {main topic} of {structure of the Earth} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1664027 wdt:P1269 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Earth's structure", 'p': 'main topic', 'o': '$y0'}}

 Q: What is {subtopic of} of {history of Louisiana}, that has {divided into} is {Iberia Parish} ?
 SPARQL: SELECT ?answer WHERE { wd:Q656802 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q504415}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Louisiana', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Iberia Parish'}}

 Q: What is {real gross domestic product growth rate} of {Belize} that is {point in time} is {2016-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q242 p:P2219 ?s . ?s ps:P2219 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Belize', 'p': 'real gross domestic product growth rate', 'o': '?x0', 't': '2016'}

 Q: Is the number of season of the Malibu Country less than 1.2?
 SPARQL: ASK WHERE { wd:Q210665 wdt:P2437 ?obj filter(?obj < 1.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Malibu Country', 'p': 'number of seasons', 'o': '?x0', '?x0': '1.2'}

 Q: What is the {abdication} for {significant person} of {Juan Carlos I}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3342 wd:Q19943 . ?sbj wdt:P31 wd:Q207549 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Juan Carlos I', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abdication'}}

 Q: What is the {dam} with the {MAX(installed capacity)} whose {instance of} is {hydroelectric power station}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12323 . ?ent wdt:P2109 ?obj . ?ent wdt:P31 wd:Q15911738 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'installed capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dam', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hydroelectric power station'}}}

 Q: Who is the person in the time period of Ancient Egypt?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2348 wd:Q11768 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'Ancient Egypt', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is the {fictional family} for {family} of {Donald Duck}
 SPARQL:  select distinct ?obj where { wd:Q6550 wdt:P53 ?obj . ?obj wdt:P31 wd:Q15331236 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Donald Duck', 'p': 'family', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional family'}}

