 Q: Who is {favorite player} of {The Rolling Stones}, that has {found guilty of} is {tax evasion}
 SPARQL: SELECT ?answer WHERE { wd:Q11036 wdt:P737 ?answer . ?answer wdt:P1399 wd:Q6502151}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Rolling Stones', 'p': 'favorite player', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'guilty of', 'o': 'tax evasion'}}

 Q: What is the density of water?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q283 wdt:P2054 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'water', 'p': 'density', 'o': '?x0'}

 Q: What is award received of Richard M. Karp that is point in time is 1985-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q92612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1985')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Richard M. Karp', 'p': 'award received', 'o': '?x0', 't': '1985'}

 Q: Does Bob Dylan have archives at the University of Georgia?
 SPARQL: ASK WHERE { wd:Q392 wdt:P485 wd:Q761534 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bob Dylan', 'p': 'archives at', 'o': '?x0', '?x0': 'University of Georgia'}]

 Q: Is the slope rating of the Crosswater Club equal to 145?
 SPARQL: ASK WHERE { wd:Q5188884 wdt:P3840 ?obj filter(?obj = 145) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Crosswater Club', 'p': 'slope rating', 'o': '?x0', '?x0': '145'}

 Q: What is {end cause} and {elected in} of {{Oswald Mosley} has {position held} as {Member of the 35th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q332400 p:P39 ?s . ?s ps:P39 wd:Q41582588 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oswald Mosley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 35th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oswald Mosley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 35th Parliament of the United Kingdom'}}}]

 Q: What is {location of burial} of {Deniz Gezmiş}, that has {wgs 84} is {39.992} ?
 SPARQL: SELECT ?answer WHERE { wd:Q982419 wdt:P119 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'39.992'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Deniz Gezmiş', 'p': 'burial location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wgs 84', 'o': '39.992'}}

 Q: What is INTEGRAL's start point?
 SPARQL: select distinct ?answer where { wd:Q50021 wdt:P1427 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'INTEGRAL', 'p': 'start point', 'o': '?x0'}

 Q: What is {facet of a polytope} of {shape} of {six-sided die} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17639282 wdt:P1419 ?X . ?X wdt:P1312 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'facet of a polytope', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'six-sided die', 'p': 'shape', 'o': '$y0'}}

 Q: which sport in a geographic region has maximum number of clubs in Australia?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4999 ?obj . ?ent wdt:P276 wd:Q408 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of clubs', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport in a geographic region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Australia'}}}

 Q: What is the trunk prefix of the shooting location Seven Samurai?
 SPARQL: SELECT ?answer WHERE { wd:Q189540 wdt:P915 ?X . ?X wdt:P3238 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'trunk prefix', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seven Samurai', 'p': 'shooting location', 'o': '$y0'}}

 Q: Which are the subsidiary entities of the maintainer of Forth Bridge?
 SPARQL: SELECT ?answer WHERE { wd:Q275 wdt:P126 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Forth Bridge', 'p': 'maintainer', 'o': '$y0'}}

 Q: What is the {business} for {parent organization} of {American Broadcasting Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q169889 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'American Broadcasting Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: what is the {point in time} for {Charlie Rose} has {award received} as {James Madison Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q715515 p:P166 ?s . ?s ps:P166 wd:Q16987872 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Charlie Rose', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'James Madison Award'}, 't': '?x0'}

 Q: What is {mayor} of {active in} of {Johann Gottlieb Fichte} ?
 SPARQL: SELECT ?answer WHERE { wd:Q102585 wdt:P937 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mayor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Johann Gottlieb Fichte', 'p': 'active in', 'o': '$y0'}}

 Q: What is the {group} for {located on terrain feature} of {City of London}
 SPARQL:  select distinct ?obj where { wd:Q23311 wdt:P706 ?obj . ?obj wdt:P31 wd:Q16887380 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'City of London', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group'}}

 Q: What is {birth location} of {Erik Erikson}, that has {head of national government} is {Kurt Blaum} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58074 wdt:P19 ?answer . ?answer wdt:P6 wd:Q1764115}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Erik Erikson', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head of national government', 'o': 'Kurt Blaum'}}

 Q: When was Pablo Neruda awarded the National Prize for Literature?
 SPARQL: SELECT ?value WHERE { wd:Q34189 p:P166 ?s . ?s ps:P166 wd:Q860699 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Pablo Neruda', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'National Prize for Literature'}, 't': '?x0'}

 Q: What is {has influence} of {portrayed by} of {Standards} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7598413 wdt:P175 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has influence', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Standards', 'p': 'portrayed by', 'o': '$y0'}}

 Q: How many {stated in} are for {Zaporizhzhia} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q157835 wdt:P248 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Zaporizhzhia', 'p': 'stated in', 'o': '?x0'}

 Q: Tell me about the codon that is encoded by glycine.
 SPARQL:  select distinct ?obj where { wd:Q620730 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'glycine', 'p': 'encoded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'codon'}}

 Q: What award did Arthur Rubinstein win on 1/1/1961?
 SPARQL: SELECT ?obj WHERE { wd:Q183182 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arthur Rubinstein', 'p': 'award', 'o': '?x0', 't': '1961'}

 Q: What has  pet of dog ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1429 wd:Q144}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'pet', 'o': 'dog'}

 Q: What is {academic major} and {academic degree} of {{George Lucas} has {educated at} as {University of Southern California}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q38222 p:P69 ?s . ?s ps:P69 wd:Q4614 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Lucas', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Southern California'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Lucas', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Southern California'}}}]

 Q: Was Franklin D. Roosevelt awarded the Albert Medal?
 SPARQL: ASK WHERE { wd:Q8007 wdt:P166 wd:Q4710826 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Franklin D. Roosevelt', 'p': 'award', 'o': '?x0', '?x0': 'Albert Medal'}]

 Q: What is the name of a branch of service that starts with the letter v.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q690109 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of service'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is the master name of Michel de Montaigne, who has the native name Marc Antoine Muret?
 SPARQL: SELECT ?answer WHERE { wd:Q41568 wdt:P1066 ?answer . ?answer wdt:P1559 ?x FILTER(contains(?x,'Marc Antoine Muret'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michel de Montaigne', 'p': 'master', 'o': '?x0'}

 Q: How many {influenced by} are for {Maimonides} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q127398 wdt:P737 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Maimonides', 'p': 'influenced by', 'o': '?x0'}

 Q: Is the embodied energy of the glass more than 18.0?
 SPARQL: ASK WHERE { wd:Q11469 wdt:P6075 ?obj filter(?obj > 18.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'glass', 'p': 'embodied energy', 'o': '?x0', '?x0': '18.0'}

 Q: What is <update method> of <Windows 10> ?
 SPARQL: select distinct ?answer where { wd:Q18168774 wdt:P4387 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Windows 10', 'p': 'update method', 'o': '?x0'}

 Q: Give me {rotary cannon} that {designed by} {General Electric} and which that starts with {'m'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1966482 . ?sbj wdt:P287 wd:Q54173 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rotary cannon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'General Electric'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: what is the {end time} for {Cardinal Mazarin} has {position held} as {Bishop of Metz} ?
 SPARQL: SELECT ?value WHERE { wd:Q166056 p:P39 ?s . ?s ps:P39 wd:Q15729481 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cardinal Mazarin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Bishop of Metz'}}}

 Q: Who is the {empire} for {country of citizenship} of {Vladimir Lenin}
 SPARQL:  select distinct ?obj where { wd:Q1394 wdt:P27 ?obj . ?obj wdt:P31 wd:Q48349 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Lenin', 'p': 'country of citizenship', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire'}}

 Q: What is {written by} of {appears in} of {Professor Shattuck} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28658577 wdt:P1441 ?X . ?X wdt:P58 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'written by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Professor Shattuck', 'p': 'appeared in', 'o': '$y0'}}

 Q: What is {built out of} of {operates} of {Air China} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51747 wdt:P121 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'built out of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Air China', 'p': 'operates', 'o': '$y0'}}

 Q: When did Alexander Shelepin stop being chairperson for the KGB?
 SPARQL: SELECT ?value WHERE { wd:Q80919 p:P488 ?s . ?s ps:P488 wd:Q533890 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'KGB', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Alexander Shelepin'}}}

 Q: What is {graduate of} of {played by} of {Burnin' the Roadhouse Down} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4999805 wdt:P175 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'graduate of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Burnin' the Roadhouse Down", 'p': 'played by', 'o': '$y0'}}

 Q: What is Spock's occupation in 2286?
 SPARQL: SELECT ?obj WHERE { wd:Q16341 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2286')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spock', 'p': 'occupation', 'o': '?x0', 't': '2286'}

 Q: What is Francis's religious name?
 SPARQL: select distinct ?answer where { wd:Q450675 wdt:P1635 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Francis', 'p': 'religious name', 'o': '?x0'}

 Q: The Chinese garden has what FOIH heritage types ID?
 SPARQL: select distinct ?answer where { wd:Q47692 wdt:P4307 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chinese garden', 'p': 'FOIH heritage types ID', 'o': '?x0'}

 Q: How much chemical structure are for oxytocin?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q169960 wdt:P117 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'oxytocin', 'p': 'chemical structure', 'o': '?x0'}

 Q: What is <order of battle> of <Battle of Lepanto> ?
 SPARQL: select distinct ?answer where { wd:Q165425 wdt:P4220 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Battle of Lepanto', 'p': 'order of battle', 'o': '?x0'}

 Q: What is the type of government in the state of Norfolk?
 SPARQL: SELECT ?answer WHERE { wd:Q23109 wdt:P17 ?X . ?X wdt:P122 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Norfolk', 'p': 'state', 'o': '$y0'}}

 Q: What is the {opera} for {characters} of {Dionysus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q1344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'characters', 'o': 'Dionysus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'opera'}}

 Q: What company was Steve Jobs a board member of?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3320 wd:Q19837 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'board member', 'o': 'Steve Jobs', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'company'}}

 Q: Frank Gehry created what sculpture?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q180374 . ?sbj wdt:P31 wd:Q860861 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'created', 'o': 'Frank Gehry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sculpture'}}

 Q: Tell me me a textile fibre whose name consist of the word "woman" and whose fabrication method sericulture silk
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj wdt:P2079 wd:Q864650 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'silk')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'textile fibre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'sericulture'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'silk'}}

 Q: What is the {G-type main-sequence star} for {child astronomical body} of {Planet Nine}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q22133699 . ?sbj wdt:P31 wd:Q5864 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Planet Nine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: What is {prequel is} of {in narrative} of {Ray Stantz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2559996 wdt:P1441 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prequel is', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ray Stantz', 'p': 'in narrative', 'o': '$y0'}}

 Q: what is the {point in time} for {Tom Cruise} has {award received} as {Golden Globe Award for Best Actor – Motion Picture Musical or Comedy} ?
 SPARQL: SELECT ?value WHERE { wd:Q37079 p:P166 ?s . ?s ps:P166 wd:Q181883 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tom Cruise', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Golden Globe Award for Best Actor – Motion Picture Musical or Comedy'}, 't': '?x0'}

 Q: What is {start time} and {end time} of {{Aleksandr Solzhenitsyn} has {spouse} as {Natalia Solzhenitsyna}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q34474 p:P26 ?s . ?s ps:P26 wd:Q4427694 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': 'Natalia Solzhenitsyna'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'to', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': 'Natalia Solzhenitsyna'}}}]

 Q: What is the {human} for {student} of {Michel Foucault}
 SPARQL:  select distinct ?obj where { wd:Q44272 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Foucault', 'p': 'student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the original language of Television in Mexico's typology?
 SPARQL: SELECT ?answer WHERE { wd:Q11704292 wdt:P364 ?X . ?X wdt:P4132 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'typology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Television in Mexico', 'p': 'original language', 'o': '$y0'}}

 Q: What is the {disease} with the {MAX(disease burden)} whose {drug used for treatment} is {erythromycin}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P2854 ?obj . ?ent wdt:P2176 wd:Q213511 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'disease burden', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'used for treatment', 'o': 'Erythromycin'}}}

 Q: Did World War II took place in Mediterranean Sea?
 SPARQL: ASK WHERE { wd:Q362 wdt:P276 wd:Q4918 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'World War II', 'p': 'location', 'o': '?x0', '?x0': 'Mediterranean Sea'}]

 Q: What is {founders} of {superior formation} of {Weyerhauser (Canada)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29123048 wdt:P749 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founders', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Weyerhauser (Canada)', 'p': 'superior formation', 'o': '$y0'}}

 Q: What are the words by My Old Kentucky Home whose career is lyricist?
 SPARQL: SELECT ?answer WHERE { wd:Q1153133 wdt:P676 ?answer . ?answer wdt:P106 wd:Q822146}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'My Old Kentucky Home', 'p': 'lyricist', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'lyricist'}}

 Q: Is the magnification of the TZF 9b equal to 2.5?
 SPARQL: ASK WHERE { wd:Q42292630 wdt:P4163 ?obj filter(?obj = 2.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'TZF 9b', 'p': 'magnification', 'o': '?x0', '?x0': '2.5'}

 Q: What is the {monument} for {depicted by} of {Iroquois}
 SPARQL:  select distinct ?obj where { wd:Q68518 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q4989906 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iroquois', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monument'}}

 Q: Which is the voice type of Paul McCartney?
 SPARQL: select distinct ?answer where { wd:Q2599 wdt:P412 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paul McCartney', 'p': 'voice type', 'o': '?x0'}

 Q: Tell me operating system component whose name has the word file in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30059018 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'file')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'operating system component'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'file'}}

 Q: Who was the spouse of Honoré de Balzac in the year 1850?
 SPARQL: SELECT ?obj WHERE { wd:Q9711 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1850')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Honoré de Balzac', 'p': 'spouse', 'o': '?x0', 't': '1850'}

 Q: What is {position held} of {Andrea Mantegna} that is {start time} is {1460-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5681 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1460')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrea Mantegna', 'p': 'position held', 'o': '?x0', 't': '1460'}

 Q: What is the {position} for {office held by head of government} of {Greater London}
 SPARQL:  select distinct ?obj where { wd:Q23306 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Greater London', 'p': 'office held by head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: what is the {series ordinal} for {James A. Garfield} has {position held} as {President of the United States} ?
 SPARQL: SELECT ?value WHERE { wd:Q34597 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James A. Garfield', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the United States'}}}

 Q: What was the award received by Anne, Princess Royal that is point in time was 1969-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q151754 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anne, Princess Royal', 'p': 'award received', 'o': '?x0', 't': '1969'}

 Q: What is {nominated for} of {Gérard Depardieu} that is {for work} is {Camille Claudel} ?
 SPARQL: SELECT ?obj WHERE { wd:Q106508 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1029155 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerard Depardieu', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Camille Claudel'}}}

 Q: What is the {owned by} and the {founded by} of {JPMorgan_Chase} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q192314 wdt:P127 ?ans_1 . wd:Q192314 wdt:P112 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'JPMorgan Chase', 'p': 'owned by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'JPMorgan Chase', 'p': 'founded by', 'o': '?x1'}]

 Q: What was Melinda Gates' academic major and degree when she studied at Duke University?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 wd:Q168751 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Melinda Gates', 'p': 'studied at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'studied at', 'o': 'Duke University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Melinda Gates', 'p': 'studied at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'studied at', 'o': 'Duke University'}}}]

 Q: Who is the  {chemical compound} for {significant drug interaction} of {(RS)-methadone}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P769 wd:Q179996 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant drug interaction', 'o': '(RS)-methadone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is the {protein} for {physically interacts with} of {adenosine triphosphate}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P129 wd:Q80863 . ?sbj wdt:P31 wd:Q8054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'physically interacts with', 'o': 'ATP', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protein'}}

 Q: Is Colin Firth a sibling of Jonathan Firth and Kate Firth?
 SPARQL: ASK WHERE { wd:Q162492 wdt:P3373 wd:Q713766 . wd:Q162492 wdt:P3373 wd:Q4532014 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Colin Firth', 'p': 'sibling', 'o': '?x0', '?x0': 'Jonathan Firth'}, {'h': 'IS', 'v': '?x1', 's': 'Colin Firth', 'p': 'sibling', 'o': '?x1', '?x1': 'Kate Firth'}]

 Q: What is the number of out of school children in the planetary system of the Moon?
 SPARQL: SELECT ?answer WHERE { wd:Q405 wdt:P397 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moon', 'p': 'planetary system', 'o': '$y0'}}

 Q: Which is the {international sport governing body} for {authority} of {baseball}?
 SPARQL:  select distinct ?obj where { wd:Q5369 wdt:P797 ?obj . ?obj wdt:P31 wd:Q11422536 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'baseball', 'p': 'authority', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international sport governing body'}}

 Q: What is the largest depth of a lunar crater?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1348589 . ?ent wdt:P4511 ?obj . ?ent wdt:P31 wd:Q1348589 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'depth', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lunar crater'}}

 Q: What is the {abdication} for {significant event} of {Juan Carlos I}
 SPARQL:  select distinct ?obj where { wd:Q19943 wdt:P793 ?obj . ?obj wdt:P31 wd:Q207549 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Juan Carlos I', 'p': 'significant event', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abdication'}}

 Q: When has Košice been doing as head of government since 2010-12-21?
 SPARQL: SELECT ?obj WHERE { wd:Q25409 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Košice', 'p': 'head of government', 'o': '?x0', 't': '2010'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Clarence Seedorf} has {member of sports team} as {Real Madrid C.F.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 wd:Q8682 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Real'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clarence Seedorf', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Real'}}}]

 Q: Is the maximum age of compulsory education in Sweden equal to 16 ?
 SPARQL: ASK WHERE { wd:Q34 wdt:P3271 ?obj filter(?obj = 16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sweden', 'p': 'compulsory education (maximum age)', 'o': '?x0', '?x0': '16'}

 Q: What is {child} of {Philip II of France} and {date of birth}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q34428 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P569 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip II of France', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip II of France', 'p': 'child', 'o': '$y0'}}]

 Q: What award John Berryman received at 1969-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q522192 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Berryman', 'p': 'award', 'o': '?x0', 't': '1969'}

 Q: Tell me about the television program WWE and its production company.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P272 wd:Q35339 . ?sbj wdt:P31 wd:Q15416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'production company', 'o': 'WWE', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television program'}}

 Q: Who is the stepparent of Ludwig von Mises?
 SPARQL: select distinct ?answer where { ?answer wdt:P3448 wd:Q84233}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stepparent', 'o': 'Ludwig von Mises'}

 Q: What is Joy Division's country of origin and what is her genre?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q172763 wdt:P495 ?ans_1 . wd:Q172763 wdt:P136 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Joy Division', 'p': 'country of origin', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Joy Division', 'p': 'genre', 'o': '?x1'}]

 Q: Who is the prime minister at admin HQ of the International Ice Hockey Federation?
 SPARQL: SELECT ?answer WHERE { wd:Q190173 wdt:P159 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prime minister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'International Ice Hockey Federation', 'p': 'HQ', 'o': '$y0'}}

 Q: What is {population} of {San Cristóbal de La Laguna} that is {determination method} is {register office} ?
 SPARQL: SELECT ?obj WHERE { wd:Q54898 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'San Cristóbal de La Laguna', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'register office'}}}

 Q: What is the {discography} for {discography} of {Duran Duran}
 SPARQL:  select distinct ?obj where { wd:Q58381 wdt:P358 ?obj . ?obj wdt:P31 wd:Q273057 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Duran Duran', 'p': 'discography', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discography'}}

 Q: What is the {nomadic empire} for {country} of {Golden Horde}
 SPARQL:  select distinct ?obj where { wd:Q79965 wdt:P17 ?obj . ?obj wdt:P31 wd:Q2495771 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Golden Horde', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nomadic empire'}}

 Q: What is {age of majority} of {loyalty} of {Moshe Dayan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q188783 wdt:P945 ?X . ?X wdt:P2997 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'age of majority', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moshe Dayan', 'p': 'loyalty', 'o': '$y0'}}

 Q: Did {Jacqueline_Kennedy_Onassis} {religion} {Melkite Greek Catholic Church}?
 SPARQL: ASK WHERE { wd:Q165421 wdt:P140 wd:Q64885 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jacqueline Kennedy Onassis', 'p': 'religion', 'o': '?x0', '?x0': 'Melkite Greek Catholic Church'}]

