 Q: What is the {country of citizenship} and the {occupation} of {Alice_Cooper} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q332032 wdt:P27 ?ans_1 . wd:Q332032 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Alice Cooper', 'p': 'country of citizenship', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Alice Cooper', 'p': 'occupation', 'o': '?x1'}]

 Q: What is Fashion Model Directory model ID for Paris Hilton ?
 SPARQL: select distinct ?answer where { wd:Q47899 wdt:P2266 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paris Hilton', 'p': 'Fashion Model Directory model ID', 'o': '?x0'}

 Q: Which is {official language} {is in the department of} {Kali Penjalin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q25249655 wdt:P131 ?X . ?X wdt:P37 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kali Penjalin', 'p': 'is in the department of', 'o': '$y0'}}

 Q: What is the {protected area} for {creator} of {Frank Gehry}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q180374 . ?sbj wdt:P31 wd:Q473972 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'creator', 'o': 'Frank Gehry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protected area'}}

 Q: DOES THE MAXIMUM GLIDE RATIO OF DG FLUZEUGBAU L S 10 EQUALS 60.0
 SPARQL: ASK WHERE { wd:Q2163977 wdt:P1470 ?obj filter(?obj = 60.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'DG Flugzeugbau LS10', 'p': 'maximum glide ratio', 'o': '?x0', '?x0': '60.0'}

 Q: What is the watercourse that outflows of Walker Lake?
 SPARQL: SELECT ?answer WHERE { wd:Q679846 wdt:P201 ?X . ?X wdt:P403 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'outflow', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Walker Lake', 'p': 'outflows', 'o': '$y0'}}

 Q: what is the {start time} for {Charles Stewart Parnell} has {position held} as {Member of the 24th Parliament of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q317436 p:P39 ?s . ?s ps:P39 wd:Q41582570 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Stewart Parnell', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 24th Parliament of the United Kingdom'}}}

 Q: is ANZUS a signatory?
 SPARQL: select distinct ?answer where { wd:Q295875 wdt:P1891 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ANZUS', 'p': 'signatory', 'o': '?x0'}

 Q: What is the {book of the Bible} for {follows} of {Exodus}
 SPARQL:  select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q29154430 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Exodus', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book of the Bible'}}

 Q: What colossal statue starts with the letter "s"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'colossal statue'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is <Sandbox-Item> of <1> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P369 wd:Q199}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'Sandbox-Item', 'o': 'one'}

 Q: Who is the mother of Elektra that is married to Agamemnon?
 SPARQL: SELECT ?answer WHERE { wd:Q131651 wdt:P25 ?answer . ?answer wdt:P26 wd:Q128176}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Elektra', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'married to', 'o': 'Agamemnon'}}

 Q: what is the {for work} for {John Updike} has {award received} as {PEN/Faulkner Award for Fiction} ?
 SPARQL: SELECT ?value WHERE { wd:Q105756 p:P166 ?s . ?s ps:P166 wd:Q1188661 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Updike', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'PEN/Faulkner Award for Fiction'}}}

 Q: tell me that aerospace manufacturer which contains the word zeebruges on its own name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q936518 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeebruges')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aerospace manufacturer'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeebruges'}}

 Q: What is the {business} for {replaced by} of {Oracle Corporation}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1366 wd:Q19900 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Oracle Corporation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: what is the {end time} for {Eugenio Montale} has {position held} as {senatore a vita} ?
 SPARQL: SELECT ?value WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eugenio Montale', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'senatore a vita'}}}

 Q: Which is the twin city of place of death of Clark Gable?
 SPARQL: SELECT ?answer WHERE { wd:Q71243 wdt:P20 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clark Gable', 'p': 'place of death', 'o': '$y0'}}

 Q: What is {type locality (geology)} of {diopside}, that has {total area} is {11.14} ?
 SPARQL: SELECT ?answer WHERE { wd:Q316671 wdt:P2695 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'11.14'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'diopside', 'p': 'type locality (geology)', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'area', 'o': '11.14'}}

 Q: What are the salad which start with the letter y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9266 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'salad'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: what is the {end time} for {Ptolemy I Soter} has {noble title} as {pharaoh} ?
 SPARQL: SELECT ?value WHERE { wd:Q168261 p:P97 ?s . ?s ps:P97 wd:Q37110 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ptolemy I Soter', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'pharaoh'}}}

 Q: Who is the {factory} for {product or material produced} of {butter}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q34172 . ?sbj wdt:P31 wd:Q83405 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'butter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'factory'}}

 Q: Who gave the {unit symbol} of {based upon} of {lumen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q484092 wdt:P144 ?X . ?X wdt:P5061 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'unit symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'lumen', 'p': 'based upon', 'o': '$y0'}}

 Q: Who is the wife of Medgar Evers in 1951?
 SPARQL: SELECT ?obj WHERE { wd:Q717985 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1951')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Medgar Evers', 'p': 'wife', 'o': '?x0', 't': '1951'}

 Q: Tell me the name of a non-metal with the most electronegativity
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19600 . ?ent wdt:P1108 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'electronegativity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'non-metal'}}

 Q: Who owns CNN is owned and who is CNN owned by?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q48340 wdt:P1830 ?ans_1 . wd:Q48340 wdt:P127 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'CNN', 'p': 'owns', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'CNN', 'p': 'owned by', 'o': '?x1'}]

 Q: What is {pronunciation audio} of {media} of {chocolate milk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13253 wdt:P186 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'chocolate milk', 'p': 'media', 'o': '$y0'}}

 Q: What is the adjacent station for Oregon City?
 SPARQL: select distinct ?answer where { wd:Q849596 wdt:P197 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oregon City', 'p': 'adjacent station', 'o': '?x0'}

 Q: What is <PhilPapers topic> of <Roger Bacon> ?
 SPARQL: select distinct ?answer where { wd:Q171677 wdt:P3235 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Roger Bacon', 'p': 'PhilPapers topic', 'o': '?x0'}

 Q: What is the Operabase ID for Terry Gilliam?
 SPARQL: select distinct ?answer where { wd:Q25078 wdt:P4869 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Terry Gilliam', 'p': 'Operabase ID', 'o': '?x0'}

 Q: What is {date of birth} of {Polybius} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q131169 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Polybius', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'circa'}}}

 Q: What is <area> of <Channel Islands> ?
 SPARQL: select distinct ?answer where { wd:Q42314 wdt:P2046 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Channel Islands', 'p': 'area', 'o': '?x0'}

 Q: Which country was Medina from at the time of her inception 632-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q35484 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(?x,'632-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Medina', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'from', 'o': '632-0-0'}}}

 Q: What is the {human} for {cover artist} of {All Quiet on the Western Front}
 SPARQL:  select distinct ?obj where { wd:Q207332 wdt:P736 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'All Quiet on the Western Front', 'p': 'cover artist', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is Chicago located in Cook County?
 SPARQL: ASK WHERE { wd:Q1297 wdt:P131 wd:Q108418 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chicago', 'p': 'in', 'o': '?x0', '?x0': 'Cook County'}]

 Q: Name a silent movie written by Thomas Dixon Jr that starts with letter B
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q226730 . ?sbj wdt:P58 wd:Q4993107 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'silent movie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'written by', 'o': 'Thomas Dixon'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: Did {Angkor_Wat} {architectural style} {Dravidian architecture} and {Medang Kingdom} ?
 SPARQL: ASK WHERE { wd:Q43473 wdt:P149 wd:Q171309 . wd:Q43473 wdt:P149 wd:Q402580 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Angkor Wat', 'p': 'style of architecture', 'o': '?x0', '?x0': 'Dravidian architecture'}, {'h': 'IS', 'v': '?x1', 's': 'Angkor Wat', 'p': 'style of architecture', 'o': '?x1', '?x1': 'Medang Kingdom'}]

 Q: What was the population of Nunavut in the year 2017?
 SPARQL: SELECT ?obj WHERE { wd:Q2023 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nunavut', 'p': 'population', 'o': '?x0', 't': '2017'}

 Q: Which is the license for copyright?
 SPARQL: select distinct ?answer where { ?answer wdt:P275 wd:Q12948581}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'license', 'o': 'copyright'}

 Q: What is {location born} of {Murray Perahia}, that has {executive power headed by} is {Michael Bloomberg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q326221 wdt:P19 ?answer . ?answer wdt:P6 wd:Q607}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Murray Perahia', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'executive power headed by', 'o': 'Michael Bloomberg'}}

 Q: What is {position held} of {Alexander Dubček} that is {start time} is {1989-12-28} ?
 SPARQL: SELECT ?obj WHERE { wd:Q150543 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alexander Dubcek', 'p': 'position held', 'o': '?x0', 't': '1989'}

 Q: What is <legal status (medicine)> of <prescription drug> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3493 wd:Q1643563}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'legal status (medicine)', 'o': 'prescription drug'}

 Q: what is the {point in time} for {Serbia} has {total fertility rate} as {1.59} ?
 SPARQL: SELECT ?value WHERE { wd:Q403 p:P4841 ?s . ?s ps:P4841 ?x filter(contains(?x,'1.59')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Serbia', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'total fertility rate', 'o': '1.59'}, 't': '?x0'}

 Q: What what is  international parliament  office held by head of the organisation by President of the United Nations General Assembly and also which starts with letter a
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj wdt:P2388 wd:Q1161813 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international parliament', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'President of the United Nations General Assembly'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: what is the {point in time} for {Celine Dion} has {award received} as {Officer of the National Order of Quebec} ?
 SPARQL: SELECT ?value WHERE { wd:Q5105 p:P166 ?s . ?s ps:P166 wd:Q15464524 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Celine Dion', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Officer of the National Order of Quebec'}, 't': '?x0'}

 Q: What is {educated at} of {Marina Abramović} that is {end time} is {1970-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q47496 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marina Abramovic', 'p': 'educated at', 'o': '?x0', 't': '1970'}

 Q: Who has the country seat of Taipei, who also has diplomatic relations with the country of Mali?
 SPARQL: SELECT ?answer WHERE { wd:Q1867 wdt:P1376 ?answer . ?answer wdt:P530 wd:Q912}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Taipei', 'p': 'seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Mali'}}

 Q: Who are the sons starring in H. Con-172
 SPARQL: SELECT ?answer WHERE { wd:Q5628146 wdt:P161 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'H. Con-172', 'p': 'starring', 'o': '$y0'}}

 Q: What is {town} of {Capua}, that has {has cities} is {Tora e Piccilli} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58477 wdt:P131 ?answer . ?answer wdt:P150 wd:Q58909}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Capua', 'p': 'town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'Tora e Piccilli'}}

 Q: What is {topic of} of {history of Washington, D.C.}, that has {prime minister} is {Marion Barry} ?
 SPARQL: SELECT ?answer WHERE { wd:Q685093 wdt:P1269 ?answer . ?answer wdt:P6 wd:Q938243}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Washington, D.C.', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prime minister', 'o': 'Marion Barry'}}

 Q: what is the {for work} for {Sydney Pollack} has {nominated for} as {Academy Award for Best Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q51522 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sydney Pollack', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Director'}}}

 Q: What is the {relative} and the {position played on team / speciality} of {Dwayne_Johnson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q10738 wdt:P1038 ?ans_1 . wd:Q10738 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Dwayne Johnson', 'p': 'relative', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Dwayne Johnson', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: What is {wikibase:geoLatitude ?max} {land} of {history of Senegal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1151513 wdt:P17 ?X . ?X wdt:P1332 ?answer}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'history of Senegal', 'p': 'land', 'o': '$y0'}

 Q: Name an airline company using the Chennai International Airport as a hub that contains the word "spicejet"" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj wdt:P113 wd:Q502670 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'spicejet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'hub', 'o': 'Chennai International Airport'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'spicejet'}}

 Q: What is {position held} of {Ralf Dahrendorf} that is {start time} is {1993-7-15} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76959 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ralf Dahrendorf', 'p': 'position held', 'o': '?x0', 't': '1993'}

 Q: Who is the operator of Sydney Metro?
 SPARQL: select distinct ?answer where { ?answer wdt:P137 wd:Q14774571}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Sydney Metro'}

 Q: what is the {point in time} for {Kenny Rogers} has {award received} as {American Music Award for Favorite Country Album} ?
 SPARQL: SELECT ?value WHERE { wd:Q217160 p:P166 ?s . ?s ps:P166 wd:Q1441539 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kenny Rogers', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'American Music Award for Favorite Country Album'}, 't': '?x0'}

 Q: how is remake of makes use of Roman numerals?
 SPARQL: SELECT ?answer WHERE { wd:Q38918 wdt:P2283 ?X . ?X wdt:P144 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'remake of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roman numerals', 'p': 'makes use of', 'o': '$y0'}}

 Q: what is the {serial number} for {Andrei Gromyko} has {award received} as {Order of Lenin} ?
 SPARQL: SELECT ?value WHERE { wd:Q184267 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P2598 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'serial number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andrei Gromyko', 'p': 'awards', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'awards', 'o': 'Order of Lenin'}}}

 Q: Is the decomposition point of citric acid greater than 140.0?
 SPARQL: ASK WHERE { wd:Q159683 wdt:P2107 ?obj filter(?obj > 140.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'citric acid', 'p': 'decomposition point', 'o': '?x0', '?x0': '140.0'}

 Q: Is the IDLH of carbon dioxide equal to 72000?
 SPARQL: ASK WHERE { wd:Q1997 wdt:P2129 ?obj filter(?obj = 72000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'carbon dioxide', 'p': 'IDLH', 'o': '?x0', '?x0': '72000'}

 Q: Tell me postgraduate degree whose name has the word philosophy in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015928 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'postgraduate degree'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'philosophy'}}

 Q: Who is the  {horse} for {owner of} of {Ulysses S. Grant}
 SPARQL:  select distinct ?obj where { wd:Q34836 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q726 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ulysses S. Grant', 'p': 'owner of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'horse'}}

 Q: Is power pop the genre of Phil Collins' music?
 SPARQL: ASK WHERE { wd:Q144622 wdt:P136 wd:Q837837 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Phil Collins', 'p': 'genre', 'o': '?x0', '?x0': 'power pop'}]

 Q: What is {member of} of {musical artist} of {The Trip into the Light World Tour} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28405906 wdt:P175 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Trip into the Light World Tour', 'p': 'artist', 'o': '$y0'}}

 Q: Which is the film the was produced by Isabelle Adjani?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P162 wd:Q106383 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'produced by', 'o': 'Isabelle Adjani', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: What is {genetic association} of {cardiovascular disease} that is {determination method} is {TAS} ?
 SPARQL: SELECT ?obj WHERE { wd:Q389735 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cardiovascular disease', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'TAS'}}}

 Q: What is the rate of fire of a VAP submachine gun?
 SPARQL: ASK WHERE { wd:Q61235737 wdt:P3792 ?obj filter(?obj = 900) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'VAP submachine gun', 'p': 'rate of fire', 'o': '?x0', '?x0': '900'}

 Q: Which animated film series whose distributor Metro-Goldwyn-Mayer and which that starts with the letter j
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56884562 . ?sbj wdt:P750 wd:Q179200 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'j')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated film series', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'distributor', 'o': 'Metro-Goldwyn-Mayer'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'j'}}

 Q: What is the {federal state} for {diplomatic relation} of {Soviet Union}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P530 wd:Q15180 . ?sbj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: What is the construction with the maximum slope rating whose located in the administrative territorial entity is Oregon ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q811430 . ?ent wdt:P3840 ?obj . ?ent wdt:P131 wd:Q824 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'slope rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'construction', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Oregon'}}}

 Q: What is <Discogs artist ID> of <Heinrich Heine> ?
 SPARQL: select distinct ?answer where { wd:Q44403 wdt:P1953 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Heinrich Heine', 'p': 'Discogs artist ID', 'o': '?x0'}

 Q: Tell me baseball league whose name has the word professional in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6631808 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'professional')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'baseball league'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'professional'}}

 Q: What is formation of succeeded by of Julian calendar ?
 SPARQL: SELECT ?answer WHERE { wd:Q11184 wdt:P1366 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julian calendar', 'p': 'succeeded by', 'o': '$y0'}}

 Q: What is {place of activity} of {Lotte Jacobi}, that has {has towns} is {Berg am Laim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q70006 wdt:P937 ?answer . ?answer wdt:P150 wd:Q533054}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lotte Jacobi', 'p': 'place of activity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has towns', 'o': 'Berg am Laim'}}

 Q: What country was Jiangsu a part of in October 1949?
 SPARQL: SELECT ?obj WHERE { wd:Q16963 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1949')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jiangsu', 'p': 'country', 'o': '?x0', 't': '1949'}

 Q: Which is the TAXREF ID for Salvia officinalis?
 SPARQL: select distinct ?answer where { wd:Q1111359 wdt:P3186 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salvia officinalis', 'p': 'TAXREF ID', 'o': '?x0'}

 Q: Who are the characters of the series Civilization V: Gods & Kings?
 SPARQL: SELECT ?answer WHERE { wd:Q2418673 wdt:P179 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Civilization V: Gods & Kings', 'p': 'series', 'o': '$y0'}}

 Q: Tell meGerman nationalism whose name has the word national in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q370744 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'national')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'German nationalism'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'national'}}

 Q: The Erie Canal has what Structurae ID (structure)?
 SPARQL: select distinct ?answer where { wd:Q459578 wdt:P454 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Erie Canal', 'p': 'Structurae ID (structure)', 'o': '?x0'}

 Q: What is the movement in Les Demoiselles d'Avignon?
 SPARQL: select distinct ?answer where { wd:Q910199 wdt:P135 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Les Demoiselles d'Avignon", 'p': 'movement', 'o': '?x0'}

 Q: What opera was composed by Pyotr Ilyich Tchaikovsky?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q7315 . ?sbj wdt:P31 wd:Q1344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composed by', 'o': 'Pyotr Ilyich Tchaikovsky', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'opera'}}

 Q: Name a MediaWiki website located in Amsterdam that starts with letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15633582 . ?sbj wdt:P276 wd:Q727 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'MediaWiki website', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Amsterdam'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: When did country for participant of of World War II?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1344 wd:Q362 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant of', 'o': 'World War II', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is {established by} of {distributed by} of {Children of the Corn 666: Isaac's Return} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1502325 wdt:P750 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Children of the Corn 6', 'p': 'distributed by', 'o': '$y0'}}

 Q: When did Yerevan's population reach 1.0547e+06?
 SPARQL: SELECT ?value WHERE { wd:Q1953 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.0547e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Yerevan', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.0547e+06'}, 't': '?x0'}

 Q: Is the magnetic moment of the Ganymede equal to 1.056e+20?
 SPARQL: ASK WHERE { wd:Q3169 wdt:P2069 ?obj filter(?obj = 1.056e+20) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ganymede', 'p': 'magnetic moment', 'o': '?x0', '?x0': '1.056e+20'}

 Q: Is 17 the age of consent in South Australia?
 SPARQL: ASK WHERE { wd:Q35715 wdt:P2999 ?obj filter(?obj = 17) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'South Australia', 'p': 'age of consent', 'o': '?x0', '?x0': '17'}

 Q: Which is the LittleSis people ID for Shinzō Abe?
 SPARQL: select distinct ?answer where { wd:Q132345 wdt:P3388 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shinzō Abe', 'p': 'LittleSis people ID', 'o': '?x0'}

 Q: What is {member of sports team} of {Lucien Laurent} that is {number of points/goals/set scored} is {4.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q315286 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter(contains(?x,'4.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lucien Laurent', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '4.0'}}}

 Q: What is {buried at} of {David Vetter}, that has {has cities} is {Dawson County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q726179 wdt:P119 ?answer . ?answer wdt:P150 wd:Q110670}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'David Vetter', 'p': 'buried at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'Dawson County'}}

 Q: Which is the film character of the husband of Princess Leia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P26 wd:Q51797 . ?sbj wdt:P31 wd:Q15773347 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'husband', 'o': 'Princess Leia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character'}}

