 Q: What is the translation of Dongguan in pinyin?
 SPARQL: select distinct ?answer where { wd:Q59218 wdt:P1721 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dongguan', 'p': 'pinyin', 'o': '?x0'}

 Q: Tell me decimal classification whose name has the word classification in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'decimal classification'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'classification'}}

 Q: What is the {municipality of Germany} for {shares border with} of {Hamburg}
 SPARQL:  select distinct ?obj where { wd:Q1055 wdt:P47 ?obj . ?obj wdt:P31 wd:Q262166 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hamburg', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Germany'}}

 Q: What is the {human} for {sibling} of {Bashar al-Assad}
 SPARQL:  select distinct ?obj where { wd:Q44329 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bashar al-Assad', 'p': 'sibling', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {slaughtered by} of {cinematographer} of {Jim: The James Foley Story} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24593936 wdt:P344 ?X . ?X wdt:P157 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'slaughtered by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jim: The James Foley Story', 'p': 'cinematographer', 'o': '$y0'}}

 Q: What is {stock exchange} of {ING Group} that is {ticker symbol} is {ING} ?
 SPARQL: SELECT ?obj WHERE { wd:Q645708 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'ING')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stock exchange', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ING', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ticker symbol', 'o': 'ing'}}}

 Q: What are the invasion which start with the letter  migration
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q467011 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'migration')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'invasion'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'migration'}}

 Q: What is the telephone numbering plan of the seat of Union Cycliste Internationale ?
 SPARQL: SELECT ?answer WHERE { wd:Q48663 wdt:P159 ?X . ?X wdt:P473 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'telephone numbering plan', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Union Cycliste Internationale', 'p': 'seat', 'o': '$y0'}}

 Q: Which is the Ustream username for National Aeronautics and Space Administration?
 SPARQL: select distinct ?answer where { wd:Q23548 wdt:P4017 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'National Aeronautics and Space Administration', 'p': 'Ustream username', 'o': '?x0'}

 Q: Who is the writer of the preceeds of Choke?
 SPARQL: SELECT ?answer WHERE { wd:Q2466091 wdt:P156 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'writer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Choke', 'p': 'preceeds', 'o': '$y0'}}

 Q: What is {elected in} and {end cause} of {{John Major} has {position held} as {Member of the 51st Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q9559 p:P39 ?s . ?s ps:P39 wd:Q41582627 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Major', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 51st Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Major', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 51st Parliament of the United Kingdom'}}}]

 Q: What is the {holding company} with the {MAX(net profit)} whose {country} is {United States of America}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q219577 . ?ent wdt:P2295 ?obj . ?ent wdt:P17 wd:Q30 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'net profit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'holding company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'US'}}}

 Q: What is the {human} for {chief executive officer} of {IBM}
 SPARQL:  select distinct ?obj where { wd:Q37156 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'IBM', 'p': 'chief executive officer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {manner of death} are to/by {lynching} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1196 wd:Q486775 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'manner of death', 'o': 'lynching'}

 Q: what is the {language of work or name} for {Meditations} has {has edition} as {Marcus Aurelius Antoninus, His Meditations concerning himselfe} ?
 SPARQL: SELECT ?value WHERE { wd:Q1152283 p:P747 ?s . ?s ps:P747 wd:Q50279195 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Meditations', 'p': 'edition', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'edition', 'o': 'Meditations'}}}

 Q: Is the shear modulas of the glass equal to 26.2?
 SPARQL: ASK WHERE { wd:Q11469 wdt:P5673 ?obj filter(?obj = 26.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'glass', 'p': 'shear modulus', 'o': '?x0', '?x0': '26.2'}

 Q: Who is the {human} for {replaces} of {Ayman al-Zawahiri}
 SPARQL:  select distinct ?obj where { wd:Q186316 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ayman al-Zawahiri', 'p': 'replaces', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the type of kinship for William the Conqueror has relative as Edward the Confessor?
 SPARQL: SELECT ?value WHERE { wd:Q37594 p:P1038 ?s . ?s ps:P1038 wd:Q130005 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William the Conqueror', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Edward the Confessor'}}}

 Q: Which is the archINFORM person or group ID for Thomas Jefferson?
 SPARQL: select distinct ?answer where { wd:Q11812 wdt:P5508 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thomas Jefferson', 'p': 'archINFORM person or group ID', 'o': '?x0'}

 Q: Is true that Mecca was the capital of Makkah Region and Hejaz Vilayet?
 SPARQL: ASK WHERE { wd:Q5806 wdt:P1376 wd:Q234167 . wd:Q5806 wdt:P1376 wd:Q3558385 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mecca', 'p': 'capital of', 'o': '?x0', '?x0': 'Makkah Region'}, {'h': 'IS', 'v': '?x1', 's': 'Mecca', 'p': 'capital of', 'o': '?x1', '?x1': 'Hejaz Vilayet'}]

 Q: Does the defined daily dose of zonisamide equal to 0.2?
 SPARQL: ASK WHERE { wd:Q219957 wdt:P4250 ?obj filter(?obj = 0.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'zonisamide', 'p': 'defined daily dose', 'o': '?x0', '?x0': '0.2'}

 Q: Wich means{conjugate base} in {ammonium cation} ?
 SPARQL: select distinct ?answer where { wd:Q190901 wdt:P4149 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ammonium cation', 'p': 'conjugate base', 'o': '?x0'}

 Q: What is {painting of} of {heart}, that has {found in species} is {human} ?
 SPARQL: SELECT ?answer WHERE { wd:Q826930 wdt:P180 ?answer . ?answer wdt:P703 wd:Q5}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'heart', 'p': 'painting of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'found in species', 'o': 'human'}}

 Q: Henry Goudy is the position holder of what professorship?
 SPARQL: SELECT ?answer WHERE { wd:Q16976151 wdt:P803 ?X . ?X wdt:P1308 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position holder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Goudy', 'p': 'professorship', 'o': '$y0'}}

 Q: What is Davis Cup player ID for Ken Rosewall?
 SPARQL: select distinct ?answer where { wd:Q312728 wdt:P2641 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ken Rosewall', 'p': 'Davis Cup player ID', 'o': '?x0'}

 Q: What is {died in} of {Pōmare II}, that has {Wikivoyage banner} is {Moorea banner.jpg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q887744 wdt:P20 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Moorea banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pōmare II', 'p': 'died in', 'o': '?x0'}

 Q: What what is Olympic sport authority by International Biathlon Union  and which that starts with b
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj wdt:P797 wd:Q866910 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Olympic sport', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'authority', 'o': 'International Biathlon Union'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: How many {allegiance} are to/by {West Germany} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P945 wd:Q713750 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'allegiance', 'o': 'West Germany'}

 Q: what is the {academic degree} for {Bjarne Stroustrup} has {educated at} as {University of Cambridge} ?
 SPARQL: SELECT ?value WHERE { wd:Q92620 p:P69 ?s . ?s ps:P69 wd:Q35794 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bjarne Stroustrup', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Cambridge'}}}

 Q: What is {located in time zone} of {Donetsk Oblast} that is {valid in period} is {standard time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2012050 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donetsk Oblast', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'standard time'}}}

 Q: Which is the ARMB member ID of Étienne-Jules Marey?
 SPARQL: select distinct ?answer where { wd:Q289217 wdt:P5329 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Étienne-Jules Marey', 'p': 'ARMB member ID', 'o': '?x0'}

 Q: Who is the publisher and the developer of Minecraft?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q49740 wdt:P123 ?ans_1 . wd:Q49740 wdt:P178 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Minecraft', 'p': 'publisher', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Minecraft', 'p': 'developer', 'o': '?x1'}]

 Q: Tell me the ancient Greek temple that had as architect Chersiphron and contains the word artemis in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q267596 . ?sbj wdt:P84 wd:Q1070392 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'artemis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient Greek temple', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Chersiphron'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'artemis'}}

 Q: Is google's total equity 96,822,000,000.00?
 SPARQL: ASK WHERE { wd:Q95 wdt:P2137 ?obj filter(?obj = 96822000000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Google', 'p': 'total equity', 'o': '?x0', '?x0': '96822000000.0'}

 Q: what is the {point in time} for {Jean Cocteau} has {position held} as {President of the Jury at the Cannes Festival} ?
 SPARQL: SELECT ?value WHERE { wd:Q83158 p:P39 ?s . ?s ps:P39 wd:Q23958341 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jean Cocteau', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the Jury at the Cannes Festival'}, 't': '?x0'}

 Q: What is {country of citizenship} and {place of birth} of {{Roald Dahl} has {occupation} as {writer}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q25161 p:P106 ?s . ?s ps:P106 wd:Q36180 . ?s pq:P27 ?value1 . ?s pq:P19 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country of citizenship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roald Dahl', 'p': 'work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work', 'o': 'writer'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'place of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roald Dahl', 'p': 'work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work', 'o': 'writer'}}}]

 Q: What is <Académie française member ID> of <Alfred de Musset> ?
 SPARQL: select distinct ?answer where { wd:Q179680 wdt:P4717 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alfred de Musset', 'p': 'Académie française member ID', 'o': '?x0'}

 Q: What is {safety classification and labelling} of {zinc chloride} that is {NFPA Health} is {3} ?
 SPARQL: SELECT ?obj WHERE { wd:Q204714 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P993 ?x filter(contains(?x,'3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'safety classification and labelling', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'zinc chloride', 'p': 'safety classification and labelling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'NFPA Health', 'o': '3'}}}

 Q: which public research university name was  starts with u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q62078547 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public research university'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is the {human} for {doctoral advisor} of {Isaac Newton}
 SPARQL:  select distinct ?obj where { wd:Q935 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Isaac Newton', 'p': 'doctoral advisor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {twinned administrative body} are to/by {Argenteuil} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P190 wd:Q181946 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Argenteuil'}

 Q: Which chef-lieu was the hometown of George Orwell?
 SPARQL: SELECT ?answer WHERE { wd:Q3335 wdt:P551 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chef-lieu', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Orwell', 'p': 'hometown', 'o': '$y0'}}

 Q: What is <DOI prefix> of <Institute of Electrical and Electronics Engineers> ?
 SPARQL: select distinct ?answer where { wd:Q131566 wdt:P1662 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Institute of Electrical and Electronics Engineers', 'p': 'DOI prefix', 'o': '?x0'}

 Q: How many operating systems does Skype have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q40984 wdt:P306 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Skype', 'p': 'operating system', 'o': '?x0'}

 Q: What is the {Wikimedia category} for {category of associated people} of {Surat}
 SPARQL:  select distinct ?obj where { wd:Q4629 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Surat', 'p': 'category of associated people', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: What sports team did Jonah Lomu play for on 1-1-1999?
 SPARQL: SELECT ?obj WHERE { wd:Q363717 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jonah Lomu', 'p': 'team', 'o': '?x0', 't': '1999'}

 Q: what is the {end time} for {Albert Bierstadt} has {educated at} as {Düsseldorf school of painting} ?
 SPARQL: SELECT ?value WHERE { wd:Q77132 p:P69 ?s . ?s ps:P69 wd:Q680559 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Albert Bierstadt', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Düsseldorf school of painting'}}}

 Q: Moon Jae-in is the head of state of which constitutional republic?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q21001 . ?sbj wdt:P31 wd:Q1520223 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Moon Jae-in', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitutional republic'}}

 Q: What is {death place} of {Paul Verlaine}, that has {prime minister} is {Jean Sylvain Bailly} ?
 SPARQL: SELECT ?answer WHERE { wd:Q755 wdt:P20 ?answer . ?answer wdt:P6 wd:Q1685301}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paul Verlaine', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prime minister', 'o': 'Jean Sylvain Bailly'}}

 Q: What is {award received} of {Alvin Eliot Roth} that is {together with} is {Lloyd Shapley} ?
 SPARQL: SELECT ?obj WHERE { wd:Q28542 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q244739 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alvin Eliot Roth', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'together with', 'o': 'Lloyd Shapley'}}}

 Q: Give me {vegetation zone} that {continent} {Europe} and which contains the word {taiga} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj wdt:P30 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vegetation zone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Europe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'taiga'}}

 Q: tell me sexual orientation that name has the word sex in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17888 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sexual orientation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'sex'}}

 Q: what is the {point in time} for {Pius X} has {canonization status} as {Catholic saint} ?
 SPARQL: SELECT ?value WHERE { wd:Q43739 p:P411 ?s . ?s ps:P411 wd:Q3464126 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Pius X', 'p': 'canonization status', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'canonization status', 'o': 'Catholic saint'}, 't': '?x0'}

 Q: Which is the Nobel prize ID of André Gide?
 SPARQL: select distinct ?answer where { wd:Q47484 wdt:P3188 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'André Gide', 'p': 'Nobel prize ID', 'o': '?x0'}

 Q: Which is the name in kana of Akira?
 SPARQL: select distinct ?answer where { wd:Q1905968 wdt:P1814 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Akira', 'p': 'name in kana', 'o': '?x0'}

 Q: what is the {start time} for {Berenice Abbott} has {educated at} as {Ohio State University} ?
 SPARQL: SELECT ?value WHERE { wd:Q231861 p:P69 ?s . ?s ps:P69 wd:Q309331 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Berenice Abbott', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Ohio State University'}}}

 Q: how many sexual orientations are bisexual?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P91 wd:Q43200 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sexual orientation', 'o': 'bisexual'}

 Q: What is {environment} of {Street Fighter}, that has {comes before} is {PlayStation 4} ?
 SPARQL: SELECT ?answer WHERE { wd:Q288035 wdt:P400 ?answer . ?answer wdt:P156 wd:Q5014725}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Street Fighter', 'p': 'environment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'comes before', 'o': 'PlayStation 4'}}

 Q: Who was the film starring in the movie Happy Days, the birth place for the movie was in Los Angeles
 SPARQL: SELECT ?answer WHERE { wd:Q518589 wdt:P161 ?answer . ?answer wdt:P19 wd:Q65}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Happy Days', 'p': 'starring', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'birth place', 'o': 'Los Angeles'}}

 Q: What is safety classification and labelling of ferrous sulfate anhydrous, that has publishing house National Fire Protection Association has published?
 SPARQL: SELECT ?answer WHERE { wd:Q214863 wdt:P4952 ?answer . ?answer wdt:P123 wd:Q1806416}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'ferrous sulfate', 'p': 'safety classification and labelling', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'publishing house', 'o': 'National Fire Protection Association'}}

 Q: Is it true that Zoroastrianism was the main regulatory text for the Prayer of Bahman Yasht?
 SPARQL: ASK WHERE { wd:Q9601 wdt:P92 wd:Q4842666 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Zoroastrianism', 'p': 'main regulatory text', 'o': '?x0', '?x0': 'Bahman Yasht'}]

 Q: What is the religion and sex of Hugh Laurie?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q49017 wdt:P140 ?ans_1 . wd:Q49017 wdt:P21 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hugh Laurie', 'p': 'religion', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hugh Laurie', 'p': 'sex', 'o': '?x1'}]

 Q: what is the {statement is subject of} for {Mel Gibson} has {award received} as {Academy Award for Best Picture} ?
 SPARQL: SELECT ?value WHERE { wd:Q42229 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mel Gibson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Picture'}}}

 Q: Did {Eva_Braun} {sibling} {Gretl Braun} and {Ilse Braun} ?
 SPARQL: ASK WHERE { wd:Q76433 wdt:P3373 wd:Q1165052 . wd:Q76433 wdt:P3373 wd:Q6001165 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Eva Braun', 'p': 'sibling', 'o': '?x0', '?x0': 'Gretl Braun'}, {'h': 'IS', 'v': '?x1', 's': 'Eva Braun', 'p': 'sibling', 'o': '?x1', '?x1': 'Ilse Braun'}]

 Q: What is {noble title} of {Godfrey of Bouillon} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q76721 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Godfrey of Bouillon', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Godfrey of Bouillon', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is {granted by} of {nomination received} of {Thomas Hardy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q132805 wdt:P1411 ?X . ?X wdt:P1027 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'granted by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Hardy', 'p': 'nomination received', 'o': '$y0'}}

 Q: What is {diplomatic relation} of {comes from} of {White Christmas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1131761 wdt:P495 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'White Christmas', 'p': 'comes from', 'o': '$y0'}}

 Q: What was the population of Maryland in 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q1391 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maryland', 'p': 'population', 'o': '?x0', 't': '1980'}

 Q: Give me {performing arts genre} that {used by} {dancing} and which contains the word {dance} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj wdt:P1535 wd:Q43393537 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dance')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'performing arts genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'used by', 'o': 'dancing'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dance'}}

 Q: what is the {start time} for {Gloria Swanson} has {spouse} as {Wallace Beery} ?
 SPARQL: SELECT ?value WHERE { wd:Q229232 p:P26 ?s . ?s ps:P26 wd:Q322179 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gloria Swanson', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Wallace Beery'}}}

 Q: What is {owned by} of {Oracle Corporation} that is {proportion} is {0.0306} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19900 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P1107 ?x filter(contains(?x,'0.0306')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owned by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oracle Corporation', 'p': 'owned by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'proportion', 'o': '0.0306'}}}

 Q: Which solar calendar contains the word calendar in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210953 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'calendar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'solar calendar'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'calendar'}}

 Q: How many {natural product of taxon} are to/by {Pinus} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1582 wd:Q12024 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'natural product of taxon', 'o': 'Pinus'}

 Q: Give me {taxon} that {has fruit type} {capsule} and which that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj wdt:P4000 wd:Q147768 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has fruit type', 'o': 'capsule'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: what is the {end time} for {Alexander Pope} has {country of citizenship} as {Kingdom of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q164047 p:P27 ?s . ?s ps:P27 wd:Q179876 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Pope', 'p': 'country of citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country of citizenship', 'o': 'Kingdom of England'}}}

 Q: What is {open days} of {British Museum} and {open period to}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3028 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'open period to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'open days', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0'}}]

 Q: What is {presented by} of {series} of {American Idol, season 1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q655900 wdt:P179 ?X . ?X wdt:P371 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'presented by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'American Idol, season 1', 'p': 'series', 'o': '$y0'}}

 Q: What is the {secular state} with the {MAX(total fertility rate)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q859563 . ?ent wdt:P4841 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total fertility rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'secular state'}}

 Q: What is succeeds to part of work of Very Ape ?
 SPARQL: SELECT ?answer WHERE { wd:Q9093082 wdt:P1433 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'succeeds to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Very Ape', 'p': 'part of work', 'o': '$y0'}}

 Q: A solid is what phase of matter?
 SPARQL: select distinct ?answer where { ?answer wdt:P515 wd:Q11438}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'phase of matter', 'o': 'solid'}

 Q: What is {slogan} of {working for} {Vilfredo Pareto} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11031 wdt:P108 ?X . ?X wdt:P1451 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'slogan', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vilfredo Pareto', 'p': 'working for', 'o': '$y0'}}

 Q: Which is the OSM tag or key for castle?
 SPARQL: select distinct ?answer where { wd:Q23413 wdt:P1282 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'castle', 'p': 'OSM tag', 'o': '?x0'}

 Q: What is the {human} for {child} of {Nargis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P40 wd:Q159169 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child', 'o': 'Nargis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the governing body of Aktobe located at street address улица Т. Ахтанова, 50?
 SPARQL: SELECT ?answer WHERE { wd:Q477232 wdt:P797 ?answer . ?answer wdt:P969 ?x FILTER(contains(?x,'улица Т. Ахтанова, 50'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aktobe', 'p': 'governing body', 'o': '?x0'}

 Q: which work place split from Pierre Puvis de Chavannes?
 SPARQL: SELECT ?answer WHERE { wd:Q216873 wdt:P937 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'split from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pierre Puvis de Chavannes', 'p': 'work place', 'o': '$y0'}}

 Q: Which character from Mario wasn´t in Super Mario?
 SPARQL: SELECT ?obj WHERE { wd:Q12379 p:P2868 ?s . ?s ps:P2868 ?obj . ?s pq:P642 wd:Q4802838 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mario', 'p': 'as', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Super Mario'}}}

