 Q: what is the {image} for {Virat Kohli} has {country for sport} as {India} ?
 SPARQL: SELECT ?value WHERE { wd:Q213854 p:P1532 ?s . ?s ps:P1532 wd:Q668 . ?s pq:P18 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'image', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Virat Kohli', 'p': 'country for sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country for sport', 'o': 'India'}}}

 Q: What is the {literary award} for {nominated for} of {Terry Pratchett}
 SPARQL:  select distinct ?obj where { wd:Q46248 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q378427 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Terry Pratchett', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary award'}}

 Q: What is {worked at} of {authors} of {William Morris and Morris & Co.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q54104312 wdt:P50 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'worked at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Morris and Morris & Co.', 'p': 'author', 'o': '$y0'}}

 Q: What is {nominated for} of {Warren Beatty} that is {for work} is {Heaven Can Wait} ?
 SPARQL: SELECT ?obj WHERE { wd:Q95030 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q637180 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Warren Beatty', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Heaven Can Wait'}}}

 Q: Is Mary Ball Washington mother of George Washington?
 SPARQL: ASK WHERE { wd:Q23 wdt:P25 wd:Q458119 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'George Washington', 'p': 'mother', 'o': '?x0', '?x0': 'Mary Ball Washington'}]

 Q: When did Hannes Alfvén cease to be a member of the Royal Swedish Academy of Engineering Sciences?
 SPARQL: SELECT ?value WHERE { wd:Q54945 p:P463 ?s . ?s ps:P463 wd:Q3394637 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hannes Alfvén', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Royal Swedish Academy of Engineering Sciences'}}}

 Q: Are the total points in the career of Mikko Jokela less than 0?
 SPARQL: ASK WHERE { wd:Q119866 wdt:P6544 ?obj filter(?obj < 0.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Mikko Jokela', 'p': 'total points in career', 'o': '?x0', '?x0': '0.0'}

 Q: What is {region} of {recording studio} of {The Dark Side of the Moon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q150901 wdt:P483 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Dark Side of the Moon', 'p': 'studio', 'o': '$y0'}}

 Q: What head of national government is in the town of Narmada?
 SPARQL: SELECT ?answer WHERE { wd:Q234004 wdt:P131 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'head of national government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Narmada', 'p': 'is in the town of', 'o': '$y0'}}

 Q: What is {this taxon is the source of} of {cattle}, that has {pronunciation audio} is {Uk-яловичина.ogg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q830 wdt:P1672 ?answer . ?answer wdt:P443 ?x FILTER(contains(?x,'Uk-яловичина.ogg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cattle', 'p': 'this taxon is the source of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'pronunciation audio', 'o': 'uk-яловичина.ogg'}}

 Q: what is the {statement is subject of} for {Tennessee Williams} has {nominated for} as {Academy Award for Best Writing, Adapted Screenplay} ?
 SPARQL: SELECT ?value WHERE { wd:Q134262 p:P1411 ?s . ?s ps:P1411 wd:Q107258 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tennessee Williams', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Writing, Adapted Screenplay'}}}

 Q: what is the {point in time} for {J. R. R. Tolkien} has {nominated for} as {Locus Award for Best Fantasy Novel} ?
 SPARQL: SELECT ?value WHERE { wd:Q892 p:P1411 ?s . ?s ps:P1411 wd:Q607354 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tolkien', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Locus Award for Best Fantasy Novel'}, 't': '?x0'}

 Q: What is the {utility software} for {operating system} of {MS-DOS}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q312466 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'OS', 'o': 'MS-DOS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'utility software'}}

 Q: What is {ZIP+4} of {active in} of {David Ricardo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q160270 wdt:P937 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ZIP+4', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Ricardo', 'p': 'active in', 'o': '$y0'}}

 Q: what is the {start time} for {R.E.M.} has {record label} as {Hib-Tone} ?
 SPARQL: SELECT ?value WHERE { wd:Q134969 p:P264 ?s . ?s ps:P264 wd:Q3512782 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'R.E.M.', 'p': 'record label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record label', 'o': 'Hib-Tone'}}}

 Q: Is Nokia's operating income -1.1 billion?
 SPARQL: ASK WHERE { wd:Q1418 wdt:P3362 ?obj filter(?obj = -1100000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nokia', 'p': 'operating income', 'o': '?x0', '?x0': '-1100000000'}

 Q: David Ben-Gurion was the signatory of which historical document?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1891 wd:Q37610 . ?sbj wdt:P31 wd:Q3771738 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'signatory', 'o': 'David Ben-Gurion', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical document'}}

 Q: what is the {end time} for {William Shatner} has {spouse} as {Nerine Kidd} ?
 SPARQL: SELECT ?value WHERE { wd:Q16297 p:P26 ?s . ?s ps:P26 wd:Q1529685 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Shatner', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Nerine Kidd'}}}

 Q: How much language is in Dutch?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1412 wd:Q7411 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'language', 'o': 'Dutch'}

 Q: What is {educated at} of {Maximilien Robespierre} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q44197 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maximilien Robespierre', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maximilien Robespierre', 'p': 'educated at', 'o': '$y0'}}]

 Q: Which is the economic branch that has motor vehicle as a product and contains the word automotive in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q268592 . ?sbj wdt:P1056 wd:Q752870 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'automotive')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'product', 'o': 'motor vehicle'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'automotive'}}

 Q: What is {role model} of {musical artist} of {Needles} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6039366 wdt:P175 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role model', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Needles', 'p': 'artist', 'o': '$y0'}}

 Q: What is SureChEMBL ID for DL-fructose?
 SPARQL: select distinct ?answer where { wd:Q122043 wdt:P2877 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fructose', 'p': 'SureChEMBL ID', 'o': '?x0'}

 Q: What is  in the panorama view of Jerusalem ?
 SPARQL: select distinct ?answer where { wd:Q1218 wdt:P4291 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jerusalem', 'p': 'panorama view', 'o': '?x0'}

 Q: When did Bochum have a population of 341,935?
 SPARQL: SELECT ?value WHERE { wd:Q2103 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'341935.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Bochum', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '341935.0'}, 't': '?x0'}

 Q: What is the noble title of Louis II of Italy and who is he followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q215204 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0'}}]

 Q: Which is the crown colony of the British Empire that follows Hong Kong?
 SPARQL:  select distinct ?obj where { wd:Q8646 wdt:P155 ?obj . ?obj wdt:P31 wd:Q1351282 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hong Kong', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'crown colony'}}

 Q: When did scholarly article for published in of Rolling Stone?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q13442814 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'Rolling Stone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scholarly article'}}

 Q: Who created the fictional universe of Doctor Doom?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q430178 wdt:P170 ?ans_1 . wd:Q430178 wdt:P1080 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Doctor Doom', 'p': 'created', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Doctor Doom', 'p': 'universe', 'o': '?x1'}]

 Q: What is the {classification in sports} for {competition class} of {high jump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2094 wd:Q165704 . ?sbj wdt:P31 wd:Q1744559 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'competition class', 'o': 'high jump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'classification in sports'}}

 Q: What was the population of Piraeus in 2001?
 SPARQL: SELECT ?obj WHERE { wd:Q58976 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Piraeus', 'p': 'population', 'o': '?x0', 't': '2001'}

 Q: Which is the television character owner of which is Toby and that starts with the letter h?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773317 . ?sbj wdt:P1830 wd:Q20822927 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'Toby'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: Which is the IMA Number, broad sense of diopside?
 SPARQL: select distinct ?answer where { wd:Q316671 wdt:P484 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'diopside', 'p': 'IMA Number, broad sense', 'o': '?x0'}

 Q: What is <solves> of <Schrödinger equation> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2159 wd:Q165498}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'solves', 'o': 'Schrödinger equation'}

 Q: Who is the developer of C?
 SPARQL: select distinct ?answer where { wd:Q15777 wdt:P178 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'C', 'p': 'developer', 'o': '?x0'}

 Q: What is {resting place} of {Melvin Purvis}, that has {executive branch} is {Government of South Carolina} ?
 SPARQL: SELECT ?answer WHERE { wd:Q765838 wdt:P119 ?answer . ?answer wdt:P208 wd:Q53709977}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Melvin Purvis', 'p': 'resting place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'executive branch', 'o': 'Government of South Carolina'}}

 Q: What are theOlympic sport which start with the letter weightlifting
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weightlifting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Olympic sport'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'weightlifting'}}

 Q: What domain is doctoral supervisor of Yurii Vladimirovich Egorov?
 SPARQL: SELECT ?answer WHERE { wd:Q23655951 wdt:P184 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'domain', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yurii Vladimirovich Egorov', 'p': 'doctoral supervisor', 'o': '$y0'}}

 Q: What is the Carnegie Classification of Institutions of Higher Education of the the school attended by Renee Zellweger?
 SPARQL: SELECT ?answer WHERE { wd:Q122614 wdt:P69 ?X . ?X wdt:P2643 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Carnegie Classification of Institutions of Higher Education', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Renee Zellweger', 'p': 'school attended', 'o': '$y0'}}

 Q: What is {birth city} of {Jacques Anquetil}, that has {twin city} is {Osica de Sus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q221001 wdt:P19 ?answer . ?answer wdt:P190 wd:Q2719507}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacques Anquetil', 'p': 'birth city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Osica de Sus'}}

 Q: How many mobile country codes are in the USA?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q30 wdt:P2258 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'USA', 'p': 'mobile country code', 'o': '?x0'}

 Q: Is the compressive modulus of elasticity of copper greater than 120.0?
 SPARQL: ASK WHERE { wd:Q753 wdt:P5993 ?obj filter(?obj > 120.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'copper', 'p': 'compressive modulus of elasticity', 'o': '?x0', '?x0': '120.0'}

 Q: What is the population of Tacloban in 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q40626 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tacloban', 'p': 'population', 'o': '?x0', 't': '1980'}

 Q: What is {educated at} of {Rajneesh} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q148285 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rajneesh', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rajneesh', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {public office} for {office held by head of government} of {Khyber Pakhtunkhwa}
 SPARQL:  select distinct ?obj where { wd:Q183314 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q294414 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Khyber Pakhtunkhwa', 'p': 'office held by head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public office'}}

 Q: Tell me holiday whose name has the word дан  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1445650 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'дан')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'holiday'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'дан'}}

 Q: What is {member of sports team} of {Hristo Stoichkov} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q187125 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hristo Stoichkov', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hristo Stoichkov', 'p': 'team', 'o': '$y0'}}]

 Q: is the maximum frequency of audible sound of house cat equal to 64000?
 SPARQL: ASK WHERE { wd:Q146 wdt:P3465 ?obj filter(?obj = 64000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'house cat', 'p': 'maximum frequency of audible sound', 'o': '?x0', '?x0': '64000'}

 Q: What is {operating income} of {ExxonMobil} that is {point in time} is {2014-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q156238 p:P3362 ?s . ?s ps:P3362 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'ExxonMobil', 'p': 'operating income', 'o': '?x0', 't': '2014'}

 Q: Did {Lauryn_Hill} {genre} {disco} and {neo soul} ?
 SPARQL: ASK WHERE { wd:Q214226 wdt:P136 wd:Q58339 . wd:Q214226 wdt:P136 wd:Q268253 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lauryn Hill', 'p': 'genre', 'o': '?x0', '?x0': 'disco'}, {'h': 'IS', 'v': '?x1', 's': 'Lauryn Hill', 'p': 'genre', 'o': '?x1', '?x1': 'neo soul'}]

 Q: What is the lib.reviews ID for the Nintendo Switch?
 SPARQL: select distinct ?answer where { wd:Q19610114 wdt:P3308 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nintendo Switch', 'p': 'lib.reviews ID', 'o': '?x0'}

 Q: What is coat of arms image of Liechtenstein ?
 SPARQL: select distinct ?answer where { wd:Q347 wdt:P94 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Liechtenstein', 'p': 'coat of arms image', 'o': '?x0'}

 Q: Whose {wife} {has sons} of {Cecil Coward} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18529681 wdt:P40 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'wife', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cecil Coward', 'p': 'son', 'o': '$y0'}}

 Q: When did Carrie Fisher get married to Paul Simon?
 SPARQL: ASK WHERE { wd:Q108941 wdt:P26 wd:Q4028 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Carrie Fisher', 'p': 'married to', 'o': '?x0', '?x0': 'Paul Simon'}]

 Q: Did Mikko Lehtonen complete more than 2 total shots in their career?
 SPARQL: ASK WHERE { wd:Q59951 wdt:P6543 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Mikko Lehtonen', 'p': 'total shots in career', 'o': '?x0', '?x0': '2'}

 Q: What is {winner} and {followed by} of {{Animal Farm} has {award received} as {Prometheus Award - Hall of Fame}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q1396889 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P1346 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Animal Farm', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Prometheus Award - Hall of Fame'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Animal Farm', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Prometheus Award - Hall of Fame'}}}]

 Q: On what continent is Constantinople with the banner name "Ladakh banner.jpg"?
 SPARQL: SELECT ?answer WHERE { wd:Q16869 wdt:P30 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Ladakh banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Constantinople', 'p': 'continent', 'o': '?x0'}

 Q: what is the {start time} for {Mexico City} has {twinned administrative body} as {Dolores Hidalgo Municipality} ?
 SPARQL: SELECT ?value WHERE { wd:Q1489 p:P190 ?s . ?s ps:P190 wd:Q958153 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mexico City', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Dolores Hidalgo Municipality'}}}

 Q: How many genetic associations are with the {colorectal cancer} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2293 wd:Q188874 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'colorectal cancer'}

 Q: Which is a lifestyle of mysticism?
 SPARQL: select distinct ?answer where { ?answer wdt:P1576 wd:Q45996}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'lifestyle', 'o': 'mysticism'}

 Q: Which does not have part in air force?
 SPARQL: select distinct ?answer where { ?answer wdt:P3113 wd:Q61883}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'does not have part', 'o': 'air force'}

 Q: What is Wang Yangming's Stanford Encyclopedia of Philosophy ID?
 SPARQL: select distinct ?answer where { wd:Q378462 wdt:P3123 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wang Yangming', 'p': 'Stanford Encyclopedia of Philosophy ID', 'o': '?x0'}

 Q: what is the {point in time} for {Linus Torvalds} has {award received} as {doctor honoris causa} ?
 SPARQL: SELECT ?value WHERE { wd:Q34253 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Linus Torvalds', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'honorary doctor'}, 't': '?x0'}

 Q: Tell me sex whose name has the word organism in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'organism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sex'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'organism'}}

 Q: Which termini is connected with Tokyo Metropolitan Road Route 418?
 SPARQL: SELECT ?answer WHERE { wd:Q11103016 wdt:P2789 ?X . ?X wdt:P559 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'termini', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tokyo Metropolitan Road Route 418', 'p': 'connected with', 'o': '$y0'}}

 Q: What is <National Academy of Sciences member ID> of <Noam Chomsky> ?
 SPARQL: select distinct ?answer where { wd:Q9049 wdt:P5380 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Noam Chomsky', 'p': 'National Academy of Sciences member ID', 'o': '?x0'}

 Q: Give me {survival skill} that contains the word {swimming} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'swimming')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'survival skill'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'swimming'}}

 Q: Which is the J.League manager ID for Zico?
 SPARQL: select distinct ?answer where { wd:Q47526 wdt:P4048 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zico', 'p': 'J.League manager ID', 'o': '?x0'}

 Q: Which is the Guardiana ID for Dune II?
 SPARQL: select distinct ?answer where { wd:Q596631 wdt:P4710 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dune II', 'p': 'Guardiana ID', 'o': '?x0'}

 Q: Is 509.6 the wingspan of the DH-4?
 SPARQL: ASK WHERE { wd:Q56881060 wdt:P2050 ?obj filter(?obj = 509.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'DH-4', 'p': 'wingspan', 'o': '?x0', '?x0': '509.5'}

 Q: Tell me commandment whose name has the word tithe in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497090 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tithe')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commandment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tithe'}}

 Q: What is {cases} of {language native} of {John Adams} ?
 SPARQL: SELECT ?answer WHERE { wd:Q84114 wdt:P103 ?X . ?X wdt:P2989 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cases', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Adams', 'p': 'native language', 'o': '$y0'}}

 Q: what is located in the administrative territorial entity for Huawei has headquarters location as Shenzhen ?
 SPARQL: SELECT ?value WHERE { wd:Q160120 p:P159 ?s . ?s ps:P159 wd:Q15174 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Huawei', 'p': 'headquarters location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'headquarters location', 'o': 'Shenzhen'}}}

 Q: What is a mathematical model that starts with the letter t.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486902 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mathematical model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Who is Imran Khan's significant other, whose gender is female?
 SPARQL: SELECT ?answer WHERE { wd:Q155164 wdt:P451 ?answer . ?answer wdt:P21 wd:Q6581072}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Imran Khan', 'p': 'significant other', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'gender', 'o': 'female'}}

 Q: What is the {alkanol} for {material used} of {vinegar}
 SPARQL:  select distinct ?obj where { wd:Q41354 wdt:P186 ?obj . ?obj wdt:P31 wd:Q11685431 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'vinegar', 'p': 'material used', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alkanol'}}

 Q: What is the {road bridge} for {location} of {Manhattan}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q11299 . ?sbj wdt:P31 wd:Q537127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Manhattan', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road bridge'}}

 Q: What is <position played on team / speciality> of <long-distance running> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P413 wd:Q917206}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'position played on team / speciality', 'o': 'long-distance running'}

 Q: Which is the aircraft family that it is operated by Qantas?
 SPARQL:  select distinct ?obj where { wd:Q32491 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056993 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Qantas', 'p': 'operated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: Which are the characters of the edition of La Divine Comédie?
 SPARQL: SELECT ?answer WHERE { wd:Q21191003 wdt:P629 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'La Divine Comédie', 'p': 'edition of', 'o': '$y0'}}

 Q: Which is the transcontinental country for the location of the French invasion of Russia?
 SPARQL:  select distinct ?obj where { wd:Q179250 wdt:P276 ?obj . ?obj wdt:P31 wd:Q1323642 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'French invasion of Russia', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'transcontinental country'}}

 Q: When did award received of Adolf von Baeyer and prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q57078 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adolf von Baeyer', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adolf von Baeyer', 'p': 'award received', 'o': '$y0'}}]

 Q: Who is the ancestor of the record producer from The Thrill Chaser?
 SPARQL: SELECT ?answer WHERE { wd:Q7769131 wdt:P162 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ancestor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Thrill Chaser', 'p': 'producer', 'o': '$y0'}}

 Q: What are the nonprofit organization which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163740 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonprofit organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: what award received by Andrew Wiles on 20-16-0-0 ?
 SPARQL: SELECT ?obj WHERE { wd:Q184433 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrew Wiles', 'p': 'award received', 'o': '?x0', 't': '2016'}

 Q: Which are the plays of the record producer of Your Man?
 SPARQL: SELECT ?answer WHERE { wd:Q8058873 wdt:P162 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'plays', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Your Man', 'p': 'producer', 'o': '$y0'}}

 Q: Which is the Nobel Prize People Nomination ID of Robert Lowell?
 SPARQL: select distinct ?answer where { wd:Q981448 wdt:P3360 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Lowell', 'p': 'Nobel Prize People Nomination ID', 'o': '?x0'}

 Q: Who is the subsidiary company make the maker My Little Pony?
 SPARQL: SELECT ?answer WHERE { wd:Q1071312 wdt:P176 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'My Little Pony', 'p': 'maker', 'o': '$y0'}}

 Q: What is {has states} of {Maranhão}, that has {co-ordinate location} is {-44.9333} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42362 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-44.9333'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maranhao', 'p': 'has states', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'co-ordinate location', 'o': '-44.9333'}}

 Q: What is the {country} for {country of origin} of {The Star-Spangled Banner}
 SPARQL:  select distinct ?obj where { wd:Q44696 wdt:P495 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Star-Spangled Banner', 'p': 'country of origin', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is {connector} of {Nintendo Switch} that is {title} is {Dock} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19610114 p:P2935 ?s . ?s ps:P2935 ?obj . ?s pq:P1476 ?x filter(contains(?x,'Dock')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'connector', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nintendo Switch', 'p': 'connector', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'title', 'o': 'dock'}}}

