 Q: What is {followed by} and {follows} of {{Louis the Pious} has {noble title} as {emperor of Occident}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q23906200 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}]

 Q: What software version of Perl was published on October 1st, 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q42478 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Perl', 'p': 'version', 'o': '?x0', 't': '2014'}

 Q: What is {is owned by} of {owns} of {Dalian Hexing} ?
 SPARQL: SELECT ?answer WHERE { wd:Q36340882 wdt:P1830 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owned by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dalian Hexing', 'p': 'owns', 'o': '$y0'}}

 Q: What are sculptors of quantum mechanics that have worked at Humboldt University of Berlin?
 SPARQL: SELECT ?answer WHERE { wd:Q944 wdt:P170 ?answer . ?answer wdt:P108 wd:Q152087}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'quantum mechanics', 'p': 'sculptor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worked at', 'o': 'Humboldt University of Berlin'}}

 Q: What are the kingdom which start with the letter zakhara
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q417175 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zakhara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kingdom'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zakhara'}}

 Q: What is {sibling} of {Mary Shelley} that is {type of kinship} is {maternal half-sister} ?
 SPARQL: SELECT ?obj WHERE { wd:Q47152 p:P3373 ?s . ?s ps:P3373 ?obj . ?s pq:P1039 wd:Q19595229 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mary Shelley', 'p': 'sister', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'maternal half-sister'}}}

 Q: In how many fields did Simone de Beauvoir work?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q7197 wdt:P101 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Simone de Beauvoir', 'p': 'fields', 'o': '?x0'}

 Q: What region is adjacent to the Battle of Fontenoy?
 SPARQL: SELECT ?answer WHERE { wd:Q569953 wdt:P276 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'adjacent to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of Fontenoy', 'p': 'location', 'o': '$y0'}}

 Q: How many {film crew member} are for {Snow White and the Seven Dwarfs} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q134430 wdt:P3092 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Snow White and the Seven Dwarfs', 'p': 'film crew member', 'o': '?x0'}

 Q: What is the consumer price index inflation rate for the state of Jambi Province?
 SPARQL: SELECT ?answer WHERE { wd:Q2051 wdt:P17 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jambi', 'p': 'state', 'o': '$y0'}}

 Q: What is <activity policy in this place> of <Museum of Fine Arts, Boston> ?
 SPARQL: select distinct ?answer where { wd:Q49133 wdt:P5023 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Museum of Fine Arts', 'p': 'activity policy in this place', 'o': '?x0'}

 Q: Who did C.S. Lewis marry  on 1-1-1956?
 SPARQL: SELECT ?obj WHERE { wd:Q9204 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'C.S. Lewis', 'p': 'marry', 'o': '?x0', 't': '1956'}

 Q: Give the mortality rate which has the strongest incidence in Finland.
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q58702 . ?ent wdt:P2844 ?obj . ?ent wdt:P276 wd:Q33 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'incidence', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mortality rate', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Finland'}}}

 Q: Which chemical compound has the most explosive speed?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'explosive velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What are the mineral acid that starts with the letter a
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408683 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral acid'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: What is {etymology} of {Poisson distribution}, that has {famous books} is {Poisson's equation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q205692 wdt:P138 ?answer . ?answer wdt:P800 wd:Q827688}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Poisson distribution', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'famous books', 'o': "Poisson's equation"}}

 Q: Give me {military order} that {allegiance} {Holy Roman Emperor} and which contains the word {knights} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj wdt:P945 wd:Q181765 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'knights')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military order', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'allegiance', 'o': 'Holy Roman Emperor'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'knights'}}

 Q: Give me {sport} that {sports discipline competed in} {beach handball} and which contains the word {handball} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q349 . ?sbj wdt:P2416 wd:Q535116 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'handball')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sports discipline competed in', 'o': 'beach handball'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'handball'}}

 Q: Which is Soccerdonna player ID for Ellyse Perry?
 SPARQL: select distinct ?answer where { wd:Q600090 wdt:P4381 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ellyse Perry', 'p': 'Soccerdonna player ID', 'o': '?x0'}

 Q: Is the number of seats of the Senate of Palau greater than 10.8?
 SPARQL: ASK WHERE { wd:Q969494 wdt:P1342 ?obj filter(?obj > 10.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Senate of Palau', 'p': 'number of seats', 'o': '?x0', '?x0': '10.8'}

 Q: What is the {Tour de France} for {participant of} of {Lance Armstrong}
 SPARQL:  select distinct ?obj where { wd:Q2172 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q33881 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lance Armstrong', 'p': 'participant of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Tour de France'}}

 Q: What is the lagoon with the lowest residence time of water whose country is Chile?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q187223 . ?ent wdt:P3020 ?obj . ?ent wdt:P17 wd:Q298} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'residence time of water', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lagoon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Chile'}}}

 Q: What is <topic's main Wikimedia portal> of <Judaism> ?
 SPARQL: select distinct ?answer where { wd:Q9268 wdt:P1151 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Judaism', 'p': "topic's main Wikimedia portal", 'o': '?x0'}

 Q: which process starts with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3249551 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'process'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which is the temporal range end for Quaternary?
 SPARQL: select distinct ?answer where { ?answer wdt:P524 wd:Q26185}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'temporal range end', 'o': 'Quaternary'}

 Q: Did {Larry_Bird} {award received} {NBA Rookie of the Year Award} and {National Basketball Association} ?
 SPARQL: ASK WHERE { wd:Q190152 wdt:P166 wd:Q644357 . wd:Q190152 wdt:P166 wd:Q155223 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Larry Bird', 'p': 'award received', 'o': '?x0', '?x0': 'NBA Rookie of the Year Award'}, {'h': 'IS', 'v': '?x1', 's': 'Larry Bird', 'p': 'award received', 'o': '?x1', '?x1': 'National Basketball Association'}]

 Q: What is {pronunciation audio} of {Triticum aestivum} that is {language of work or name} is {Swedish} ?
 SPARQL: SELECT ?obj WHERE { wd:Q161098 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q9027 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Triticum aestivum', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'Swedish'}}}

 Q: Which is the chemical substance which starts with the letter z?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q79529 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical substance'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Is the vapor pressure of ethylene glycol monoethyl ether 4?
 SPARQL: ASK WHERE { wd:Q209381 wdt:P2119 ?obj filter(?obj = 4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'ethylene glycol monoethyl ether', 'p': 'vapor pressure', 'o': '?x0', '?x0': '4'}

 Q: What is the {human} for {professional or sports partner} of {Matt Stone}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1327 wd:Q44410 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports partner', 'o': 'Matt Stone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {logographic writing system} for {writing system} of {Chinese}
 SPARQL:  select distinct ?obj where { wd:Q7850 wdt:P282 ?obj . ?obj wdt:P31 wd:Q3953107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chinese', 'p': 'writing system', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'logographic system'}}

 Q: what is the {for work} for {Henry Louis Gates} has {award received} as {American Book Awards} ?
 SPARQL: SELECT ?value WHERE { wd:Q561458 p:P166 ?s . ?s ps:P166 wd:Q463606 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Louis Gates', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'American Book Awards'}}}

 Q: Where is the birth place of Andrew W. Mellon located at 40.44062 -79.99589?
 SPARQL: SELECT ?answer WHERE { wd:Q446858 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'40.44062 -79.99589'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrew W. Mellon', 'p': 'birth place', 'o': '?x0'}

 Q: Give me {film production company} that contains the word {tellfilm} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762059 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tellfilm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film production company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tellfilm'}}

 Q: What is {given name} of {Wojciech Jaruzelski} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q55834 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wojciech Jaruzelski', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: What is {educated at} of {Hans Christian Andersen} that is {start time} is {1822-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5673 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1822')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hans Christian Andersen', 'p': 'educated at', 'o': '?x0', 't': '1822'}

 Q: Is Paul the Apostle most significant event conversion of Paul the Apostle and Dumb Ways to Die?
 SPARQL: ASK WHERE { wd:Q9200 wdt:P793 wd:Q901397 . wd:Q9200 wdt:P793 wd:Q58120 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Paul', 'p': 'significant event', 'o': '?x0', '?x0': 'conversion of Paul the Apostle'}, {'h': 'IS', 'v': '?x1', 's': 'Paul', 'p': 'significant event', 'o': '?x1', '?x1': 'Dumb Ways to Die'}]

 Q: When was Yukio Mishima nominated for a Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q134456 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Yukio Mishima', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: what is the {for work} for {David Mitchell} has {nominated for} as {Guardian First Book Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q40479 p:P1411 ?s . ?s ps:P1411 wd:Q153296 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Mitchell', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Guardian First Book Award'}}}

 Q: Name a road in Karachi.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q8660 . ?sbj wdt:P31 wd:Q34442 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Karachi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road'}}

 Q: IS THE MAXIMUM CAPACITY OF THE SZD 50 PUCHARCZ EQUALS 1.6
 SPARQL: ASK WHERE { wd:Q9375 wdt:P1083 ?obj filter(?obj = 1.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'SZD-50 Puchacz', 'p': 'maximum capacity', 'o': '?x0', '?x0': '1.6'}

 Q: What is the botanist author abbreviation of Robert Brown?
 SPARQL: select distinct ?answer where { wd:Q155764 wdt:P428 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Brown', 'p': 'botanist author abbreviation', 'o': '?x0'}

 Q: Give me {periodization} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q816829 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'periodization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the production process of medium grog?
 SPARQL: SELECT ?answer WHERE { wd:Q492554 wdt:P186 ?X . ?X wdt:P2079 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'production process', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'grog', 'p': 'medium', 'o': '$y0'}}

 Q: How many {distribution} are for {Team Fortress 2} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q382108 wdt:P437 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Team Fortress 2', 'p': 'distribution', 'o': '?x0'}

 Q: How many {member of political party} are for {Shigeru Yoshida} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q301804 wdt:P102 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Shigeru Yoshida', 'p': 'member of political party', 'o': '?x0'}

 Q: What is {characters} of {Nabucco} that is {voice type} is {soprano} ?
 SPARQL: SELECT ?obj WHERE { wd:Q202230 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P412 wd:Q30903 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nabucco', 'p': 'characters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'voice type', 'o': 'soprano'}}}

 Q: What is {location of birth} of {Enrique Iglesias}, that has {partner town} is {Bogotá} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47122 wdt:P19 ?answer . ?answer wdt:P190 wd:Q2841}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Enrique Iglesias', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Bogota'}}

 Q: What is the astronomical filter for Messier 7 has apparent magnitude as 3.3?
 SPARQL: SELECT ?value WHERE { wd:Q11234 p:P1215 ?s . ?s ps:P1215 ?x filter(contains(?x,'3.3')) . ?s pq:P1227 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'astronomical filter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 7', 'p': 'apparent magnitude', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'apparent magnitude', 'o': '3.3'}}}

 Q: Which is religion of Maratha Empire ?
 SPARQL: select distinct ?answer where { wd:Q83618 wdt:P140 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maratha Empire', 'p': 'religion', 'o': '?x0'}

 Q: what is the {replaced by} for {H. H. Asquith} has {position held} as {Secretary of State for the Home Department} ?
 SPARQL: SELECT ?value WHERE { wd:Q166714 p:P39 ?s . ?s ps:P39 wd:Q2484309 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'H. H. Asquith', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary of State for the Home Department'}}}

 Q: Who gave the  {sector} of {developed by} of {Ms. Pac-Man} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2141683 wdt:P178 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sector', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ms. Pac-Man', 'p': 'developed by', 'o': '$y0'}}

 Q: What is {titleholder} of {nomination received} of {Insaaf Ka Tarazu} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11000078 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'titleholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Insaaf Ka Tarazu', 'p': 'nominated for', 'o': '$y0'}}

 Q: Which is the Internet Encyclopedia of Philosophy ID of aesthetics?
 SPARQL: select distinct ?answer where { wd:Q35986 wdt:P5088 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aesthetics', 'p': 'Internet Encyclopedia of Philosophy ID', 'o': '?x0'}

 Q: How many people depicted by the {Jesus Christ} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q302 wdt:P1299 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Jesus', 'p': 'depicted by', 'o': '?x0'}

 Q: What is the {academic discipline} for {studies} of {Hebrew}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2578 wd:Q9288 . ?sbj wdt:P31 wd:Q11862829 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'Hebrew', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discipline'}}

 Q: Which is the highest judicial authority of Rhode Island?
 SPARQL: select distinct ?answer where { wd:Q1387 wdt:P209 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rhode Island', 'p': 'highest judicial authority', 'o': '?x0'}

 Q: Which is the interaction of the supersymmetric particle of quark?
 SPARQL: SELECT ?answer WHERE { wd:Q6718 wdt:P2375 ?X . ?X wdt:P517 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'interaction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'quark', 'p': 'supersymmetric particle', 'o': '$y0'}}

 Q: What is {award received} of {Toni Braxton} that is {for work} is {Love, Marriage & Divorce} ?
 SPARQL: SELECT ?obj WHERE { wd:Q155412 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q16916554 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Toni Braxton', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Love, Marriage & Divorce'}}}

 Q: Genghis Khan's noble family name is?
 SPARQL:  select distinct ?obj where { wd:Q720 wdt:P734 ?obj . ?obj wdt:P31 wd:Q13417114 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genghis Khan', 'p': 'family name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble family'}}

 Q: Which article of Z-Boys features the film director Stacy Peralta?
 SPARQL: SELECT ?answer WHERE { wd:Q191378 wdt:P805 ?answer . ?answer wdt:P57 wd:Q465229}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Z-Boys', 'p': 'article', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Stacy Peralta'}}

 Q: Is it true that Heath Ledger's ethnicity was Ulster Protestant?
 SPARQL: ASK WHERE { wd:Q40572 wdt:P172 wd:Q17017729 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Heath Ledger', 'p': 'ethnicity', 'o': '?x0', '?x0': 'Ulster Protestant'}]

 Q: What is {position held} of {Muammar al-Gaddafi} that is {end time} is {2010-1-31} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19878 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gaddafi', 'p': 'position held', 'o': '?x0', 't': '2010'}

 Q: What award did Jane Goodall receive in 2004?
 SPARQL: SELECT ?obj WHERE { wd:Q184746 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jane Goodall', 'p': 'award', 'o': '?x0', 't': '2004'}

 Q: What is the {country for sport} and the {position played on team / speciality} of {Allen_Iverson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q190094 wdt:P1532 ?ans_1 . wd:Q190094 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Allen Iverson', 'p': 'country for sport', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Allen Iverson', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: Is the standard molar entropy of sodium greater than 61.44?
 SPARQL: ASK WHERE { wd:Q658 wdt:P3071 ?obj filter(?obj > 61.44) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'sodium', 'p': 'standard molar entropy', 'o': '?x0', '?x0': '61.44'}

 Q: Did Harry Styles get his education at Ivybridge Community College?
 SPARQL: ASK WHERE { wd:Q3626966 wdt:P69 wd:Q6099982 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Harry Styles', 'p': 'education', 'o': '?x0', '?x0': 'Ivybridge Community College'}]

 Q: Tell me  a album whose name consist of the word wall and whose english is the language of work
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj wdt:P407 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wall')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'album', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language of work', 'o': 'en'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wall'}}

 Q: What are the invention which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18119757 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'invention'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: How many {language of work or name} are for {Spotify} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q689141 wdt:P407 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Spotify', 'p': 'language of work or name', 'o': '?x0'}

 Q: Did {Grover_Cleveland} {position held} {President of the United States} and {Governor of New York} ?
 SPARQL: ASK WHERE { wd:Q35171 wdt:P39 wd:Q11696 . wd:Q35171 wdt:P39 wd:Q2347975 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Grover Cleveland', 'p': 'position held', 'o': '?x0', '?x0': 'President of the US'}, {'h': 'IS', 'v': '?x1', 's': 'Grover Cleveland', 'p': 'position held', 'o': '?x1', '?x1': 'Governor of New York'}]

 Q: What is the {type of quantum particle} for {antiparticle} of {electron}
 SPARQL:  select distinct ?obj where { wd:Q2225 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'electron', 'p': 'antiparticle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: What is {from} of {coincident with} of {Japan National Route 438} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6157543 wdt:P1382 ?X . ?X wdt:P609 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Japan National Route 438', 'p': 'coincident with', 'o': '$y0'}}

 Q: What are the subculture which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'subculture'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {manifestation of} of {operated by} of {e-commerce} ?
 SPARQL: SELECT ?answer WHERE { wd:Q484847 wdt:P137 ?X . ?X wdt:P1557 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manifestation of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'e-commerce', 'p': 'operated by', 'o': '$y0'}}

 Q: What is the {human} for {conflict} of {Battle of Verdun}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P607 wd:Q130847 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'Battle of Verdun', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is the GUI toolkit of framework for iOS?
 SPARQL: select distinct ?answer where { wd:Q48493 wdt:P1414 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'iOS', 'p': 'GUI toolkit', 'o': '?x0'}

 Q: What is {date of death} of {Masaccio} that is {instance of} is {statement with Gregorian date earlier than 1584} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5811 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Masaccio', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'statement with Gregorian date earlier than 1584'}}}

 Q: Did {National_Football_League} {headquarters location} {New York City}?
 SPARQL: ASK WHERE { wd:Q1215884 wdt:P159 wd:Q60 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'NFL', 'p': 'headquarters location', 'o': '?x0', '?x0': 'New York City'}]

 Q: When did Scotland have a population of 5.3136e+06?
 SPARQL: SELECT ?value WHERE { wd:Q22 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'5.3136e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Scotland', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '5.3136e+06'}, 't': '?x0'}

 Q: What ilocation to takes part of Stanislav Cherchesov ?
 SPARQL: SELECT ?answer WHERE { wd:Q699557 wdt:P1344 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanislav Cherchesov', 'p': 'takes part', 'o': '$y0'}}

 Q: How many package management systems exist for Android?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q94 wdt:P3033 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Android', 'p': 'package management system', 'o': '?x0'}

 Q: Who was the person that was a student of Gustav Mahler?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1066 wd:Q7304 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'student of', 'o': 'Gustav Mahler', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Jock Stein} has {member of sports team} as {Scottish Football League XI}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q355378 p:P54 ?s . ?s ps:P54 wd:Q7437735 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jock Stein', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Scottish Football League XI'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jock Stein', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Scottish Football League XI'}}}]

 Q: Google has how many distributors?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P750 wd:Q95 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'distributor', 'o': 'Google'}

 Q: Who is the musical conductor of Mary Poppins?
 SPARQL: select distinct ?answer where { wd:Q209170 wdt:P3300 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mary Poppins', 'p': 'musical conductor', 'o': '?x0'}

 Q: what is the {applies to part} for {Vistula} has {coordinate location} as {54.3641} ?
 SPARQL: SELECT ?value WHERE { wd:Q548 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'54.3641')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vistula', 'p': 'co-ordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'co-ordinate location', 'o': '54.3641'}}}

 Q: What is {worked for} of {Franz Bopp}, that has {rector} is {Ernst Bumm} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76934 wdt:P108 ?answer . ?answer wdt:P1075 wd:Q90646}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Franz Bopp', 'p': 'worked for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'rector', 'o': 'Ernst Bumm'}}

