 Q: Which {MAMSL} {contains} {Sinaloa} ?
 SPARQL: SELECT ?answer WHERE { wd:Q80252 wdt:P150 ?X . ?X wdt:P2044 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'MAMSL', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sinaloa', 'p': 'contains', 'o': '$y0'}}

 Q: What is the {W3C Recommendation} for {depends on software} of {Hypertext Transfer Protocol}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1547 wd:Q8777 . ?sbj wdt:P31 wd:Q2661442 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depends on software', 'o': 'Hypertext Transfer Protocol', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'W3C Recommendation'}}

 Q: "Which is {godmother} of {Camillo Benso di Cavour}, whose {craft} is {politician} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q166092 wdt:P1290 ?answer . ?answer wdt:P106 wd:Q82955}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Camillo Benso di Cavour', 'p': 'godmother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'craft', 'o': 'politician'}}

 Q: What is the {superhero} for {sidekick of} of {Superman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2546 wd:Q79015 . ?sbj wdt:P31 wd:Q188784 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sidekick of', 'o': 'Superman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'superhero'}}

 Q: What is the {human} for {student of} of {microbiology}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1066 wd:Q7193 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'student of', 'o': 'microbiology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is <field of this occupation> of <ninja> ?
 SPARQL: select distinct ?answer where { wd:Q9402 wdt:P425 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ninja', 'p': 'field of this occupation', 'o': '?x0'}

 Q: What is the Autonomous University of Madrid's COAM structure ID?
 SPARQL: select distinct ?answer where { wd:Q788091 wdt:P2917 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Autonomous University of Madrid', 'p': 'COAM structure ID', 'o': '?x0'}

 Q: What is {diplomatic relation} of {Switzerland} that is {statement is subject of} is {Indonesia–Switzerland relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q39 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948966 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Switzerland', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Indonesia–Switzerland relations'}}}

 Q: what is the {object has role} for {Siméon Denis Poisson} has {doctoral advisor} as {Pierre-Simon Laplace} ?
 SPARQL: SELECT ?value WHERE { wd:Q190772 p:P184 ?s . ?s ps:P184 wd:Q44481 . ?s pq:P3831 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Siméon Denis Poisson', 'p': 'doctoral advisor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'doctoral advisor', 'o': 'Pierre-Simon Laplace'}}}

 Q: Which point in time for Charles Boyer has award received as Academy Honorary Award ?
 SPARQL: SELECT ?value WHERE { wd:Q105987 p:P166 ?s . ?s ps:P166 wd:Q727328 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Charles Boyer', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Honorary Award'}, 't': '?x0'}

 Q: Name a weekly newspaper based in Chicago that starts with letter O
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj wdt:P159 wd:Q1297 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weekly newspaper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'based in', 'o': 'Chicago'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: When was the 8.00102e+06 population of Virginia?
 SPARQL: SELECT ?value WHERE { wd:Q1370 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'8.00102e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Virginia', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '8.00102e+06'}, 't': '?x0'}

 Q: What is ISC event ID for 2011 Tōhoku earthquake and tsunami ?
 SPARQL: select distinct ?answer where { wd:Q36204 wdt:P5092 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '2011 Tōhoku earthquake and tsunami', 'p': 'ISC event ID', 'o': '?x0'}

 Q: What is {date of incorporation} of {genre of music} of {Exile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q655239 wdt:P136 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of incorporation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Exile', 'p': 'genre', 'o': '$y0'}}

 Q: What was Max Weber Ahre a member of during the year 1918?
 SPARQL: SELECT ?obj WHERE { wd:Q9387 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1918')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Max Weber', 'p': 'member of', 'o': '?x0', 't': '1918'}

 Q: What is {line connected to} of {next station} of {Gare du Nord} ?
 SPARQL: SELECT ?answer WHERE { wd:Q745942 wdt:P197 ?X . ?X wdt:P81 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'line connected to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gare du Nord', 'p': 'next station', 'o': '$y0'}}

 Q: What is the {book} for {notable work} of {Hillary Clinton}
 SPARQL:  select distinct ?obj where { wd:Q6294 wdt:P800 ?obj . ?obj wdt:P31 wd:Q571 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hillary Clinton', 'p': 'notable work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book'}}

 Q: What is <SRCBB player ID> of <George Mikan> ?
 SPARQL: select distinct ?answer where { wd:Q314185 wdt:P3696 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Mikan', 'p': 'SRCBB player ID', 'o': '?x0'}

 Q: Who gave the {source of inspiration} of {characters} of {Les Misérables} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1193096 wdt:P674 ?X . ?X wdt:P941 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'source of inspiration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Les Misérables', 'p': 'characters', 'o': '$y0'}}

 Q: What is the sister town of the chef-lieu of the Qajar dynasty?
 SPARQL: SELECT ?answer WHERE { wd:Q189326 wdt:P36 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Qajar dynasty', 'p': 'chef-lieu', 'o': '$y0'}}

 Q: Who is the daughter of the co-founder of King's College London?
 SPARQL: SELECT ?answer WHERE { wd:Q245247 wdt:P112 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "King's College London", 'p': 'co-founder', 'o': '$y0'}}

 Q: Where was John Kenneth Galbraith educated at and what was his academic major?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q186042 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Kenneth Galbraith', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Kenneth Galbraith', 'p': 'educated at', 'o': '$y0'}}]

 Q: When was Taha Hussein nominated for the Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q328765 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Taha Hussein', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: Who is the wife of the musical score by Freddie Freeloader?
 SPARQL: SELECT ?answer WHERE { wd:Q1452600 wdt:P86 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'wife', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Freddie Freeloader', 'p': 'musical score by', 'o': '$y0'}}

 Q: What is the {earthquake} with the {MAX(earthquake magnitude on the Richter magnitude scale)} whose {country} is {Taiwan}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2528 ?obj . ?ent wdt:P17 wd:Q865 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'earthquake magnitude on the Richter magnitude scale', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'earthquake', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Taiwan'}}}

 Q: What is the {new religious movement} for {movement} of {Rajneesh}
 SPARQL:  select distinct ?obj where { wd:Q148285 wdt:P135 ?obj . ?obj wdt:P31 wd:Q477544 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rajneesh', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'new religious movement'}}

 Q: With a total fertility rate of 1.8615, what is the event participant of the Guadalcanal Campaign?
 SPARQL: SELECT ?answer WHERE { wd:Q217145 wdt:P710 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'1.8615'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guadalcanal Campaign', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '1.8615'}}

 Q: What is {diplomatic relation} of {is in the parish of} of {Southwest China} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1190484 wdt:P131 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Southwest China', 'p': 'in', 'o': '$y0'}}

 Q: What is the {written work} for {collection} of {Bill Gates}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P195 wd:Q5284 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'collection', 'o': 'Bill Gates', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is {place of birth} of {Charlie Sheen} that is {located in the administrative territorial entity} is {New York} ?
 SPARQL: SELECT ?obj WHERE { wd:Q103939 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlie Sheen', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'NY'}}}

 Q: When was Terry Pratchett nominated for the Locus Award for Best Fantasy Novel?
 SPARQL: SELECT ?value WHERE { wd:Q46248 p:P1411 ?s . ?s ps:P1411 wd:Q607354 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Terry Pratchett', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Locus Award for Best Fantasy Novel'}, 't': '?x0'}

 Q: what is phase of the moon contains the word quarter in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26388 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'quarter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phase of the moon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'quarter'}}

 Q: What's the name of a type of dog with the word "toy" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of dog'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'toy'}}

 Q: Who is including my son?
 SPARQL: select distinct ?answer where { ?answer wdt:P1012 wd:Q177232}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'including', 'o': 'son'}

 Q: Did {Ronaldinho} {member of sports team} {Paris Saint-Germain F.C.}?
 SPARQL: ASK WHERE { wd:Q39444 wdt:P54 wd:Q483020 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ronaldinho', 'p': 'team', 'o': '?x0', '?x0': 'Paris'}]

 Q: What is {location born} of {Arcadius}, that has {member of} is {Council of Europe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q159369 wdt:P19 ?answer . ?answer wdt:P463 wd:Q8908}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arcadius', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Council of Europe'}}

 Q: which sacrament of the catholic church starts with the letter m
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3233636 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sacrament'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Is the density of the water less than 1.169832?
 SPARQL: ASK WHERE { wd:Q283 wdt:P2054 ?obj filter(?obj < 1.169832) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'water', 'p': 'density', 'o': '?x0', '?x0': '1.169832'}

 Q: What is the {human} for {movement} of {Impressionism}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P135 wd:Q40415 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'movement', 'o': 'Impressionism', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {spore print color} are to/by {tan} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P787 wd:Q1670336 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'spore print color', 'o': 'tan'}

 Q: which valley starts with v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39816 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'valley'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {prevalence} of {tuberculosis} that is {country} is {Norway} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12204 p:P1193 ?s . ?s ps:P1193 ?obj . ?s pq:P17 wd:Q20 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prevalence', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'tuberculosis', 'p': 'prevalence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Norway'}}}

 Q: What is {spouse} of {Anna Karina} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q232113 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Karina', 'p': 'marry', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'marry', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Karina', 'p': 'marry', 'o': '$y0'}}]

 Q: Which is {tributary} of {next to lake} of {Spitsbergen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21162 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Spitsbergen', 'p': 'next to lake', 'o': '$y0'}}

 Q: What was the population of Freiburg im Breisgau in 1968?
 SPARQL: SELECT ?obj WHERE { wd:Q2833 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1968')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Freiburg im Breisgau', 'p': 'population', 'o': '?x0', 't': '1968'}

 Q: Is it true that Jeremy Yablonski has not scored any goals in his career?
 SPARQL: ASK WHERE { wd:Q536720 wdt:P6509 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Jeremy Yablonski', 'p': 'total goals in career', 'o': '?x0', '?x0': '0'}

 Q: Who is {member of} of {land} of {Serie A} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15804 wdt:P17 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Serie A', 'p': 'land', 'o': '$y0'}}

 Q: What is the {Commonwealth realm} for {official language} of {English}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q1860 . ?sbj wdt:P31 wd:Q202686 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'en', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Commonwealth realm'}}

 Q: What is the {business} for {developer} of {ARM architecture}
 SPARQL:  select distinct ?obj where { wd:Q16980 wdt:P178 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ARM architecture', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is the {kingdom} for {shares border with} of {Austrian Empire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q131964 . ?sbj wdt:P31 wd:Q417175 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Austria', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kingdom'}}

 Q: What is {scientific discipline} of {discoverer} of {(229760) 2007 RM225} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8223332 wdt:P61 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '(229760) 2007 RM225', 'p': 'discoverer', 'o': '$y0'}}

 Q: What is the bilingual inscription of Egyptian hieroglyphs for writing system
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q132659 . ?sbj wdt:P31 wd:Q861809 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'Egyptian hieroglyphs', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bilingual inscription'}}

 Q: what is the {point in time} for {Jeanne Moreau} has {nominated for} as {César Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q106099 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jeanne Moreau', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'César Award for Best Actress'}, 't': '?x0'}

 Q: What award did Mohamed ElBaradei receive in the year 2008?
 SPARQL: SELECT ?obj WHERE { wd:Q133308 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mohamed ElBaradei', 'p': 'award', 'o': '?x0', 't': '2008'}

 Q: What is {pronunciation audio} of {route of administration} of {cannabis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2845 wdt:P636 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cannabis', 'p': 'route of administration', 'o': '$y0'}}

 Q: what is the {start time} for {Oulu} has {head of government} as {Ilmo Paananen} ?
 SPARQL: SELECT ?value WHERE { wd:Q47048 p:P6 ?s . ?s ps:P6 wd:Q6031942 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oulu', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Ilmo Paananen'}}}

 Q: Is the partition coefficient water/octanol of dichlorodifluirimethane less than 1.728?
 SPARQL: ASK WHERE { wd:Q423021 wdt:P2993 ?obj filter(?obj < 1.728) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'dichlorodifluoromethane', 'p': 'partition coefficient water/octanol', 'o': '?x0', '?x0': '1.728'}

 Q: What is <UGentMemorialis ID> of <Henri Pirenne> ?
 SPARQL: select distinct ?answer where { wd:Q312501 wdt:P3159 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Henri Pirenne', 'p': 'UGentMemorialis ID', 'o': '?x0'}

 Q: What is {electorate} of {Iligan} that is {point in time} is {2013-1-11} ?
 SPARQL: SELECT ?obj WHERE { wd:Q285488 p:P1831 ?s . ?s ps:P1831 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Iligan', 'p': 'electorate', 'o': '?x0', 't': '2013'}

 Q: Is the prevalence of tuberculosis less than 5.16e-06?
 SPARQL: ASK WHERE { wd:Q12204 wdt:P1193 ?obj filter(?obj < 5.16e-06) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'tuberculosis', 'p': 'prevalence', 'o': '?x0', '?x0': '5.16e-06'}

 Q: Who is {head of government} of {Düsseldorf} whose {start time} is {1820-7-19} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1718 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1820')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Düsseldorf', 'p': 'head of government', 'o': '?x0', 't': '1820'}

 Q: What is the {flag carrier} for {operator} of {Airbus A330}
 SPARQL:  select distinct ?obj where { wd:Q6478 wdt:P137 ?obj . ?obj wdt:P31 wd:Q721639 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Airbus A330', 'p': 'operator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flag carrier'}}

 Q: Who is the {asteroid} for {followed by} of {Pluto}
 SPARQL:  select distinct ?obj where { wd:Q339 wdt:P156 ?obj . ?obj wdt:P31 wd:Q3863 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pluto', 'p': 'followed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asteroid'}}

 Q: Who is the {copolymer} for {monomer of} of {ethylene}
 SPARQL:  select distinct ?obj where { wd:Q151313 wdt:P4599 ?obj . ?obj wdt:P31 wd:Q421281 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethylene', 'p': 'monomer of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'copolymer'}}

 Q: What is the {human} for {head of state} of {Inca Empire}
 SPARQL:  select distinct ?obj where { wd:Q28573 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Inca Empire', 'p': 'head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is the intended public of children's literature?
 SPARQL: select distinct ?answer where { wd:Q131539 wdt:P2360 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "children's literature", 'p': 'intended public', 'o': '?x0'}

 Q: What is {child} of {Princess Leia} that is {from fictional universe} is {Star Wars expanded to other media} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51797 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P1080 wd:Q3551295 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Princess Leia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'universe', 'o': 'Star Wars expanded to other media'}}}

 Q: What is {spouse} of {Andriy Shevchenko} and {place of marriage}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q41244 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andriy Shevchenko', 'p': 'spouse', 'o': '$y0'}}]

 Q: Which is the Minitel code of the Associated Press?
 SPARQL: select distinct ?answer where { wd:Q40469 wdt:P2878 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Associated Press', 'p': 'Minitel code', 'o': '?x0'}

 Q: which country in Beersheba  has am end time of 1917-10-31?
 SPARQL: SELECT ?obj WHERE { wd:Q41843 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1917')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Beersheba', 'p': 'country', 'o': '?x0', 't': '1917'}

 Q: What is {position held} of {Bob Hawke} and {electoral district}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q269372 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bob Hawke', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bob Hawke', 'p': 'position held', 'o': '$y0'}}]

 Q: what is the {start time} for {Montreal Canadiens} has {home venue} as {Centre Bell} ?
 SPARQL: SELECT ?value WHERE { wd:Q188143 p:P115 ?s . ?s ps:P115 wd:Q522282 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montreal Canadiens', 'p': 'home venue', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'home venue', 'o': 'Centre Bell'}}}

 Q: tell me alloy that name has the world zamak in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37756 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zamak')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alloy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zamak'}}

 Q: Which is Yahoo! Japan Talent Database ID for Jimmy Connors?
 SPARQL: select distinct ?answer where { wd:Q53393 wdt:P3284 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jimmy Connors', 'p': 'Yahoo! Japan Talent Database ID', 'o': '?x0'}

 Q: What is the binary relation that contains the word subset in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130901 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'subset')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'binary relation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'subset'}}

 Q: Which is the Track and Field Statistics female athlete ID of Florence Griffith-Joyner?
 SPARQL: select distinct ?answer where { wd:Q31082 wdt:P3924 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Florence Griffith', 'p': 'Track and Field Statistics female athlete ID', 'o': '?x0'}

 Q: What is the current translated edition of Tao Te Ching
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P629 wd:Q134425 . ?sbj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition of', 'o': 'Tao Te Ching', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'edition'}}

 Q: What is the {design of a banknote or a coin} for {currency} of {Russian ruble}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q28794013 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Russian ruble', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'design of a banknote or a coin'}}

 Q: What are the degree and field of work of Hans Bethe?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q155794 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P101 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Bethe', 'p': 'degree', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Bethe', 'p': 'degree', 'o': '$y0'}}]

 Q: What is the name of the writer of "How to Win Friends and Influence People", who died in 1955?
 SPARQL: SELECT ?answer WHERE { wd:Q960077 wdt:P50 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1955'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'How to Win Friends and Influence People', 'p': 'writer', 'o': '?x0', 't': '1955'}

 Q: wich means{ does not have part} in {province of China} ?
 SPARQL: select distinct ?answer where { wd:Q1615742 wdt:P3113 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'province of China', 'p': 'does not have part', 'o': '?x0'}

 Q: What is the gender of Diana Ross, that is not a woman?
 SPARQL: SELECT ?answer WHERE { wd:Q36290 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q467}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Diana Ross', 'p': 'gender', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is not', 'o': 'woman'}}

 Q: Which {function} is {treatment} of {postoperative complications} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18478450 wdt:P2176 ?X . ?X wdt:P2868 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'function', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'postoperative complications', 'p': 'treatment', 'o': '$y0'}}

 Q: What is the emergency phone number for Liberia?
 SPARQL: select distinct ?answer where { wd:Q1014 wdt:P2852 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Liberia', 'p': 'emergency phone number', 'o': '?x0'}

 Q: What is {known for} of {written by} of {The Dean's Answer to The Rebus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21283498 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'known for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "The Dean's Answer to The Rebus", 'p': 'written by', 'o': '$y0'}}

 Q: What is <LUMIERE director ID> of <Álex de la Iglesia> ?
 SPARQL: select distinct ?answer where { wd:Q250627 wdt:P4283 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Álex de la Iglesia', 'p': 'LUMIERE director ID', 'o': '?x0'}

 Q: what is the {point in time} for {Osamu Tezuka} has {award received} as {Iwaya Sazanami Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q193300 p:P166 ?s . ?s ps:P166 wd:Q28069010 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Osamu Tezuka', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Iwaya Sazanami Award'}, 't': '?x0'}

 Q: What is {academic degree} and {academic major} of {{Sheryl Sandberg} has {educated at} as {Harvard College}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q234653 p:P69 ?s . ?s ps:P69 wd:Q49123 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sheryl Sandberg', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard College'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sheryl Sandberg', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard College'}}}]

 Q: What partner town of Trondheim has the geotag of 61.4981?
 SPARQL: SELECT ?answer WHERE { wd:Q25804 wdt:P190 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'61.4981'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Trondheim', 'p': 'partner town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'geotag', 'o': '61.4981'}}

 Q: What is {has shires} of {Phuket}, that has {human population} is {60712.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q182565 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'60712.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Phuket', 'p': 'has shires', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '60712.0'}}

 Q: What is {member of} of {county seat for} of {Yaounde} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3808 wdt:P1376 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yaounde', 'p': 'county seat for', 'o': '$y0'}}

