 Q: What is {educated at} of {Douglas Adams} that is {academic major} is {English literature} ?
 SPARQL: SELECT ?obj WHERE { wd:Q42 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q186579 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Douglas Adams', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic major', 'o': 'English literature'}}}

 Q: What is {label} of {Jefferson Airplane}, that has {co-founder} is {Emile Berliner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q488260 wdt:P264 ?answer . ?answer wdt:P112 wd:Q71004}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jefferson Airplane', 'p': 'label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Emile Berliner'}}

 Q: Which is the objective of project or mission of the nuclear weapon?
 SPARQL: select distinct ?answer where { ?answer wdt:P3712 wd:Q12802}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'objective', 'o': 'nuclear weapon'}

 Q: What are the commune of France with specific status which start with the letter E
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'è')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France with specific status'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'è'}}

 Q: What is the legal citation for Roe v. Wade?
 SPARQL: select distinct ?answer where { wd:Q300950 wdt:P1031 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Roe v. Wade', 'p': 'citation', 'o': '?x0'}

 Q: What is the {historical country} for {replaced by} of {Kingdom of Great Britain}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1366 wd:Q161885 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Great Britain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Which is the day of week of Saturday?
 SPARQL: select distinct ?answer where { ?answer wdt:P2894 wd:Q131}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'day of week', 'o': 'Saturday'}

 Q: What geographical region and terrain feature is Thessaloniki located among?
 SPARQL:  select distinct ?obj where { wd:Q17151 wdt:P706 ?obj . ?obj wdt:P31 wd:Q82794 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thessaloniki', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'region'}}

 Q: Who stepped down as the excavation director of works in Pompeii in 1825?
 SPARQL: SELECT ?obj WHERE { wd:Q43332 p:P4345 ?s . ?s ps:P4345 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1825')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pompeii', 'p': 'excavation director', 'o': '?x0', 't': '1825'}

 Q: Give me {vegetation zone} that contains the word {taiga} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vegetation zone'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'taiga'}}

 Q: Is the price of the Kuwaiti dinar less than 3.6?
 SPARQL: ASK WHERE { wd:Q193098 wdt:P2284 ?obj filter(?obj < 3.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Kuwaiti dinar', 'p': 'price', 'o': '?x0', '?x0': '3.6'}

 Q: what is the {criterion used} for {Florence Griffith-Joyner} has {record held} as {200 metres} ?
 SPARQL: SELECT ?value WHERE { wd:Q31082 p:P1000 ?s . ?s ps:P1000 wd:Q211155 . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Florence Griffith', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': '200 meter'}}}

 Q: What is {educated at} of {Herbert Hoover} that is {start time} is {1891-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q35236 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1891')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Herbert Hoover', 'p': 'educated at', 'o': '?x0', 't': '1891'}

 Q: what is the {end time} for {Manchukuo} has {capital} as {Hsinking} ?
 SPARQL: SELECT ?value WHERE { wd:Q30623 p:P36 ?s . ?s ps:P36 wd:Q92237 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Manchukuo', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Hsinking'}}}

 Q: Give me {state of Australia} that {executive body} {Government of South Australia} and which contains the word {australia} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5852411 . ?sbj wdt:P208 wd:Q3112580 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'australia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state of Australia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'executive body', 'o': 'Government of South Australia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'australia'}}

 Q: How many {described by source} are to/by {The Times} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1343 wd:Q50008 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'described by source', 'o': 'Times'}

 Q: Who gave the {interment} of {consecrated by} of {Klaus Dick} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76132 wdt:P1598 ?X . ?X wdt:P119 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'interment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Klaus Dick', 'p': 'consecrated by', 'o': '$y0'}}

 Q: When G. Evelyn Hutchinson was awarded Kyoto Prize in Basic Sciences?
 SPARQL: SELECT ?value WHERE { wd:Q302752 p:P166 ?s . ?s ps:P166 wd:Q18344281 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'G. Evelyn Hutchinson', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Kyoto Prize in Basic Sciences'}, 't': '?x0'}

 Q: What is the {vanity label} for {manager/director} of {David Foster}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1037 wd:Q77112 . ?sbj wdt:P31 wd:Q2510436 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manager', 'o': 'David Foster', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vanity label'}}

 Q: what is the {has cause} for {Van Morrison} has {spouse} as {Michelle Rocca} ?
 SPARQL: SELECT ?value WHERE { wd:Q272203 p:P26 ?s . ?s ps:P26 wd:Q372148 . ?s pq:P828 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Van Morrison', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Michelle Rocca'}}}

 Q: Are people or cargo transported in an ambulance?
 SPARQL: select distinct ?answer where { wd:Q180481 wdt:P3437 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ambulance', 'p': 'people or cargo transported', 'o': '?x0'}

 Q: is the minimum number of players of The Settlers of Catan more than 2.4?
 SPARQL: ASK WHERE { wd:Q17271 wdt:P1872 ?obj filter(?obj > 2.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'The Settlers of Catan', 'p': 'minimum number of players', 'o': '?x0', '?x0': '2.4'}

 Q: What is <MYmovies movie ID> of <Game of Thrones> ?
 SPARQL: select distinct ?answer where { wd:Q23572 wdt:P4780 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Game of Thrones', 'p': 'MYmovies movie ID', 'o': '?x0'}

 Q: What is {twin town} of {birth location} of {George Cukor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q56014 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Cukor', 'p': 'birth location', 'o': '$y0'}}

 Q: What are list of monuments in Rennes?
 SPARQL: select distinct ?answer where { wd:Q647 wdt:P1456 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rennes', 'p': 'list of monuments', 'o': '?x0'}

 Q: What is {raw material} of {square} of {Pippinger Straße 37 (München)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18745045 wdt:P669 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'raw material', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pippinger Straße 37 (München)', 'p': 'square', 'o': '$y0'}}

 Q: Which is the chartered company is a public company in it's legal form and whose name contains the word company?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj wdt:P1454 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'company')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chartered company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'legal form', 'o': 'public company'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'company'}}

 Q: How many input methods are there for the Wii U?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q56942 wdt:P479 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Wii U', 'p': 'input method', 'o': '?x0'}

 Q: Does the width of the Hermannskarsee equal 0.12?
 SPARQL: ASK WHERE { wd:Q260850 wdt:P2049 ?obj filter(?obj = 0.12) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Hermannskarsee', 'p': 'width', 'o': '?x0', '?x0': '0.12'}

 Q: At the Wan Chai station, are there 2.4 platform faces?
 SPARQL: ASK WHERE { wd:Q15811 wdt:P5595 ?obj filter(?obj = 2.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Wan Chai station', 'p': 'platform faces', 'o': '?x0', '?x0': '2.4'}

 Q: What is <uBio ID> of <Hylidae> ?
 SPARQL: select distinct ?answer where { wd:Q53696 wdt:P4728 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hylid', 'p': 'uBio ID', 'o': '?x0'}

 Q: What is <draftexpress.com ID> of <LeBron James> ?
 SPARQL: select distinct ?answer where { wd:Q36159 wdt:P3533 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'LeBron James', 'p': 'draftexpress.com ID', 'o': '?x0'}

 Q: What is the number of points/goals/set scored for Ali Daei, the member of sports team of Saipa F.C.?
 SPARQL: SELECT ?value WHERE { wd:Q159622 p:P54 ?s . ?s ps:P54 wd:Q782983 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ali Daei', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Saipa F.C.'}}}

 Q: What is the name of the location of death for Socrates, whose governor is Marta Suplicy?
 SPARQL: SELECT ?answer WHERE { wd:Q102331 wdt:P20 ?answer . ?answer wdt:P6 wd:Q463614}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Socrates', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'governor', 'o': 'Marta Suplicy'}}

 Q: Which is the house commissioned by James Watt?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P88 wd:Q9041 . ?sbj wdt:P31 wd:Q3947 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'James Watt', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'house'}}

 Q: What team was Pele' apart of on January 1st 1957?
 SPARQL: SELECT ?obj WHERE { wd:Q12897 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pele', 'p': 'team', 'o': '?x0', 't': '1957'}

 Q: what is the {criterion used} for {September} has {series ordinal} as {9} ?
 SPARQL: SELECT ?value WHERE { wd:Q123 p:P1545 ?s . ?s ps:P1545 ?x filter(contains(?x,'9')) . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'September', 'p': 'series ordinal', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '9'}}}

 Q: What is {country of origin} of {Boney M.} that is {start time} is {1975-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q156298 p:P495 ?s . ?s ps:P495 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Boney M.', 'p': 'country of origin', 'o': '?x0', 't': '1975'}

 Q: What was approved by Fuji followed by McIntosh?
 SPARQL: SELECT ?value WHERE { wd:Q504893 p:P156 ?s . ?s ps:P156 wd:Q1144556 . ?s pq:P790 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'approved by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fuji', 'p': 'followed by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'followed by', 'o': 'McIntosh'}}}

 Q: What is the {country club} with the {MAX(par)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1137210 . ?ent wdt:P3530 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'par', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country club'}}

 Q: Which are the studies for toxin?
 SPARQL: select distinct ?answer where { ?answer wdt:P2578 wd:Q184651}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'toxin'}

 Q: What is {followed by} and {follows} of {{Chlothar II} has {noble title} as {king of Franks}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q209118 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chlothar II', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chlothar II', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}]

 Q: In 2016, what was the net profit of UnitedHealth Group?
 SPARQL: SELECT ?obj WHERE { wd:Q2103926 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'UnitedHealth Group', 'p': 'net profit', 'o': '?x0', 't': '2016'}

 Q: Which is the rank for the taxon rank of the blue whale?
 SPARQL:  select distinct ?obj where { wd:Q42196 wdt:P105 ?obj . ?obj wdt:P31 wd:Q3100180 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'blue whale', 'p': 'taxon rank', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rank'}}

 Q: Which is the conjugate acid for nitric acid?
 SPARQL: select distinct ?answer where { ?answer wdt:P4147 wd:Q83320}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'nitric acid'}

 Q: what is the {start time} for {Potsdam} has {located in the administrative territorial entity} as {Province of Brandenburg} ?
 SPARQL: SELECT ?value WHERE { wd:Q1711 p:P131 ?s . ?s ps:P131 wd:Q700264 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starting', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Potsdam', 'p': 'is located in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'is located in', 'o': 'Province of Brandenburg'}}}

 Q: Name a movie featuring Burt Reynolds
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P161 wd:Q202148 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'featuring', 'o': 'Burt Reynolds', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'movie'}}

 Q: What is the {country} for {ethnic group} of {Indigenous peoples of the United States}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P172 wd:Q49297 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'ethnic group', 'o': 'American Indians', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is the born on of advisor of Gaston Bachelard ?
 SPARQL: SELECT ?answer WHERE { wd:Q270800 wdt:P184 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born on', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gaston Bachelard', 'p': 'advisor', 'o': '$y0'}}

 Q: What is {category of associated people} of {active in} of {Éamon de Valera} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173347 wdt:P937 ?X . ?X wdt:P1792 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'category of associated people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eamon de Valera', 'p': 'active in', 'o': '$y0'}}

 Q: What is the {museum} for {place of death} of {Mahatma Gandhi}
 SPARQL:  select distinct ?obj where { wd:Q1001 wdt:P20 ?obj . ?obj wdt:P31 wd:Q33506 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mahatma Gandhi', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'museum'}}

 Q: What is {topic of} of {history of anarchism}, that has {to be distinguished from} is {Illegalism} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2746978 wdt:P1269 ?answer . ?answer wdt:P1889 wd:Q1516296}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of anarchism', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'distinguished from', 'o': 'illegalism'}}

 Q: does the lenth of provartenka equal to 0?
 SPARQL: ASK WHERE { wd:Q61870762 wdt:P2043 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Provartenka', 'p': 'length', 'o': '?x0', '?x0': '0'}

 Q: Who are the daughters of the author of Black Lamb and Grey Falcon?
 SPARQL: SELECT ?answer WHERE { wd:Q4921153 wdt:P50 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Black Lamb and Grey Falcon', 'p': 'author', 'o': '$y0'}}

 Q: Does the Seeteufel beam equal 2?
 SPARQL: ASK WHERE { wd:Q320214 wdt:P2261 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Seeteufel', 'p': 'beam', 'o': '?x0', '?x0': '2'}

 Q: Tell me chartered company whose name has the word company in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'company')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chartered company'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'company'}}

 Q: Was Oda Nobunaga born on June 23, 1534?
 SPARQL: SELECT ?value WHERE { wd:Q171411 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1534')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oda Nobunaga', 'p': 'born on', 'o': '$y0'}}

 Q: Which state has the city that is the twin city of Geneva?
 SPARQL: SELECT ?answer WHERE { wd:Q71 wdt:P190 ?X . ?X wdt:P17 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'state', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Geneva', 'p': 'twin city', 'o': '$y0'}}

 Q: "Where is {birth place} of {Louis Timothee}, which has {member of} is {Treaty on Open Skies} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q6688279 wdt:P19 ?answer . ?answer wdt:P463 wd:Q1928989}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louis Timothee', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Treaty on Open Skies'}}

 Q: What point in time did Indonesia have the inflation rate of 17.1?
 SPARQL: SELECT ?value WHERE { wd:Q252 p:P1279 ?s . ?s ps:P1279 ?x filter(contains(?x,'17.1')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Indonesia', 'p': 'inflation rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'inflation rate', 'o': '17.1'}, 't': '?x0'}

 Q: what is the {subject has role} for {caffeine} has {physically interacts with} as {Inositol 1,4,5-trisphosphate receptor type 1} ?
 SPARQL: SELECT ?value WHERE { wd:Q60235 p:P129 ?s . ?s ps:P129 wd:Q21107812 . ?s pq:P2868 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject has role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'caffeine', 'p': 'physically interacts with', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'physically interacts with', 'o': 'Inositol 1,4,5-trisphosphate receptor type 1'}}}

 Q: In the country of  Singapore what are the A.P.J Abdul Kalam languages?
 SPARQL: SELECT ?answer WHERE { wd:Q9513 wdt:P1412 ?answer . ?answer wdt:P131 wd:Q334}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Abdul Kalam', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Singapore'}}

 Q: What is the Bildindex der Kunst und Architektur ID for The Night Watch?
 SPARQL: select distinct ?answer where { wd:Q219831 wdt:P2092 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Night Watch', 'p': 'Bildindex der Kunst und Architektur ID', 'o': '?x0'}

 Q: What is Flickr's software framework in its current version 3.16.10?
 SPARQL: SELECT ?answer WHERE { wd:Q103204 wdt:P1547 ?answer . ?answer wdt:P348 ?x FILTER(contains(?x,'3.16.10'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Flickr', 'p': 'software framework', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'version', 'o': '3.16.10'}}

 Q: What is {award received} of {Marianne Moore} that is {point in time} is {1952-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q278495 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1952')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marianne Moore', 'p': 'award', 'o': '?x0', 't': '1952'}

 Q: Tell me carbine whose name has the word zastava in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q183302 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zastava')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'carbine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zastava'}}

 Q: What is {work period (start)} and {work period (end)} of {{Nastia Liukin} has {sport} as {female artistic gymnastics}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q230164 p:P641 ?s . ?s ps:P641 wd:Q3122646 . ?s pq:P2031 ?value1 . ?s pq:P2032 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work period (start)', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nastia Liukin', 'p': 'sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sport', 'o': 'female artistic gymnastics'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'work period (end)', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nastia Liukin', 'p': 'sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sport', 'o': 'female artistic gymnastics'}}}]

 Q: How many border shares with the City of Cape Town?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1185115 wdt:P47 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'City of Cape Town', 'p': 'border', 'o': '?x0'}

 Q: What is {competed in} of {Fulgencio Batista}, that has {starttime} is {1933-9-4} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11270 wdt:P1344 ?answer . ?answer wdt:P580 ?x FILTER(contains(YEAR(?x),'1933'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fulgencio Batista', 'p': 'competed in', 'o': '?x0', 't': '1933'}

 Q: What is <JMDb person or company ID> of <Kenji Mizoguchi> ?
 SPARQL: select distinct ?answer where { wd:Q55401 wdt:P3703 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kenji Mizoguchi', 'p': 'JMDb person or company ID', 'o': '?x0'}

 Q: What is {award received} of {Chow Yun-fat} that is {for work} is {Hong Kong 1941} ?
 SPARQL: SELECT ?obj WHERE { wd:Q181425 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q5894138 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chow Yun-fat', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Hong Kong 1941'}}}

 Q: When did animated character for characters of The Lion King?
 SPARQL:  select distinct ?obj where { wd:Q36479 wdt:P674 ?obj . ?obj wdt:P31 wd:Q15711870 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Lion King', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated character'}}

 Q: What is the name o an historical country that starts with the letter r.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: What is the China National Petroleum Corporation headquarters location that is located at 9 Dongzhimen North Street, Dongcheng District?
 SPARQL: SELECT ?obj WHERE { wd:Q588786 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter(contains(?x,'9 Dongzhimen North Street, Dongcheng District')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'China National Petroleum Corporation', 'p': 'headquarters location', 'o': '?x0'}

 Q: explain me that the artistic type that contains the word of venus which has its own name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16767597 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'venus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'artistic type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'venus'}}

 Q: What is movement for Renaissance music ?
 SPARQL: select distinct ?answer where { ?answer wdt:P135 wd:Q201405}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'movement', 'o': 'Renaissance music'}

 Q: What is the series ordinal of Philip V of France's child Margaret I, Countess of Burgundy?
 SPARQL: SELECT ?value WHERE { wd:Q8433 p:P40 ?s . ?s ps:P40 wd:Q261999 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip V of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Margaret I, Countess of Burgundy'}}}

 Q: How many terminus locations are by California?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P609 wd:Q99 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'terminus location', 'o': 'California'}

 Q: When did award received of Rabindranath Tagore and prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7241 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rabindranath Tagore', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rabindranath Tagore', 'p': 'award received', 'o': '$y0'}}]

 Q: How many {depicts} are for {Mona Lisa} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q12418 wdt:P180 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Mona Lisa', 'p': 'depicts', 'o': '?x0'}

 Q: Wich means{FIPS 5-2 alpha code (US states)}in {North Carolina} ?
 SPARQL: select distinct ?answer where { wd:Q1454 wdt:P5086 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'North Carolina', 'p': 'FIPS 5-2 alpha code (US states)', 'o': '?x0'}

 Q: Was Jupiter's child astronomical body Amalthea?
 SPARQL: ASK WHERE { wd:Q319 wdt:P398 wd:Q3257 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jupiter', 'p': 'child astronomical body', 'o': '?x0', '?x0': 'Amalthea'}]

 Q: Is the moisture absorption rate of the akroloy para ICF 40 equal to 1.1?
 SPARQL: ASK WHERE { wd:Q57273218 wdt:P5594 ?obj filter(?obj = 1.1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'AKROLOY PARA ICF 40', 'p': 'moisture absorption', 'o': '?x0', '?x0': '1.1'}

 Q: What position does the nominee for 'One Ok Rock' currently hold?
 SPARQL: SELECT ?answer WHERE { wd:Q1072736 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'One Ok Rock', 'p': 'nominee for', 'o': '$y0'}}

 Q: Was David_Bowie record label EMI?
 SPARQL: ASK WHERE { wd:Q5383 wdt:P264 wd:Q183412 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bowie', 'p': 'record label', 'o': '?x0', '?x0': 'EMI'}]

 Q: What is <ISBN-10> of <For Whom the Bell Tolls> ?
 SPARQL: select distinct ?answer where { wd:Q200920 wdt:P957 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'For Whom the Bell Tolls', 'p': 'ISBN-10', 'o': '?x0'}

 Q: what is the {acquisition transaction} for {George Best} has {member of sports team} as {Dunstable Town F.C.} ?
 SPARQL: SELECT ?value WHERE { wd:Q164521 p:P54 ?s . ?s ps:P54 wd:Q5315710 . ?s pq:P1642 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'acquisition transaction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Best', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Dunstable Town'}}}

 Q: Tell me an ancient civilization whose name has the word urartu in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'urartu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient civilization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'urartu'}}

 Q: Who is the cast member of Thomas Mitchell?
 SPARQL: select distinct ?answer where { ?answer wdt:P161 wd:Q317026}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Thomas Mitchell'}

 Q: What is {landscape of} of {representative work} of {Susan Luery} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15649005 wdt:P800 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'landscape of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Susan Luery', 'p': 'work', 'o': '$y0'}}

 Q: What is {portrait of} of {Fine Wind, Clear Morning}, that has {coordinate location} is {35.3625} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3565037 wdt:P180 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'35.3625'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fine Wind, Clear Morning', 'p': 'portrait of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coordinate location', 'o': '35.3625'}}

 Q: Is the General Electric stock exchange ticker symbol GE?
 SPARQL: SELECT ?obj WHERE { wd:Q54173 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'GE')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stock exchange', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'General Electric', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ticker symbol', 'o': 'ge'}}}

