 Q: What is the {madhhab} for {religion} of {Druze}
 SPARQL:  select distinct ?obj where { wd:Q163943 wdt:P140 ?obj . ?obj wdt:P31 wd:Q209928 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Druze', 'p': 'religion', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'madhhab'}}

 Q: When Vin Diesel, with its net worth estimate 1.9e+08, started?
 SPARQL: SELECT ?value WHERE { wd:Q178166 p:P2218 ?s . ?s ps:P2218 ?x filter(contains(?x,'1.9e+08')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Vin Diesel', 'p': 'net worth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'net worth', 'o': '1.9e+08'}, 't': '?x0'}

 Q: What is the Dailymotion channel ID of David Guetta?
 SPARQL: select distinct ?answer where { wd:Q8298 wdt:P2942 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Guetta', 'p': 'Dailymotion channel ID', 'o': '?x0'}

 Q: What was the name of Antonio Gades's wife?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q561048 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antonio Gades', 'p': 'wife', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'wife', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antonio Gades', 'p': 'wife', 'o': '$y0'}}]

 Q: Is the number of perpetrators of the Gladbeck hostage crisis equal to 3?
 SPARQL: ASK WHERE { wd:Q896727 wdt:P3886 ?obj filter(?obj = 3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Gladbeck hostage crisis', 'p': 'number of perpetrators', 'o': '?x0', '?x0': '3'}

 Q: What is {adjacent to} of {Düsseldorf}, that has {twin cities} is {Żnin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1718 wdt:P47 ?answer . ?answer wdt:P190 wd:Q324941}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Düsseldorf', 'p': 'adjacent to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin cities', 'o': 'Żnin'}}

 Q: What is {produces} of {administrator} of {Q/U Imaging ExperimenT} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7265603 wdt:P137 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'produces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Q/U Imaging ExperimenT', 'p': 'administrator', 'o': '$y0'}}

 Q: What fictional location starts with the letter "z"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3895768 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional location'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: From what country is Jacques Cartier, who was born in Rotheneuf?
 SPARQL: SELECT ?value WHERE { wd:Q7321 p:P19 ?s . ?s ps:P19 wd:Q2168809 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacques Cartier', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'born in', 'o': 'Rotheneuf'}}}

 Q: what is the {replaces} for {Zachary Taylor} has {position held} as {President of the United States} ?
 SPARQL: SELECT ?value WHERE { wd:Q11896 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zachary Taylor', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the United States'}}}

 Q: Which is the communist party of the mouthpiece of Pravda and which contains the word communist in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj wdt:P2813 wd:Q183644 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'communist')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'communist party', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mouthpiece', 'o': 'Pravda'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'communist'}}

 Q: Tell me asymmetric warfare  whose name has the word drug  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q752673 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'drug')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asymmetric warfare'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'drug'}}

 Q: Who is the {human} for {relative} of {Joseph Conrad}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1038 wd:Q82925 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'relative', 'o': 'Joseph Conrad', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the Euler characteristic of G2 equal to 0?
 SPARQL: ASK WHERE { wd:Q869338 wdt:P6438 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'G2', 'p': 'Euler characteristic', 'o': '?x0', '?x0': '0'}

 Q: Which is the adjacent building for Tate Modern?
 SPARQL: select distinct ?answer where { wd:Q193375 wdt:P3032 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tate Modern', 'p': 'adjacent building', 'o': '?x0'}

 Q: Which United States single has the maximum beats per minute?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q134556 . ?ent wdt:P1725 ?obj . ?ent wdt:P495 wd:Q30 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'beats per minute', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'United States'}}}

 Q: What is {award received} of {Frank Borzage} that is {for work} is {Seventh Heaven} ?
 SPARQL: SELECT ?obj WHERE { wd:Q369190 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q368451 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frank Borzage', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Seventh Heaven'}}}

 Q: What is the sign language for the written spelling of Ronnie Corbett?
 SPARQL: SELECT ?answer WHERE { wd:Q756377 wdt:P1412 ?X . ?X wdt:P2919 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sign', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ronnie Corbett', 'p': 'language', 'o': '$y0'}}

 Q: Where is the {architectural structure} of {architect} {Zaha Hadid}?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q47780 . ?sbj wdt:P31 wd:Q811979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Zaha Hadid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'architectural structure'}}

 Q: What sculpture is located at Yale University?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q860861 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Yale University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sculpture'}}

 Q: What is the {residence} and the {occupation} of {Christopher_Walken} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q185051 wdt:P551 ?ans_1 . wd:Q185051 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Christopher Walken', 'p': 'residence', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Christopher Walken', 'p': 'occupation', 'o': '?x1'}]

 Q: Is the number of spans of Ponte dell'Accademia equal to 1.2?
 SPARQL: ASK WHERE { wd:Q52509 wdt:P1314 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "Ponte dell'Accademia", 'p': 'number of spans', 'o': '?x0', '?x0': '1.2'}

 Q: What federal state was replaced by the Thirteen Colonies?
 SPARQL:  select distinct ?obj where { wd:Q179997 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thirteen Colonies', 'p': 'replaced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: Which is the geochronological unit which contains the word silurian in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6156156 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'silurian')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geochronological unit'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'silurian'}}

 Q: To whom was Osip Mandelstam married in the year 1922?
 SPARQL: SELECT ?obj WHERE { wd:Q189950 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1922')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Osip Mandelstam', 'p': 'married', 'o': '?x0', 't': '1922'}

 Q: How many {place of publication} are to/by {Nottingham} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P291 wd:Q41262 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'place of publication', 'o': 'Nottingham'}

 Q: How many Pokémon browser numbers are there for the {Pikachu} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q9351 wdt:P1685 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Pikachu', 'p': 'Pokémon browser number', 'o': '?x0'}

 Q: Who was head of government of Chemnitz on 1961?
 SPARQL: SELECT ?obj WHERE { wd:Q2795 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chemnitz', 'p': 'head of government', 'o': '?x0', 't': '1961'}

 Q: Is the boyfriend of Poseidon who has daughters Briareus?
 SPARQL: SELECT ?answer WHERE { wd:Q41127 wdt:P451 ?answer . ?answer wdt:P40 wd:Q849647}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Poseidon', 'p': 'boyfriend', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'daughter', 'o': 'Briareus'}}

 Q: How many are influenced by Gustave Courbet?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q34618 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'influenced by', 'o': 'Gustave Courbet'}

 Q: Was Tina Turner's discography known as 50 Cent discography?
 SPARQL: ASK WHERE { wd:Q131814 wdt:P358 wd:Q1513998 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Tina Turner', 'p': 'discography', 'o': '?x0', '?x0': '50 Cent discography'}]

 Q: What is {division} of {teams played for} of {Harry Beadles} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10449958 wdt:P54 ?X . ?X wdt:P118 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'division', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harry Beadles', 'p': 'team', 'o': '$y0'}}

 Q: what is the {replaced by} for {Lester B. Pearson} has {position held} as {Prime Minister of Canada} ?
 SPARQL: SELECT ?value WHERE { wd:Q128604 p:P39 ?s . ?s ps:P39 wd:Q839078 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lester B. Pearson', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Canada'}}}

 Q: What is the {native language} and the {languages spoken, written or signed} of {Swami_Vivekananda} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q47478 wdt:P103 ?ans_1 . wd:Q47478 wdt:P1412 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Vivekananda', 'p': 'native language', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Vivekananda', 'p': 'language', 'o': '?x1'}]

 Q: Is the size of the team at the finish of the 2015 Iditarod larger than 4.8?
 SPARQL: ASK WHERE { wd:Q19455277 wdt:P2105 ?obj filter(?obj > 4.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '2015 Iditarod', 'p': 'size of team at finish', 'o': '?x0', '?x0': '4.8'}

 Q: Give me {therapy} that {author} {Sigmund Freud} and which contains the word {psychoanalysis} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179661 . ?sbj wdt:P50 wd:Q9215 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'psychoanalysis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'therapy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Sigmund Freud'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'psychoanalysis'}}

 Q: Was David Foster Wallace's notable works "Infinite Jest" and "House of Leaves"?
 SPARQL: ASK WHERE { wd:Q313246 wdt:P800 wd:Q1077445 . wd:Q313246 wdt:P800 wd:Q521688 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'David Foster Wallace', 'p': 'notable work', 'o': '?x0', '?x0': 'Infinite Jest'}, {'h': 'IS', 'v': '?x1', 's': 'David Foster Wallace', 'p': 'notable work', 'o': '?x1', '?x1': 'House of Leaves'}]

 Q: What was Anne Bancroft nominated for in 1967?
 SPARQL: SELECT ?obj WHERE { wd:Q183532 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anne Bancroft', 'p': 'nominated for', 'o': '?x0', 't': '1967'}

 Q: How many fabrication methods are used by illustrations?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2079 wd:Q178659 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'illustration'}

 Q: What is the common name with the highest minimum frequency of audible sound whose on focus list of Wikimedia project is Wikipedia:Vital articles?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q502895 . ?ent wdt:P3387 ?obj . ?ent wdt:P5008 wd:Q5460604 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'minimum frequency of audible sound', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'common name', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'on focus list of Wikimedia project', 'o': 'Wikipedia:Vital articles'}}}

 Q: Is the orbital period of the 4765 Wasserburg equal to 2.71?
 SPARQL: ASK WHERE { wd:Q285478 wdt:P2146 ?obj filter(?obj = 2.71) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '4765 Wasserburg', 'p': 'orbital period', 'o': '?x0', '?x0': '2.71'}

 Q: Vanessa Redgrave was nominated for the Academy Awards.
 SPARQL:  select distinct ?obj where { wd:Q347879 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vanessa Redgrave', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Academy Awards'}}

 Q: Did {Kareena_Kapoor} {ethnic group} {Punjabi Muslim}?
 SPARQL: ASK WHERE { wd:Q184885 wdt:P172 wd:Q19893558 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kareena Kapoor', 'p': 'ethnic group', 'o': '?x0', '?x0': 'Punjabi Muslim'}]

 Q: What is {genomic start} of {AVP} that is {genomic assembly} is {Genome assembly GRCh38} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12009087 p:P644 ?s . ?s ps:P644 ?obj . ?s pq:P659 wd:Q20966585 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genomic start', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'AVP', 'p': 'genomic start', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genomic assembly', 'o': 'GRCh38'}}}

 Q: Which extinct language uses the Arabic alphabet?
 SPARQL:  select distinct ?obj where { wd:Q8196 wdt:P407 ?obj . ?obj wdt:P31 wd:Q38058796 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arabic alphabet', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'extinct language'}}

 Q: what is the {replaced by} for {Henry Addington, 1st Viscount Sidmouth} has {position held} as {Secretary of State for the Home Department} ?
 SPARQL: SELECT ?value WHERE { wd:Q312577 p:P39 ?s . ?s ps:P39 wd:Q2484309 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Addington, 1st Viscount Sidmouth', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary of State for the Home Department'}}}

 Q: what is the {determination method} for {Olongapo} has {population} as {233040} ?
 SPARQL: SELECT ?value WHERE { wd:Q56759 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'233040')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Olongapo', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '233040'}}}

 Q: What is {position held} of {Leo X} that is {replaced by} is {Adrian VI} ?
 SPARQL: SELECT ?obj WHERE { wd:Q49237 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q57087 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leo X', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Adrian VI'}}}

 Q: What is {based in} of {New Mexico}, that has {diplomatic relation} is {Cayman Islands} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1522 wdt:P131 ?answer . ?answer wdt:P530 wd:Q5785}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New Mexico', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Cayman Islands'}}

 Q: What is the {human} for {work location} of {Yekaterinburg}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P937 wd:Q887 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work location', 'o': 'Yekaterinburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {monument} with the {MAX(lighthouse range)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4989906 . ?ent wdt:P2929 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'lighthouse range', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monument'}}

 Q: What is {end time} and {start time} of {{Nigel Farage} has {employer} as {Refco}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q318471 p:P108 ?s . ?s ps:P108 wd:Q2136640 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigel Farage', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Refco'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigel Farage', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Refco'}}}]

 Q: What is the {ancient civilization} for {located on terrain feature} of {classical antiquity}
 SPARQL:  select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q28171280 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'classical antiquity', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient civilization'}}

 Q: Are there 411600000.0 children on Earth out of school
 SPARQL: ASK WHERE { wd:Q2 wdt:P2573 ?obj filter(?obj = 411600000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Earth', 'p': 'number of out-of-school children', 'o': '?x0', '?x0': '411600000.0'}

 Q: Is Chuck Norris the student of Sun Hwan Chung?
 SPARQL: ASK WHERE { wd:Q2673 wdt:P1066 wd:Q15987799 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chuck Norris', 'p': 'student of', 'o': '?x0', '?x0': 'Sun Hwan Chung'}]

 Q: Tell mebook series whose name has the word world in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q277759 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book series'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: what is in the IRS Employer Identification Number of Chevron Corporation ?
 SPARQL: select distinct ?answer where { wd:Q319642 wdt:P1297 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chevron Corporation', 'p': 'IRS Employer Identification Number', 'o': '?x0'}

 Q: Is the field of view of the TZF 5d equal to 25?
 SPARQL: ASK WHERE { wd:Q42302419 wdt:P4036 ?obj filter(?obj = 25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'TZF 5d', 'p': 'field of view', 'o': '?x0', '?x0': '25'}

 Q: What is {followed by} and {together with} of {{Guy of Lusignan} has {noble title} as {King of Jerusalem}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P156 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'King of Jerusalem'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'King of Jerusalem'}}}]

 Q: How many names are there for Almaty?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q35493 wdt:P1448 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Almaty', 'p': 'name', 'o': '?x0'}

 Q: what is the {statement is subject of} for {Annette Bening} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q190602 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Annette Bening', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Did {Ernest_Hemingway} {country of citizenship} {United States of America}?
 SPARQL: ASK WHERE { wd:Q23434 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ernest Hemingway', 'p': 'country of citizenship', 'o': '?x0', '?x0': 'US'}]

 Q: Give me {season} that {month of the year} {August} and which that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj wdt:P2922 wd:Q122 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'season', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'month', 'o': 'August'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which is the short film that was produced by Hayao Miyazaki?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P162 wd:Q55400 . ?sbj wdt:P31 wd:Q24862 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'produced by', 'o': 'Hayao Miyazaki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'short film'}}

 Q: What are the interdisciplinary science which start with the letter toxicology
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1665984 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toxicology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'interdisciplinary science'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'toxicology'}}

 Q: What is {location of burial} of {Mehmed the Conqueror}, that has {partner city} is {Damascus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q34503 wdt:P119 ?answer . ?answer wdt:P190 wd:Q3766}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mehmed the Conqueror', 'p': 'location of burial', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'Damascus'}}

 Q: what is the {replaces} for {Henry VI of England} has {position held} as {monarch of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q160337 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry VI of England', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of England'}}}

 Q: What is {located in the administrative territorial entity} of {Vilnius} that is {start time} is {1413-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q216 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1413')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vilnius', 'p': 'in', 'o': '?x0', 't': '1413'}

 Q: who SI derived unit for measured by energy?
 SPARQL:  select distinct ?obj where { wd:Q11379 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q208469 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'energy', 'p': 'measured by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'SI derived unit'}}

 Q: Which means {Banque de noms de lieux du Québec ID} at{Hudson Bay} ?
 SPARQL: select distinct ?answer where { wd:Q3040 wdt:P2100 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hudson Bay', 'p': 'Banque de noms de lieux du Québec ID', 'o': '?x0'}

 Q: What is {written by} of {Ficciones}, that has {autograph} is {Jorge Luis Borges autograph.png} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2483432 wdt:P50 ?answer . ?answer wdt:P109 ?x FILTER(contains(?x,'Jorge Luis Borges signature.png'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ficciones', 'p': 'written by', 'o': '?x0'}

 Q: which natural number with the highest numeric value whose instance is natural number?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21199 . ?ent wdt:P1181 ?obj . ?ent wdt:P31 wd:Q21199 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'numeric value', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural number'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Neymar} has {member of sports team} as {Brazil national under-17 football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q142794 p:P54 ?s . ?s ps:P54 wd:Q2402747 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neymar', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Brazil national under-17 football team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neymar', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Brazil national under-17 football team'}}}]

 Q: What is the {producer} and the {executive producer} of {Eternal_Sunshine_of_the_Spotless_Mind} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q208269 wdt:P162 ?ans_1 . wd:Q208269 wdt:P1431 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Eternal Sunshine of the Spotless Mind', 'p': 'producer', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Eternal Sunshine of the Spotless Mind', 'p': 'executive producer', 'o': '?x1'}]

 Q: What is Animal Farm derivative work?
 SPARQL: select distinct ?answer where { wd:Q1396889 wdt:P4969 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Animal Farm', 'p': 'derivative work', 'o': '?x0'}

 Q: Which is the song of the tracklist of OK Computer?
 SPARQL:  select distinct ?obj where { wd:Q202996 wdt:P658 ?obj . ?obj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'OK Computer', 'p': 'tracklist', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: What is {headquarters location} of {HBO} that is {country} is {United States of America} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23633 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q30 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'HBO', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'the United States'}}}

 Q: Who is the musician a split from of Tell Me 'bout It?
 SPARQL: SELECT ?answer WHERE { wd:Q1158846 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musician', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Tell Me 'bout It", 'p': 'split from', 'o': '$y0'}}

 Q: what is the {together with} for {Wladimir Klitschko} has {award received} as {Steiger Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q18797 p:P166 ?s . ?s ps:P166 wd:Q821717 . ?s pq:P1706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wladimir Klitschko', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Steiger Award'}}}

 Q: What particle radiation stars with the letter c?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'particle radiation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Which is the refractive index for calcium carbonate?
 SPARQL: select distinct ?answer where { wd:Q23767 wdt:P1109 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'calcium carbonate', 'p': 'refractive index', 'o': '?x0'}

 Q: What is the {sovereign state} for {head of government} of {Vladimir Lenin}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Vladimir Lenin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: what is the {point in time} for {Harold Eugene Edgerton} has {award received} as {SPIE Gold Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q475733 p:P166 ?s . ?s ps:P166 wd:Q8153695 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Harold Eugene Edgerton', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'SPIE Gold Medal'}, 't': '?x0'}

 Q: What motto of Spain has the words "Further Beyond"?
 SPARQL: SELECT ?obj WHERE { wd:Q29 p:P1546 ?s . ?s ps:P1546 ?obj . ?s pq:P1451 ?x filter(contains(?x,'Further Beyond')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spain', 'p': 'motto', 'o': '?x0'}

 Q: Which  business has the most subscribers?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P3744 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'subscribers', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What TV show is inspired by the life of Blackbeard?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P941 wd:Q213518 . ?sbj wdt:P31 wd:Q15416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'inspired by', 'o': 'Blackbeard', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV show'}}

 Q: When was Halley's Comet discovered?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q23054 wdt:P575 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': "Halley's Comet", 'p': 'discovered', 'o': '?x0'}

