 Q: What what is  female beauty pageant operating area by all countries which starts with letter m
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'female beauty pageant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operating area', 'o': 'all countries'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: When was Gabriela Mistral nominated for the Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q80871 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gabriela Mistral', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: Tell me cell type whose name has the word reticulodyte in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189118 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'reticulocyte')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cell type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'reticulocyte'}}

 Q: What is {residence} of {Don Bluth} that is {start time} is {1940-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q448957 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1940')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Don Bluth', 'p': 'residence', 'o': '?x0', 't': '1940'}

 Q: What is the {professional sports team} for {member of sports team} of {Lionel Messi}
 SPARQL:  select distinct ?obj where { wd:Q615 wdt:P54 ?obj . ?obj wdt:P31 wd:Q20639856 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lionel Messi', 'p': 'member of sports team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'professional sports team'}}

 Q: What is the {human} for {head of state} of {Czechoslovakia}
 SPARQL:  select distinct ?obj where { wd:Q33946 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Czechoslovakia', 'p': 'leader', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When was Louis XVI of France divorced his spouse Marie Antoinette?
 SPARQL: SELECT ?value WHERE { wd:Q7732 p:P26 ?s . ?s ps:P26 wd:Q47365 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divorced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis XVI of France', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Marie Antoinette'}}}

 Q: What is the religion of Roman Empire since 380-2-27?
 SPARQL: SELECT ?obj WHERE { wd:Q2277 p:P140 ?s . ?s ps:P140 ?obj . ?s pq:P580 ?x filter(contains(?x,'380-2-27')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'religion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roman Empire', 'p': 'religion', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'since', 'o': '380-2-27'}}}

 Q: Where is the birthplace of Sherilyn Fenn that was founded in 1701?
 SPARQL: SELECT ?answer WHERE { wd:Q229993 wdt:P19 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1701'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sherilyn Fenn', 'p': 'birthplace', 'o': '?x0', 't': '1701'}

 Q: What's the LombardiaBeniCulturali building ID of the Milan Cathedral.
 SPARQL: select distinct ?answer where { wd:Q18068 wdt:P3503 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Milan Cathedral', 'p': 'LombardiaBeniCulturali building ID', 'o': '?x0'}

 Q: What is {electoral district} and {end cause} of {{Henry Morton Stanley} has {position held} as {Member of the 26th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q171421 p:P39 ?s . ?s ps:P39 wd:Q41582573 . ?s pq:P768 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Morton Stanley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 26th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Morton Stanley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 26th Parliament of the United Kingdom'}}}]

 Q: What is the available observing time of a Very Large Telescope?
 SPARQL: select distinct ?answer where { wd:Q265628 wdt:P3891 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Very Large Telescope', 'p': 'available observing time', 'o': '?x0'}

 Q: Is it true that the parallax of Arcturus equals to 88.85?
 SPARQL: ASK WHERE { wd:Q12985 wdt:P2214 ?obj filter(?obj = 88.85) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Arcturus', 'p': 'parallax', 'o': '?x0', '?x0': '88.85'}

 Q: What chemical phenomenon starts with the letter "c"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3382117 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical phenomenon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Did {The_Empire_Strikes_Back} {cast member} {Carrie Fisher} and {Jeremy Bulloch} ?
 SPARQL: ASK WHERE { wd:Q181795 wdt:P161 wd:Q108941 . wd:Q181795 wdt:P161 wd:Q2369237 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Empire Strikes Back', 'p': 'cast member', 'o': '?x0', '?x0': 'Carrie Fisher'}, {'h': 'IS', 'v': '?x1', 's': 'The Empire Strikes Back', 'p': 'cast member', 'o': '?x1', '?x1': 'Jeremy Bulloch'}]

 Q: Is the average shot length of the Mist equal to 5.4?
 SPARQL: ASK WHERE { wd:Q695209 wdt:P2208 ?obj filter(?obj = 5.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Mist', 'p': 'average shot length', 'o': '?x0', '?x0': '5.4'}

 Q: What are the literary form which start with the letter Y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4263830 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary form'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is {member of} of {Austrian Empire} that is {end time} is {1866-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q131964 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1866')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Austrian Empire', 'p': 'member of', 'o': '?x0', 't': '1866'}

 Q: what is the {replaced by} for {Ibn Saud} has {position held} as {King of Saudi Arabia} ?
 SPARQL: SELECT ?value WHERE { wd:Q151509 p:P39 ?s . ?s ps:P39 wd:Q850168 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ibn Saud', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of Saudi Arabia'}}}

 Q: Which is the Visual Novel Database ID of courage?
 SPARQL: select distinct ?answer where { wd:Q208160 wdt:P3180 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'courage', 'p': 'Visual Novel Database ID', 'o': '?x0'}

 Q: What is {alumna of} of {Edward Said}, that has {is in the province of} is {Elizabeth} ?
 SPARQL: SELECT ?answer WHERE { wd:Q201538 wdt:P69 ?answer . ?answer wdt:P131 wd:Q138311}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Edward Said', 'p': 'alumna of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is in the province of', 'o': 'Elizabeth'}}

 Q: What is Library of Congress Genre/Form Terms ID for encyclopedia?
 SPARQL: select distinct ?answer where { wd:Q5292 wdt:P4953 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'encyclopedia', 'p': 'Library of Congress Genre/Form Terms ID', 'o': '?x0'}

 Q: When did Jim Skinner stop being McDonald's chief executive officer?
 SPARQL: SELECT ?value WHERE { wd:Q38076 p:P169 ?s . ?s ps:P169 wd:Q1355678 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'McD', 'p': 'chief executive officer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chief executive officer', 'o': 'Jim Skinner'}}}

 Q: Is the luminosity of Betelgeuse equal to 48000.0?
 SPARQL: ASK WHERE { wd:Q12124 wdt:P2060 ?obj filter(?obj = 48000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Betelgeuse', 'p': 'luminosity', 'o': '?x0', '?x0': '48000.0'}

 Q: Does silver have electrical conductivity equal to 63000000
 SPARQL: ASK WHERE { wd:Q1090 wdt:P2055 ?obj filter(?obj = 63000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'silver', 'p': 'electrical conductivity', 'o': '?x0', '?x0': '63000000'}

 Q: Give me {languoid class} that contains the word {variety} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28923954 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'variety')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'languoid class'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'variety'}}

 Q: What is the {aircraft family} for {item operated} of {American Airlines}
 SPARQL:  select distinct ?obj where { wd:Q32396 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056993 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Airlines', 'p': 'item operated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: What is <ITTF table tennis player ID> of <Jan-Ove Waldner> ?
 SPARQL: select distinct ?answer where { wd:Q345360 wdt:P1364 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jan-Ove Waldner', 'p': 'ITTF table tennis player ID', 'o': '?x0'}

 Q: What is the {codon} for {encodes} of {L-Tyrosine}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P688 wd:Q188017 . ?sbj wdt:P31 wd:Q165052 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'encodes', 'o': 'L-Tyrosine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'codon'}}

 Q: Which is the Wimbledon player ID for Novak Djokovic?
 SPARQL: select distinct ?answer where { wd:Q5812 wdt:P4503 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Novak Djokovic', 'p': 'Wimbledon player ID', 'o': '?x0'}

 Q: What is <Wikimedia outline> of <outline of physics> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5125 wd:Q2427913}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'Wikimedia outline', 'o': 'outline of physics'}

 Q: DOES THE DISCHARGE OF THE CONCA EQUALS 1.5
 SPARQL: ASK WHERE { wd:Q970873 wdt:P2225 ?obj filter(?obj = 1.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Conca', 'p': 'discharge', 'o': '?x0', '?x0': '1.5'}

 Q: who AMSL of principal place of Zaire?
 SPARQL: SELECT ?answer WHERE { wd:Q6500954 wdt:P36 ?X . ?X wdt:P2044 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'AMSL', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zaire', 'p': 'principal place', 'o': '$y0'}}

 Q: Who was Leopold Sedar Senghor's spouse in 1946?
 SPARQL: SELECT ?obj WHERE { wd:Q154545 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leopold Sedar Senghor', 'p': 'spouse', 'o': '?x0', 't': '1946'}

 Q: What is {source of inspiration} of {sidekick of} of {Sebastian} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7885388 wdt:P2546 ?X . ?X wdt:P941 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'source of inspiration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sebastian', 'p': 'sidekick of', 'o': '$y0'}}

 Q: What is the {day in the Eastern Orthodox liturgical calendar} with the {MIN(Sandbox-Quantity)} whose {instance of} is {day in the Eastern Orthodox liturgical calendar}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q47164206 . ?ent wdt:P1106 ?obj . ?ent wdt:P31 wd:Q47164206} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'Sandbox-Quantity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'day in the Eastern Orthodox liturgical calendar'}}

 Q: What is the {Class IC flammable liquid} with the {MIN(ionization energy)} whose {has part} is {carbon}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P2260 ?obj . ?ent wdt:P527 wd:Q623} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'ionization energy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IC flammable liquid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has part', 'o': 'carbon'}}}

 Q: Is it true that the number of episodes of the the 10.5: Apocalypse equals 2?
 SPARQL: ASK WHERE { wd:Q163903 wdt:P1113 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '10.5: Apocalypse', 'p': 'number of episodes', 'o': '?x0', '?x0': '2'}

 Q: what is the {replaces} for {Gerhard Schröder} has {position held} as {Federal Chancellor of Germany} ?
 SPARQL: SELECT ?value WHERE { wd:Q2530 p:P39 ?s . ?s ps:P39 wd:Q4970706 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerhard Schröder', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Federal Chancellor of Germany'}}}

 Q: What is the {protein} for {physically interacts with} of {hydrogen peroxide}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P129 wd:Q171877 . ?sbj wdt:P31 wd:Q8054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'physically interacts with', 'o': 'hydrogen peroxide', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protein'}}

 Q: Who is the director and director of photography of Apocalypse Now?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q182692 wdt:P57 ?ans_1 . wd:Q182692 wdt:P344 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Apocalypse Now', 'p': 'director', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Apocalypse Now', 'p': 'director of photography', 'o': '?x1'}]

 Q: What is the {conversation} for {used by} of {human}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1535 wd:Q5 . ?sbj wdt:P31 wd:Q52943 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'used by', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conversation'}}

 Q: what is the {located in the administrative territorial entity} for {Johann Gottfried Herder} has {place of birth} as {Morąg} ?
 SPARQL: SELECT ?value WHERE { wd:Q155547 p:P19 ?s . ?s ps:P19 wd:Q139725 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Johann Gottfried Herder', 'p': 'birthplace', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'birthplace', 'o': 'Morąg'}}}

 Q: Did Philadelphia share border with Delran Township?
 SPARQL: ASK WHERE { wd:Q1345 wdt:P47 wd:Q3016798 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Philadelphia', 'p': 'border', 'o': '?x0', '?x0': 'Delran Township'}]

 Q: What is a lifestyle that begins with the letter w.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32090 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lifestyle'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What Belgian municipality with city privileges shares a border with Bruges?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q12994 . ?sbj wdt:P31 wd:Q15273785 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Bruges', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Belgian municipality with city privileges'}}

 Q: What is the {human} for {member of sports team} of {F.C. Porto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P54 wd:Q128446 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'plays for', 'o': 'FC Porto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who was the mother of Eleanor of Aquitaine?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P25 wd:Q178525 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'mother', 'o': 'Eleanor of Aquitaine'}

 Q: what is the {point in time} for {Patricia Arquette} has {award received} as {Golden Globe Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q215976 p:P166 ?s . ?s ps:P166 wd:Q1011547 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Patricia Arquette', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Golden Globe Award'}, 't': '?x0'}

 Q: Give me {metropolitan city of South Korea} that starts with {'u'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolitan city of South Korea'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: Is Budapest a twinned administrative body with Tehran and San Vito al Tagliamento?
 SPARQL: ASK WHERE { wd:Q1781 wdt:P190 wd:Q3616 . wd:Q1781 wdt:P190 wd:Q53194 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Budapest', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Tehran'}, {'h': 'IS', 'v': '?x1', 's': 'Budapest', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'San Vito al Tagliamento'}]

 Q: What is Barefoot Gen's Anime News Network manga ID?
 SPARQL: select distinct ?answer where { wd:Q4347 wdt:P1984 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Barefoot Gen', 'p': 'Anime News Network manga ID', 'o': '?x0'}

 Q: Which is the Italian cadastre code of Venice?
 SPARQL: select distinct ?answer where { wd:Q641 wdt:P806 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Venice', 'p': 'Italian cadastre code', 'o': '?x0'}

 Q: Who gave the {pronunciation audio} of {language written} of {Jonas Savimbi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q273051 wdt:P1412 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jonas Savimbi', 'p': 'language written', 'o': '$y0'}}

 Q: What is {subsidiary company} of {label} of {Deep Purple} ?
 SPARQL: SELECT ?answer WHERE { wd:Q101505 wdt:P264 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Deep Purple', 'p': 'label', 'o': '$y0'}}

 Q: What is the filmography of Ron Howard?
 SPARQL:  select distinct ?obj where { wd:Q103646 wdt:P1283 ?obj . ?obj wdt:P31 wd:Q1371849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ron Howard', 'p': 'filmography', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'filmography'}}

 Q: What is {house} of {has sister} of {Lionel of Antwerp, 1st Duke of Clarence} ?
 SPARQL: SELECT ?answer WHERE { wd:Q313846 wdt:P3373 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'house', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lionel of Antwerp, 1st Duke of Clarence', 'p': 'sister', 'o': '$y0'}}

 Q: What is {is in the voivodeship of} of {Beni Suef Governorate}, that has {diplomatic relation} is {South Korea} ?
 SPARQL: SELECT ?answer WHERE { wd:Q30683 wdt:P131 ?answer . ?answer wdt:P530 wd:Q884}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Beni Suef Governorate', 'p': 'is in the voivodeship of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'South Korea'}}

 Q: What is the {single} for {follows} of {Unchained Melody}
 SPARQL:  select distinct ?obj where { wd:Q949416 wdt:P155 ?obj . ?obj wdt:P31 wd:Q134556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Unchained Melody', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single'}}

 Q: What is {IPv4 routing prefix} of {Department of Defense} that is {has quality} is {legacy IPv4 address block} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11209 p:P3761 ?s . ?s ps:P3761 ?obj . ?s pq:P1552 wd:Q28919811 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'IPv4 routing prefix', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Department of Defense', 'p': 'IPv4 routing prefix', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'has quality', 'o': 'legacy IPv4 address block'}}}

 Q: what is the {end time} for {William Lamb, 2nd Viscount Melbourne} has {position held} as {Prime Minister of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q312567 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Lamb, 2nd Viscount Melbourne', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of the United Kingdom'}}}

 Q: What is the {profession} for {field of this occupation} of {ecology}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P425 wd:Q7150 . ?sbj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'field of this occupation', 'o': 'ecology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: Is the age of consent in Norway 16?
 SPARQL: ASK WHERE { wd:Q20 wdt:P2999 ?obj filter(?obj = 16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Norway', 'p': 'age of consent', 'o': '?x0', '?x0': '16'}

 Q: Is the synodic period of mars less than 623.952?
 SPARQL: ASK WHERE { wd:Q111 wdt:P4341 ?obj filter(?obj < 623.952) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Mars', 'p': 'synodic period', 'o': '?x0', '?x0': '623.952'}

 Q: What is <captain> of <Montreal Canadiens> ?
 SPARQL: select distinct ?answer where { wd:Q188143 wdt:P634 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Montreal Canadiens', 'p': 'captain', 'o': '?x0'}

 Q: How many {student of} are to/by {Hans Hofmann} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1066 wd:Q215461 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'student of', 'o': 'Hans Hofmann'}

 Q: What is the {human} for {conflict} of {Russian Civil War}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P607 wd:Q79911 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'Russian Civil War', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Dmitry Medvedev} has {position held} as {First Deputy Chairman of the Government of the Russian Federation} ?
 SPARQL: SELECT ?value WHERE { wd:Q23530 p:P39 ?s . ?s ps:P39 wd:Q1965788 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dmitry Medvedev', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'First Deputy Chairman of the Government of the Russian Federation'}}}

 Q: what is the {end time} for {Mohammad Reza Pahlavi} has {position held} as {Shah} ?
 SPARQL: SELECT ?value WHERE { wd:Q128245 p:P39 ?s . ?s ps:P39 wd:Q184299 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mohammad Reza Pahlavi', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Shah'}}}

 Q: Is it true that Natalie Wood married to Richard Gregson?
 SPARQL: ASK WHERE { wd:Q180919 wdt:P26 wd:Q19299123 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Natalie Wood', 'p': 'married to', 'o': '?x0', '?x0': 'Richard Gregson'}]

 Q: What is the thermal conductivity of aluminium?
 SPARQL: select distinct ?answer where { wd:Q663 wdt:P2068 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aluminium', 'p': 'thermal conductivity', 'o': '?x0'}

 Q: what is the {nominee} for {The Last of the Mohicans} has {nominated for} as {Academy Award for Best Sound Mixing} ?
 SPARQL: SELECT ?value WHERE { wd:Q144483 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Last of the Mohicans', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Sound'}}}

 Q: Is Lil Wayne's country of citizenship the United States of America?
 SPARQL: ASK WHERE { wd:Q15615 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lil Wayne', 'p': 'country of citizenship', 'o': '?x0', '?x0': 'United States of America'}]

 Q: What is the {nuclear weapon} with the {MAX(explosive energy equivalent)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12802 . ?ent wdt:P2145 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'explosive energy equivalent', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nuclear weapon'}}

 Q: What is {located in time zone} of {Tennessee} that is {applies to part} is {Lake County} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1509 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P518 wd:Q494771 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tennessee', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'Lake County'}}}

 Q: What is {precedes} of {featured in work} of {Albany} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27990788 wdt:P1441 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'precedes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Albany', 'p': 'featured in work', 'o': '$y0'}}

 Q: Give me {book of the Bible} that contains the word {song} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29154430 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'song')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book of the Bible'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'song'}}

 Q: What is {has local government areas} of {Incheon}, that has {co-ords} is {37.4094} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20934 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'37.4094'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Incheon', 'p': 'has local government areas', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'co-ords', 'o': '37.4094'}}

 Q: What is the {human} for {architect} of {Mausoleum of Maussollos}
 SPARQL:  select distinct ?obj where { wd:Q45368 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mausoleum of Maussollos', 'p': 'architect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {software publisher} of {Super Smash Bros. Melee}, that has {divisions} is {Nintendo Platform Technology Development} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1052131 wdt:P123 ?answer . ?answer wdt:P199 wd:Q21190892}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Super Smash Bros. Melee', 'p': 'publisher', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divisions', 'o': 'Nintendo Platform Technology Development'}}

 Q: Which is the science award that is conferred by the Columbia University and contains the word prize in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11448906 . ?sbj wdt:P1027 wd:Q49088 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'prize')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'science award', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'conferred by', 'o': 'Columbia University'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'prize'}}

 Q: Which is the IDESCAT territorial code in Catalonia for Badalona?
 SPARQL: select distinct ?answer where { wd:Q15468 wdt:P4335 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Badalona', 'p': 'IDESCAT territorial code in Catalonia', 'o': '?x0'}

 Q: What is the birth location of Frederic Remington whose co-ords are 44.5975 -75.1711?
 SPARQL: SELECT ?answer WHERE { wd:Q560787 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'44.5975 -75.1711'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frederic Remington', 'p': 'birth location', 'o': '?x0'}

 Q: What is {part of work} of {bibliographic citation} of {Masked smoothing using separable kernels for CT perfusion images.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35229347 wdt:P2860 ?X . ?X wdt:P1433 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'part of work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Masked smoothing using separable kernels for CT perfusion images.', 'p': 'bibliographic citation', 'o': '$y0'}}

 Q: What is the name of the circular saw model and its acoustic power?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23811261 . ?ent wdt:P2797 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'sound power level', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'circular saw model'}}

 Q: What is the {place of death} and the {cause of death} of {Robert_Wadlow} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q192789 wdt:P20 ?ans_1 . wd:Q192789 wdt:P509 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Robert Wadlow', 'p': 'place of death', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Robert Wadlow', 'p': 'cause of death', 'o': '?x1'}]

 Q: what is the {end time} for {Valentino Rossi} has {member of sports team} as {Ducati Motor Holding} ?
 SPARQL: SELECT ?value WHERE { wd:Q169814 p:P54 ?s . ?s ps:P54 wd:Q271812 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valentino Rossi', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Ducati Motor Holding'}}}

 Q: Jimmy Page has how many producers?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P162 wd:Q165467 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'producer', 'o': 'Jimmy Page'}

 Q: Which is the television film that was based on Twenty Thousand Leagues Under the Sea?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P144 wd:Q183565 . ?sbj wdt:P31 wd:Q506240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'Twenty Thousand Leagues Under the Sea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television film'}}

