 Q: What was Burt Reynolds nominated for in 1-1-1997?
 SPARQL: SELECT ?obj WHERE { wd:Q202148 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1997')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Burt Reynolds', 'p': 'nominated for', 'o': '?x0', 't': '1997'}

 Q: what is the {series ordinal} for {Megawati Sukarnoputri} has {position held} as {President of Indonesia} ?
 SPARQL: SELECT ?value WHERE { wd:Q76179 p:P39 ?s . ?s ps:P39 wd:Q11755916 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Megawati Sukarnoputri', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Indonesia'}}}

 Q: Did {Keith_Richards} {genre} {rock music} and {jazz} ?
 SPARQL: ASK WHERE { wd:Q189599 wdt:P136 wd:Q11399 . wd:Q189599 wdt:P136 wd:Q8341 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Keith Richards', 'p': 'genre', 'o': '?x0', '?x0': 'Rock'}, {'h': 'IS', 'v': '?x1', 's': 'Keith Richards', 'p': 'genre', 'o': '?x1', '?x1': 'jazz'}]

 Q: Tell me scalar physical quantity whose name has the word voltage in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q181175 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'voltage')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scalar'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'voltage'}}

 Q: What is NNL ID for Pride and Prejudice?
 SPARQL: select distinct ?answer where { wd:Q170583 wdt:P3959 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pride and Prejudice', 'p': 'NNL', 'o': '?x0'}

 Q: Who is the discoverer or inventor of Hypertext Transfer Protocol?
 SPARQL: select distinct ?answer where { wd:Q8777 wdt:P61 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hypertext Transfer Protocol', 'p': 'discoverer or inventor', 'o': '?x0'}

 Q: How many {military branch} are to/by {anti-aircraft warfare} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P241 wd:Q843941 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'military branch', 'o': 'anti-aircraft warfare'}

 Q: How many {developer} are for {Need for Speed} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q55679 wdt:P178 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Need for Speed', 'p': 'developer', 'o': '?x0'}

 Q: David Grossman together with Jessica Cohen won which award?
 SPARQL: SELECT ?obj WHERE { wd:Q160263 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q30301433 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Grossman', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'together with', 'o': 'Jessica Cohen'}}}

 Q: What award did Dwight D. Eisenhower receive in 1945?
 SPARQL: SELECT ?obj WHERE { wd:Q9916 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1945')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dwight D. Eisenhower', 'p': 'award', 'o': '?x0', 't': '1945'}

 Q: What is {building date} of {in action} of {Horatio Nelson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83235 wdt:P607 ?X . ?X wdt:P580 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'building date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Horatio Nelson', 'p': 'in action', 'o': '$y0'}}

 Q: Who are the {characters} in {Exodus}, the has a {brother or sister} named {Nadabe}?
 SPARQL: SELECT ?answer WHERE { wd:Q9190 wdt:P674 ?answer . ?answer wdt:P3373 wd:Q1941782}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Exodus', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister', 'o': 'Nadabe'}}

 Q: Is the fatality rate of Fournier gangrene less than 15.36?
 SPARQL: ASK WHERE { wd:Q616449 wdt:P3457 ?obj filter(?obj < 15.36) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Fournier gangrene', 'p': 'fatality rate', 'o': '?x0', '?x0': '15.36'}

 Q: How many {regulates (molecular biology)} are to/by {gene expression} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P128 wd:Q26972 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'regulates (molecular biology)', 'o': 'gene expression'}

 Q: Tell me {house cat} whose name  starts with m
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q146 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'м')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'house cat'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'м'}}

 Q: What area of mathematics does Claude Shannon specialize in?
 SPARQL:  select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q1936384 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Claude Shannon', 'p': 'area', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'area of mathematics'}}

 Q: What is the {website} for {website account on} of {YouTube}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P553 wd:Q866 . ?sbj wdt:P31 wd:Q35127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'website account on', 'o': 'YouTube', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'website'}}

 Q: What is  in the postsynaptic connection of rod cell ?
 SPARQL: select distinct ?answer where { wd:Q505544 wdt:P926 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'rod cell', 'p': 'postsynaptic connection', 'o': '?x0'}

 Q: Is the ceiling exposure limit of hydrazine equal to 0.04?
 SPARQL: ASK WHERE { wd:Q58447 wdt:P2405 ?obj filter(?obj = 0.04) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'hydrazine', 'p': 'ceiling exposure limit', 'o': '?x0', '?x0': '0.04'}

 Q: What is the motif of chancellor Armand Marrast, that has Bal du moulin de la Galette?
 SPARQL: SELECT ?answer WHERE { wd:Q683274 wdt:P180 ?answer . ?answer wdt:P6 wd:Q677730}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bal du moulin de la Galette', 'p': 'motif', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'chancellor', 'o': 'Armand Marrast'}}

 Q: What is {has local government areas} of {subitem of} of {history of Vietnam} ?
 SPARQL: SELECT ?answer WHERE { wd:Q212913 wdt:P1269 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has local government areas', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Vietnam', 'p': 'subitem of', 'o': '$y0'}}

 Q: "Who was born in Bernard Herrmann, with local calling code 917?"
 SPARQL: SELECT ?answer WHERE { wd:Q296804 wdt:P19 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'917'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bernard Herrmann', 'p': 'born in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'local calling code', 'o': '917'}}

 Q: Did {Japanese_language} {country} {Taiwan} and {South Korea} ?
 SPARQL: ASK WHERE { wd:Q5287 wdt:P17 wd:Q865 . wd:Q5287 wdt:P17 wd:Q884 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Japanese', 'p': 'country', 'o': '?x0', '?x0': 'Taiwan'}, {'h': 'IS', 'v': '?x1', 's': 'Japanese', 'p': 'country', 'o': '?x1', '?x1': 'South Korea'}]

 Q: Is the galactic longitude of the Orion Nebula equal to 209.010797
 SPARQL: ASK WHERE { wd:Q13903 wdt:P6260 ?obj filter(?obj = 209.010797) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Orion Nebula', 'p': 'galactic longitude', 'o': '?x0', '?x0': '209.010797'}

 Q: How many {significant drug interaction} are to/by {erythromycin} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P769 wd:Q213511 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'significant drug interaction', 'o': 'erythromycin'}

 Q: Which is the business that is the publisher of The Economist?
 SPARQL:  select distinct ?obj where { wd:Q180089 wdt:P123 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Economist', 'p': 'publisher', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is <tributary> of <Tennessee River> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P974 wd:Q193737}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Tennessee River'}

 Q: What is the {imperative programming language} for {designed by} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q21562092 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'imperative programming language'}}

 Q: Which child of Louis VIII of France died 8/25/1270?
 SPARQL: SELECT ?obj WHERE { wd:Q165284 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P570 ?x filter(contains(YEAR(?x),'1270')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louis VIII of France', 'p': 'child', 'o': '?x0', 't': '1270'}

 Q: What is the queen of the land} of Bahia Toco Largo Lake ?
 SPARQL: SELECT ?answer WHERE { wd:Q7356830 wdt:P17 ?X . ?X wdt:P35 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'queen', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bahia Toco Largo Lake', 'p': 'land', 'o': '$y0'}}

 Q: Which are the people that participate in the religion of Islam?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P140 wd:Q432 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'Islam', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: Who is the {historic county of England} for {shares border with} of {Hampshire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q1138494 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'shares border with', 'o': 'Hampshire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historic county of England'}}

 Q: What job did Dorothy Stratten have during 1979?
 SPARQL: SELECT ?obj WHERE { wd:Q241081 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dorothy Stratten', 'p': 'job', 'o': '?x0', 't': '1979'}

 Q: What is {prescribed drug} of {murder method} of {Bronisław Malinowski} ?
 SPARQL: SELECT ?answer WHERE { wd:Q184992 wdt:P509 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prescribed drug', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bronislaw Malinowski', 'p': 'method of murder', 'o': '$y0'}}

 Q: What is the {version, edition, or translation} for {edition or translation of} of {Twenty Thousand Leagues Under the Sea}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P629 wd:Q183565 . ?sbj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition or translation of', 'o': 'Twenty Thousand Leagues Under the Sea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version, edition, or translation'}}

 Q: What is {time zone} of {place of origin} of {San Francisco Chronicle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q139103 wdt:P495 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'San Francisco Chronicle', 'p': 'place of origin', 'o': '$y0'}}

 Q: What is <proved by> of <Alexander Grothendieck> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1318 wd:Q77141}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'proved by', 'o': 'Alexander Grothendieck'}

 Q: What education is composed by Papillons ?
 SPARQL: SELECT ?answer WHERE { wd:Q28480156 wdt:P86 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'education', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Papillons', 'p': 'composed by', 'o': '$y0'}}

 Q: What is {portrayed by} {track listing} of {Invasion of Privacy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51027746 wdt:P658 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrayed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Invasion of Privacy', 'p': 'track list', 'o': '$y0'}}

 Q: Does the elevation above sea level of the Jericho equals -220.0?
 SPARQL: ASK WHERE { wd:Q5687 wdt:P2044 ?obj filter(?obj = -220.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Jericho', 'p': 'elevation above sea level', 'o': '?x0', '?x0': '-220.0'}

 Q: What what is brain region arterial supply superior cerebellar artery and also which starts with letter c
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj wdt:P2286 wd:Q707592 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'brain region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'arterial supply', 'o': 'superior cerebellar artery'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Whose professional harpsichordist's namesake was the Goldberg Variations named after?
 SPARQL: SELECT ?answer WHERE { wd:Q213728 wdt:P138 ?answer . ?answer wdt:P106 wd:Q5371902}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Goldberg Variations', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'profession', 'o': 'harpsichordist'}}

 Q: Tell me the border that contains the word line in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133346 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'line')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'border'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'line'}}

 Q: What is the {rolling stock class} with the {MAX(total produced)} whose {operator} is {New York City Subway}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q811704 . ?ent wdt:P1092 ?obj . ?ent wdt:P137 wd:Q7733 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total produced', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rolling stock class', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operated by', 'o': 'New York City Subway'}}}

 Q: Is the Yukon Quest 2016's size of team at finish  greater than 4.8?
 SPARQL: ASK WHERE { wd:Q28570721 wdt:P2105 ?obj filter(?obj > 4.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Yukon Quest 2016', 'p': 'size of team at finish', 'o': '?x0', '?x0': '4.8'}

 Q: What language has the regulatory body in the Office québécois de la langue française and is spoken by Manuel Castells?
 SPARQL: SELECT ?answer WHERE { wd:Q310161 wdt:P1412 ?answer . ?answer wdt:P1018 wd:Q2578454}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Manuel Castells', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'regulatory body', 'o': 'Office québécois de la langue française'}}

 Q: What is {pronunciation audio} of {Georges Pompidou} that is {language of work or name} is {French} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2185 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georges Pompidou', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'French'}}}

 Q: Which is the railway tunnel with terminus Erstfeld and contains the word base in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj wdt:P559 wd:Q69642 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'base')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway tunnel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'terminus', 'o': 'Erstfeld'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'base'}}

 Q: What was the population of Thailand in 2006?
 SPARQL: SELECT ?obj WHERE { wd:Q869 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thailand', 'p': 'population', 'o': '?x0', 't': '2006'}

 Q: Of which enterprise is Mark Zuckerberg CEO?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P169 wd:Q36215 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'CEO', 'o': 'Mark Zuckerberg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What is the {regional organization} for {legislative body} of {European Parliament}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P194 wd:Q8889 . ?sbj wdt:P31 wd:Q4120211 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'legislative body', 'o': 'European Parliament', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'regional organization'}}

 Q: What { sports team member } of { Bernard Thévenet } that is { end time } is { 1979 - 0 - 0 }?
 SPARQL: SELECT ?obj WHERE { wd:Q367064 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bernard Thévenet', 'p': 'team', 'o': '?x0', 't': '1979'}

 Q: George Washington Bridge has what UglyBridges.com ID
 SPARQL: select distinct ?answer where { wd:Q125821 wdt:P1380 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Washington Bridge', 'p': 'UglyBridges.com ID', 'o': '?x0'}

 Q: How many movies have Georges Méliès as the production designer?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2554 wd:Q152272 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'production designer', 'o': 'Georges Méliès'}

 Q: What is the Fedora package for Ruby?
 SPARQL: select distinct ?answer where { wd:Q161053 wdt:P3463 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ruby', 'p': 'Fedora package', 'o': '?x0'}

 Q: What is {population} of {Móstoles} that is {determination method} is {register office} ?
 SPARQL: SELECT ?obj WHERE { wd:Q187826 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Móstoles', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'register office'}}}

 Q: What is designed to carry the automobile?
 SPARQL: select distinct ?answer where { wd:Q1420 wdt:P3349 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'auto', 'p': 'designed to carry', 'o': '?x0'}

 Q: What is medical condition of Human Pregnancy ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1050 wd:Q11995}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition', 'o': 'Pregnancy'}

 Q: What is {educated at} of {George Wallace} that is {academic degree} is {Bachelor of Laws} ?
 SPARQL: SELECT ?obj WHERE { wd:Q313776 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q798137 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Wallace', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Bachelor of Laws'}}}

 Q: What is Carlos Menem's Argentine Senate member ID?
 SPARQL: select distinct ?answer where { wd:Q185107 wdt:P4453 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carlos Menem', 'p': 'Argentine Senate member ID', 'o': '?x0'}

 Q: Give me {fungal part} that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56883667 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fungal part'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {follows} and {followed by} of {{Charles the Fat} has {noble title} as {king of Franks}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}]

 Q: What Gdańsk twinned administrative body began in 1993?
 SPARQL: SELECT ?obj WHERE { wd:Q1792 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gdańsk', 'p': 'twinned administrative body', 'o': '?x0', 't': '1993'}

 Q: Who is {work partner} of {scriptwriter} {Member Berries} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26898074 wdt:P58 ?X . ?X wdt:P1327 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work partner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Member Berries', 'p': 'scriptwriter', 'o': '$y0'}}

 Q: which type of anime television series starts with y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anime television'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is the {G-type main-sequence star} for {child astronomical body} of {Neptune}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q332 . ?sbj wdt:P31 wd:Q5864 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Neptune', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: What is the military casualty classification of prisoner of war?
 SPARQL: select distinct ?answer where { ?answer wdt:P1347 wd:Q179637}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'military casualty classification', 'o': 'prisoner of war'}

 Q: Is it true that the moisture absorption of Grivory GM-4H equals to 1.68?
 SPARQL: ASK WHERE { wd:Q57051271 wdt:P5594 ?obj filter(?obj = 1.68) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Grivory GM-4H', 'p': 'moisture absorption', 'o': '?x0', '?x0': '1.68'}

 Q: Give me {performing arts genre} that {used by} {dancing} and which that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj wdt:P1535 wd:Q43393537 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'performing arts genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'used by', 'o': 'dancing'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: what is the {point in time} for {B. F. Skinner} has {award received} as {E. L. Thorndike Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q213195 p:P166 ?s . ?s ps:P166 wd:Q5322016 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'B. F. Skinner', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'E. L. Thorndike Award'}, 't': '?x0'}

 Q: What is the {musical duo} for {contributor(s) to the creative work} of {Sasha Grey}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P767 wd:Q2709 . ?sbj wdt:P31 wd:Q9212979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contributor', 'o': 'Sasha Grey', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical duo'}}

 Q: What is the death place of Lavrentiy Beria and is the twin town of Tehran?
 SPARQL: SELECT ?answer WHERE { wd:Q141829 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3616}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lavrentiy Beria', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin town', 'o': 'Tehran'}}

 Q: What is the version and date of publication of the Diary of Anne Frank?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q6911 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P577 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of publication', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diary of Anne Frank', 'p': 'version', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'version', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diary of Anne Frank', 'p': 'version', 'o': '$y0'}}]

 Q: Which is the age of onset for gout?
 SPARQL: select distinct ?answer where { wd:Q133087 wdt:P2841 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'gout', 'p': 'age of onset', 'o': '?x0'}

 Q: What is the source of inspiration for the film character in Blackbeard?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P941 wd:Q213518 . ?sbj wdt:P31 wd:Q15773347 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'source of inspiration', 'o': 'Blackbeard', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character'}}

 Q: What awards were the Rolling Stones nominated for in 1989?
 SPARQL: SELECT ?obj WHERE { wd:Q11036 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rolling Stones', 'p': 'nominated for', 'o': '?x0', 't': '1989'}

 Q: What member of the American Academy of Arts and Sciences is coined of calcium?
 SPARQL: SELECT ?answer WHERE { wd:Q706 wdt:P61 ?answer . ?answer wdt:P463 wd:Q463303}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'calcium', 'p': 'coined', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'American Academy of Arts and Sciences'}}

 Q: What is the {Pacific hurricane} with the {MIN(lowest atmospheric pressure)} whose {country} is {United States of America}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3306242 . ?ent wdt:P2532 ?obj . ?ent wdt:P17 wd:Q30} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'lowest atmospheric pressure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Pacific hurricane', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'state', 'o': 'America'}}}

 Q: What is the {human sacrifice} for {significant event} of {Isaac}
 SPARQL:  select distinct ?obj where { wd:Q671872 wdt:P793 ?obj . ?obj wdt:P31 wd:Q119094 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Isaac', 'p': 'significant event', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human sacrifice'}}

 Q: What is <Printemps des poètes poet ID> of <Wisława Szymborska> ?
 SPARQL: select distinct ?answer where { wd:Q42552 wdt:P5344 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wisława Szymborska', 'p': 'Printemps des poètes poet ID', 'o': '?x0'}

 Q: What is the population of Nashville at  2016?
 SPARQL: SELECT ?obj WHERE { wd:Q23197 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nashville', 'p': 'population', 'o': '?x0', 't': '2016'}

 Q: Which is the poster that depicts Barack Obama?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P180 wd:Q76 . ?sbj wdt:P31 wd:Q429785 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'Barack Obama', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'poster'}}

 Q: What is the {religious text} for {series} of {Book of Genesis}
 SPARQL:  select distinct ?obj where { wd:Q9184 wdt:P179 ?obj . ?obj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Book of Genesis', 'p': 'series', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: What is bipedalism's means of locomotion?
 SPARQL: select distinct ?answer where { ?answer wdt:P3512 wd:Q372949}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'means of locomotion', 'o': 'bipedalism'}

 Q: What is the {road} for {connects with} of {Zagreb}
 SPARQL:  select distinct ?obj where { wd:Q1435 wdt:P2789 ?obj . ?obj wdt:P31 wd:Q34442 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zagreb', 'p': 'connects with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road'}}

 Q: what is the {start time} for {Akita} has {twinned administrative body} as {St. Cloud} ?
 SPARQL: SELECT ?value WHERE { wd:Q17139 p:P190 ?s . ?s ps:P190 wd:Q736834 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Akita', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'St. Cloud'}}}

 Q: What is the exact match for the handkerchief?
 SPARQL: select distinct ?answer where { wd:Q192411 wdt:P2888 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'handkerchief', 'p': 'exact match', 'o': '?x0'}

 Q: Which year did Edmonton had a population of 932546?
 SPARQL: SELECT ?value WHERE { wd:Q2096 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'932546')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Edmonton', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '932546'}, 't': '?x0'}

 Q: What are the {has states} of {sovereign state} of {Ministry of Foreign Affairs of the People's Republic of China}?
 SPARQL: SELECT ?answer WHERE { wd:Q1155502 wdt:P17 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has states', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Ministry of Foreign Affairs of the People's Republic of China", 'p': 'sovereign state', 'o': '$y0'}}

 Q: Which ester has the highest flash point?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q101487 . ?ent wdt:P2128 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'flash point', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ester'}}

 Q: Who is speaker of Nicolas Sarkozy?
 SPARQL: select distinct ?answer where { ?answer wdt:P823 wd:Q329}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'speaker', 'o': 'Nicolas Sarkozy'}

 Q: When did Madrid have a population of 3.21327e+06?
 SPARQL: SELECT ?value WHERE { wd:Q2807 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'3.21327e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Madrid', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '3.21327e+06'}, 't': '?x0'}

 Q: Where is Japan Railways Group, the place of incorporation that has the prime minister Yuriko Koike?
 SPARQL: SELECT ?answer WHERE { wd:Q864495 wdt:P740 ?answer . ?answer wdt:P6 wd:Q261703}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Japan Railways Group', 'p': 'place of incorporation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prime minister', 'o': 'Yuriko Koike'}}

 Q: Which is the CODEN for the Journal of the American Chemical Society?
 SPARQL: select distinct ?answer where { wd:Q898902 wdt:P1159 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Journal of the American Chemical Society', 'p': 'CODEN', 'o': '?x0'}

