 Q: Who is the musical score by in It Happened One Night that states someone's middle name is Howard?
 SPARQL: SELECT ?answer WHERE { wd:Q208632 wdt:P86 ?answer . ?answer wdt:P735 wd:Q3595959}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'It Happened One Night', 'p': 'musical score by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'middle name', 'o': 'Howard'}}

 Q: Is the number of injured in the Newhall massacre less than 0.8?
 SPARQL: ASK WHERE { wd:Q16211090 wdt:P1339 ?obj filter(?obj < 0.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Newhall massacre', 'p': 'number of injured', 'o': '?x0', '?x0': '0.8'}

 Q: Lata Mangeshkar received what award in what field of work?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q156347 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P101 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lata Mangeshkar', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lata Mangeshkar', 'p': 'award', 'o': '$y0'}}]

 Q: What is follows of city that has criterion used for human population?
 SPARQL: SELECT ?obj WHERE { wd:Q515 p:P155 ?s . ?s ps:P155 ?obj . ?s pq:P1013 wd:Q33829 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'city', 'p': 'follows', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'criterion used', 'o': 'human population'}}}

 Q: who pharmaceutical product for has active ingredient of amoxicillin?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3781 wd:Q201928 . ?sbj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has active ingredient', 'o': 'amoxicillin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: Did {Bible} {has edition} of {Wycliffe's Bible} and {LDS edition of the Bible} ?
 SPARQL: ASK WHERE { wd:Q1845 wdt:P747 wd:Q1626958 . wd:Q1845 wdt:P747 wd:Q6457532 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bible', 'p': 'edition', 'o': '?x0', '?x0': "Wycliffe's Bible"}, {'h': 'IS', 'v': '?x1', 's': 'Bible', 'p': 'edition', 'o': '?x1', '?x1': 'LDS edition of the Bible'}]

 Q: What is {academic degree} and {academic major} of {{Bashar al-Assad} has {educated at} as {Damascus University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q44329 p:P69 ?s . ?s ps:P69 wd:Q1351317 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bashar al-Assad', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Damascus University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bashar al-Assad', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Damascus University'}}}]

 Q: Did {Chevy_Chase} {award received} {Emmy Award} and {61st Primetime Emmy Awards} ?
 SPARQL: ASK WHERE { wd:Q310926 wdt:P166 wd:Q123737 . wd:Q310926 wdt:P166 wd:Q1338932 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chevy Chase', 'p': 'award received', 'o': '?x0', '?x0': 'Emmy Award'}, {'h': 'IS', 'v': '?x1', 's': 'Chevy Chase', 'p': 'award received', 'o': '?x1', '?x1': '61st Primetime Emmy Awards'}]

 Q: Who are the {pupils} of the {songwriter} of {Für Elise}?
 SPARQL: SELECT ?answer WHERE { wd:Q11980 wdt:P86 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pupil', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Für Elise', 'p': 'songwriter', 'o': '$y0'}}

 Q: What is a religious order of knight ?
 SPARQL: select distinct ?answer where { ?answer wdt:P611 wd:Q102083}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religious order', 'o': 'knight'}

 Q: Give me {ceremony} that starts with {'u'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ceremony'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: Which part of Adélie Land has a the second-level administrative country subdivision?
 SPARQL: SELECT ?value WHERE { wd:Q184319 p:P31 ?s . ?s ps:P31 wd:Q13220204 . ?s pq:P361 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'part of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adélie Land', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'second-level administrative country subdivision'}}}

 Q: What are theeconomic ideology which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5333510 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic ideology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {owned by} of {Mona Lisa} that is {start time} is {1519-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12418 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1519')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mona Lisa', 'p': 'owned by', 'o': '?x0', 't': '1519'}

 Q: What is the sex of Barbie and who is her partner?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q167447 wdt:P21 ?ans_1 . wd:Q167447 wdt:P451 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Barbie', 'p': 'sex', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Barbie', 'p': 'partner', 'o': '?x1'}]

 Q: What is {has counties} of {partner town} of {Chișinău} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21197 wdt:P190 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has counties', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chisinau', 'p': 'sister town', 'o': '$y0'}}

 Q: Which is the HATVP person ID of Jean-Marie Le Pen?
 SPARQL: select distinct ?answer where { wd:Q7177 wdt:P4703 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean-Marie Le Pen', 'p': 'HATVP person ID', 'o': '?x0'}

 Q: Who are the daughters of Peter Gabriel that were born in Bath?
 SPARQL: SELECT ?answer WHERE { wd:Q175195 wdt:P40 ?answer . ?answer wdt:P19 wd:Q22889}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Gabriel', 'p': 'daughter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Bath'}}

 Q: What is the {Wikimedia list article} for {list of monuments} of {Bern}
 SPARQL:  select distinct ?obj where { wd:Q70 wdt:P1456 ?obj . ?obj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bern', 'p': 'list of monuments', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'list'}}

 Q: What is {ZIP+4} of {studied at} of {Diane Sawyer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q236402 wdt:P69 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ZIP+4', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diane Sawyer', 'p': 'studied at', 'o': '$y0'}}

 Q: Who are Sean Connery's wife and child?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q4573 wdt:P26 ?ans_1 . wd:Q4573 wdt:P40 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Sean Connery', 'p': 'wife', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Sean Connery', 'p': 'child', 'o': '?x1'}]

 Q: How many people use Polish as their native language?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P103 wd:Q809 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'native language', 'o': 'Polish'}

 Q: What is guest of honor for Arturo Toscanini ?
 SPARQL: select distinct ?answer where { ?answer wdt:P967 wd:Q13003}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'guest of honor', 'o': 'Arturo Toscanini'}

 Q: What is the symbol of quantity of a square kilometer?
 SPARQL: SELECT ?answer WHERE { wd:Q712226 wdt:P111 ?X . ?X wdt:P416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'square kilometer', 'p': 'quantity', 'o': '$y0'}}

 Q: Which is the OKP ID of the good or service of white chocolate?
 SPARQL: select distinct ?answer where { wd:Q742385 wdt:P3248 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'white chocolate', 'p': 'OKP ID of the good or service', 'o': '?x0'}

 Q: What is {leader} of {honors} of {The Colour of My Love} ?
 SPARQL: SELECT ?answer WHERE { wd:Q939286 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'leader', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Colour of My Love', 'p': 'honors', 'o': '$y0'}}

 Q: What is the {whistleblower platform} for {creator} of {Julian Assange}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q360 . ?sbj wdt:P31 wd:Q1344897 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'creator', 'o': 'Julian Assange', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'whistleblower platform'}}

 Q: Phil Collins hosted what benefit concert?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q144622 . ?sbj wdt:P31 wd:Q1850936 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'host', 'o': 'Phil Collins', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'benefit concert'}}

 Q: What is headstone picture of songwriter of Winterreise ?
 SPARQL: SELECT ?answer WHERE { wd:Q611529 wdt:P86 ?X . ?X wdt:P1442 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headstone picture', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Winterreise', 'p': 'songwriter', 'o': '$y0'}}

 Q: What is social media account on publishing house of Puyo Puyo Fever 2 ?
 SPARQL: SELECT ?answer WHERE { wd:Q5356463 wdt:P123 ?X . ?X wdt:P553 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'social media account on', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Puyo Puyo Fever 2', 'p': 'publishing house', 'o': '$y0'}}

 Q: Air India operates which aircraft model ?
 SPARQL:  select distinct ?obj where { wd:Q69906 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056995 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Air India', 'p': 'operates', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft model'}}

 Q: Give me {sovereign state} that {replaced by} {Korean Empire} and which contains the word {joseon} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj wdt:P1366 wd:Q28233 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'joseon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Korean Empire'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'joseon'}}

 Q: What is the {human} for {screenwriter} of {Forrest Gump}
 SPARQL:  select distinct ?obj where { wd:Q134773 wdt:P58 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Forrest Gump', 'p': 'screenwriter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {item used} of {rallying}, that has {same as} is {car} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7856 wdt:P2283 ?answer . ?answer wdt:P460 wd:Q1144312}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'rallying', 'p': 'item used', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'similar to', 'o': 'car'}}

 Q: Was Carlos Slim the owner of Torre Latinoamericana and Claro?
 SPARQL: ASK WHERE { wd:Q170419 wdt:P1830 wd:Q947870 . wd:Q170419 wdt:P1830 wd:Q1770208 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Carlos Slim', 'p': 'owner of', 'o': '?x0', '?x0': 'Torre Latinoamericana'}, {'h': 'IS', 'v': '?x1', 's': 'Carlos Slim', 'p': 'owner of', 'o': '?x1', '?x1': 'Claro'}]

 Q: Is the number of eligible voters in the Catalan regional election 2015 in Sobremunt equal to 69?
 SPARQL: ASK WHERE { wd:Q44991020 wdt:P1867 ?obj filter(?obj = 69) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Catalan regional election 2015 in Sobremunt', 'p': 'eligible voters', 'o': '?x0', '?x0': '69'}

 Q: Which is the chemical formula for cephalexin anhydrous?
 SPARQL: select distinct ?answer where { wd:Q411417 wdt:P274 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cephalexin', 'p': 'chemical formula', 'o': '?x0'}

 Q: Which is the cuisine of Surimi?
 SPARQL: select distinct ?answer where { wd:Q815740 wdt:P2012 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Surimi', 'p': 'cuisine', 'o': '?x0'}

 Q: Does the 22 mm gun M1931/37 have a field of view that is equal to 46.4?
 SPARQL: ASK WHERE { wd:Q280356 wdt:P4036 ?obj filter(?obj = 46.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'M1931/37', 'p': 'field of view', 'o': '?x0', '?x0': '46.4'}

 Q: What platform was Doom released on in 1996?
 SPARQL: SELECT ?value WHERE { wd:Q189784 p:P577 ?s . ?s ps:P577 ?x filter(contains(YEAR(?x),'1996')) . ?s pq:P400 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'platform', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Doom', 'p': 'released', 'o': '$y0'}}

 Q: What is {noble title} of {Gediminas} that is {end time} is {1341-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q244852 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1341')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gediminas', 'p': 'noble title', 'o': '?x0', 't': '1341'}

 Q: What was the twinned administrative body of San Diego in 1983?
 SPARQL: SELECT ?obj WHERE { wd:Q16552 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1983')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'San Diego', 'p': 'twinned administrative body', 'o': '?x0', 't': '1983'}

 Q: What is the {anatomical structure} for {anatomical location} of {stomach}
 SPARQL:  select distinct ?obj where { wd:Q1029907 wdt:P927 ?obj . ?obj wdt:P31 wd:Q4936952 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'stomach', 'p': 'anatomical location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anatomical structure'}}

 Q: What is {end cause} and {elected in} of {{Jeffrey Archer} has {position held} as {Member of the 44th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q313489 p:P39 ?s . ?s ps:P39 wd:Q41582609 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeffrey Archer', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 44th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeffrey Archer', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 44th Parliament of the United Kingdom'}}}]

 Q: Is the albedo of the 7384 1981 TJ .035?
 SPARQL: ASK WHERE { wd:Q844936 wdt:P4501 ?obj filter(?obj = 0.035) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '(7384) 1981 TJ', 'p': 'albedo', 'o': '?x0', '?x0': '0.035'}

 Q: What is {total fertility rate} of {Bahrain} that is {determination method} is {estimation process} ?
 SPARQL: SELECT ?obj WHERE { wd:Q398 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bahrain', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'estimation process'}}}

 Q: What is {played by} of {successor} of {Call of the Wild} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2934076 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Call of the Wild', 'p': 'successor', 'o': '$y0'}}

 Q: What is the {human} for {student of} of {Warren Buffett}
 SPARQL:  select distinct ?obj where { wd:Q47213 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Warren Buffett', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {dynasty} for {country of citizenship} of {Chandragupta Maurya}
 SPARQL:  select distinct ?obj where { wd:Q188541 wdt:P27 ?obj . ?obj wdt:P31 wd:Q164950 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chandragupta Maurya', 'p': 'country of citizenship', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dynasty'}}

 Q: What is {victor} of {awards} of {Tom Hollander} ?
 SPARQL: SELECT ?answer WHERE { wd:Q312124 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'victor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tom Hollander', 'p': 'awards', 'o': '$y0'}}

 Q: Is the explosive velocity of 1,3,5-trinitrobenzene equal to 7450?
 SPARQL: ASK WHERE { wd:Q420320 wdt:P2231 ?obj filter(?obj = 7450) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '1,3,5-trinitrobenzene', 'p': 'explosive velocity', 'o': '?x0', '?x0': '7450'}

 Q: What is Squash Info ID for Jahangir Khan?
 SPARQL: select distinct ?answer where { wd:Q741690 wdt:P3286 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jahangir Khan', 'p': 'Squash Info ID', 'o': '?x0'}

 Q: what is the {start time} for {William Henry Harrison} has {position held} as {President of the United States} ?
 SPARQL: SELECT ?value WHERE { wd:Q11869 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Henry Harrison', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the United States'}}}

 Q: What is the BMW M20 with the highest torque whose engine configuration is straight-six ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q796558 . ?ent wdt:P2230 ?obj . ?ent wdt:P1002 wd:Q1148385 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'torque', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'BMW M20', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'engine configuration', 'o': 'straight-six'}}}

 Q: Is the synodic period of Pluto equal to 366.73?
 SPARQL: ASK WHERE { wd:Q339 wdt:P4341 ?obj filter(?obj = 366.73) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Pluto', 'p': 'synodic period', 'o': '?x0', '?x0': '366.73'}

 Q: Does Montreal have a twinned administrative body of Los Angeles and Bucharest?
 SPARQL: ASK WHERE { wd:Q340 wdt:P190 wd:Q65 . wd:Q340 wdt:P190 wd:Q19660 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Montreal', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Los Angeles'}, {'h': 'IS', 'v': '?x1', 's': 'Montreal', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Bucharest'}]

 Q: what is instruction set architecture that starts with x
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'instruction set architecture'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'x'}}

 Q: What is {nominated for} of {John Mills} that is {for work} is {Ryan's Daughter} ?
 SPARQL: SELECT ?obj WHERE { wd:Q315728 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1423795 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Mills', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "Ryan's Daughter"}}}

 Q: What is the {girder bridge} for {next crossing upstream} of {London Bridge}
 SPARQL:  select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q1055465 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'London Bridge', 'p': 'next crossing upstream', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'girder bridge'}}

 Q: Is the elongation at the break of the AKROLOY PARA ICF 40 equal to 1?
 SPARQL: ASK WHERE { wd:Q57273218 wdt:P5811 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'AKROLOY PARA ICF 40', 'p': 'elongation at break', 'o': '?x0', '?x0': '1'}

 Q: Are John F. Kennedy and Eunice Kennedy Shriver sibling to Ted Kennedy?
 SPARQL: ASK WHERE { wd:Q134549 wdt:P3373 wd:Q9696 . wd:Q134549 wdt:P3373 wd:Q272908 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ted Kennedy', 'p': 'sibling', 'o': '?x0', '?x0': 'John F. Kennedy'}, {'h': 'IS', 'v': '?x1', 's': 'Ted Kennedy', 'p': 'sibling', 'o': '?x1', '?x1': 'Eunice Kennedy Shriver'}]

 Q: What is {follows} and {followed by} of {{Benedict XVI} has {position held} as {cardinal}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q2494 p:P39 ?s . ?s ps:P39 wd:Q45722 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benedict XVI', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'cardinal'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benedict XVI', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'cardinal'}}}]

 Q: How many {film crew member} are to/by {Ub Iwerks} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3092 wd:Q336424 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'film crew member', 'o': 'Ub Iwerks'}

 Q: What is the {Wikimedia list article} for {is a list of} of {natural number}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P360 wd:Q21199 . ?sbj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is a list of', 'o': 'natural number', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia list article'}}

 Q: Which is the start point of Taoyuan City?
 SPARQL: select distinct ?answer where { ?answer wdt:P1427 wd:Q115256}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'Taoyuan City'}

 Q: What is {has influence} of {Georges Bataille}, that has {studied at} is {Eberhard-Ludwigs-Gymnasium} ?
 SPARQL: SELECT ?answer WHERE { wd:Q207359 wdt:P737 ?answer . ?answer wdt:P69 wd:Q1278808}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Georges Bataille', 'p': 'has influence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied at', 'o': 'Eberhard-Ludwigs-Gymnasium'}}

 Q: Tell me race horse whose name has the word tikkanen in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10855242 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tikkanen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'race horse'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tikkanen'}}

 Q: What is the deathplace of Natalia Molchanova with a government headed by Jaume Ferrer Ribas?
 SPARQL: SELECT ?answer WHERE { wd:Q59920 wdt:P20 ?answer . ?answer wdt:P6 wd:Q11684565}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Natalia Molchanova', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'government headed by', 'o': 'Jaume Ferrer Ribas'}}

 Q: What is <NeuroNames ID (plain mode)> of <brain stem> ?
 SPARQL: select distinct ?answer where { wd:Q182228 wdt:P4394 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'brain stem', 'p': 'NeuroNames ID (plain mode)', 'o': '?x0'}

 Q: What is {birth city} of {Claude Adrien Helvétius}, that has {has villages} is {7th arrondissement of Paris} ?
 SPARQL: SELECT ?answer WHERE { wd:Q190302 wdt:P19 ?answer . ?answer wdt:P150 wd:Q259463}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Claude Adrien Helvétius', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has villages', 'o': '7th arrondissement of Paris'}}

 Q: What is {position held} of {Liu Xiaobo} where {start time} is {2003-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41617 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2003')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Liu Xiaobo', 'p': 'position held', 'o': '?x0', 't': '2003'}

 Q: What award did Juan Ramon Jimenez receive on 1956-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q131318 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Juan Ramon Jimenez', 'p': 'award', 'o': '?x0', 't': '1956'}

 Q: Who is the  {sovereign state} for {allegiance} of {Salman of Saudi Arabia}
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P945 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'allegiance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the unit conversion of the measured by Young's modulus?
 SPARQL: SELECT ?answer WHERE { wd:Q2091584 wdt:P1880 ?X . ?X wdt:P2442 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'unit conversion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Young's modulus", 'p': 'measured by', 'o': '$y0'}}

 Q: Who was the head of government in New Jersey beginning in 1935-1-15?W
 SPARQL: SELECT ?obj WHERE { wd:Q1408 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1935')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New Jersey', 'p': 'head of government', 'o': '?x0', 't': '1935'}

 Q: What is the {day in the Eastern Orthodox liturgical calendar} with the {MAX(Sandbox-Quantity)} whose {day in year for periodic occurrence} is {November 28}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q47164206 . ?ent wdt:P1106 ?obj . ?ent wdt:P837 wd:Q3017 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Sandbox-Quantity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'day in the Eastern Orthodox liturgical calendar', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'day in year for periodic occurrence', 'o': 'November 28'}}}

 Q: What is {position held} of {Zhou Enlai} where {end time} is {1976-1-8} ?
 SPARQL: SELECT ?obj WHERE { wd:Q17410 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1976')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zhou Enlai', 'p': 'position held', 'o': '?x0', 't': '1976'}

 Q: What is the art genre that starts with the letter o?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ō')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ō'}}

 Q: What significant event happened in Arkansas on April 12, 1861?
 SPARQL: SELECT ?obj WHERE { wd:Q1612 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1861')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arkansas', 'p': 'significant event', 'o': '?x0', 't': '1861'}

 Q: What is the {inferior planet} with the {MAX(flattening)} whose {parent astronomical body} is {Sun}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3901935 . ?ent wdt:P1102 ?obj . ?ent wdt:P397 wd:Q525 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'flattening', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inferior planet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Sun'}}}

 Q: What ice age starts with the letter "a"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49367 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ice age'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: How many items are narrated by Tom Kenny?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2438 wd:Q299282 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'narrated by', 'o': 'Tom Kenny'}

 Q: What is the place of incorporation of the developers of the Nintendo Switch?
 SPARQL: SELECT ?answer WHERE { wd:Q19610114 wdt:P178 ?X . ?X wdt:P740 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of incorporation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nintendo Switch', 'p': 'developer', 'o': '$y0'}}

 Q: What woodcut print is depicted by the Tower of Babel?
 SPARQL:  select distinct ?obj where { wd:Q41213 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q18219090 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tower of Babel', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'woodcut print'}}

 Q: Give me {credit institution} that contains the word {wachovia} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q730038 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wachovia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'credit institution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wachovia'}}

 Q: When did series of Nanda Empire and followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q949268 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nanda Empire', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nanda Empire', 'p': 'series', 'o': '$y0'}}]

 Q: What are thebig city which start with the letter i
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ł')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'big city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ł'}}

 Q: What is the {capital} for {work location} of {Vladimir Lenin}
 SPARQL:  select distinct ?obj where { wd:Q1394 wdt:P937 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Lenin', 'p': 'work location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: Who is {habitat} of {taxon parent} of {Lagopus persicus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41002157 wdt:P171 ?X . ?X wdt:P2974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'habitat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lagopus persicus', 'p': 'taxon parent', 'o': '$y0'}}

