 Q: What is {previous job holder} of {published in journal} of {Acoustic discrimination of sympatric morphs in Darwin's finches: a behavioural mechanism for assortative mating?} ?
 SPARQL: SELECT ?answer WHERE { wd:Q30475867 wdt:P1433 ?X . ?X wdt:P1365 ?answer}
 ALIST: {}

 Q: Give me {decimal currency} that {central bank/issuer} {Reserve Bank of Australia} and which that starts with {'a'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28795800 . ?sbj wdt:P562 wd:Q1506724 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'decimal currency', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'central bank/issuer', 'o': 'Reserve Bank of Australia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: what is the {for work} for {Angelina Jolie} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q13909 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angelina Jolie', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: what is the {start time} for {Anne of Great Britain} has {position held} as {monarch of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q119702 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anne of Great Britain', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of England'}}}

 Q: What is {husbands} of {daughter of} of {Edward the Confessor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q130005 wdt:P25 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husbands', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edward the Confessor', 'p': 'daughter of', 'o': '$y0'}}

 Q: What is Dewey Decimal Classification for Canton of Fribourg ?
 SPARQL: select distinct ?answer where { wd:Q12640 wdt:P1036 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Canton of Fribourg', 'p': 'Dewey Decimal Classification', 'o': '?x0'}

 Q: What is the {painting} for {depicted by} of {Charles I of England}
 SPARQL:  select distinct ?obj where { wd:Q81506 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles I of England', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: What is {sports} of {International Canoe Federation}, that has {associated with} is {kayaker} ?
 SPARQL: SELECT ?answer WHERE { wd:Q684857 wdt:P641 ?answer . ?answer wdt:P3095 wd:Q16004471}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'International Canoe Federation', 'p': 'sport', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'associated with', 'o': 'kayaker'}}

 Q: Is the boiler pressure of the SNCF 141.R equal to 15.5?
 SPARQL: ASK WHERE { wd:Q948166 wdt:P5071 ?obj filter(?obj = 15.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'SNCF 141.R', 'p': 'boiler pressure', 'o': '?x0', '?x0': '15.5'}

 Q: What is the {grammar} for {studies} of {Hungarian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2578 wd:Q9067 . ?sbj wdt:P31 wd:Q8091 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'Hungarian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'grammar'}}

 Q: Which was the aerial bombing participant of Allies?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q329888 . ?sbj wdt:P31 wd:Q17912683 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Allies', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aerial bombing'}}

 Q: What is the diet that is opposite and named after veganism?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q181138 wdt:P461 ?ans_1 . wd:Q181138 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'veganism', 'p': 'opposite', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'veganism', 'p': 'named after', 'o': '?x1'}]

 Q: Is it true that the magnetic moment of the triton equals 0.000000000000000000000000015046094?
 SPARQL: ASK WHERE { wd:Q488424 wdt:P2069 ?obj filter(?obj = 0.000000000000000000000000015046094) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'triton', 'p': 'magnetic moment', 'o': '?x0', '?x0': '0.000000000000000000000000015046094'}

 Q: What is <ČSFD film ID> of <The Ten Commandments> ?
 SPARQL: select distinct ?answer where { wd:Q746733 wdt:P2529 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Ten Commandments', 'p': 'ČSFD film ID', 'o': '?x0'}

 Q: Where did Guy de Maupassant end his education in 1869?
 SPARQL: SELECT ?obj WHERE { wd:Q9327 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1869')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guy de Maupassant', 'p': 'education', 'o': '?x0', 't': '1869'}

 Q: Which is the detail map of Windsor Castle?
 SPARQL: select distinct ?answer where { wd:Q42646 wdt:P1621 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Windsor Castle', 'p': 'detail map', 'o': '?x0'}

 Q: What is {noble title} of {Berengar I of Italy} that is {followed by} is {Rudolph II of Burgundy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 wd:Q442257 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'noble title', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Berengar I of Italy', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'followed by', 'o': 'Rudolph II of Burgundy'}}}

 Q: What is <DVN ID> of <Anne Frank> ?
 SPARQL: select distinct ?answer where { wd:Q4583 wdt:P1788 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anne Frank', 'p': 'DVN ID', 'o': '?x0'}

 Q: Who gave the {ideology} of {party} of {Elisenda Alamany} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42963597 wdt:P102 ?X . ?X wdt:P1142 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ideology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Elisenda Alamany', 'p': 'party', 'o': '$y0'}}

 Q: Port Harcourt shares the border with who?
 SPARQL: select distinct ?answer where { wd:Q217432 wdt:P47 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Port Harcourt', 'p': 'border', 'o': '?x0'}

 Q: Located in the city of Washington D.C., what is the parent company of the Smithsonian Institution?
 SPARQL: SELECT ?answer WHERE { wd:Q131626 wdt:P355 ?answer . ?answer wdt:P131 wd:Q61}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Smithsonian Institution', 'p': 'parent company of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Washington'}}

 Q: What is the native language and also the languages spoken, written or signed by Iggy Pop?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q182665 wdt:P103 ?ans_1 . wd:Q182665 wdt:P1412 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Iggy Pop', 'p': 'native language', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Iggy Pop', 'p': 'languages spoken, written or signed', 'o': '?x1'}]

 Q: What is {color} and {architectural style} of {{American Gothic} has {depicts} as {house}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q464782 p:P180 ?s . ?s ps:P180 wd:Q3947 . ?s pq:P462 ?value1 . ?s pq:P149 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'color', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'American Gothic', 'p': 'depicts', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'depicts', 'o': 'house'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'architectural style', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'American Gothic', 'p': 'depicts', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'depicts', 'o': 'house'}}}]

 Q: what is the {start time} for {Jerusalem} has {head of government} as {Daniel Auster} ?
 SPARQL: SELECT ?value WHERE { wd:Q1218 p:P6 ?s . ?s ps:P6 wd:Q676953 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jerusalem', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Daniel Auster'}}}

 Q: Which are the measures for weighing scale?
 SPARQL: select distinct ?answer where { wd:Q134566 wdt:P2575 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'weighing scale', 'p': 'measures', 'o': '?x0'}

 Q: What is {location born} of {Xu Fu}, that has {longitude} is {118.3} ?
 SPARQL: SELECT ?answer WHERE { wd:Q700302 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'118.3'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Xu Fu', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': '118.3'}}

 Q: which inner planet has the highest orbital eccentricity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3504248 . ?ent wdt:P1096 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'orbital eccentricity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inner planet'}}

 Q: What is {spouse} of {Mark Zuckerberg} that is {place of marriage} is {Palo Alto} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36215 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q47265 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'married', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mark Zuckerberg', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of marriage', 'o': 'Palo Alto'}}}

 Q: What itime of the day that has the minimum time index in a Day?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1260524 . ?ent wdt:P4895 ?obj . ?ent wdt:P31 wd:Q1260524} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'time index', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'time of the day'}}

 Q: What is {member of sports team} of {Colin Meads} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q642380 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Colin Meads', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Colin Meads', 'p': 'team', 'o': '$y0'}}]

 Q: How many awards are given by the Académie française?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1027 wd:Q161806 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'given by', 'o': 'Académie française'}

 Q: Which is the architectural style of postmodernism?
 SPARQL: select distinct ?answer where { ?answer wdt:P149 wd:Q47783}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'postmodernism'}

 Q: Is the sublimation temperature of the cobalt(III) nitrate equal to 40?
 SPARQL: ASK WHERE { wd:Q14174835 wdt:P2113 ?obj filter(?obj = 40) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'cobalt(III) nitrate', 'p': 'sublimation temperature', 'o': '?x0', '?x0': '40'}

 Q: What is the {human} for {designed by} of {Golden Gate Bridge}
 SPARQL:  select distinct ?obj where { wd:Q44440 wdt:P287 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Golden Gate Bridge', 'p': 'designer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is it true that the speed of sound through water is less than 1197.6?
 SPARQL: ASK WHERE { wd:Q283 wdt:P2075 ?obj filter(?obj < 1197.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'water', 'p': 'speed of sound', 'o': '?x0', '?x0': '1197.6'}

 Q: Which is the end and start time of Barnaul which is located in the administrative territorial entity as West Siberian Krai?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q6014 p:P131 ?s . ?s ps:P131 wd:Q4186485 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barnaul', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'West Siberian Krai'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barnaul', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'West Siberian Krai'}}}]

 Q: what is the {for work} for {Steven Soderbergh} has {nominated for} as {Satellite Award for Best Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q103917 p:P1411 ?s . ?s ps:P1411 wd:Q2092962 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Steven Soderbergh', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Satellite Award for Best Director'}}}

 Q: Which award did Mike Trout receive and to which league does he belong?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q3090378 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P118 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'league', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mike Trout', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mike Trout', 'p': 'award', 'o': '$y0'}}]

 Q: What painting is exhibited at Brown University?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P608 wd:Q49114 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'exhibited at', 'o': 'Brown University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: what is the {start time} for {Emilia-Romagna} has {head of government} as {Pier Luigi Bersani} ?
 SPARQL: SELECT ?value WHERE { wd:Q1263 p:P6 ?s . ?s ps:P6 wd:Q47556 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emilia-Romagna', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Pier Luigi Bersani'}}}

 Q: What are the medical examinations for blood sugar?
 SPARQL: select distinct ?answer where { wd:Q275157 wdt:P923 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'blood sugar', 'p': 'medical examinations', 'o': '?x0'}

 Q: Which is the Argentine deputy votations ID of Cristina Kirchner?
 SPARQL: select distinct ?answer where { wd:Q40649 wdt:P4693 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cristina Kirchner', 'p': 'Argentine deputy votations ID', 'o': '?x0'}

 Q: Who is the organizer of Ultimate Fighting Championship?
 SPARQL: select distinct ?answer where { ?answer wdt:P664 wd:Q186471}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'organizer', 'o': 'Ultimate Fighting Championship'}

 Q: Give me {art genre} that {studied by} {ballet studies} and which that starts with {'b'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'ballet studies'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: In 1975, what awards were Gladys Knight & the Pips nominated for?
 SPARQL: SELECT ?obj WHERE { wd:Q1529105 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gladys Knight & the Pips', 'p': 'nominated for', 'o': '?x0', 't': '1975'}

 Q: What borders with Sao Goncalo whose start date is 11-22-1573?
 SPARQL: SELECT ?answer WHERE { wd:Q83114 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1573'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sao Goncalo', 'p': 'border', 'o': '?x0', 't': '1573'}

 Q: How many films are edited by David Lynch?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1040 wd:Q2071 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'edited by', 'o': 'David Lynch'}

 Q: Which is the medical attribute for the produced sound of the respiratory system?
 SPARQL:  select distinct ?obj where { wd:Q7891 wdt:P4733 ?obj . ?obj wdt:P31 wd:Q44476427 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'respiratory system', 'p': 'produced sound', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical attribute'}}

 Q: How many Gutenberg Bible collections are there?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q158075 wdt:P195 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Gutenberg Bible', 'p': 'collection', 'o': '?x0'}

 Q: Which is the BBC News Democracy Live ID of Jeremy Corbyn?
 SPARQL: select distinct ?answer where { wd:Q291169 wdt:P2173 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jeremy Corbyn', 'p': 'BBC News Democracy Live ID', 'o': '?x0'}

 Q: What is the {taxon} with the {MAX(genome size)} whose {taxon rank} is {species}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P2143 ?obj . ?ent wdt:P105 wd:Q7432 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'genome size', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon rank', 'o': 'species'}}}

 Q: what is the {statement is subject of} for {John Ford} has {nominated for} as {Academy Award for Best Picture} ?
 SPARQL: SELECT ?value WHERE { wd:Q51114 p:P1411 ?s . ?s ps:P1411 wd:Q102427 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Ford', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Picture'}}}

 Q: what is the {country} for {John Barrymore} has {place of death} as {Los Angeles} ?
 SPARQL: SELECT ?value WHERE { wd:Q95034 p:P20 ?s . ?s ps:P20 wd:Q65 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Barrymore', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Los Angeles'}}}

 Q: Who is the {cricket field} for {owned by} of {Australian Football League}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q50783 . ?sbj wdt:P31 wd:Q682943 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'Australian Football League', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cricket field'}}

 Q: who is partner of Tyler Perry that has start time is 2009-1-1 ?
 SPARQL: SELECT ?obj WHERE { wd:Q686301 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tyler Perry', 'p': 'partner', 'o': '?x0', 't': '2009'}

 Q: "What is the result of the first aid response to move to fresh air, with regard to talc?"
 SPARQL: SELECT ?answer WHERE { wd:Q134583 wdt:P1542 ?answer . ?answer wdt:P2239 wd:Q21010971}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'talc', 'p': 'result', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first aid response', 'o': 'move to fresh air'}}

 Q: what is the {end time} for {Brandeis University} has {chairperson} as {Abram L. Sachar} ?
 SPARQL: SELECT ?value WHERE { wd:Q49119 p:P488 ?s . ?s ps:P488 wd:Q4669370 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brandeis University', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Abram L. Sachar'}}}

 Q: Where is the next crossing downstream of the London Bridge.
 SPARQL: select distinct ?answer where { wd:Q130206 wdt:P2674 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'London Bridge', 'p': 'next crossing downstream', 'o': '?x0'}

 Q: What is {next to lake} of {is in the principal area of} of {University of Medical Sciences and Technology} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7895723 wdt:P131 ?X . ?X wdt:P206 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'next to lake', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'University of Medical Sciences and Technology', 'p': 'in', 'o': '$y0'}}

 Q: What is {diplomatic relation} of {Brunei} that is {statement is subject of} is {Brunei–Canada relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q921 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15949089 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brunei', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Brunei–Canada relations'}}}

 Q: Is the bite force quotient of the Vulpes vulpes equal to 92?
 SPARQL: ASK WHERE { wd:Q8332 wdt:P3485 ?obj filter(?obj = 92) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vulpes vulpes', 'p': 'bite force quotient', 'o': '?x0', '?x0': '92'}

 Q: What is sex or gender for Mick Jagger ?
 SPARQL: select distinct ?answer where { wd:Q128121 wdt:P21 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mick Jagger', 'p': 'sex or gender', 'o': '?x0'}

 Q: What is work period start for Corín Tellado ?
 SPARQL: select distinct ?answer where { wd:Q1813126 wdt:P2031 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Corín Tellado', 'p': 'work period start', 'o': '?x0'}

 Q: what is the {burial plot reference} for {Louis-Nicolas Davout} has {place of burial} as {Père Lachaise Cemetery} ?
 SPARQL: SELECT ?value WHERE { wd:Q158778 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'burial plot reference', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis-Nicolas Davout', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of burial', 'o': 'Pere Lachaise'}}}

 Q: What is the name of the skyscraper that has an architectural style of neo-futurism and that starts with the letter "t"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj wdt:P149 wd:Q17012219 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skyscraper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'neo-futurism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: The conjugate base of ammonia is what chemical compound?
 SPARQL:  select distinct ?obj where { wd:Q4087 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ammonia', 'p': 'conjugate base', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Who is the film editor and director of Reservoir Dogs?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q72962 wdt:P1040 ?ans_1 . wd:Q72962 wdt:P57 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Reservoir Dogs', 'p': 'film editor', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Reservoir Dogs', 'p': 'director', 'o': '?x1'}]

 Q: What is the female version of Józef Piłsudski with the acronym чол?
 SPARQL: SELECT ?answer WHERE { wd:Q885 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'чол'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Józef Piłsudski', 'p': 'male', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'acronym', 'o': 'чол'}}

 Q: Tell me the name of Badminton World Federation that of start time is 1934-7-5?
 SPARQL: SELECT ?obj WHERE { wd:Q126638 p:P2561 ?s . ?s ps:P2561 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1934')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Badminton World Federation', 'p': 'name', 'o': '?x0', 't': '1934'}

 Q: What is  the used for treatment of the treats disease of methocarbamol ?
 SPARQL: SELECT ?answer WHERE { wd:Q411456 wdt:P2175 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used for treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'methocarbamol', 'p': 'treats', 'o': '$y0'}}

 Q: Which is the Power of 10 athlete ID for Paula Radcliffe?
 SPARQL: select distinct ?answer where { wd:Q233672 wdt:P2090 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paula Radcliffe', 'p': 'Power of 10 athlete ID', 'o': '?x0'}

 Q: Which is the CulturaItalia ID of Uffizi?
 SPARQL: select distinct ?answer where { wd:Q51252 wdt:P1949 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Uffizi', 'p': 'CulturaItalia ID', 'o': '?x0'}

 Q: What is {award received} of {Louis Malle} that is {for work} is {Au revoir les enfants} ?
 SPARQL: SELECT ?obj WHERE { wd:Q55392 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q187276 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis Malle', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Au revoir les enfants'}}}

 Q: What is the sister city of Tirana, that has the county seat for the 4th of August Regime?
 SPARQL: SELECT ?answer WHERE { wd:Q19689 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q1358836}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tirana', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat for', 'o': '4th of August Regime'}}

 Q: Which is Tilastopaja female athlete ID for Irena Szewińska?
 SPARQL: select distinct ?answer where { wd:Q229424 wdt:P3882 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Irena Szewińska', 'p': 'Tilastopaja female athlete ID', 'o': '?x0'}

 Q: What is {award received} of {Abdellatif Kechiche} that is {for work} is {The Secret of the Grain} ?
 SPARQL: SELECT ?obj WHERE { wd:Q307996 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q521484 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abdellatif Kechiche', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Secret of the Grain'}}}

 Q: Which is the Olympic sport that is an authority of International Biathlon Union and contains the word biathlon in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj wdt:P797 wd:Q866910 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'biathlon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Olympic sport', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'authority', 'o': 'International Biathlon Union'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'biathlon'}}

 Q: who is played by next of Perfect Day ?
 SPARQL: SELECT ?answer WHERE { wd:Q3503874 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Perfect Day', 'p': 'next', 'o': '$y0'}}

 Q: What is the start time for Auguste Comte and his spouse Caroline Massin
 SPARQL: SELECT ?value WHERE { wd:Q12718 p:P26 ?s . ?s ps:P26 wd:Q1044529 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Auguste Comte', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Caroline Massin'}}}

 Q: what is the {replaces} for {William H. Seward} has {position held} as {United States Secretary of State} ?
 SPARQL: SELECT ?value WHERE { wd:Q297308 p:P39 ?s . ?s ps:P39 wd:Q14213 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William H. Seward', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary of State'}}}

 Q: Which is the Catalogue of Life in Taiwan ID for Carica papaya?
 SPARQL: select distinct ?answer where { wd:Q34887 wdt:P3088 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carica papaya', 'p': 'Catalogue of Life in Taiwan ID', 'o': '?x0'}

 Q: What time is it at the twin town of Denpasar?
 SPARQL: SELECT ?answer WHERE { wd:Q11506 wdt:P190 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Denpasar', 'p': 'twin town', 'o': '$y0'}}

 Q: Volgograd is the capital of governorate of the Russian Soviet Federative Socialist Republic
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P36 wd:Q914 . ?sbj wdt:P31 wd:Q15733039 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Volgograd', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'governorate of the Russian Soviet Federative Socialist Republic'}}

 Q: What is key event for film producer of Selma ?
 SPARQL: SELECT ?answer WHERE { wd:Q17183770 wdt:P162 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Selma', 'p': 'producer', 'o': '$y0'}}

 Q: Who is the facet of and located in the administrative territorial entity of Assassination of John F. Kennedy?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q193484 wdt:P1269 ?ans_1 . wd:Q193484 wdt:P131 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Assassination of John F. Kennedy', 'p': 'facet of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Assassination of John F. Kennedy', 'p': 'located in the administrative territorial entity', 'o': '?x1'}]

 Q: What is {coordinate location} of {Daugava River} that is {applies to part} is {river mouth} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8197 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Daugava River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'mouth'}}}

 Q: Tell me the type of statistic that starts with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47103999 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of statistic'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Who was Leonard Nimoy married to in 1989?
 SPARQL: SELECT ?obj WHERE { wd:Q16345 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leonard Nimoy', 'p': 'married to', 'o': '?x0', 't': '1989'}

 Q: Does the pulication interval of the Le Monde equal 0.8?
 SPARQL: ASK WHERE { wd:Q12461 wdt:P2896 ?obj filter(?obj = 0.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Le Monde', 'p': 'publication interval', 'o': '?x0', '?x0': '0.8'}

