 Q: Which is the business that has as parent organization the Oracle Corporation?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q19900 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Oracle Corporation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: Tell me the security agency which starts with the letter s!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'security agency'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the {unincorporated territory} for {anthem} of {The Star-Spangled Banner}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P85 wd:Q44696 . ?sbj wdt:P31 wd:Q783733 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'Star-Spangled Banner', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unincorporated territory'}}

 Q: What is {position held} of {Robert I of Scotland} that is {replaced by} is {David II of Scotland} ?
 SPARQL: SELECT ?obj WHERE { wd:Q187312 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q239486 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert I of Scotland', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'David II of Scotland'}}}

 Q: What is the {taxon} with the {MAX(basic reproduction number)} whose {found in taxon} is {Homo sapiens}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3492 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'basic reproduction number', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'found in taxon', 'o': 'Homo sapiens'}}}

 Q: Is the standard enthalpy of formation for ethanol less than -333.12?
 SPARQL: ASK WHERE { wd:Q153 wdt:P3078 ?obj filter(?obj < -333.12) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'ethanol', 'p': 'standard enthalpy of formation', 'o': '?x0', '?x0': '-333.12'}

 Q: What is {notable work} of {Christopher Hitchens} and {publication date}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'notable work', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0'}}]

 Q: What is the {attempted murder} for {conflict} of {Guy Fawkes}
 SPARQL:  select distinct ?obj where { wd:Q13898 wdt:P607 ?obj . ?obj wdt:P31 wd:Q4818169 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Guy Fawkes', 'p': 'conflict', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'attempted murder'}}

 Q: Is the heat capacity of benzoic acid equal to 102.7?
 SPARQL: ASK WHERE { wd:Q191700 wdt:P2056 ?obj filter(?obj = 102.7) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'benzoic acid', 'p': 'heat capacity', 'o': '?x0', '?x0': '102.7'}

 Q: Did {Chris_Martin} {instrument} {guitar}?
 SPARQL: ASK WHERE { wd:Q712860 wdt:P1303 wd:Q6607 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chris Martin', 'p': 'instrument', 'o': '?x0', '?x0': 'guitar'}]

 Q: What is {cast member} of {Roots} that is {character role} is {Kunta Kinte} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1247168 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q636142 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cast member', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roots', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'character role', 'o': 'Kunta Kinte'}}}

 Q: What is the {record label} and the {discography} of {Sex_Pistols} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q82545 wdt:P264 ?ans_1 . wd:Q82545 wdt:P358 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Sex Pistols', 'p': 'record label', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Sex Pistols', 'p': 'discography', 'o': '?x1'}]

 Q: How many seats are in prefectural assembly?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q28362371 . ?ent wdt:P1342 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of seats', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'prefectural assembly'}}

 Q: What is the {single-family detached home} for {architect} of {Frank Lloyd Wright}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q5604 . ?sbj wdt:P31 wd:Q1307276 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Frank Lloyd Wright', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single-family detached home'}}

 Q: what is the {start time} for {Nicolas Jean-de-Dieu Soult} has {position held} as {head of government of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q296023 p:P39 ?s . ?s ps:P39 wd:Q15135541 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-de-Dieu Soult', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'head of government of France'}}}

 Q: Did {Heart} {connects with} {artery} and {human body} ?
 SPARQL: ASK WHERE { wd:Q1072 wdt:P2789 wd:Q9655 . wd:Q1072 wdt:P2789 wd:Q23852 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'heart', 'p': 'connects with', 'o': '?x0', '?x0': 'arteries'}, {'h': 'IS', 'v': '?x1', 's': 'heart', 'p': 'connects with', 'o': '?x1', '?x1': 'human body'}]

 Q: what is the {end time} for {Jeannette Rankin} has {position held} as {United States representative} ?
 SPARQL: SELECT ?value WHERE { wd:Q232407 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeannette Rankin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States representative'}}}

 Q: The memory capacity of the Nokia X is 409.6, correct?
 SPARQL: ASK WHERE { wd:Q15299648 wdt:P2928 ?obj filter(?obj = 409.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nokia X', 'p': 'memory capacity', 'o': '?x0', '?x0': '409.6'}

 Q: Is the number of survivors of PIA Flight 661 less than 0?
 SPARQL: ASK WHERE { wd:Q100021 wdt:P1561 ?obj filter(?obj < 0.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'PIA Flight 661', 'p': 'number of survivors', 'o': '?x0', '?x0': '0.0'}

 Q: Was the number of casualties of the King's Cross fire equal to 100?
 SPARQL: ASK WHERE { wd:Q58395 wdt:P1590 ?obj filter(?obj = 100) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "King's Cross fire", 'p': 'number of casualties', 'o': '?x0', '?x0': '100'}

 Q: what is the {end time} for {Vicente Guerrero} has {position held} as {President of Mexico} ?
 SPARQL: SELECT ?value WHERE { wd:Q315618 p:P39 ?s . ?s ps:P39 wd:Q628004 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vicente Guerrero', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Mexico'}}}

 Q: What is the taxonomic rank of the blue whale?
 SPARQL:  select distinct ?obj where { wd:Q42196 wdt:P105 ?obj . ?obj wdt:P31 wd:Q427626 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'blue whale', 'p': 'taxonomic rank', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxonomic rank'}}

 Q: What is the {state-owned enterprise} for {item operated} of {Airbus A330}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P121 wd:Q6478 . ?sbj wdt:P31 wd:Q270791 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operates', 'o': 'Airbus A330', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state-owned enterprise'}}

 Q: Give me {international association football clubs cup} that {anthem} {UEFA Champions League Anthem} and which that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542757 . ?sbj wdt:P85 wd:Q1453101 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international association football clubs cup', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'UEFA Champions League Anthem'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Which is the chronology which starts with the letter t?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130788 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chronology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: what is the {point in time} for {Pau Gasol} has {award received} as {Gold Medal of Work Merit (Spain)} ?
 SPARQL: SELECT ?value WHERE { wd:Q193052 p:P166 ?s . ?s ps:P166 wd:Q39946570 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Pau Gasol', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Gold Medal of Work Merit (Spain)'}, 't': '?x0'}

 Q: What is {published by} of {works for} of {Harold James Mowat} ?
 SPARQL: SELECT ?answer WHERE { wd:Q54453167 wdt:P108 ?X . ?X wdt:P123 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold James Mowat', 'p': 'works for', 'o': '$y0'}}

 Q: Did {Al_Capone} {religion} {Melkite Greek Catholic Church}?
 SPARQL: ASK WHERE { wd:Q80048 wdt:P140 wd:Q64885 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Al Capone', 'p': 'religion', 'o': '?x0', '?x0': 'Melkite Greek Catholic Church'}]

 Q: What is the Royal Society ID of Jocelyn Bell Burnell?
 SPARQL: select distinct ?answer where { wd:Q233974 wdt:P2070 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jocelyn Bell Burnell', 'p': 'Royal Society ID', 'o': '?x0'}

 Q: Dilma Rousseff received what award in the year 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q40722 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dilma Rousseff', 'p': 'award', 'o': '?x0', 't': '2015'}

 Q: Tell me the mathematical model that contains the word theory in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486902 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'theory')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mathematical model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'theory'}}

 Q: Which is the DAAO ID for Louise Bourgeois?
 SPARQL: select distinct ?answer where { wd:Q159409 wdt:P1707 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Louise Bourgeois', 'p': 'DAAO ID', 'o': '?x0'}

 Q: What is the {Irinotecan} for {medical condition treated} of {colorectal cancer}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q188874 . ?sbj wdt:P31 wd:Q26989371 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'colorectal cancer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Irinotecan'}}

 Q: Is the minimal incubation period of Ebola in humans more or less than 1.6?
 SPARQL: ASK WHERE { wd:Q51993 wdt:P3488 ?obj filter(?obj < 1.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Ebola', 'p': 'minimal incubation period in humans', 'o': '?x0', '?x0': '1.6'}

 Q: What is <ForaDeJogo player ID> of <Eusébio> ?
 SPARQL: select distinct ?answer where { wd:Q162043 wdt:P3046 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eusébio', 'p': 'ForaDeJogo player ID', 'o': '?x0'}

 Q: What is {characters} of {famous books} of {Wolfgang Amadeus Mozart} ?
 SPARQL: SELECT ?answer WHERE { wd:Q254 wdt:P800 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wolfgang Amadeus Mozart', 'p': 'famous books', 'o': '$y0'}}

 Q: What is {academic degree} and {doctoral thesis} of {{Angela Merkel} has {educated at} as {German Academy of Sciences at Berlin}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q567 p:P69 ?s . ?s ps:P69 wd:Q49738 . ?s pq:P512 ?value1 . ?s pq:P1026 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angela Merkel', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'German Academy of Sciences at Berlin'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'thesis', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angela Merkel', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'German Academy of Sciences at Berlin'}}}]

 Q: Who was Gale Sondergaard married to until 1971-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q233845 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1971')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gale Sondergaard', 'p': 'married to', 'o': '?x0', 't': '1971'}

 Q: What is the {literary work} for {language of work or name} of {Old English}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q42365 . ?sbj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Old English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: What is <depicts Iconclass notation> of <The Garden of Earthly Delights> ?
 SPARQL: select distinct ?answer where { wd:Q321303 wdt:P1257 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Garden of Earthly Delights', 'p': 'depicts Iconclass notation', 'o': '?x0'}

 Q: tell  me American football team that home venue Lambeau Field  name has the  the word bay in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q860790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bay')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'American football team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'home venue', 'o': 'Lambeau Field'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'bay'}}

 Q: What is extended from and written by The Man with Two Faces?
 SPARQL: SELECT ?answer WHERE { wd:Q7750132 wdt:P144 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'written by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Man with Two Faces', 'p': 'extended from', 'o': '$y0'}}

 Q: What is {awarded} of {headed by} of {International Council for Science} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1162568 wdt:P488 ?X . ?X wdt:P166 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'International Council for Science', 'p': 'headed by', 'o': '$y0'}}

 Q: What is the numeric writing system that starts with the letter 'n'?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q140774 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'numeric writing system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is {Indian reservation} of {Telangana}, that has {compulsory education (minimum age)} is {6.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q677037 wdt:P131 ?answer . ?answer wdt:P3270 ?x FILTER(contains(?x,'6.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Telangana', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'compulsory education (minimum age)', 'o': '6.0'}}

 Q: What is the {G-type main-sequence star} for {child astronomical body} of {Uranus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q324 . ?sbj wdt:P31 wd:Q5864 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Uranus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: Who is the {religious identity} for {manifestation of} of {atheism}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q7066 . ?sbj wdt:P31 wd:Q4392985 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'atheism', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious identity'}}

 Q: What is the Terminologia Histologica for stem cell?
 SPARQL: select distinct ?answer where { wd:Q48196 wdt:P1694 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'stem cell', 'p': 'Terminologia Histologica', 'o': '?x0'}

 Q: What is the {medication} for {drug used for treatment} of {asthma}
 SPARQL:  select distinct ?obj where { wd:Q35869 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'asthma', 'p': 'used for treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medication'}}

 Q: What is the {ranch} for {residence} of {Ronald Reagan}
 SPARQL:  select distinct ?obj where { wd:Q9960 wdt:P551 ?obj . ?obj wdt:P31 wd:Q509028 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ronald Reagan', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ranch'}}

 Q: Who is the {local coat of arms} for {coat of arms} of {Jerusalem}
 SPARQL:  select distinct ?obj where { wd:Q1218 wdt:P237 ?obj . ?obj wdt:P31 wd:Q480260 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jerusalem', 'p': 'coat of arms', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'local coat of arms'}}

 Q: what is the {point in time} for {Rachel Carson} has {award received} as {Presidential Medal of Freedom} ?
 SPARQL: SELECT ?value WHERE { wd:Q100948 p:P166 ?s . ?s ps:P166 wd:Q17144 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Rachel Carson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Presidential Medal of Freedom'}, 't': '?x0'}

 Q: What { partner } of { Kirsten Dunst } is { start time } { 2002 - 0 }?
 SPARQL: SELECT ?obj WHERE { wd:Q76478 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kirsten Dunst', 'p': 'partner', 'o': '?x0', 't': '2002'}

 Q: Which chemical tanker has the largest payload mass?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15254 . ?ent wdt:P4519 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'payload mass', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical tanker'}}

 Q: What is {twin town} of {Chiba}, that has {has shires} is {Shengze} ?
 SPARQL: SELECT ?answer WHERE { wd:Q170616 wdt:P190 ?answer . ?answer wdt:P150 wd:Q13821942}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chiba', 'p': 'twin town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has shires', 'o': 'Shengze'}}

 Q: What is the {snooker tournament} for {location} of {Indore}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q66616 . ?sbj wdt:P31 wd:Q17299750 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Indore', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'snooker tournament'}}

 Q: What is {isn't} of {Dave Marsh}, that has {biological sex} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q753476 wdt:P1889 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dave Marsh', 'p': "isn't", 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'biological sex', 'o': 'male'}}

 Q: When was the population of Kazan 1.19085e+06?
 SPARQL: SELECT ?value WHERE { wd:Q900 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.19085e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kazan', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.19085e+06'}, 't': '?x0'}

 Q: What is {written by} of {The Origins of Totalitarianism}, that has {role model} is {Karl Jaspers} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1327843 wdt:P50 ?answer . ?answer wdt:P737 wd:Q76509}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Origins of Totalitarianism', 'p': 'written by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'role model', 'o': 'Karl Jaspers'}}

 Q: What is the domain of compact space?
 SPARQL: select distinct ?answer where { ?answer wdt:P1568 wd:Q381892}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'domain', 'o': 'compact space'}

 Q: Which is the Tela Botanica ID for Diospyros?
 SPARQL: select distinct ?answer where { wd:Q165258 wdt:P3105 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Diospyros', 'p': 'Tela Botanica ID', 'o': '?x0'}

 Q: Who {follows} and {followed by} of {{Lothair I} has {noble title} as {monarch of Italy}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lothair I', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lothair I', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}]

 Q: What is the {point in time} {Lodz} had a {population} of {45200.0}?
 SPARQL: SELECT ?value WHERE { wd:Q580 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'452000.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lodz', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '452000.0'}, 't': '?x0'}

 Q: When did Budapest have a population of 1.74 million?
 SPARQL: SELECT ?value WHERE { wd:Q1781 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.74004e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Budapest', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.74004e+06'}, 't': '?x0'}

 Q: What is {computing platform} of {series} of {Mario Bros. II} ?
 SPARQL: SELECT ?answer WHERE { wd:Q886260 wdt:P179 ?X . ?X wdt:P400 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'platform', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mario Bros. II', 'p': 'series', 'o': '$y0'}}

 Q: What are the factors of therapeutic area for the  {major depressive disorder} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4044 wd:Q42844 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'therapeutic area', 'o': 'major depressive disorder'}

 Q: What award was Nicolas Cage nominated for that he received?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q42869 wdt:P1411 ?ans_1 . wd:Q42869 wdt:P166 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Nicolas Cage', 'p': 'nominated for', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Nicolas Cage', 'p': 'award', 'o': '?x1'}]

 Q: Was Atom studied by a list of academic disciplines and atomic physics?
 SPARQL: ASK WHERE { wd:Q9121 wdt:P2579 wd:Q221173 . wd:Q9121 wdt:P2579 wd:Q26383 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'atom', 'p': 'studied by', 'o': '?x0', '?x0': 'list of academic disciplines'}, {'h': 'IS', 'v': '?x1', 's': 'atom', 'p': 'studied by', 'o': '?x1', '?x1': 'atomic physics'}]

 Q: What was the depth over terrain presented by Good Morning America?
 SPARQL: SELECT ?answer WHERE { wd:Q825946 wdt:P371 ?X . ?X wdt:P2048 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'depth over terrain', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Good Morning America', 'p': 'presented by', 'o': '$y0'}}

 Q: Which is the category of people buried here in Amsterdam?
 SPARQL: select distinct ?answer where { wd:Q727 wdt:P1791 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amsterdam', 'p': 'category of people buried here', 'o': '?x0'}

 Q: Did {German_language} {linguistic typology} {Romance languages} and {V2 word order} ?
 SPARQL: ASK WHERE { wd:Q188 wdt:P4132 wd:Q19814 . wd:Q188 wdt:P4132 wd:Q1516105 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'German', 'p': 'linguistic typology', 'o': '?x0', '?x0': 'Romance languages'}, {'h': 'IS', 'v': '?x1', 's': 'German', 'p': 'linguistic typology', 'o': '?x1', '?x1': 'V2 word order'}]

 Q: What is the {manga} for {language of work or name} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q5287 . ?sbj wdt:P31 wd:Q8274 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Japanese', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'manga'}}

 Q: Is the clock speed of GP2X Wiz equal to 533?
 SPARQL: ASK WHERE { wd:Q930260 wdt:P2149 ?obj filter(?obj = 533) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'GP2X Wiz', 'p': 'clock speed', 'o': '?x0', '?x0': '533'}

 Q: Who is the Muslim ibn al-Hajjaj with a death date of 875?
 SPARQL: SELECT ?value WHERE { wd:Q140124 p:P570 ?s . ?s ps:P570 ?x filter(contains(?x,'875-5-6')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Muslim ibn al-Hajjaj', 'p': 'death date', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'death date', 'o': '875-5-6'}}}

 Q: What is the {holding company} for {chief executive officer} of {Al-Waleed bin Talal}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P169 wd:Q293679 . ?sbj wdt:P31 wd:Q219577 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'CEO', 'o': 'Al-Waleed bin Talal', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'holding company'}}

 Q: What is the {practiced by} and the {named after} of {Marathon} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q40244 wdt:P3095 ?ans_1 . wd:Q40244 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'marathon', 'p': 'practiced by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'marathon', 'p': 'named after', 'o': '?x1'}]

 Q: what is the {point in time} for {Gary Becker} has {award received} as {National Medal of Science} ?
 SPARQL: SELECT ?value WHERE { wd:Q191020 p:P166 ?s . ?s ps:P166 wd:Q737051 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gary Becker', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'National Medal of Science'}, 't': '?x0'}

 Q: What is the {human} for {publisher} of {The New York Times}
 SPARQL:  select distinct ?obj where { wd:Q9684 wdt:P123 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'New York Times', 'p': 'publisher', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {end time} for {Alfonso VI of León and Castile} has {spouse} as {Zaida of Seville} ?
 SPARQL: SELECT ?value WHERE { wd:Q235080 p:P26 ?s . ?s ps:P26 wd:Q2543811 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfonso VI', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Zaida of Seville'}}}

 Q: Is the atomic number of calcium equal to 16.0?
 SPARQL: ASK WHERE { wd:Q706 wdt:P1086 ?obj filter(?obj = 16.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'calcium', 'p': 'atomic number', 'o': '?x0', '?x0': '16.0'}

 Q: What are the meteorological phenomenon which start with the letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16332653 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'meteorological phenomenon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {streak color} of {calcite}, that has {label in sign language} is {Csc-blanc-spreadthesign.ogv} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171917 wdt:P534 ?answer . ?answer wdt:P2919 ?x FILTER(contains(?x,'Csc-blanc-spreadthesign.ogv'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'calcite', 'p': 'streak color', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'label in sign language', 'o': 'csc-blanc-spreadthesign.ogv'}}

 Q: What show was Ricky Nelson a cast member?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P161 wd:Q303207 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Ricky Nelson'}

 Q: Which battery storage power station has the max energy storage capacity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q810924 . ?ent wdt:P4140 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'energy storage capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'battery storage power station'}}

 Q: What excipient that's part carbon has the lowest refractive index?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q902638 . ?ent wdt:P1109 ?obj . ?ent wdt:P527 wd:Q623} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'refractive index', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'excipient', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has part', 'o': 'carbon'}}}

 Q: What was the population of Bogota in 1775?
 SPARQL: SELECT ?obj WHERE { wd:Q2841 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1775')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bogota', 'p': 'population', 'o': '?x0', 't': '1775'}

 Q: What is connecting service of AVE ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1192 wd:Q433671}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'connecting service', 'o': 'AVE'}

 Q: Tell me posthumous work whose name has the word people in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17518461 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'people')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'posthumous work'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'people'}}

 Q: What is {chief executive officer} of {Yahoo} that is {start time} is {2011-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q37093 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yahoo', 'p': 'chief executive officer', 'o': '?x0', 't': '2011'}

