 Q: Is the mass of the Procyon less than 1.8?
 SPARQL: ASK WHERE { wd:Q13034 wdt:P2067 ?obj filter(?obj < 1.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Procyon', 'p': 'mass', 'o': '?x0', '?x0': '1.8'}

 Q: What is <has vertex figure> of <pentagon> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1678 wd:Q127840}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has vertex figure', 'o': 'pentagon'}

 Q: what was the end time for Clifford Geertz has employer as University of Chicago?
 SPARQL: SELECT ?value WHERE { wd:Q310956 p:P108 ?s . ?s ps:P108 wd:Q131252 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clifford Geertz', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'University of Chicago'}}}

 Q: "Which prize received by Martha Graham, has another one of the winners named Lynn Fontanne?"
 SPARQL: SELECT ?answer WHERE { wd:Q487604 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q242484}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Martha Graham', 'p': 'prize received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Lynn Fontanne'}}

 Q: The total fertility rate of Liechtenstein is?
 SPARQL: select distinct ?answer where { wd:Q347 wdt:P4841 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Liechtenstein', 'p': 'total fertility rate', 'o': '?x0'}

 Q: Is it true that the compression ratio of the Junkers Jumo 210 is less than 7.8?
 SPARQL: ASK WHERE { wd:Q564413 wdt:P1247 ?obj filter(?obj < 7.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Junkers Jumo 210', 'p': 'compression ratio', 'o': '?x0', '?x0': '7.8'}

 Q: What is National Library of Greece ID for  Maurice Ravel ?
 SPARQL: select distinct ?answer where { wd:Q1178 wdt:P3348 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maurice Ravel', 'p': 'National Library of Greece ID', 'o': '?x0'}

 Q: Which is the Lotsawa House Indian author ID of Nagarjuna?
 SPARQL: select distinct ?answer where { wd:Q171195 wdt:P4349 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nagarjuna', 'p': 'Lotsawa House Indian author ID', 'o': '?x0'}

 Q: What are the concepts that contain the word "übersarung" in their name ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'übersarung')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'concept'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'übersarung'}}

 Q: What is {faculty} of {film director} of {The Star Wars Holiday Special} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1538082 wdt:P57 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'faculty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Star Wars Holiday Special', 'p': 'director', 'o': '$y0'}}

 Q: What is {record held} of {disc golf} and {location}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q876737 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P276 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'disc golf', 'p': 'record held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'record held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'disc golf', 'p': 'record held', 'o': '$y0'}}]

 Q: What what is economic crisis has cause Wall Street Crash of 1929 and also which starts with letter d
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj wdt:P828 wd:Q201684 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic crisis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cause', 'o': 'Wall Street Crash of 1929'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: what is the {start time} for {Valencian Community} has {head of government} as {Ximo Puig} ?
 SPARQL: SELECT ?value WHERE { wd:Q5720 p:P6 ?s . ?s ps:P6 wd:Q9096682 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valencia', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Ximo Puig'}}}

 Q: What combustible gas with the highest IDLH exists in humans?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21073026 . ?ent wdt:P2129 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'IDLH', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'combustible gas', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'found in taxon', 'o': 'Homo sapiens'}}}

 Q: Who were Apollo's partner's Muses?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P451 wd:Q37340 . ?sbj wdt:P31 wd:Q66016 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Apollo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Muses'}}

 Q: Give me {emirate of the United Arab Emirates} that contains the word {fujairah} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19833031 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'fujairah')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'emirate of the United Arab Emirates'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'fujairah'}}

 Q: Tell me forensic technique whose name has the word dnain it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q456443 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dna')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'forensic technique'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dna'}}

 Q: Which is the instrumentation of the Piano Concerto?
 SPARQL: select distinct ?answer where { wd:Q44261 wdt:P870 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Piano Concerto', 'p': 'instrumentation', 'o': '?x0'}

 Q: Did {Kamal_Haasan} {languages spoken, written or signed} {Romance languages} and {Tamil} ?
 SPARQL: ASK WHERE { wd:Q381477 wdt:P1412 wd:Q19814 . wd:Q381477 wdt:P1412 wd:Q5885 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kamal Haasan', 'p': 'languages spoken, written or signed', 'o': '?x0', '?x0': 'Romance languages'}, {'h': 'IS', 'v': '?x1', 's': 'Kamal Haasan', 'p': 'languages spoken, written or signed', 'o': '?x1', '?x1': 'Tamil'}]

 Q: What is in the  Transfermarkt manager ID of Alex Ferguson ?
 SPARQL: select distinct ?answer where { wd:Q44980 wdt:P2447 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alex Ferguson', 'p': 'Transfermarkt manager ID', 'o': '?x0'}

 Q: Moon Jae-in is the head of state of which sovereign state ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q21001 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Moon Jae-in', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: How many lifestyle follow mysticism?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1576 wd:Q45996 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'lifestyle', 'o': 'mysticism'}

 Q: Tell me the region of the Czech Republic that is the twinned administrative body of Hamburg.
 SPARQL:  select distinct ?obj where { wd:Q1055 wdt:P190 ?obj . ?obj wdt:P31 wd:Q38911 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hamburg', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'region of the Czech Republic'}}

 Q: What is the bald eagle's Guide to North American Birds ID?
 SPARQL: select distinct ?answer where { wd:Q127216 wdt:P4715 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'bald eagle', 'p': 'Guide to North American Birds ID', 'o': '?x0'}

 Q: What is {member of} of {Czechoslovakia}, that has {maxime} is {Союз мира и социализма} ?
 SPARQL: SELECT ?answer WHERE { wd:Q33946 wdt:P463 ?answer . ?answer wdt:P1451 ?x FILTER(contains(?x,'Союз мира и социализма'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Czechoslovakia', 'p': 'member of', 'o': '?x0'}

 Q: What is mascot of took part in  Thierry Henry ?
 SPARQL: SELECT ?answer WHERE { wd:Q45901 wdt:P1344 ?X . ?X wdt:P822 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mascot', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thierry Henry', 'p': 'took part', 'o': '$y0'}}

 Q: What area of the South Bohemian Region has a male population of 637,834?
 SPARQL: SELECT ?value WHERE { wd:Q188373 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'637834.0')) . ?s pq:P1540 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'male population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'South Bohemian Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '637834.0'}}}

 Q: Is the minimum age of the Category 1 0.0?
 SPARQL: ASK WHERE { wd:Q23830576 wdt:P2899 ?obj filter(?obj = 0.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Category I', 'p': 'minimum age', 'o': '?x0', '?x0': '0.0'}

 Q: Does the HMS Shrospshire have a cruise speed of 25.6?
 SPARQL: ASK WHERE { wd:Q930632 wdt:P2217 ?obj filter(?obj = 25.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'HMS Shropshire', 'p': 'cruise speed', 'o': '?x0', '?x0': '25.6'}

 Q: which reserve currency has the highest price?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q756202 . ?ent wdt:P2284 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'price', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'reserve currency'}}

 Q: Did {Buddy_Holly} {record label} {Brunswick} and {CNR Records} ?
 SPARQL: ASK WHERE { wd:Q5977 wdt:P264 wd:Q994175 . wd:Q5977 wdt:P264 wd:Q2553853 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Buddy Holly', 'p': 'record label', 'o': '?x0', '?x0': 'Brunswick'}, {'h': 'IS', 'v': '?x1', 's': 'Buddy Holly', 'p': 'record label', 'o': '?x1', '?x1': 'CNR'}]

 Q: What is {prescribed drug} of {stroke}, that has {capable of inhibiting or preventing pathological process} is {cerebrovascular disease} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12202 wdt:P2176 ?answer . ?answer wdt:P2175 wd:Q3010352}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'stroke', 'p': 'prescribed drug', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capable of inhibiting or preventing pathological process', 'o': 'cerebrovascular disease'}}

 Q: Give me {phase of life} that contains the word {zygospore} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1811014 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zygospore')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phase of life'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zygospore'}}

 Q: What is {location of death} of {Madam C. J. Walker}, that has {member of} is {Association of Southeast Asian Nations Regional Forum} ?
 SPARQL: SELECT ?answer WHERE { wd:Q447716 wdt:P20 ?answer . ?answer wdt:P463 wd:Q7886981}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Madam C. J. Walker', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'ASEAN Regional Forum'}}

 Q: Which religion affiliation was established by Mahendra Sūri?
 SPARQL: SELECT ?answer WHERE { wd:Q6733781 wdt:P140 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mahendra Sūri', 'p': 'religion', 'o': '$y0'}}

 Q: What is the {cult film} for {director} of {Francis Ford Coppola}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P57 wd:Q56094 . ?sbj wdt:P31 wd:Q219557 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Francis Ford Coppola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cult film'}}

 Q: what is the {start time} for {Ingmar Bergman} has {spouse} as {Else Fisher} ?
 SPARQL: SELECT ?value WHERE { wd:Q7546 p:P26 ?s . ?s ps:P26 wd:Q3723687 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ingmar Bergman', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Else Fisher'}}}

 Q: What is the {publication} for {location of formation} of {University of Toronto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P740 wd:Q180865 . ?sbj wdt:P31 wd:Q732577 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location of formation', 'o': 'University of Toronto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'publication'}}

 Q: Give me {programming language} that {programming paradigm} {array programming} and which contains the word {zpl} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj wdt:P3966 wd:Q4795882 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zpl')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'programming language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'programming paradigm', 'o': 'array programming'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zpl'}}

 Q: Give me {unit of mass} that {measured physical quantity} {mass} and which that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj wdt:P111 wd:Q11423 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of mass', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'quantity', 'o': 'mass'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the superhuman feature or ability of the superhero Daredevil?
 SPARQL: select distinct ?answer where { wd:Q327553 wdt:P2563 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Daredevil', 'p': 'superhuman feature or ability', 'o': '?x0'}

 Q: Bill Gates is the chairperson for what private foundation located in the United States?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q5284 . ?sbj wdt:P31 wd:Q7246202 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Bill Gates', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private foundation'}}

 Q: what is the {point in time} for {William Jones} has {award received} as {Fellow of the Royal Society} ?
 SPARQL: SELECT ?value WHERE { wd:Q371877 p:P166 ?s . ?s ps:P166 wd:Q15631401 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'William Jones', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Fellow of the Royal Society'}, 't': '?x0'}

 Q: What is the {human} for {manager/director} of {BBC}
 SPARQL:  select distinct ?obj where { wd:Q9531 wdt:P1037 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'BBC', 'p': 'manager', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {award received} are for {Alexey Sudayev} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q603779 wdt:P166 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Alexey Sudayev', 'p': 'awards', 'o': '?x0'}

 Q: What is {birth place} of {Margery Williams}, that has {has towns} is {London Borough of Ealing} ?
 SPARQL: SELECT ?answer WHERE { wd:Q948301 wdt:P19 ?answer . ?answer wdt:P150 wd:Q207218}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Margery Williams', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has towns', 'o': 'London Borough of Ealing'}}

 Q: What was the population of South Dakota in the year 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q1211 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'South Dakota', 'p': 'population', 'o': '?x0', 't': '2000'}

 Q: Did Ghostbusters cast members Bill Murray and Sigourney Weaver?
 SPARQL: ASK WHERE { wd:Q108745 wdt:P161 wd:Q29250 . wd:Q108745 wdt:P161 wd:Q102124 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ghostbusters', 'p': 'cast member', 'o': '?x0', '?x0': 'Bill Murray'}, {'h': 'IS', 'v': '?x1', 's': 'Ghostbusters', 'p': 'cast member', 'o': '?x1', '?x1': 'Sigourney Weaver'}]

 Q: what is the {for work} for {Blanca Esthela Guerra Islas} has {award received} as {Ariel Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q804319 p:P166 ?s . ?s ps:P166 wd:Q4790397 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Blanca Esthela Guerra Islas', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Ariel Award for Best Actress'}}}

 Q: What is the name of the sister town of the location of birth of Troy Fraser ?
 SPARQL: SELECT ?answer WHERE { wd:Q7846826 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Troy Fraser', 'p': 'location of birth', 'o': '$y0'}}

 Q: Is it true that the number of seats of Coles equals to 1?
 SPARQL: ASK WHERE { wd:Q5355257 wdt:P1342 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Coles', 'p': 'number of seats', 'o': '?x0', '?x0': '1'}

 Q: Who was born in Hugh Griffith near a body of water?
 SPARQL: SELECT ?answer WHERE { wd:Q310934 wdt:P19 ?X . ?X wdt:P206 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'body of water', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hugh Griffith', 'p': 'born in', 'o': '$y0'}}

 Q: What is {scientific area} of {correspondence at} of {Emil Baumgärtel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1335827 wdt:P485 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emil Baumgärtel', 'p': 'correspondence at', 'o': '$y0'}}

 Q: Did {Metallica} {discography} {Megadeth discography}?
 SPARQL: ASK WHERE { wd:Q15920 wdt:P358 wd:Q1461269 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Metallica', 'p': 'discography', 'o': '?x0', '?x0': 'Megadeth discography'}]

 Q: What is {date of death} of {Gregory of Nyssa} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q191734 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gregory of Nyssa', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'circa'}}}

 Q: Which is the spoken text audio for median?
 SPARQL: select distinct ?answer where { wd:Q226995 wdt:P989 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'median', 'p': 'spoken text audio', 'o': '?x0'}

 Q: In what year was Joan Sutherland awarded a Royal Philharmonic Society Gold Medal?
 SPARQL: SELECT ?value WHERE { wd:Q207269 p:P166 ?s . ?s ps:P166 wd:Q27575234 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Joan Sutherland', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Royal Philharmonic Society Gold Medal'}, 't': '?x0'}

 Q: what are the newscast which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1358344 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newscast'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {chairperson} of {member of} of {Đurica Jojkić} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12747513 wdt:P102 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chairperson', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Đurica Jojkić', 'p': 'member of', 'o': '$y0'}}

 Q: Which is the Rijksmonument IDfor Concertgebouw?
 SPARQL: select distinct ?answer where { wd:Q849957 wdt:P359 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Concertgebouw', 'p': 'Rijksmonument ID', 'o': '?x0'}

 Q: What is {key event} of {written by} of {Comprehensive Guide to the County of Durham (1892 edition)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q53574467 wdt:P50 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Comprehensive Guide to the County of Durham (1892 edition)', 'p': 'written by', 'o': '$y0'}}

 Q: What is the name of the hometown of Hello Kitty, whose postal code is N?
 SPARQL: SELECT ?answer WHERE { wd:Q191794 wdt:P551 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'N'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hello Kitty', 'p': 'hometown', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'postal code', 'o': 'n'}}

 Q: what is the {type of kinship} for {Queen Victoria} has {sibling} as {Princess Feodora of Leiningen} ?
 SPARQL: SELECT ?value WHERE { wd:Q9439 p:P3373 ?s . ?s ps:P3373 wd:Q60508 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Queen Victoria', 'p': 'sibling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sibling', 'o': 'Princess Feodora of Leiningen'}}}

 Q: what is the {end time} for {Carlos Fuentes} has {pseudonym} as {Emmanuel Matta} ?
 SPARQL: SELECT ?value WHERE { wd:Q154691 p:P742 ?s . ?s ps:P742 ?x filter(contains(?x,'Emmanuel Matta')) . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carlos Fuentes', 'p': 'alias', 'o': '$y0'}}

 Q: What is {using} of {academic discipline} of {syntax} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1152399 wdt:P101 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'using', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'syntax', 'p': 'discipline', 'o': '$y0'}}

 Q: Tell me area of law whose name has the word law in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1756157 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'law')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'area of law'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'law'}}

 Q: Which is {manifestation of} of {work} of {Johann Reinhard Kistner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55685289 wdt:P106 ?X . ?X wdt:P1557 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manifestation of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Johann Reinhard Kistner', 'p': 'work', 'o': '$y0'}}

 Q: Which is the height and location of the pole vault record held by Sergey Bubka?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q184556 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'height', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Sergey Bubka'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'location', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Sergey Bubka'}}}]

 Q: What is {has influence} of {written by} of {I taste a liquor never brewed} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5980230 wdt:P50 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has influence', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'I taste a liquor never brewed', 'p': 'author', 'o': '$y0'}}

 Q: What is {birth location} of {Alonso Pérez de Guzmán, 7th Duke of Medina Sidonia}, that has {inhabitants} is {67640} ?
 SPARQL: SELECT ?answer WHERE { wd:Q278954 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'67640'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alonso Pérez de Guzmán, 7th Duke of Medina Sidonia', 'p': 'birth location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '67640'}}

 Q: What are the musical which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Is the minimum frequency of audible sound for goldfish greater than 24?
 SPARQL: ASK WHERE { wd:Q123141 wdt:P3387 ?obj filter(?obj > 24.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'goldfish', 'p': 'minimum frequency of audible sound', 'o': '?x0', '?x0': '24.0'}

 Q: What are the  geometric concept which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21550639 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geometric concept'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the decay mode for uranium-238?
 SPARQL: select distinct ?answer where { wd:Q1148503 wdt:P817 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'uranium-238', 'p': 'decay mode', 'o': '?x0'}

 Q: Give me {isotope of hydrogen} that {follows} {deuterium} and which that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q466603 . ?sbj wdt:P155 wd:Q102296 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of hydrogen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'follows', 'o': 'deuterium'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is Irish Sites and Monuments Record ID  for Trinity College Dublin
 SPARQL: select distinct ?answer where { wd:Q258464 wdt:P4057 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Trinity College Dublin', 'p': 'Irish Sites and Monuments Record ID', 'o': '?x0'}

 Q: What is the {written work} for {characters} of {Christopher Hitchens}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P674 wd:Q49081 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'characters', 'o': 'Christopher Hitchens', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: In what environment is the series Darius Force set?
 SPARQL: SELECT ?answer WHERE { wd:Q1527988 wdt:P179 ?X . ?X wdt:P400 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'environment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Darius Force', 'p': 'series', 'o': '$y0'}}

 Q: What country that is a member of the International Centre for Settlement of Investment Disputes has the most GDP?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2131 ?obj . ?ent wdt:P463 wd:Q899770 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'GDP', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Centre for Settlement of Investment Disputes'}}}

 Q: What is {tribute to} of {Pictures at an Exhibition}, that has {deathplace} is {Saint Petersburg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q724981 wdt:P825 ?answer . ?answer wdt:P20 wd:Q656}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pictures at an Exhibition', 'p': 'tribute to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'deathplace', 'o': 'Saint Petersburg'}}

 Q: What is {last name} of {Franz Marc}, that has {is the same as} is {Marek} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44054 wdt:P734 ?answer . ?answer wdt:P460 wd:Q1894550}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Franz Marc', 'p': 'last name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Marek'}}

 Q: what is the {position held} for {Linz} has {head of government} as {Franz Dobusch} ?
 SPARQL: SELECT ?value WHERE { wd:Q41329 p:P6 ?s . ?s ps:P6 wd:Q1446553 . ?s pq:P39 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Linz', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Franz Dobusch'}}}

 Q: What is {papers at} of {Queen Victoria}, that has {co-ords} is {52.4145 -4.06846} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9439 wdt:P485 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'52.4145 -4.06846'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Queen Victoria', 'p': 'papers at', 'o': '?x0'}

 Q: Was Aileen Wuornos convicted of depraved heart murder and robbery?
 SPARQL: ASK WHERE { wd:Q264849 wdt:P1399 wd:Q5260820 . wd:Q264849 wdt:P1399 wd:Q53706 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Aileen Wuornos', 'p': 'convicted of', 'o': '?x0', '?x0': 'depraved heart murder'}, {'h': 'IS', 'v': '?x1', 's': 'Aileen Wuornos', 'p': 'convicted of', 'o': '?x1', '?x1': 'robbery'}]

 Q: What is <BPS language code> of <Sundanese> ?
 SPARQL: select distinct ?answer where { wd:Q34002 wdt:P2590 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sundanese', 'p': 'BPS language code', 'o': '?x0'}

 Q: What is {kids} of {Ferdinand I of León and Castile}, that has {date of the end} is {1109-7-1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q296863 wdt:P40 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1109'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ferdinand I of León and Castile', 'p': 'child', 'o': '?x0', 't': '1109'}

 Q: Are Krillin and Son Gohan Dragon Ball Z characters?
 SPARQL: ASK WHERE { wd:Q477916 wdt:P674 wd:Q757141 . wd:Q477916 wdt:P674 wd:Q752269 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Dragon Ball Z', 'p': 'characters', 'o': '?x0', '?x0': 'Krillin'}, {'h': 'IS', 'v': '?x1', 's': 'Dragon Ball Z', 'p': 'characters', 'o': '?x1', '?x1': 'Gohan'}]

