 Q: Where is the death location of Louisa May Alcott, that has its geographic centre in 41.2596 -71.8083?
 SPARQL: SELECT ?answer WHERE { wd:Q185696 wdt:P20 ?answer . ?answer wdt:P5140 ?x FILTER(contains(?x,'42.2596 -71.8083'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louisa May Alcott', 'p': 'death location', 'o': '?x0'}

 Q: What is {originates from} of {belongs to} of {DVD} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5294 wdt:P127 ?X . ?X wdt:P740 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'DVD', 'p': 'belongs to', 'o': '$y0'}}

 Q: How many share borders are with the {Wiesbaden} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P47 wd:Q1721 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Wiesbaden'}

 Q: What is {position held} of {Louis X of France} that is {start time} is {1314-11-29} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8384 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1314')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louis X of France', 'p': 'position held', 'o': '?x0', 't': '1314'}

 Q: What is {profession} of {sculptors} of {Drawing Hands} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2390890 wdt:P170 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Drawing Hands', 'p': 'sculptor', 'o': '$y0'}}

 Q: What is the {human} for {chief executive officer} of {Walmart}
 SPARQL:  select distinct ?obj where { wd:Q483551 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Walmart', 'p': 'chief executive officer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {date of birth} for {Pedro I} has {child} as {Pedro II of Brazil} ?
 SPARQL: SELECT ?value WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q156774 . ?s pq:P569 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Pedro II of Brazil'}}}

 Q: To which musical movement did John Cage belong?
 SPARQL:  select distinct ?obj where { wd:Q180727 wdt:P135 ?obj . ?obj wdt:P31 wd:Q12020884 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Cage', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical movement'}}

 Q: Tell me Original Public Ivy whose name has the word university in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'university')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Original Public Ivy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'university'}}

 Q: What is cover artist for Peter Blake ?
 SPARQL: select distinct ?answer where { ?answer wdt:P736 wd:Q504611}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cover artist', 'o': 'Peter Blake'}

 Q: What is {connected with} of {moveable object location} of {Umayyad conquest of Hispania} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1455917 wdt:P276 ?X . ?X wdt:P2789 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'connected with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Umayyad conquest of Hispania', 'p': 'location', 'o': '$y0'}}

 Q: who is the writer of Julius Caesar who has a sister named Joan Shakespeare?
 SPARQL: SELECT ?answer WHERE { wd:Q215750 wdt:P50 ?answer . ?answer wdt:P3373 wd:Q6205446}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Julius Caesar', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister', 'o': 'Joan Shakespeare'}}

 Q: Which is the language of work or name of Appetite for Destruction?
 SPARQL: select distinct ?answer where { wd:Q270690 wdt:P407 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Appetite for Destruction', 'p': 'language of work or name', 'o': '?x0'}

 Q: Who gave the{son of} of {son of} of {William FitzMaurice, 2nd Earl of Kerry} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8009095 wdt:P25 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William FitzMaurice, 2nd Earl of Kerry', 'p': 'son of', 'o': '?x0'}

 Q: Give me {condition} that {facet of} {meteorology} and which contains the word {drought} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q813912 . ?sbj wdt:P1269 wd:Q25261 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'drought')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'condition', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'meteorology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'drought'}}

 Q: What is the {television character} for {sidekick of} of {Superman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2546 wd:Q79015 . ?sbj wdt:P31 wd:Q15773317 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sidekick of', 'o': 'Superman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television character'}}

 Q: Which flammable liquid has the highest ionization energy ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5457310 . ?ent wdt:P2260 ?obj . ?ent wdt:P31 wd:Q21073026 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ionization energy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable liquid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable gas'}}}

 Q: What is {human population} of {borders} of {Malawi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1020 wdt:P47 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malawi', 'p': 'border', 'o': '$y0'}}

 Q: What is <GONIAT place ID> of <Staffordshire> ?
 SPARQL: select distinct ?answer where { wd:Q23105 wdt:P5215 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Staffordshire', 'p': 'GONIAT place ID', 'o': '?x0'}

 Q: How many describe a project that uses Twitter?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4510 wd:Q918 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'Twitter'}

 Q: Which is dan/kyu rank of wushu ?
 SPARQL: select distinct ?answer where { wd:Q3479346 wdt:P468 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'wushu', 'p': 'dan/kyu rank', 'o': '?x0'}

 Q: On June 24th of 1948 what award did Kliment Voroshilov received?
 SPARQL: SELECT ?obj WHERE { wd:Q186185 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1948')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kliment Voroshilov', 'p': 'award', 'o': '?x0', 't': '1948'}

 Q: What operating system component starts with the letter "f"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30059018 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'operating system component'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: Name the award received by Greta Garbo in the year 1954?
 SPARQL: SELECT ?obj WHERE { wd:Q5443 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1954')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Greta Garbo', 'p': 'award received', 'o': '?x0', 't': '1954'}

 Q: what is the {of} for {Harley Quinn} has {performer} as {Jacqui Verdura} ?
 SPARQL: SELECT ?value WHERE { wd:Q849477 p:P175 ?s . ?s ps:P175 wd:Q33228927 . ?s pq:P642 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harley Quinn', 'p': 'performer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'performer', 'o': 'Jacqui Verdura'}}}

 Q: Which is the filmography for Orange Is the New Black?
 SPARQL: select distinct ?answer where { ?answer wdt:P1283 wd:Q7099650}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'filmography', 'o': 'Orange Is the New Black'}

 Q: "What is {name after} of {Carnot heat engine}, which has {Christian name} is {Nicolas} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q1335241 wdt:P138 ?answer . ?answer wdt:P735 wd:Q7029481}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carnot heat engine', 'p': 'name after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Christian name', 'o': 'Nicolas'}}

 Q: What is {born in} of {Gong Qiuxia}, that has {has local government areas} is {Zhenjiang} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1139517 wdt:P19 ?answer . ?answer wdt:P150 wd:Q57958}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gong Qiuxia', 'p': 'born in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has local government areas', 'o': 'Zhenjiang'}}

 Q: Is satellite of Saturn have a date of discovery of 2000-8-7?
 SPARQL: SELECT ?answer WHERE { wd:Q193 wdt:P398 ?answer . ?answer wdt:P575 ?x FILTER(contains(YEAR(?x),'2000'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saturn', 'p': 'satellite', 'o': '?x0', 't': '2000'}

 Q: Which is the Sandbox-String for degree Fahrenheit?
 SPARQL: select distinct ?answer where { wd:Q42289 wdt:P370 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'degree Fahrenheit', 'p': 'Sandbox-String', 'o': '?x0'}

 Q: Which is the instruction set of 16-bit architecture?
 SPARQL: select distinct ?answer where { ?answer wdt:P1068 wd:Q194368}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'instruction set', 'o': '16-bit architecture'}

 Q: what is the {place of marriage} for {Zelda Fitzgerald} has {spouse} as {F. Scott Fitzgerald} ?
 SPARQL: SELECT ?value WHERE { wd:Q187324 p:P26 ?s . ?s ps:P26 wd:Q93354 . ?s pq:P2842 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zelda Fitzgerald', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'F. Scott Fitzgerald'}}}

 Q: Tell me art movement whose name has the word yamato in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q968159 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yamato')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art movement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yamato'}}

 Q: How many {victory} are for {Maureen Connolly} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q53390 wdt:P2522 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Maureen Connolly', 'p': 'victory', 'o': '?x0'}

 Q: what is the {for work} for {Jennifer Lawrence} has {award received} as {MTV Movie Award for Best Female Performance} ?
 SPARQL: SELECT ?value WHERE { wd:Q189490 p:P166 ?s . ?s ps:P166 wd:Q15096815 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jennifer Lawrence', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'MTV Movie Award for Best Female Performance'}}}

 Q: What is {diplomatic relation} of {party} of {Laotian Civil War} ?
 SPARQL: SELECT ?answer WHERE { wd:Q877450 wdt:P710 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Laotian Civil War', 'p': 'party', 'o': '$y0'}}

 Q: what is the {point in time} for {Cicely Tyson} has {award received} as {Candace Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q238081 p:P166 ?s . ?s ps:P166 wd:Q27851929 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Cicely Tyson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Candace Award'}, 't': '?x0'}

 Q: Is it true that the cost of Primer equals to 7000?
 SPARQL: ASK WHERE { wd:Q1434995 wdt:P2130 ?obj filter(?obj = 7000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Primer', 'p': 'cost', 'o': '?x0', '?x0': '7000'}

 Q: what is the {point in time} for {Phil Taylor} has {winner} as {BDO World Darts Championship} ?
 SPARQL: SELECT ?value WHERE { wd:Q550313 p:P1346 ?s . ?s ps:P1346 wd:Q2629008 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Phil Taylor', 'p': 'winner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'winner', 'o': 'BDO World Darts Championship'}, 't': '?x0'}

 Q: Which is the Italian Senate ID for Giosuè Carducci?
 SPARQL: select distinct ?answer where { wd:Q43440 wdt:P3954 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Giosuè Carducci', 'p': 'Italian Senate ID', 'o': '?x0'}

 Q: Is the horizontal depth of the High-necked spheroid vase (DP 0212 equal to 28.8?
 SPARQL: ASK WHERE { wd:Q59417224 wdt:P5524 ?obj filter(?obj = 28.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'High-necked spheroid vase (DP 0212)', 'p': 'horizontal depth', 'o': '?x0', '?x0': '28.8'}

 Q: Did Carole King work with the record labels Epic Records and Avatar Records?
 SPARQL: ASK WHERE { wd:Q217787 wdt:P264 wd:Q216364 . wd:Q217787 wdt:P264 wd:Q4827811 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Carole King', 'p': 'record label', 'o': '?x0', '?x0': 'Epic Records'}, {'h': 'IS', 'v': '?x1', 's': 'Carole King', 'p': 'record label', 'o': '?x1', '?x1': 'Avatar Records'}]

 Q: What is the antonym of painting of Samson and the Philistines?
 SPARQL: SELECT ?answer WHERE { wd:Q20355202 wdt:P180 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Samson and the Philistines', 'p': 'painting of', 'o': '$y0'}}

 Q: Give me {capital} that {twinned administrative body} {Kiel} and which contains the word {tallinn} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P190 wd:Q1707 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tallinn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Kiel'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tallinn'}}

 Q: What is the name of film studio that starts with letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q375336 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film studio'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Who gave the  {summit} of {system of mountains} of {Stevens Pass} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3494853 wdt:P4552 ?X . ?X wdt:P610 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'summit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stevens Pass', 'p': 'system of mountains', 'o': '$y0'}}

 Q: Which is the Historical Gazetteer GOV ID for German Confederation?
 SPARQL: select distinct ?answer where { wd:Q151624 wdt:P2503 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'German Confederation', 'p': 'GOV ID', 'o': '?x0'}

 Q: Did {Chris_Pratt} {notable work} {Guardians of the Galaxy}?
 SPARQL: ASK WHERE { wd:Q503706 wdt:P800 wd:Q5887360 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chris Pratt', 'p': 'notable work', 'o': '?x0', '?x0': 'Guardians of the Galaxy'}]

 Q: what is the {series ordinal} for {Ted Hughes} has {given name} as {James} ?
 SPARQL: SELECT ?value WHERE { wd:Q272194 p:P735 ?s . ?s ps:P735 wd:Q677191 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ted Hughes', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'name', 'o': 'James'}}}

 Q: What is the {sovereign state} for {official language} of {Romanian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q7913 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Romanian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Which is the mass excess of helium-4?
 SPARQL: select distinct ?answer where { wd:Q1151346 wdt:P2160 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'helium-4', 'p': 'mass excess', 'o': '?x0'}

 Q: What is {work location} of {Willem de Kooning} that is {end time} is {1926-7-18} ?
 SPARQL: SELECT ?obj WHERE { wd:Q132305 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1926')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Willem de Kooning', 'p': 'work location', 'o': '?x0', 't': '1926'}

 Q: What is {authors} of {succeeds to} of {The Glory} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7736826 wdt:P155 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'author', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Glory', 'p': 'succeeds to', 'o': '$y0'}}

 Q: What is won by the honorary titles of The Settlers of Catan?
 SPARQL: SELECT ?answer WHERE { wd:Q17271 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'won by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Settlers of Catan', 'p': 'honorary title', 'o': '$y0'}}

 Q: What is Hulk Hogan's Wrestlingdata person ID?
 SPARQL: select distinct ?answer where { wd:Q44176 wdt:P2764 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hulk Hogan', 'p': 'Wrestlingdata person ID', 'o': '?x0'}

 Q: What is {twinned administrative body} of {Nagoya} that is {start time} is {1978-12-21} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11751 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1978')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nagoya', 'p': 'twinned administrative body', 'o': '?x0', 't': '1978'}

 Q: Is the Elo rating of the Noa Saxon Gardiner equal to 1004.0?
 SPARQL: ASK WHERE { wd:Q28479683 wdt:P1087 ?obj filter(?obj = 1004.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Noa Saxon Gardiner', 'p': 'Elo rating', 'o': '?x0', '?x0': '1004.0'}

 Q: What is {member of sports team} of {Valeriy Lobanovskyi} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q324484 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valeriy Lobanovskyi', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valeriy Lobanovskyi', 'p': 'team', 'o': '$y0'}}]

 Q: Give me {human settlement} that contains the word {zanzibar} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486972 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zanzibar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human settlement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zanzibar'}}

 Q: Which is the Entomologists of the World ID for Jean-Baptiste de Lamarck?
 SPARQL: select distinct ?answer where { wd:Q82122 wdt:P5370 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean-Baptiste de Lamarck', 'p': 'Entomologists of the World ID', 'o': '?x0'}

 Q: What is {place of death} of {Clement I} that is {country} is {Bosporan Kingdom} ?
 SPARQL: SELECT ?obj WHERE { wd:Q42887 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q321371 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement I', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Bosporan Kingdom'}}}

 Q: Who was the presenter for Meet the Press starting on September 16, 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q1543066 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Meet the Press', 'p': 'presenter', 'o': '?x0', 't': '1984'}

 Q: Which is the GSS code (2011) of the Lake District?
 SPARQL: select distinct ?answer where { wd:Q211778 wdt:P836 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake District', 'p': 'GSS code (2011)', 'o': '?x0'}

 Q: What award did Mel Brooks receive in 2003?
 SPARQL: SELECT ?obj WHERE { wd:Q104266 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mel Brooks', 'p': 'award', 'o': '?x0', 't': '2003'}

 Q: what is the {elected in} for {John Dalberg-Acton, 1st Baron Acton} has {position held} as {Member of the 19th Parliament of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q311778 p:P39 ?s . ?s ps:P39 wd:Q41582559 . ?s pq:P2715 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Dalberg-Acton, 1st Baron Acton', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 19th Parliament of the United Kingdom'}}}

 Q: Ruth Benedict lives in what administrative location?
 SPARQL: SELECT ?answer WHERE { wd:Q228822 wdt:P551 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruth Benedict', 'p': 'lives in', 'o': '$y0'}}

 Q: Is it true that the payload mass of the Vale Beijing equals to 404389?
 SPARQL: ASK WHERE { wd:Q3553528 wdt:P4519 ?obj filter(?obj = 404389) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vale Beijing', 'p': 'payload mass', 'o': '?x0', '?x0': '404389'}

 Q: Please tell me Alistair Brownlee's IAT triathlete ID.
 SPARQL: select distinct ?answer where { wd:Q716308 wdt:P2778 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alistair Brownlee', 'p': 'IAT triathlete ID', 'o': '?x0'}

 Q: What is {depiction of} of {The Son of Man}, that has {pronunciation audio} is {La-cls-malum.ogg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1151384 wdt:P180 ?answer . ?answer wdt:P443 ?x FILTER(contains(?x,'La-cls-malum.ogg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Son of Man', 'p': 'depiction of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'pronunciation audio', 'o': 'la-cls-malum.ogg'}}

 Q: What is the pole vault height record held by Igor Potapovich and where was the event?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'height', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Igor Potapovich'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'location', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Igor Potapovich'}}}]

 Q: What is {position held} of {James Bryant Conant} that is {replaced by} is {Nathan M. Pusey} ?
 SPARQL: SELECT ?obj WHERE { wd:Q49355 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q1772795 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Bryant Conant', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Nathan M. Pusey'}}}

 Q: what is the {end time} for {Auckland} has {head of government} as {Len Brown} ?
 SPARQL: SELECT ?value WHERE { wd:Q37100 p:P6 ?s . ?s ps:P6 wd:Q4116955 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Auckland', 'p': 'mayor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'mayor', 'o': 'Len Brown'}}}

 Q: Tell me chemical substance whose name has the word zeolite in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q79529 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeolite')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical substance'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeolite'}}

 Q: what is the {mother} for {Philip III of France} has {child} as {Louis, Count of Évreux} ?
 SPARQL: SELECT ?value WHERE { wd:Q172203 p:P40 ?s . ?s ps:P40 wd:Q352940 . ?s pq:P25 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip III of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Louis, Count of Évreux'}}}

 Q: what is the {place of marriage} for {Catherine, Duchess of Cambridge} has {spouse} as {Prince William, Duke of Cambridge} ?
 SPARQL: SELECT ?value WHERE { wd:Q10479 p:P26 ?s . ?s ps:P26 wd:Q36812 . ?s pq:P2842 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Catherine, Duchess of Cambridge', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Prince William, Duke of Cambridge'}}}

 Q: What is the {organ} for {position held} of {Justin Trudeau}
 SPARQL:  select distinct ?obj where { wd:Q3099714 wdt:P39 ?obj . ?obj wdt:P31 wd:Q895526 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Justin Trudeau', 'p': 'position held', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organ'}}

 Q: What is {instrument played} of {plays} of {Darrell Pace} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1166597 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Darrell Pace', 'p': 'play', 'o': '$y0'}}

 Q: Is it true that the face value of the United States two-dollar bill equals to 2?
 SPARQL: ASK WHERE { wd:Q1189454 wdt:P3934 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'United States two-dollar bill', 'p': 'face value', 'o': '?x0', '?x0': '2'}

 Q: Who did Seiji Ozawa marry in the year 1962?
 SPARQL: SELECT ?obj WHERE { wd:Q313649 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Seiji Ozawa', 'p': 'marry', 'o': '?x0', 't': '1962'}

 Q: Name a former municipality of the Netherlands that shares a border with Rotterdam
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q34370 . ?sbj wdt:P31 wd:Q7265977 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Rotterdam', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'former municipality of the Netherlands'}}

 Q: Did {Venice} {twinned administrative body} {Sarajevo} and {Tallinn} ?
 SPARQL: ASK WHERE { wd:Q641 wdt:P190 wd:Q11194 . wd:Q641 wdt:P190 wd:Q1770 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Venice', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Sarajevo'}, {'h': 'IS', 'v': '?x1', 's': 'Venice', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Tallinn'}]

 Q: Is the base salary of Gary Chan equal to 77000?
 SPARQL: ASK WHERE { wd:Q5524836 wdt:P3618 ?obj filter(?obj = 77000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Gary Chan', 'p': 'base salary', 'o': '?x0', '?x0': '77000'}

 Q: In the birth place of Gerard Reve, what is the earliest record of 1275-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q364153 wdt:P19 ?answer . ?answer wdt:P1249 ?x FILTER(contains(YEAR(?x),'1275'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gerard Reve', 'p': 'birth place', 'o': '?x0', 't': '1275'}

 Q: What is {nominated for} of {D. T. Suzuki} that is {point in time} is {1963-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q44847 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'D. T. Suzuki', 'p': 'nominated for', 'o': '?x0', 't': '1963'}

 Q: What is {mother tongue} of {Ben Carson}, that has {script} is {English alphabet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q816459 wdt:P103 ?answer . ?answer wdt:P282 wd:Q754673}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ben Carson', 'p': 'mother tongue', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alphabet', 'o': 'English alphabet'}}

 Q: what is the {statement supported by} for {Fiji} has {has quality} as {partly free country} ?
 SPARQL: SELECT ?value WHERE { wd:Q712 p:P1552 ?s . ?s ps:P1552 wd:Q47185145 . ?s pq:P3680 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement supported by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fiji', 'p': 'has quality', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'has quality', 'o': 'partly free country'}}}

 Q: Which is the ISWC of Symphony No. 9?
 SPARQL: select distinct ?answer where { wd:Q11985 wdt:P1827 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Symphony No. 9', 'p': 'ISWC', 'o': '?x0'}

 Q: Who is the developer of Stirling engine whose died in Galston
 SPARQL: SELECT ?answer WHERE { wd:Q186212 wdt:P61 ?answer . ?answer wdt:P20 wd:Q3997296}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Stirling engine', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'died in', 'o': 'Galston'}}

 Q: What is {visitors per year} of {Yellowstone National Park} that is {point in time} is {2015-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q351 p:P1174 ?s . ?s ps:P1174 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yellowstone National Park', 'p': 'visitors per year', 'o': '?x0', 't': '2015'}

 Q: Is it true that the term length of office of Captain Regent of San Marino equals to 0.5?
 SPARQL: ASK WHERE { wd:Q258045 wdt:P2097 ?obj filter(?obj = 0.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Captain Regent of San Marino', 'p': 'term length of office', 'o': '?x0', '?x0': '0.5'}

 Q: Tell me universal library whose name has the word library in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2495568 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'library')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'universal library'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'library'}}

 Q: What is the {impact wrench model} with the {MAX(power consumed)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23811265 . ?ent wdt:P2791 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'power consumed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'impact wrench model'}}

