 Q: tell  me Original Public Ivy that chairperson Carol Folt starts with  letter c
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj wdt:P488 wd:Q11246486 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Original Public Ivy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Carol Folt'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What was the previous favorite player of constructivism
 SPARQL: SELECT ?answer WHERE { wd:Q207103 wdt:P737 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prev', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'constructivism', 'p': 'favorite player', 'o': '$y0'}}

 Q: who taxonomic rank of higher taxon of treeswift ?
 SPARQL: SELECT ?answer WHERE { wd:Q31836 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'taxonomic rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'treeswift', 'p': 'higher taxon', 'o': '$y0'}}

 Q: what is the {start time} for {Rostock} has {country} as {German Democratic Republic} ?
 SPARQL: SELECT ?value WHERE { wd:Q2861 p:P17 ?s . ?s ps:P17 wd:Q16957 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rostock', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'German Democratic Republic'}}}

 Q: What is the CSFD person ID of Leonid Gaidai?
 SPARQL: select distinct ?answer where { wd:Q312480 wdt:P2605 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leonid Gaidai', 'p': 'CSFD person ID', 'o': '?x0'}

 Q: What was Joe Pesci nominated for at the point in time 1980-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q20178 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joe Pesci', 'p': 'nominated for', 'o': '?x0', 't': '1980'}

 Q: What is the {English Electric diesel engines} with the {MAX(bore)} whose {engine configuration} is {straight-six}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5378251 . ?ent wdt:P2556 ?obj . ?ent wdt:P1002 wd:Q1148385 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'bore', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'English Electric diesel engines', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'engine configuration', 'o': 'straight-six'}}}

 Q: What is {head quarters} of {Singapore Airlines}, that has {median household income} is {32360.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q32245 wdt:P159 ?answer . ?answer wdt:P3529 ?x FILTER(contains(?x,'32360.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Singapore Airlines', 'p': 'head quarters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'median household income', 'o': '32360.0'}}

 Q: What type of electrification is direct current?
 SPARQL: select distinct ?answer where { ?answer wdt:P930 wd:Q159241}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'type of electrification', 'o': 'direct current'}

 Q: What New Line Cinema film trilogy had the largest box office?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q13593818 . ?ent wdt:P2142 ?obj . ?ent wdt:P272 wd:Q79202 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'box office', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film trilogy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'production company', 'o': 'New Line Cinema'}}}

 Q: What are the revolution which start with the letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10931 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'revolution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: what is the {start time} for {Boa Vista} has {head of government} as {Teresa Surita} ?
 SPARQL: SELECT ?value WHERE { wd:Q181056 p:P6 ?s . ?s ps:P6 wd:Q9086139 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boa Vista', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Teresa Surita'}}}

 Q: How many {practiced by} are for {tennis} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q847 wdt:P3095 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'tennis', 'p': 'practiced by', 'o': '?x0'}

 Q: What is {county seat} of {Austria}, that has {head of national government} is {Josef Neumayer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40 wdt:P36 ?answer . ?answer wdt:P6 wd:Q1705370}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Austria', 'p': 'county seat', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head of national government', 'o': 'Josef Neumayer'}}

 Q: What is the unemployment rate at the Misiones Province Indian reservation?
 SPARQL: SELECT ?answer WHERE { wd:Q44798 wdt:P131 ?X . ?X wdt:P1198 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'unemployment rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Misiones Province', 'p': 'in', 'o': '$y0'}}

 Q: what is the {end time} for {Han dynasty} has {capital} as {Chang'an} ?
 SPARQL: SELECT ?value WHERE { wd:Q7209 p:P36 ?s . ?s ps:P36 wd:Q6501000 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Han', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': "Chang'an"}}}

 Q: What is the {essential medicine} for {medical condition treated} of {inflammation}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q35456 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'inflammation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essential medicine'}}

 Q: What is the {list of World Chess Champions} for {participant} of {Magnus Carlsen}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q106807 . ?sbj wdt:P31 wd:Q9805708 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Magnus Carlsen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'list of World Chess Champions'}}

 Q: What is {elected in} and {electoral district} of {{Malcolm Turnbull} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q927550 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value1 . ?s pq:P768 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Turnbull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'electoral district', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Turnbull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: what is the {character role} for {Sex and the City} has {cast member} as {Kristin Davis} ?
 SPARQL: SELECT ?value WHERE { wd:Q35791 p:P161 ?s . ?s ps:P161 wd:Q229176 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'character role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sex and the City', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Kristin Davis'}}}

 Q: What is <TasteAtlas ID> of <sushi> ?
 SPARQL: select distinct ?answer where { wd:Q46383 wdt:P5456 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'sushi', 'p': 'TasteAtlas ID', 'o': '?x0'}

 Q: What is <family relationship degree> of <parent> ?
 SPARQL: select distinct ?answer where { wd:Q7566 wdt:P4500 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'parent', 'p': 'family relationship degree', 'o': '?x0'}

 Q: How many {award received} are to/by {Tony Award} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P166 wd:Q191874 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'awards', 'o': 'Tony Award'}

 Q: what is the {start time} for {John of England} has {spouse} as {Isabel, Countess of Gloucester} ?
 SPARQL: SELECT ?value WHERE { wd:Q129308 p:P26 ?s . ?s ps:P26 wd:Q242636 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John of England', 'p': 'wife', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'wife', 'o': 'Isabel, Countess of Gloucester'}}}

 Q: What is {die from} of {B. B. King}, that has {anatomical location} is {human brain} ?
 SPARQL: SELECT ?answer WHERE { wd:Q188969 wdt:P509 ?answer . ?answer wdt:P927 wd:Q492038}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'B. B. King', 'p': 'die from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'human brain'}}

 Q: What is the LibraryThing work ID of Ajax?
 SPARQL: select distinct ?answer where { wd:Q412341 wdt:P1085 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ajax', 'p': 'LibraryThing work ID', 'o': '?x0'}

 Q: What is {has daughter} of {musical score by} of {The Beat That My Heart Skipped} ?
 SPARQL: SELECT ?answer WHERE { wd:Q931671 wdt:P86 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Beat That My Heart Skipped', 'p': 'musical score by', 'o': '$y0'}}

 Q: when is the {point in time} for {Melbourne} which has {population} as {4529500} ?
 SPARQL: SELECT ?value WHERE { wd:Q3141 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4529500')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Melbourne', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '4529500'}, 't': '?x0'}

 Q: Can you tell distributor of BP?
 SPARQL: select distinct ?answer where { ?answer wdt:P750 wd:Q152057}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'distributor', 'o': 'BP'}

 Q: What is {sister city} of {Burlington}, that has {county seat for} is {Yaroslavl Oblast} ?
 SPARQL: SELECT ?answer WHERE { wd:Q31058 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q2448}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Burlington', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat for', 'o': 'Yaroslavl Oblast'}}

 Q: When did Astrid Lindgren receive an award as Zilveren Griffel?
 SPARQL: SELECT ?value WHERE { wd:Q55767 p:P166 ?s . ?s ps:P166 wd:Q2285862 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Astrid Lindgren', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Zilveren Griffel'}, 't': '?x0'}

 Q: When did award received of Art Tatum and winner?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q109053 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Art Tatum', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Art Tatum', 'p': 'award received', 'o': '$y0'}}]

 Q: Give me {rock band} that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5741069 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rock band'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is the taxon parent of archosaur, whose vernacular name is クルロタルシ類?
 SPARQL: SELECT ?answer WHERE { wd:Q130910 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'クルロタルシ類'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'archosaur', 'p': 'taxon parent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': 'クルロタルシ類'}}

 Q: what is the {end time} for {North Atlantic Treaty Organization} has {secretary general} as {Paul-Henri Spaak} ?
 SPARQL: SELECT ?value WHERE { wd:Q7184 p:P3975 ?s . ?s ps:P3975 wd:Q155691 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North Atlantic Treaty Organization', 'p': 'secretary general', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'secretary general', 'o': 'Paul-Henri Spaak'}}}

 Q: What is {end time} and {start time} of {{Boeing 747} has {operator} as {Air Algérie}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q179 p:P137 ?s . ?s ps:P137 wd:Q406764 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boeing 747', 'p': 'operated by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'operated by', 'o': 'Air Algerie'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boeing 747', 'p': 'operated by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'operated by', 'o': 'Air Algerie'}}}]

 Q: What military rank did Mikhail Kalashnikov achieve in 1999-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q167573 p:P410 ?s . ?s ps:P410 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mikhail Kalashnikov', 'p': 'military rank', 'o': '?x0', 't': '1999'}

 Q: What is {sons} of {daughter of} of {Athena} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37122 wdt:P22 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Athena', 'p': 'daughter of', 'o': '$y0'}}

 Q: Is Diplo a participant with Skrillex and Sanjoy?
 SPARQL: ASK WHERE { wd:Q533781 wdt:P710 wd:Q19004 . wd:Q533781 wdt:P710 wd:Q16910067 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Diplo', 'p': 'participant', 'o': '?x0', '?x0': 'Skrillex'}, {'h': 'IS', 'v': '?x1', 's': 'Diplo', 'p': 'participant', 'o': '?x1', '?x1': 'Sanjoy'}]

 Q: What is {start time} and {end time} of {{Joseph Liouville} has {member of} as {French National Assembly}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q214549 p:P463 ?s . ?s ps:P463 wd:Q193582 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Liouville', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'French National Assembly'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Liouville', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'French National Assembly'}}}]

 Q: Tell me the jurisdiction and location of Matthias Corvinus which was an event as coronation.
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q188634 p:P793 ?s . ?s ps:P793 wd:Q209715 . ?s pq:P1001 ?value1 . ?s pq:P276 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'jurisdiction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matthias Corvinus', 'p': 'event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'event', 'o': 'coronation'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'location', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matthias Corvinus', 'p': 'event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'event', 'o': 'coronation'}}}]

 Q: What is the {human} for {employer} of {Lockheed Martin}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P108 wd:Q7240 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Lockheed Martin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: which chemical compound has the highest kinematic viscosity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2118 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'kinematic viscosity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is the etymology of the CNO cycle that has a date of discovery as 1772-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q222971 wdt:P138 ?answer . ?answer wdt:P575 ?x FILTER(contains(YEAR(?x),'1772'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'CNO cycle', 'p': 'etymology', 'o': '?x0', 't': '1772'}

 Q: What is {has villages} of {worked for} of {Dorian Leigh} ?
 SPARQL: SELECT ?answer WHERE { wd:Q270426 wdt:P108 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has villages', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dorian Leigh', 'p': 'worked for', 'o': '$y0'}}

 Q: What is the {type of quantum particle} for {opposite of} of {elementary particle}
 SPARQL:  select distinct ?obj where { wd:Q43116 wdt:P461 ?obj . ?obj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'elementary particle', 'p': 'opposite', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: What is the total fertility rate for operators of the Cessna 172 Skyhawk?
 SPARQL: SELECT ?answer WHERE { wd:Q244479 wdt:P137 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cessna 172 Skyhawk', 'p': 'operator', 'o': '$y0'}}

 Q: Is the number of victims of killer Francis Heaulme equal 9?
 SPARQL: ASK WHERE { wd:Q3081486 wdt:P1345 ?obj filter(?obj = 9) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Francis Heaulme', 'p': 'number of victims of killer', 'o': '?x0', '?x0': '9'}

 Q: What is {typology} of {second language} of {Paul van Dyk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q77034 wdt:P1412 ?X . ?X wdt:P4132 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'typology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul van Dyk', 'p': 'language', 'o': '$y0'}}

 Q: Give me {dead language} that {has grammatical case} {genitive case} and which contains the word {norn} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45762 . ?sbj wdt:P2989 wd:Q146233 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'norn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dead language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical case', 'o': 'genitive case'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'norn'}}

 Q: How much applies to jurisdiction to Para?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1001 wd:Q39517 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'Para'}

 Q: What is the catalog  of traditional Chinese characters for writing system
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q2352616 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'traditional Chinese characters', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'catalog'}}

 Q: What actor from The Truman Show was educated at the Peabody Institute?
 SPARQL: SELECT ?answer WHERE { wd:Q214801 wdt:P161 ?answer . ?answer wdt:P69 wd:Q1156934}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Truman Show', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'educated at', 'o': 'Peabody Institute'}}

 Q: What is {advisor} of {musical score by} of {Piano Sonata No. 3} ?
 SPARQL: SELECT ?answer WHERE { wd:Q145937 wdt:P86 ?X . ?X wdt:P1066 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piano Sonata No. 3', 'p': 'musical score by', 'o': '$y0'}}

 Q: What is {preceded by} of {London Calling}, that has {literary genre} is {folk punk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q644416 wdt:P155 ?answer . ?answer wdt:P136 wd:Q1425661}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'London Calling', 'p': 'preceded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'genre', 'o': 'folk punk'}}

 Q: What is {nominated for} of {Kevin Kline} that is {point in time} is {1991-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q105817 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kevin Kline', 'p': 'nominated for', 'o': '?x0', 't': '1991'}

 Q: What is the award received by Ellen DeGeneres in 2012-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q483325 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ellen DeGeneres', 'p': 'award received', 'o': '?x0', 't': '2012'}

 Q: What is the {sovereign state} for {culture} of {Rome}
 SPARQL:  select distinct ?obj where { wd:Q220 wdt:P2596 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rome', 'p': 'culture', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who gave the{citation} of {is shown in} of {Beardsley} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47471843 wdt:P1441 ?X . ?X wdt:P2860 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'citation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Beardsley', 'p': 'is shown in', 'o': '$y0'}}

 Q: What is {fields} of {creates} of {Chef Boyardee} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17079048 wdt:P1056 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fields', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chef Boyardee', 'p': 'creates', 'o': '$y0'}}

 Q: What is {elected in} and {end cause} of {{John Hume} has {position held} as {Member of the 1st Northern Ireland Assembly}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q193630 p:P39 ?s . ?s ps:P39 wd:Q37303731 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hume', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 1st Northern Ireland Assembly'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hume', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 1st Northern Ireland Assembly'}}}]

 Q: What disputed territory starts with the letter "t"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15239622 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disputed territory'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {academic library} with the {MAX(collection or exhibition size)} whose {instance of} is {college library}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q856234 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q1622062 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'collection or exhibition size', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'college library'}}

 Q: Which is the species kept of Chanos chanos?
 SPARQL: select distinct ?answer where { ?answer wdt:P1990 wd:Q465261}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'species kept', 'o': 'Chanos chanos'}

 Q: Which is the Japanese military aircraft designation of DC-3?
 SPARQL: select distinct ?answer where { wd:Q190211 wdt:P849 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'DC-3', 'p': 'Japanese military aircraft designation', 'o': '?x0'}

 Q: Is the clearance of the Little Belt Bridge greater than 35.2?
 SPARQL: ASK WHERE { wd:Q1424674 wdt:P2793 ?obj filter(?obj > 35.2) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Little Belt Bridge', 'p': 'clearance', 'o': '?x0', '?x0': '35.2'}

 Q: What comes before and is developed by MultiMediaCard?
 SPARQL: SELECT ?answer WHERE { wd:Q646104 wdt:P156 ?X . ?X wdt:P178 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'developed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'MultiMediaCard', 'p': 'comes before', 'o': '$y0'}}

 Q: Which is the epithet which is said to be the same as Apollo?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P460 wd:Q37340 . ?sbj wdt:P31 wd:Q207869 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'said to be the same as', 'o': 'Apollo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'epithet'}}

 Q: What is {date incorporated} of {college attended} of {Jack Ma} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1137062 wdt:P69 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'incorporated', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jack Ma', 'p': 'college attended', 'o': '$y0'}}

 Q: What is {position held} of {Umberto I of Italy} that is {replaces} is {Victor Emmanuel II of Savoy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q153688 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q168691 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Umberto I of Italy', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Victor Emmanuel II of Savoy'}}}

 Q: What is the {television series season} for {series} of {Saturday Night Live}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q13979 . ?sbj wdt:P31 wd:Q3464665 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Saturday Night Live', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'season'}}

 Q: Who are the participants in the Battle of Greece, which is a member of the Organisation for the Prohibition of Chemical Weapons?
 SPARQL: SELECT ?answer WHERE { wd:Q2888837 wdt:P710 ?answer . ?answer wdt:P463 wd:Q842490}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Battle of Greece', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Organisation for the Prohibition of Chemical Weapons'}}

 Q: what is the {point in time} for {Tim Duncan} has {award received} as {John R. Wooden Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q193020 p:P166 ?s . ?s ps:P166 wd:Q1641970 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tim Duncan', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'John R. Wooden Award'}, 't': '?x0'}

 Q: What is {instance of} of {Papal States} that is {start time} is {756-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q170174 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P580 ?x filter(contains(?x,'756-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Papal State', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'start time', 'o': '756-0-0'}}}

 Q: Is the total services of the United States of America equal to 3.47533162784e+11?
 SPARQL: ASK WHERE { wd:Q30 wdt:P2134 ?obj filter(?obj = 3.47533162784e+11) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'United States of America', 'p': 'total reserves', 'o': '?x0', '?x0': '3.47533162784e+11'}

 Q: What is {zenith} of {borders} of {East Java} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3586 wdt:P47 ?X . ?X wdt:P610 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zenith', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'East Java', 'p': 'border', 'o': '$y0'}}

 Q: What is {part of constellation} of {has moon} of {HD 76700} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1563424 wdt:P398 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'HD 76700', 'p': 'has moon', 'o': '$y0'}}

 Q: What is {time zone} of {birth place} of {Frank Capra} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51492 wdt:P19 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frank Capra', 'p': 'birth place', 'o': '$y0'}}

 Q: Give me {automobile manufacturer} that {business division} {Aston Martin} and which that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q786820 . ?sbj wdt:P199 wd:Q27074 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'automobile manufacturer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'business division', 'o': 'Aston Martin'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {nominated for} of {Katharine Hepburn} that is {for work} is {On Golden Pond} ?
 SPARQL: SELECT ?obj WHERE { wd:Q56016 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q451603 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katharine Hepburn', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'On Golden Pond'}}}

 Q: What is ASI Monument ID of Red Fort?
 SPARQL: select distinct ?answer where { wd:Q45957 wdt:P1371 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Red Fort', 'p': 'ASI Monument ID', 'o': '?x0'}

 Q: What is {seat} of {member of} of {Leiden University} ?
 SPARQL: SELECT ?answer WHERE { wd:Q156598 wdt:P463 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'seat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leiden University', 'p': 'member of', 'o': '$y0'}}

 Q: Name the empire that was replaced by the Principality of Serbia that starts with letter E
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P1366 wd:Q684030 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Principality of Serbia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'e'}}

 Q: Which are the units sold for PlayStation 2?
 SPARQL: select distinct ?answer where { wd:Q10680 wdt:P2664 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'PlayStation 2', 'p': 'units sold', 'o': '?x0'}

