 Q: Did {Lance_Armstrong} {member of sports team} {HTC-Highroad} and {RadioShack} ?
 SPARQL: ASK WHERE { wd:Q2172 wdt:P54 wd:Q169272 . wd:Q2172 wdt:P54 wd:Q897818 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lance Armstrong', 'p': 'member of sports team', 'o': '?x0', '?x0': 'HTC-Highroad'}, {'h': 'IS', 'v': '?x1', 's': 'Lance Armstrong', 'p': 'member of sports team', 'o': '?x1', '?x1': 'RadioShack'}]

 Q: what is the {start time} for {Lufthansa} has {chief executive officer} as {Christoph Franz} ?
 SPARQL: SELECT ?value WHERE { wd:Q9325 p:P169 ?s . ?s ps:P169 wd:Q92434 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lufthansa', 'p': 'CEO', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'CEO', 'o': 'Christoph Franz'}}}

 Q: What is {significant event} of {Edgar Mitchell} that is {point in time} is {1971-2-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q295873 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1971')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Edgar Mitchell', 'p': 'event', 'o': '?x0', 't': '1971'}

 Q: What is {nominated for} of {Bing Crosby} that is {statement is subject of} is {18th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q72984 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917178 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bing Crosby', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '18th Academy Awards'}}}

 Q: What is {claimed by} of {Alexander Island}, that has {total fertility rate} is {2.322} ?
 SPARQL: SELECT ?answer WHERE { wd:Q200223 wdt:P1336 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'2.322'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alexander Island', 'p': 'claimed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '2.322'}}

 Q: What is {has grammatical gender} of {languages spoken, written, or signed} of {Max Factor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q868560 wdt:P1412 ?X . ?X wdt:P5109 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical gender', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Max Factor', 'p': 'language', 'o': '$y0'}}

 Q: Tell me if the number of cases of malaria is 343527.
 SPARQL: ASK WHERE { wd:Q12156 wdt:P1603 ?obj filter(?obj = 343527) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'malaria', 'p': 'number of cases', 'o': '?x0', '?x0': '343527'}

 Q: Tell me chemical property whose name has the word tetravalence in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q764285 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tetravalence')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical property'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tetravalence'}}

 Q: Is the tuition fee of Indian Institute of Technology Kanpur equal to 100000?
 SPARQL: ASK WHERE { wd:Q782682 wdt:P5894 ?obj filter(?obj = 100000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Indian Institute of Technology Kanpur', 'p': 'tuition fee', 'o': '?x0', '?x0': '100000'}

 Q: What is {series} of {Once Upon a Time in the West} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q168154 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Once Upon a Time in the West', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: What is EMLO location ID for Riga ?
 SPARQL: select distinct ?answer where { wd:Q1773 wdt:P4672 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Riga', 'p': 'EMLO location ID', 'o': '?x0'}

 Q: What is {member of} of {Erich Honecker}, that has {establishment date} is {1949-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2607 wdt:P463 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1949'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Erich Honecker', 'p': 'member of', 'o': '?x0', 't': '1949'}

 Q: what is the {start time} for {Ben Chifley} has {position held} as {Prime Minister of Australia} ?
 SPARQL: SELECT ?value WHERE { wd:Q23379 p:P39 ?s . ?s ps:P39 wd:Q319145 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ben Chifley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Australia'}}}

 Q: Give me {conjecture} that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q319141 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conjecture'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is {located in time zone} of {Stockholm} that is {valid in period} is {daylight saving time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1754 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'timezone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stockholm', 'p': 'timezone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'daylight saving time'}}}

 Q: What is the human population of the administrative headquarters of French Indochina?
 SPARQL: SELECT ?answer WHERE { wd:Q185682 wdt:P36 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'French Indochina', 'p': 'administrative headquarters', 'o': '$y0'}}

 Q: Who created the etymology of Curie temperature and has the birth date of 1859-5-15?
 SPARQL: SELECT ?answer WHERE { wd:Q191073 wdt:P138 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1859'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Curie temperature', 'p': 'etymology', 'o': '?x0', 't': '1859'}

 Q: Which research institute is owned by the University of Oxford?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q31855 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'University of Oxford', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'research institute'}}

 Q: In Venice, do you know the work location of human?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P937 wd:Q641 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work location', 'o': 'Venice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {informed by} of {John Rawls}, that has {Christian name} is {Immanuel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q172544 wdt:P737 ?answer . ?answer wdt:P735 wd:Q18199901}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Rawls', 'p': 'informed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Christian name', 'o': 'Immanuel'}}

 Q: what is the {applies to part} for {North Platte River} has {coordinate location} as {41.1139} ?
 SPARQL: SELECT ?value WHERE { wd:Q1755015 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'41.1139')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North Platte River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'coordinate location', 'o': '41.1139'}}}

 Q: What is the {sovereign state} for {country for sport} of {George Weah}
 SPARQL:  select distinct ?obj where { wd:Q173139 wdt:P1532 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Weah', 'p': 'country for sport', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is {female form of label} of {mayor} that is {alternate names} is {mairesse} ?
 SPARQL: SELECT ?obj WHERE { wd:Q30185 p:P2521 ?s . ?s ps:P2521 ?obj . ?s pq:P4970 ?x filter(contains(?x,'mairesse')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'female form of label', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mayor', 'p': 'female form of label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'alternate name', 'o': 'mairesse'}}}

 Q: What is the AmphibiaWeb Species ID of Notophthalmus viridescens?
 SPARQL: select distinct ?answer where { wd:Q1552306 wdt:P5036 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Notophthalmus viridescens', 'p': 'AmphibiaWeb Species ID', 'o': '?x0'}

 Q: What is the {operating system} for {developer} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q9135 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'operating system'}}

 Q: what is the {applies to part} for {Saxony} has {replaces} as {Cottbus District} ?
 SPARQL: SELECT ?value WHERE { wd:Q1202 p:P1365 ?s . ?s ps:P1365 wd:Q48046 . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saxony', 'p': 'replaces', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Cottbus District'}}}

 Q: What is {educated at} of {P. J. Patterson} that is {end time} is {1953-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q109130 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'P. J. Patterson', 'p': 'educated at', 'o': '?x0', 't': '1953'}

 Q: What is the current version of the Great Expectations?
 SPARQL:  select distinct ?obj where { wd:Q219552 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Great Expectations', 'p': 'version', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version'}}

 Q: What is the Internet Standard edition or translation of Internet Protocol version 6?
 SPARQL:  select distinct ?obj where { wd:Q2551624 wdt:P629 ?obj . ?obj wdt:P31 wd:Q290378 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Internet Protocol version 6', 'p': 'edition or translation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Internet Standard'}}

 Q: What weapon family starts with the letter "u"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15142889 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weapon family'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: what is the {end time} for {Fergie} has {record label} as {Interscope Records} ?
 SPARQL: SELECT ?value WHERE { wd:Q180004 p:P264 ?s . ?s ps:P264 wd:Q231694 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fergie', 'p': 'record label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record label', 'o': 'Interscope'}}}

 Q: Is the perimeter of the Lai da Schmorras equal to 0.168?
 SPARQL: ASK WHERE { wd:Q42308574 wdt:P2547 ?obj filter(?obj = 0.168) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lai da Schmorras', 'p': 'perimeter', 'o': '?x0', '?x0': '0.168'}

 Q: What is the antonym of midnight sun whose timespan is 20?
 SPARQL: SELECT ?answer WHERE { wd:Q774621 wdt:P461 ?answer . ?answer wdt:P2047 ?x FILTER(contains(?x,'20'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'midnight sun', 'p': 'antonym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timespan', 'o': '20'}}

 Q: In 1930, what was the capital of Türkmenabat?
 SPARQL: SELECT ?obj WHERE { wd:Q487684 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Türkmenabat', 'p': 'capital of', 'o': '?x0', 't': '1930'}

 Q: What is the ingredients in beer whose phase point is the critical point?
 SPARQL: SELECT ?answer WHERE { wd:Q44 wdt:P186 ?answer . ?answer wdt:P873 wd:Q111059}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'beer', 'p': 'ingredient', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'phase point', 'o': 'critical point'}}

 Q: What is {honours} of {discoverer or inventor of} of {general relativity} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11452 wdt:P61 ?X . ?X wdt:P166 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'honours', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'general relativity', 'p': 'discoverer or inventor', 'o': '$y0'}}

 Q: Tell me the performing arts genre that contains the word videotanz in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'videotanz')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'performing arts genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'videotanz'}}

 Q: Which character from Star Wars is the husband of Princess Leia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P26 wd:Q51797 . ?sbj wdt:P31 wd:Q33125444 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'husband', 'o': 'Princess Leia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'character from Star Wars'}}

 Q: What is {oblateness} of {orbits} {Amalthea} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3257 wdt:P397 ?X . ?X wdt:P1102 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'oblateness', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amalthea', 'p': 'orbits', 'o': '$y0'}}

 Q: What is the Snooker Database player ID of Stephen Hendry?
 SPARQL: select distinct ?answer where { wd:Q295201 wdt:P4538 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stephen Hendry', 'p': 'Snooker Database player ID', 'o': '?x0'}

 Q: Is Gini coefficient of 47.7 native to American English?
 SPARQL: SELECT ?answer WHERE { wd:Q7976 wdt:P2341 ?answer . ?answer wdt:P1125 ?x FILTER(contains(?x,'47.7'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'American English', 'p': 'native to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Gini coefficient', 'o': '47.7'}}

 Q: What is the {human} for {composer} of {La traviata}
 SPARQL:  select distinct ?obj where { wd:Q186162 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'La traviata', 'p': 'composer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What are the coordinates of the headquarters of Zibo?
 SPARQL: select distinct ?answer where { ?answer wdt:P159 wd:Q198370}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters', 'o': 'Zibo'}

 Q: What is {ideology} of {political party} of {Ryō Shuhama} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7385266 wdt:P102 ?X . ?X wdt:P1142 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ideology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ryō Shuhama', 'p': 'party', 'o': '$y0'}}

 Q: who  is the sports venue for operator of Indianapolis?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P137 wd:Q6346 . ?sbj wdt:P31 wd:Q1076486 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Indianapolis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sports venue'}}

 Q: What is {location} and {doctoral advisor} of {{Hans Bethe} has {academic degree} as {doctoral degree}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q155794 p:P512 ?s . ?s ps:P512 wd:Q849697 . ?s pq:P276 ?value1 . ?s pq:P184 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Bethe', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'doctoral degree'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'doctoral advisor', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Bethe', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'doctoral degree'}}}]

 Q: What is the {Wikimedia duplicated page} for {measured by} of {energy}
 SPARQL:  select distinct ?obj where { wd:Q11379 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q17362920 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'energy', 'p': 'measured by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'duplicate'}}

 Q: Which is the lowest note of Mariah Carey
 SPARQL: select distinct ?answer where { wd:Q41076 wdt:P1898 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mariah Carey', 'p': 'lowest note', 'o': '?x0'}

 Q: What is {location of death} of {Kang Sheng}, that has {sister town} is {Tokyo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q544432 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1490}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kang Sheng', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister town', 'o': 'Tokyo'}}

 Q: What is {portrait of} of {famous works} of {Severin Roesen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q88498 wdt:P800 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrait of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Severin Roesen', 'p': 'work', 'o': '$y0'}}

 Q: What is {located in time zone} of {Piacenza} that is {valid in period} is {standard time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q13329 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piacenza', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'standard time'}}}

 Q: What is <month of the year> of <Venice Film Festival> ?
 SPARQL: select distinct ?answer where { wd:Q49024 wdt:P2922 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Venice Film Festival', 'p': 'month of the year', 'o': '?x0'}

 Q: What is the {computer network protocol} for {depends on software} of {Hypertext Transfer Protocol}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1547 wd:Q8777 . ?sbj wdt:P31 wd:Q15836568 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depends on software', 'o': 'Hypertext Transfer Protocol', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer network protocol'}}

 Q: What unfinished/abandoned film project does screenwriter Mike Myers have?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P58 wd:Q185724 . ?sbj wdt:P31 wd:Q18011171 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'screenwriter', 'o': 'Mike Myers', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abandoned film project'}}

 Q: "What is {etymology} of {Riemann sum}, which has {studied at} is {Humboldt University of Berlin} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q1156903 wdt:P138 ?answer . ?answer wdt:P69 wd:Q152087}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Riemann sum', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied at', 'o': 'Humboldt University of Berlin'}}

 Q: What is next to the Gaza Strip, that has a total fertility rate of 2.9%?
 SPARQL: SELECT ?answer WHERE { wd:Q39760 wdt:P47 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'2.9'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gaza Strip', 'p': 'next to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '2.9'}}

 Q: what is the {series ordinal} for {Jennifer Lopez} has {given name} as {Lynn} ?
 SPARQL: SELECT ?value WHERE { wd:Q40715 p:P735 ?s . ?s ps:P735 wd:Q3841018 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jennifer Lopez', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'name', 'o': 'Lynn'}}}

 Q: what are the essential medicine which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35456 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essential medicine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: who is member of sports team of Franco Baresi that has number of matches played is 531.0 ?
 SPARQL: SELECT ?obj WHERE { wd:Q189984 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'531.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of sports team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franco Baresi', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '531.0'}}}

 Q: When was Robert Koch nominated for the Nobel Prize in Physiology or Medicine
 SPARQL: SELECT ?value WHERE { wd:Q37193 p:P1411 ?s . ?s ps:P1411 wd:Q80061 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert Koch', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Physiology or Medicine'}, 't': '?x0'}

 Q: Give me {ideology} that {named by} {Donald Watson} and which that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7257 . ?sbj wdt:P3938 wd:Q178402 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ideology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'named by', 'o': 'Donald Watson'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: what is the {end time} for {Dag Hammarskjöld} has {position held} as {United Nations Secretary-General} ?
 SPARQL: SELECT ?value WHERE { wd:Q1267 p:P39 ?s . ?s ps:P39 wd:Q81066 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dag Hammarskjöld', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United Nations Secretary-General'}}}

 Q: What was "The Walking Dead" nominated for on 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q232737 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Walking Dead', 'p': 'nominated for', 'o': '?x0', 't': '2012'}

 Q: Did {Shah_Rukh_Khan} {field of work} {Koyaanisqatsi}?
 SPARQL: ASK WHERE { wd:Q9535 wdt:P101 wd:Q1127828 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Shah Rukh Khan', 'p': 'field of work', 'o': '?x0', '?x0': 'Koyaanisqatsi'}]

 Q: what is game mode starts with v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1971694 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'game mode'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Give me {demigod of Greek mythology} that {wears} {hide} and which contains the word {heracles} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015925 . ?sbj wdt:P3828 wd:Q3291230 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'heracles')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'demigod of Greek mythology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wears', 'o': 'hide'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'heracles'}}

 Q: Who is the toponym of thorium, and has a parent named Odin?
 SPARQL: SELECT ?answer WHERE { wd:Q1115 wdt:P138 ?answer . ?answer wdt:P22 wd:Q43610}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'thorium', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent', 'o': 'Odin'}}

 Q: If the female population of Sagamihara is 360244.0, what is the total population?
 SPARQL: SELECT ?obj WHERE { wd:Q209779 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1539 ?x filter(contains(?x,'360244.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sagamihara', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'female population', 'o': '360244.0'}}}

 Q: what is the {end time} for {Cordell Hull} has {position held} as {United States representative} ?
 SPARQL: SELECT ?value WHERE { wd:Q202979 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cordell Hull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States representative'}}}

 Q: For which American football team is Bill Belichick playing
 SPARQL:  select distinct ?obj where { wd:Q720027 wdt:P54 ?obj . ?obj wdt:P31 wd:Q17156793 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bill Belichick', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'American football team'}}

 Q: What is population of Ostrava that is point in time is 2017-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q8385 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ostrava', 'p': 'population', 'o': '?x0', 't': '2017'}

 Q: Is Jane Fonda's father Henry Fonda?
 SPARQL: ASK WHERE { wd:Q41142 wdt:P22 wd:Q19155 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jane Fonda', 'p': 'father', 'o': '?x0', '?x0': 'Henry Fonda'}]

 Q: What is {member of} of {university attended} of {Douglas Southall Freeman} ?
 SPARQL: SELECT ?answer WHERE { wd:Q451929 wdt:P69 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Douglas Southall Freeman', 'p': 'university attended', 'o': '$y0'}}

 Q: What is the immediate outcome of a door with a vernacular name of Mirov?
 SPARQL: SELECT ?answer WHERE { wd:Q36794 wdt:P1478 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Mirov'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'door', 'p': 'immediate outcome of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': 'mirov'}}

 Q: What is {end time} and {start time} of {{Gore Vidal} has {partner} as {Howard Austen}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q167821 p:P451 ?s . ?s ps:P451 wd:Q17309157 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gore Vidal', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Howard Austen'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gore Vidal', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Howard Austen'}}}]

 Q: What is the current translated version of Hamlet
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P629 wd:Q41567 . ?sbj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'version of', 'o': 'Hamlet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version'}}

 Q: What is the {SI derived unit} for {measured by} of {frequency}
 SPARQL:  select distinct ?obj where { wd:Q11652 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q208469 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'frequency', 'p': 'measured by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'SI derived unit'}}

 Q: Is the embodied energy of iron 30.0?
 SPARQL: ASK WHERE { wd:Q677 wdt:P6075 ?obj filter(?obj = 30.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'iron', 'p': 'embodied energy', 'o': '?x0', '?x0': '30.0'}

 Q: What is the {owner of} and the {office held by head of the organisation} of {UNESCO} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q7809 wdt:P1830 ?ans_1 . wd:Q7809 wdt:P2388 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'UNESCO', 'p': 'owns', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'UNESCO', 'p': 'office held by head of the organisation', 'o': '?x1'}]

 Q: What is {topic of} of {history of chess}, that has {players max} is {3.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q471257 wdt:P1269 ?answer . ?answer wdt:P1873 ?x FILTER(contains(?x,'3.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of chess', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'players max', 'o': '3.0'}}

 Q: What is ploidy for  human genome ?
 SPARQL: select distinct ?answer where { wd:Q720988 wdt:P1349 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'human genome', 'p': 'ploidy', 'o': '?x0'}

 Q: When did country for contains administrative territorial entity of Tripura?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q1363 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Tripura', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Tell me physical law whose name has the word superposition in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q214070 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'superposition')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical law'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'superposition'}}

 Q: What is the NCBI Taxonomy ID of the Tsetse fly?
 SPARQL: select distinct ?answer where { wd:Q205256 wdt:P685 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tsetse fly', 'p': 'NCBI', 'o': '?x0'}

 Q: What is CLARA-ID for Audrey Munson?
 SPARQL: select distinct ?answer where { wd:Q152776 wdt:P1615 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Audrey Munson', 'p': 'CLARA-ID', 'o': '?x0'}

 Q: Which is from the fictional universe of Spock?
 SPARQL: select distinct ?answer where { wd:Q16341 wdt:P1080 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Spock', 'p': 'universe', 'o': '?x0'}

 Q: What is {causes} of {mica}, that has {first aid response} is {move to fresh air} ?
 SPARQL: SELECT ?answer WHERE { wd:Q114675 wdt:P1542 ?answer . ?answer wdt:P2239 wd:Q21010971}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'mica', 'p': 'causes', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first aid response', 'o': 'move to fresh air'}}

