 Q: What is {co-founded by} of {published in journal} of {University panel faults cloning co-author.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q53254858 wdt:P1433 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'University panel faults cloning co-author.', 'p': 'published in', 'o': '$y0'}}

 Q: What is the {cultural area} with the {MAX(total imports)} whose {topic's main category} is {Category:Northern England}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q518261 . ?ent wdt:P2136 ?obj . ?ent wdt:P910 wd:Q30564613 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'imports', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cultural area', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': "topic's main category", 'o': 'Category:Northern England'}}}

 Q: What is {owner} of {motif} of {The Art Gallery of Jan Gildemeester Jansz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17337965 wdt:P180 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Art Gallery of Jan Gildemeester Jansz', 'p': 'motif', 'o': '$y0'}}

 Q: What is {head of government} of {Tucumán Province} that is {start time} is {2015-10-29} ?
 SPARQL: SELECT ?obj WHERE { wd:Q44829 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tucuman Province', 'p': 'head of government', 'o': '?x0', 't': '2015'}

 Q: How many employees worked at SpaceX in 2017?
 SPARQL: SELECT ?obj WHERE { wd:Q193701 p:P1128 ?s . ?s ps:P1128 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'SpaceX', 'p': 'employees', 'o': '?x0', 't': '2017'}

 Q: Name the municipality that diocese Roman Catholic Archdiocese of Barcelona and which that starts with the letter b
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15284 . ?sbj wdt:P708 wd:Q1364117 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diocese', 'o': 'Roman Catholic Archdiocese of Barcelona'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: What is <Scope.dk film ID> of <The Big Lebowski> ?
 SPARQL: select distinct ?answer where { wd:Q337078 wdt:P2518 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Big Lebowski', 'p': 'Scope.dk film ID', 'o': '?x0'}

 Q: What is <FR SIRET number> of <École Polytechnique> ?
 SPARQL: select distinct ?answer where { wd:Q273626 wdt:P3215 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Polytechnique', 'p': 'SIRET', 'o': '?x0'}

 Q: Is the number of speakers of the Awakatek more than 21.6?
 SPARQL: ASK WHERE { wd:Q35091 wdt:P1098 ?obj filter(?obj > 21.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Awakatek', 'p': 'number of speakers', 'o': '?x0', '?x0': '21.6'}

 Q: Who is film crew member for Alan Menken?
 SPARQL: select distinct ?answer where { ?answer wdt:P3092 wd:Q317272}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'film crew member', 'o': 'Alan Menken'}

 Q: Does the electric charge of the Majorana Fermion equal 0?
 SPARQL: ASK WHERE { wd:Q1065883 wdt:P2200 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Majorana fermion', 'p': 'electric charge', 'o': '?x0', '?x0': '0'}

 Q: Macauis located on what continent and in what country?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q14773 wdt:P30 ?ans_1 . wd:Q14773 wdt:P17 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Macau', 'p': 'continent', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Macau', 'p': 'country', 'o': '?x1'}]

 Q: Who {has children} of {actor} {The Counterfeit Traitor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q908713 wdt:P161 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Counterfeit Traitor', 'p': 'actor', 'o': '$y0'}}

 Q: What is {name in official language} of {part of constellation} of {Markarian 421} ?
 SPARQL: SELECT ?answer WHERE { wd:Q201968 wdt:P59 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name in official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Markarian 421', 'p': 'constellation', 'o': '$y0'}}

 Q: What is <guidance system> of <Global Positioning System> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P624 wd:Q18822}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'guidance system', 'o': 'Global Positioning System'}

 Q: Which Class IB flammable liquid has the most fusion enthalpy?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2066 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'fusion enthalpy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IB flammable liquid'}}

 Q: How many {lakes on river} are for {Tagus river} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q14294 wdt:P469 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Tagus river', 'p': 'lakes on river', 'o': '?x0'}

 Q: what is the {start time} for {Josephine Baker} has {country of citizenship} as {France} ?
 SPARQL: SELECT ?value WHERE { wd:Q151972 p:P27 ?s . ?s ps:P27 wd:Q142 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josephine Baker', 'p': 'citizen of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'citizen of', 'o': 'France'}}}

 Q: what is the {valid in period} for {Messina} has {located in time zone} as {UTC+01:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q13666 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messina', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+01:00'}}}

 Q: what is the {object has role} for {Bonanza} has {cast member} as {Dan Blocker} ?
 SPARQL: SELECT ?value WHERE { wd:Q862187 p:P161 ?s . ?s ps:P161 wd:Q962647 . ?s pq:P3831 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bonanza', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Dan Blocker'}}}

 Q: Is the electronegativity of gallium less than 2.172?
 SPARQL: ASK WHERE { wd:Q861 wdt:P1108 ?obj filter(?obj < 2.172) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'gallium', 'p': 'electronegativity', 'o': '?x0', '?x0': '2.172'}

 Q: What is the {chemical compound} for {drug used for treatment} of {skin cancer}
 SPARQL:  select distinct ?obj where { wd:Q192102 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'skin cancer', 'p': 'used for treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Which is the Croatian Olympic Committee athlete ID for Ivano Balić?
 SPARQL: select distinct ?answer where { wd:Q310526 wdt:P4541 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ivano Balić', 'p': 'Croatian Olympic Committee athlete ID', 'o': '?x0'}

 Q: What is {makes} of {product of} of {Cessna Model A} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3665640 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'product', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cessna Model A', 'p': 'product of', 'o': '$y0'}}

 Q: "What is {namesake} of {Diffie–Hellman key exchange}, which has {prize awarded} is {Computer History Museum fellow} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q623447 wdt:P138 ?answer . ?answer wdt:P166 wd:Q29545180}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Diffie–Hellman key exchange', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'award', 'o': 'Computer History Museum fellow'}}

 Q: What is the alkane with the safety classification and labelling of NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response and which has the word "propane" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41581 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'propane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alkane', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'safety classification and labelling', 'o': 'NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'propane'}}

 Q: What is the {aircraft family} with the {MIN(maximum glide ratio)} whose {instance of} is {aircraft family}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056993 . ?ent wdt:P1470 ?obj . ?ent wdt:P31 wd:Q15056993} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'maximum glide ratio', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: how many buildings are to be destroyed?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3082 wd:Q41176 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'destroyed', 'o': 'building'}

 Q: What is {synonym of this name} of {found in species} of {vascular tissue} ?
 SPARQL: SELECT ?answer WHERE { wd:Q968604 wdt:P703 ?X . ?X wdt:P1420 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'synonym of this name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'vascular tissue', 'p': 'found in species', 'o': '$y0'}}

 Q: What country shares a border with Duisburg?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P47 wd:Q2100 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Duisburg'}

 Q: What is the topic's main template for international trade?
 SPARQL: select distinct ?answer where { wd:Q178803 wdt:P1424 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'international trade', 'p': "topic's main template", 'o': '?x0'}

 Q: What is {award received} of {Ravi Shankar} that is {for work} is {The Concert for Bangladesh} ?
 SPARQL: SELECT ?obj WHERE { wd:Q103774 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q1164558 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ravi Shankar', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Concert for Bangladesh'}}}

 Q: What is the etymology of Laplace transform whose place of death is Paris?
 SPARQL: SELECT ?answer WHERE { wd:Q199691 wdt:P138 ?answer . ?answer wdt:P20 wd:Q90}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Laplace transform', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Paris'}}

 Q: what is the {for work} for {Dalton Trumbo} has {nominated for} as {Academy Award for Best Story} ?
 SPARQL: SELECT ?value WHERE { wd:Q350666 p:P1411 ?s . ?s ps:P1411 wd:Q504298 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dalton Trumbo', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Story'}}}

 Q: Which is the monogram for Charles II of England?
 SPARQL: select distinct ?answer where { wd:Q122553 wdt:P1543 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles II of England', 'p': 'monogram', 'o': '?x0'}

 Q: Which is the time period of Menander I?
 SPARQL: select distinct ?answer where { wd:Q347878 wdt:P2348 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Menander I', 'p': 'time period', 'o': '?x0'}

 Q: What is the {ethnic group} for {indigenous to} of {Russian}
 SPARQL:  select distinct ?obj where { wd:Q7737 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q41710 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russian', 'p': 'indigenous to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic group'}}

 Q: What is Karl von Frisch's Catalogus Professorum Rostochiensium ID?
 SPARQL: select distinct ?answer where { wd:Q60060 wdt:P2940 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Karl von Frisch', 'p': 'Catalogus Professorum Rostochiensium ID', 'o': '?x0'}

 Q: what is the {start time} for {Silvia Neid} has {member of sports team} as {SC Klinge Seckach} ?
 SPARQL: SELECT ?value WHERE { wd:Q289857 p:P54 ?s . ?s ps:P54 wd:Q2205479 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Silvia Neid', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'SC Klinge Seckach'}}}

 Q: What are the national library which start with the letter library
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22806 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'library')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national library'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'library'}}

 Q: What is the temperature of lake Valletta?
 SPARQL: SELECT ?answer WHERE { wd:Q23800 wdt:P206 ?X . ?X wdt:P2076 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'temperature', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valletta', 'p': 'lake', 'o': '$y0'}}

 Q: What is <The Vogue List ID> of <John Galliano> ?
 SPARQL: select distinct ?answer where { wd:Q313607 wdt:P3404 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Galliano', 'p': 'The Vogue List ID', 'o': '?x0'}

 Q: How many {musical conductor} are to/by {Zubin Mehta} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3300 wd:Q157635 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'musical conductor', 'o': 'Zubin Mehta'}

 Q: what is the {start time} for {Kharkiv Oblast} has {located in the administrative territorial entity} as {Ukraine} ?
 SPARQL: SELECT ?value WHERE { wd:Q170666 p:P131 ?s . ?s ps:P131 wd:Q212 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kharkiv Oblast', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Ukraine'}}}

 Q: What is {subitem of} of {history of France}, that has {operating speed} is {30.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7778 wdt:P1269 ?answer . ?answer wdt:P3086 ?x FILTER(contains(?x,'30.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of France', 'p': 'subitem of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operating speed', 'o': '30.0'}}

 Q: How many armaments are pistols?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P520 wd:Q1907525 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'armament', 'o': 'pistol'}

 Q: What destroyer has the largest draft?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q174736 . ?ent wdt:P2262 ?obj . ?ent wdt:P31 wd:Q174736 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'draft', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'destroyer'}}

 Q: In what division of MLB is the team owned by Branch Rickey found?
 SPARQL: SELECT ?answer WHERE { wd:Q126019 wdt:P54 ?answer . ?answer wdt:P118 wd:Q1163715}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Branch Rickey', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'division', 'o': 'MLB'}}

 Q: What body of water is Warsaw near and in what is the time zone?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q270 wdt:P206 ?ans_1 . wd:Q270 wdt:P421 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Warsaw', 'p': 'body of water', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Warsaw', 'p': 'time zone', 'o': '?x1'}]

 Q: What is {sculptors} of {part of series} of {Patrick's Staycation/Walking the Plankton} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29565419 wdt:P179 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sculptor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Patrick's Staycation/Walking the Plankton", 'p': 'part of series', 'o': '$y0'}}

 Q: What is the {historical period} for {located on terrain feature} of {ancient Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P706 wd:Q1747689 . ?sbj wdt:P31 wd:Q11514315 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical period'}}

 Q: Does the Peugeot 107 have a wheelbase that is equal to 2340?
 SPARQL: ASK WHERE { wd:Q214229 wdt:P3039 ?obj filter(?obj = 2340) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Peugeot 107', 'p': 'wheelbase', 'o': '?x0', '?x0': '2340'}

 Q: What is HPIP ID for Elmina Castle ?
 SPARQL: select distinct ?answer where { wd:Q1438772 wdt:P5094 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Elmina Castle', 'p': 'HPIP ID', 'o': '?x0'}

 Q: What is Daniel Ellsberg's NYRB contributor ID?
 SPARQL: select distinct ?answer where { wd:Q431085 wdt:P5419 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Daniel Ellsberg', 'p': 'NYRB contributor ID', 'o': '?x0'}

 Q: When did Istanbul have a population of 14657434?
 SPARQL: SELECT ?value WHERE { wd:Q406 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'14657434')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Istanbul', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '14657434'}, 't': '?x0'}

 Q: Tell me a human who may be fictional that has the word cech in their name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21070568 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'čech')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human who may be fictional'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'čech'}}

 Q: What is <relative to> of <queue> ?
 SPARQL: select distinct ?answer where { wd:Q220543 wdt:P2210 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'queue', 'p': 'relative to', 'o': '?x0'}

 Q: What is {tributary} of {body of water} of {Paramaribo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3001 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paramaribo', 'p': 'body of water', 'o': '$y0'}}

 Q: What is the {summit} for {participant of} of {Donald Trump}
 SPARQL:  select distinct ?obj where { wd:Q22686 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q1072326 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Donald Trump', 'p': 'participant of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'summit'}}

 Q: What was Natalie Portman nominated for in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q37876 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Natalie Portman', 'p': 'nominated for', 'o': '?x0', 't': '2011'}

 Q: Tell me a specialty that starts with the letter w.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047113 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'specialty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Is the vehicle range of the Airbus A380 less than 12160.0?
 SPARQL: ASK WHERE { wd:Q5830 wdt:P2073 ?obj filter(?obj < 12160.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Airbus A380', 'p': 'vehicle range', 'o': '?x0', '?x0': '12160.0'}

 Q: What is {this taxon is a source of} of {main topic of list} of {List of mammals of Puerto Rico} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6627050 wdt:P360 ?X . ?X wdt:P1672 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'this taxon is a source of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'list of mammals of Puerto Rico', 'p': 'list of', 'o': '$y0'}}

 Q: How many {statistical leader} are to/by {Lionel Messi} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3279 wd:Q615 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'statistical leader', 'o': 'Lionel Messi'}

 Q: What is the {type of quantum particle} with the {MAX(magnetic moment)} whose {subclass of} is {lepton}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2069 ?obj . ?ent wdt:P279 wd:Q82586 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'magnetic moment', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'lepton'}}}

 Q: what is the {start time} for {Alexios I Komnenos} has {position held} as {Byzantine emperor} ?
 SPARQL: SELECT ?value WHERE { wd:Q41600 p:P39 ?s . ?s ps:P39 wd:Q18577504 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexios I Komnenos', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Byzantine emperor'}}}

 Q: Give me {book of the Bible} that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29154430 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book of the Bible'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the muscle origin for human mandible?
 SPARQL: select distinct ?answer where { ?answer wdt:P3490 wd:Q16370}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'muscle origin', 'o': 'human mandible'}

 Q: Who is the chief executive officer of Sony starting April 1, 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q41187 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sony', 'p': 'chief executive officer', 'o': '?x0', 't': '2012'}

 Q: What is the {applies to jurisdiction} and the {office held by head of the organisation} of {United_States_Secret_Service} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q503224 wdt:P1001 ?ans_1 . wd:Q503224 wdt:P2388 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'United States Secret Service', 'p': 'applies to jurisdiction', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'United States Secret Service', 'p': 'office held by head of the organisation', 'o': '?x1'}]

 Q: Tell me incorporation whose name has the word geman in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25394665 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'german')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'incorporation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'german'}}

 Q: What is the {human} for {sibling} of {Silvio Berlusconi}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3373 wd:Q11860 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Silvio Berlusconi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: who is investor of Lawrence Summers ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1951 wd:Q317953}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'investor', 'o': 'Lawrence Summers'}

 Q: What is the country of origin and language of work of Catch-22?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q278208 wdt:P495 ?ans_1 . wd:Q278208 wdt:P407 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Catch-22', 'p': 'country of origin', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Catch-22', 'p': 'language of work', 'o': '?x1'}]

 Q: What what is American football team home venue Soldier Field and also which starts with letter c
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q1132413 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'American football team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'home venue', 'o': 'Soldier Field'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {founders} of {worked at} of {Alexander McQueen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q207939 wdt:P108 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander McQueen', 'p': 'worked at', 'o': '$y0'}}

 Q: Give me {asymmetric warfare} that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q752673 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asymmetric warfare'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is {electoral district} and {elected in} of {{Malcolm Turnbull} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q927550 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P768 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Turnbull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Turnbull', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: Were Turkic languages official language of Uyghur people in Mongol Empire?
 SPARQL: ASK WHERE { wd:Q12557 wdt:P37 wd:Q34090 . wd:Q12557 wdt:P37 wd:Q46118 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mongol Empire', 'p': 'official language', 'o': '?x0', '?x0': 'Turkic languages'}, {'h': 'IS', 'v': '?x1', 's': 'Mongol Empire', 'p': 'official language', 'o': '?x1', '?x1': 'Uyghur people'}]

 Q: What is the {whistleblower platform} for {developer} of {Julian Assange}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P178 wd:Q360 . ?sbj wdt:P31 wd:Q1344897 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Julian Assange', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'whistleblower platform'}}

 Q: What is Danish Bibliometric Research Indicator level for the Lancet ?
 SPARQL: select distinct ?answer where { wd:Q939416 wdt:P1240 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lancet', 'p': 'Danish Bibliometric Research Indicator level', 'o': '?x0'}

 Q: What is <solid solution series with> of <dolomite> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2155 wd:Q167741}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'solid solution series with', 'o': 'dolomite'}

 Q: Tell me aspect of music whose name has the word phrase  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15198957 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'phrase')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of music'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'phrase'}}

 Q: What is the {follows} and the {day in year for periodic occurrence} of {Christmas} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q19809 wdt:P155 ?ans_1 . wd:Q19809 wdt:P837 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Christmas', 'p': 'follows', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Christmas', 'p': 'day', 'o': '?x1'}]

 Q: tell me intensive quantityfacet of electricity starts with v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj wdt:P1269 wd:Q12725 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intensive quantity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'electricity'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What are the studies of natural science ?
 SPARQL: select distinct ?answer where { wd:Q7991 wdt:P2578 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'natural science', 'p': 'studies', 'o': '?x0'}

 Q: What is the tributary of the bay of Santo Domingo?
 SPARQL: SELECT ?answer WHERE { wd:Q34820 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Santo Domingo', 'p': 'bay', 'o': '$y0'}}

 Q: what is the {end time} for {Charlemagne} has {spouse} as {Desiderata of the Lombards} ?
 SPARQL: SELECT ?value WHERE { wd:Q3044 p:P26 ?s . ?s ps:P26 wd:Q263474 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Desiderata of the Lombards'}}}

 Q: What is the treatment and result of hepatitis ?
 SPARQL: SELECT ?answer WHERE { wd:Q131742 wdt:P1542 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hepatitis', 'p': 'result', 'o': '$y0'}}

 Q: what is the {start time} for {George Weah} has {member of sports team} as {Al Jazira Club} ?
 SPARQL: SELECT ?value WHERE { wd:Q173139 p:P54 ?s . ?s ps:P54 wd:Q429630 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Weah', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Al Jazira Club'}}}

 Q: Which is the net profit for SAP SE?
 SPARQL: select distinct ?answer where { wd:Q552581 wdt:P2295 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'SAP SE', 'p': 'net profit', 'o': '?x0'}

