 Q: What is {treated by} of {treats} of {tobramycin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1758380 wdt:P2175 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'tobramycin', 'p': 'treats', 'o': '$y0'}}

 Q: Who is inspired by Statue of Liberty?
 SPARQL: select distinct ?answer where { ?answer wdt:P941 wd:Q9202}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'inspired by', 'o': 'Statue of Liberty'}

 Q: What part of Missouri was Mark Twain born in?
 SPARQL: SELECT ?obj WHERE { wd:Q7245 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1581 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mark Twain', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Missouri'}}}

 Q: What is the LoC Classification of the government of the Kingdom of Funan?
 SPARQL: SELECT ?answer WHERE { wd:Q867782 wdt:P122 ?X . ?X wdt:P1149 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'LoC Classification', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kingdom of Funan', 'p': 'government', 'o': '$y0'}}

 Q: What is the {enzyme} for {found in taxon} of {Homo sapiens}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P703 wd:Q15978631 . ?sbj wdt:P31 wd:Q8047 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'found in taxon', 'o': 'Homo sapiens', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enzyme'}}

 Q: Which is the MAPS poet ID of John Berryman?
 SPARQL: select distinct ?answer where { wd:Q522192 wdt:P5509 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Berryman', 'p': 'MAPS poet ID', 'o': '?x0'}

 Q: What is the ISO 3166-1 numeric code for Kazakhstan?
 SPARQL: select distinct ?answer where { wd:Q232 wdt:P299 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kazakhstan', 'p': 'ISO 3166-1 numeric code', 'o': '?x0'}

 Q: What is the location of birth, with a capital city of Petra, of Junipero Serra?
 SPARQL: SELECT ?answer WHERE { wd:Q522107 wdt:P19 ?answer . ?answer wdt:P36 wd:Q24019630}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Junipero Serra', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Petra'}}

 Q: Which is the academic degree for undergraduate degree?
 SPARQL: select distinct ?answer where { ?answer wdt:P512 wd:Q6008527}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'academic degree', 'o': 'undergraduate degree'}

 Q: What is the {anime} for {producer} of {Hayao Miyazaki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P162 wd:Q55400 . ?sbj wdt:P31 wd:Q1107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'producer', 'o': 'Hayao Miyazaki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anime'}}

 Q: Does the foreign direct net outflow of Belarus equate to 898800000?
 SPARQL: ASK WHERE { wd:Q184 wdt:P2140 ?obj filter(?obj = 898800000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Belarus', 'p': 'foreign direct investment net outflow', 'o': '?x0', '?x0': '898800000'}

 Q: What is the {notable work} and the {present in work} of {Noah} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q81422 wdt:P800 ?ans_1 . wd:Q81422 wdt:P1441 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Noah', 'p': 'notable work', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Noah', 'p': 'present in work', 'o': '?x1'}]

 Q: What is the {inner planet} for {facet of} of {history of the world}
 SPARQL:  select distinct ?obj where { wd:Q200325 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q3504248 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'history', 'p': 'facet of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inner planet'}}

 Q: What is the fusion enthalpy for tungsten?
 SPARQL: select distinct ?answer where { wd:Q743 wdt:P2066 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tungsten', 'p': 'fusion enthalpy', 'o': '?x0'}

 Q: who chronology of topic of continent of Canine Hills ?
 SPARQL: SELECT ?answer WHERE { wd:Q5032401 wdt:P30 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chronology of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Canine Hills', 'p': 'continent', 'o': '$y0'}}

 Q: How many partners does Poseidon have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P451 wd:Q41127 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Poseidon'}

 Q: Is it true that the total debt of the Accor equals to -58000000?
 SPARQL: ASK WHERE { wd:Q212599 wdt:P2133 ?obj filter(?obj = -58000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Accor', 'p': 'total debt', 'o': '?x0', '?x0': '-58000000'}

 Q: Give me {Christian Church} that {office held by head of the organisation} {pope} and which contains the word {catholic} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34651 . ?sbj wdt:P2388 wd:Q19546 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'catholic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian Church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'pope'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'catholic'}}

 Q: What is {year of death} of {has father} of {Ismail Samani} ?
 SPARQL: SELECT ?answer WHERE { wd:Q862648 wdt:P22 ?X . ?X wdt:P570 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'year of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ismail Samani', 'p': 'father', 'o': '$y0'}}

 Q: What is the {business} for {chief executive officer} of {Mukesh Ambani}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P169 wd:Q298547 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chief executive officer', 'o': 'Mukesh Ambani', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is the {word} for {language of work or name} of {English}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q8171 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'word'}}

 Q: What is {has edition} of {Abhigyanashakuntalam} that is {language of work or name} is {English} ?
 SPARQL: SELECT ?obj WHERE { wd:Q320594 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P407 wd:Q1860 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'edition', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abhigyanashakuntalam', 'p': 'edition', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'English'}}}

 Q: What Wikipedia article lists the awards Angela Lansbury received?
 SPARQL:  select distinct ?obj where { wd:Q206856 wdt:P166 ?obj . ?obj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Angela Lansbury', 'p': 'awards', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'list'}}

 Q: What natural feature on the Leeward Islands is also on a tributary of the Riviere Roxelane?
 SPARQL: SELECT ?answer WHERE { wd:Q29971 wdt:P706 ?answer . ?answer wdt:P974 wd:Q5649034}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leeward Islands', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Riviere Roxelane'}}

 Q: What was the noble title of Charles the Fat and who was he followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is {people} of {characters} of {The Emperor's New Groove} ?
 SPARQL: SELECT ?answer WHERE { wd:Q223163 wdt:P674 ?X . ?X wdt:P172 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "The Emperor's New Groove", 'p': 'characters', 'o': '$y0'}}

 Q: Where is Robert McNamara educated at and with what major?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q191999 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert McNamara', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert McNamara', 'p': 'educated at', 'o': '$y0'}}]

 Q: William Wordsworth was the citizen of which country in the year 1801?
 SPARQL: SELECT ?obj WHERE { wd:Q45546 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1801')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Wordsworth', 'p': 'citizen of', 'o': '?x0', 't': '1801'}

 Q: What is {given name} of {Kollegah} that is {series ordinal} is {3} ?
 SPARQL: SELECT ?obj WHERE { wd:Q58785 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'given name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kollegah', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '3'}}}

 Q: what is the {statement is subject of} for {Jesus Christ} has {name} as {Son of man} ?
 SPARQL: SELECT ?value WHERE { wd:Q302 p:P2561 ?s . ?s ps:P2561 ?x filter(contains(?x,'Son of man')) . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jesus', 'p': 'name', 'o': '$y0'}}

 Q: How many members of the sports team are from the Saitama Seibu Lions?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P54 wd:Q325819 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'team', 'o': 'Saitama Seibu Lions'}

 Q: Is Fogle a family name of Jared Fogle?
 SPARQL: ASK WHERE { wd:Q6159960 wdt:P734 wd:Q56244996 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jared Fogle', 'p': 'family name', 'o': '?x0', '?x0': 'Fogle'}]

 Q: What is the {human} for {copyright owner} of {The Little Prince}
 SPARQL:  select distinct ?obj where { wd:Q25338 wdt:P3931 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Little Prince', 'p': 'copyright owner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Does the explosive velocity of the octanitrocubane equals 8080.0?
 SPARQL: ASK WHERE { wd:Q413940 wdt:P2231 ?obj filter(?obj = 8080.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'octanitrocubane', 'p': 'explosive velocity', 'o': '?x0', '?x0': '8080.0'}

 Q: What is {date of death} and {date of birth} of {{Louis IX of France} has {child} as {Margaret of France, Duchess of Brabant}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q457111 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Margaret of France, Duchess of Braban'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Margaret of France, Duchess of Braban'}}}]

 Q: How many film editors worked for Star Wars Episode IV: A New Hope?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q17738 wdt:P1040 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'A New Hope', 'p': 'film editor', 'o': '?x0'}

 Q: what is the {character role} for {The Office} has {cast member} as {James Spader} ?
 SPARQL: SELECT ?value WHERE { wd:Q23831 p:P161 ?s . ?s ps:P161 wd:Q296928 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Office', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'James Spader'}}}

 Q: What is the name of the organization represented by Pablo Picasso?
 SPARQL:  select distinct ?obj where { wd:Q5593 wdt:P1875 ?obj . ?obj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pablo Picasso', 'p': 'represented by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: Does the yield strength of the Alloy 718 equal 996?
 SPARQL: ASK WHERE { wd:Q55843475 wdt:P5529 ?obj filter(?obj = 996.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Alloy 718', 'p': 'yield strength', 'o': '?x0', '?x0': '996.0'}

 Q: Which is the building for the headquarters location of Cathay Pacific?
 SPARQL:  select distinct ?obj where { wd:Q32141 wdt:P159 ?obj . ?obj wdt:P31 wd:Q41176 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cathay Pacific', 'p': 'headquarters location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'building'}}

 Q: What is the subsidiary company of University of Paris whose geocoordinates is 48.956214 2.341933?
 SPARQL: SELECT ?answer WHERE { wd:Q209842 wdt:P355 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'48.956214 2.341933'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'University of Paris', 'p': 'subsidiary', 'o': '?x0'}

 Q: what is the {start time} for {Santa Fe} has {twinned administrative body} as {Junta de Villalba de Losa} ?
 SPARQL: SELECT ?value WHERE { wd:Q44244 p:P190 ?s . ?s ps:P190 wd:Q1643574 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Santa Fe', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Junta de Villalba de Losa'}}}

 Q: Which is the home world of Neptune?
 SPARQL: select distinct ?answer where { ?answer wdt:P1165 wd:Q332}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'home world', 'o': 'Neptune'}

 Q: Is it true that the points awarded of the 2018 AFL Women's season equals to 2?
 SPARQL: ASK WHERE { wd:Q48523108 wdt:P3260 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "2018 AFL Women's season", 'p': 'points awarded', 'o': '?x0', '?x0': '2'}

 Q: What was the population of Gelsenkirchen on 12-31-2016?
 SPARQL: SELECT ?obj WHERE { wd:Q2765 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gelsenkirchen', 'p': 'population', 'o': '?x0', 't': '2016'}

 Q: What is {spouse} of {Gary Gygax} that is {end time} is {1980-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q25550430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gary Gygax', 'p': 'spouse', 'o': '?x0', 't': '1980'}

 Q: Which academic field for the history of the United States divides into the state of Michigan?
 SPARQL: SELECT ?answer WHERE { wd:Q131110 wdt:P2578 ?answer . ?answer wdt:P150 wd:Q1166}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of the United States', 'p': 'academic field for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divides into', 'o': 'Michigan'}}

 Q: What is the {profession} for {used by} of {brick}
 SPARQL:  select distinct ?obj where { wd:Q40089 wdt:P1535 ?obj . ?obj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'brick', 'p': 'used by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: What is {together with} and {prize money} of {{Guglielmo Marconi} has {award received} as {Nobel Prize in Physics}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36488 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P1706 ?value1 . ?s pq:P2121 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guglielmo Marconi', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Physics'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'money', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guglielmo Marconi', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Physics'}}}]

 Q: Which is {surface area} of {agent} of {French invasion of Russia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179250 wdt:P710 ?X . ?X wdt:P2046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'French invasion of Russia', 'p': 'agent', 'o': '$y0'}}

 Q: What is the {podcast} for {presenter} of {John Oliver}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q1701254 . ?sbj wdt:P31 wd:Q24634210 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'John Oliver', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'podcast'}}

 Q: Which war cemetery has the least memorial based burials?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1707610 . ?ent wdt:P2324 ?obj . ?ent wdt:P31 wd:Q5003624} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'burials', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'war cemetery', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'memorial'}}}

 Q: What is the population of Richmond at 2011-7-1?
 SPARQL: SELECT ?obj WHERE { wd:Q43421 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Richmond', 'p': 'population', 'o': '?x0', 't': '2011'}

 Q: What is {name after} of {Bohr model}, that has {award} is {Nobel Prize in Physics} ?
 SPARQL: SELECT ?answer WHERE { wd:Q172948 wdt:P138 ?answer . ?answer wdt:P166 wd:Q38104}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bohr model', 'p': 'name after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'award', 'o': 'Nobel Prize in Physics'}}

 Q: What encryption software is used by author Julian Assange?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q360 . ?sbj wdt:P31 wd:Q5375622 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Julian Assange', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'encryption software'}}

 Q: Josip Broz Tito is the head of government for what historical country?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q9161 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Josip Broz Tito', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: what is the {point in time} for {The Bold and the Beautiful} has {award received} as {International TV Audience Award for Best Telenovela/Soap Opera} ?
 SPARQL: SELECT ?value WHERE { wd:Q82729 p:P166 ?s . ?s ps:P166 wd:Q23011213 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'The Bold and the Beautiful', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'International TV Audience Award for Best Telenovela/Soap Opera'}, 't': '?x0'}

 Q: What is the great power with maximum exports?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q185145 . ?ent wdt:P2135 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'exports', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'great power'}}

 Q: What is the {history of a city} for {history of topic} of {Montevideo}
 SPARQL:  select distinct ?obj where { wd:Q1335 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q28747937 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Montevideo', 'p': 'history of topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'history of a city'}}

 Q: what is the {country} for {Niccolò Machiavelli} has {place of death} as {Sant'Andrea in Percussina} ?
 SPARQL: SELECT ?value WHERE { wd:Q1399 p:P20 ?s . ?s ps:P20 wd:Q2509922 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Niccolò Machiavelli', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': "Sant'Andrea in Percussina"}}}

 Q: Which are the overlies for basement?
 SPARQL: select distinct ?answer where { ?answer wdt:P568 wd:Q2143968}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'overlies', 'o': 'basement'}

 Q: Give me {eonothem} that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2669627 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'eonothem'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: what is the {temperature} for {2,4,6-trinitrotoluene} which has {density} as {1.65} ?
 SPARQL: SELECT ?value WHERE { wd:Q170167 p:P2054 ?s . ?s ps:P2054 ?x filter(contains(?x,'1.65')) . ?s pq:P2076 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'temperature', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2,4,6-trinitrotoluene', 'p': 'density', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'density', 'o': '1.65'}}}

 Q: What is the {human} for {stepparent} of {John Stuart Mill}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3448 wd:Q50020 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stepparent', 'o': 'John Stuart Mill', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {natural product of taxon} are to/by {Cucumis sativus} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1582 wd:Q23425 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'natural product of taxon', 'o': 'Cucumis sativus'}

 Q: What is the galaxy with the lowest redshift whose constellation is Boötes?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1090 ?obj . ?ent wdt:P59 wd:Q8667} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'redshift', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'galaxy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Boötes'}}}

 Q: Which is Gmelin number for sulfate ion?
 SPARQL: select distinct ?answer where { wd:Q172290 wdt:P1578 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'sulfate ion', 'p': 'Gmelin number', 'o': '?x0'}

 Q: Is the beam of the Etchells equal to 2.1?
 SPARQL: ASK WHERE { wd:Q930962 wdt:P2261 ?obj filter(?obj = 2.1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Etchells', 'p': 'beam', 'o': '?x0', '?x0': '2.1'}

 Q: What is {equivalent of} of {Thoth}, that has {daughter} is {Norax} ?
 SPARQL: SELECT ?answer WHERE { wd:Q146921 wdt:P460 ?answer . ?answer wdt:P40 wd:Q2661436}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thoth', 'p': 'equivalent of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'daughter', 'o': 'Norax'}}

 Q: Give me {space probe} that contains the word {voyager} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'voyager')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space probe'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'voyager'}}

 Q: which is interaction of academic field for nuclear physics?
 SPARQL: SELECT ?answer WHERE { wd:Q81197 wdt:P2578 ?X . ?X wdt:P517 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'interaction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'nuclear physics', 'p': 'academic field for', 'o': '$y0'}}

 Q: What is the {position} for {office held by head of state} of {Empire of Japan}
 SPARQL:  select distinct ?obj where { wd:Q188712 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire of Japan', 'p': 'office held by head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is the {historical country} for {capital} of {Belgrade}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P36 wd:Q3711 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Belgrade', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Does the Mariana Trench have an elevation above sea level that is less than -13192.8?
 SPARQL: ASK WHERE { wd:Q510 wdt:P2044 ?obj filter(?obj < -13192.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Mariana Trench', 'p': 'elevation above sea level', 'o': '?x0', '?x0': '-13192.8'}

 Q: Where is Pat Sajak's birthplace in the province of Cook County?
 SPARQL: SELECT ?answer WHERE { wd:Q705419 wdt:P19 ?answer . ?answer wdt:P131 wd:Q108418}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pat Sajak', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Cook County'}}

 Q: Does the AKROLOY PARA ICF 40 flexual modulus equal to 35000?
 SPARQL: ASK WHERE { wd:Q57273218 wdt:P5681 ?obj filter(?obj = 35000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'AKROLOY PARA ICF 40', 'p': 'flexural modulus', 'o': '?x0', '?x0': '35000'}

 Q: What are  the archipelago  which start with the letter I
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33837 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'î')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archipelago'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'î'}}

 Q: Which are the coordinates of easternmost point of Estonia?
 SPARQL: select distinct ?answer where { wd:Q191 wdt:P1334 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Estonia', 'p': 'coordinates of easternmost point', 'o': '?x0'}

 Q: What award did Sidney Lumet win in 2009?
 SPARQL: SELECT ?obj WHERE { wd:Q51559 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sidney Lumet', 'p': 'award', 'o': '?x0', 't': '2009'}

 Q: What is {place of burial} of {Alfred Nobel} that is {burial plot reference} is {Kvarter 04A, gravnummer 170} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23810 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P965 ?x filter(contains(?x,'Kvarter 04A, gravnummer 170')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alfred Nobel', 'p': 'place of burial', 'o': '?x0'}

 Q: What is <Medium username> of <Roxane Gay> ?
 SPARQL: select distinct ?answer where { wd:Q16202911 wdt:P3899 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Roxane Gay', 'p': 'Medium username', 'o': '?x0'}

 Q: What is the {academia} for {language regulatory body} of {Esperanto}
 SPARQL:  select distinct ?obj where { wd:Q143 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q1211427 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'language regulatory body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academia'}}

 Q: What is {characters} of {series} of {Black Sails, season 2} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21185947 wdt:P179 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Black Sails, season 2', 'p': 'series', 'o': '$y0'}}

 Q: What spacecraft has the longest orbital period?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q40218 . ?ent wdt:P2146 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'orbital period', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spacecraft'}}

 Q: What engine family has the highest compression ratio?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15057020 . ?ent wdt:P1247 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'compression ratio', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'engine family'}}

 Q: What is {bottom line} of {manufactured by} of {Xbox} ?
 SPARQL: SELECT ?answer WHERE { wd:Q132020 wdt:P176 ?X . ?X wdt:P2295 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bottom line', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Xbox', 'p': 'manufactured by', 'o': '$y0'}}

 Q: What is the {twin city} of {New York City}, that is also the {birth place} of {Judit Polgar}?
 SPARQL: SELECT ?answer WHERE { wd:Q183250 wdt:P19 ?answer . ?answer wdt:P190 wd:Q60}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Judit Polgar', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'New York City'}}

 Q: What is the noble title of Charles the Fat and follows.
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0'}}]

 Q: what is the {statement supported by} for {Autonomous Republic of Crimea} has {head of government} as {Sergey Aksyonov} ?
 SPARQL: SELECT ?value WHERE { wd:Q756294 p:P6 ?s . ?s ps:P6 wd:Q15838823 . ?s pq:P3680 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement supported by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Autonomous Republic of Crimea', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Sergey Aksyonov'}}}

 Q: Which stockholder has a label of Wanda Jackson?
 SPARQL: SELECT ?answer WHERE { wd:Q235223 wdt:P264 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stockholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wanda Jackson', 'p': 'label', 'o': '$y0'}}

 Q: Was epilepsy health specialty psychology and psychiatry?
 SPARQL: ASK WHERE { wd:Q41571 wdt:P1995 wd:Q9418 . wd:Q41571 wdt:P1995 wd:Q7867 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'epilepsy', 'p': 'health specialty', 'o': '?x0', '?x0': 'psychology'}, {'h': 'IS', 'v': '?x1', 's': 'epilepsy', 'p': 'health specialty', 'o': '?x1', '?x1': 'psychiatry'}]

 Q: What is composed by Thaïs? Who is the child of Alexis Massenet?
 SPARQL: SELECT ?answer WHERE { wd:Q1144467 wdt:P86 ?answer . ?answer wdt:P22 wd:Q20895527}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thaïs', 'p': 'composed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child of', 'o': 'Alexis Massenet'}}

 Q: Which is the theatrical genre that starts with the letter z?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15850590 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theatrical genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

