 Q: What is the {dialect} for {dialect of} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4913 wd:Q5287 . ?sbj wdt:P31 wd:Q33384 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dialect of', 'o': 'Japanese', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect'}}

 Q: What is <MetroLyrics ID> of <The Internationale> ?
 SPARQL: select distinct ?answer where { wd:Q49617 wdt:P2624 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Internationale', 'p': 'MetroLyrics ID', 'o': '?x0'}

 Q: What item, that is made by DC-10, would have a wound up on date of 1997-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q208075 wdt:P176 ?answer . ?answer wdt:P576 ?x FILTER(contains(YEAR(?x),'1997'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'DC-10', 'p': 'made by', 'o': '?x0', 't': '1997'}

 Q: What is <has attribute> of <Mark the Evangelist> ?
 SPARQL: select distinct ?answer where { wd:Q31966 wdt:P4185 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mark the Evangelist', 'p': 'has attribute', 'o': '?x0'}

 Q: What is the {service on internet by PWN} with the {MAX(number of records)} whose {instance of} is {service on internet by PWN}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q55387247 . ?ent wdt:P4876 ?obj . ?ent wdt:P31 wd:Q55387247 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of records', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'service on internet by PWN'}}

 Q: What is Theatricalia person ID of Paul Scofield ?
 SPARQL: select distinct ?answer where { wd:Q223988 wdt:P2469 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paul Scofield', 'p': 'Theatricalia person ID', 'o': '?x0'}

 Q: Which  is public holiday for Eid al-Adha ?
 SPARQL: select distinct ?answer where { ?answer wdt:P832 wd:Q514400}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'public holiday', 'o': 'Eid al-Adha'}

 Q: What is the {atmosphere} for {studied by} of {meteorology}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2579 wd:Q25261 . ?sbj wdt:P31 wd:Q8104 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'meteorology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'atmosphere'}}

 Q: Which drug is used for treatment of multiple sclerosis?
 SPARQL: select distinct ?answer where { wd:Q8277 wdt:P2176 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'multiple sclerosis', 'p': 'used for treatment', 'o': '?x0'}

 Q: What are the road bridge which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road bridge'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {tributary} of {Ussuri River} that is {direction} is {right} ?
 SPARQL: SELECT ?obj WHERE { wd:Q207777 p:P974 ?s . ?s ps:P974 ?obj . ?s pq:P560 wd:Q14565199 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ussuri River', 'p': 'tributary', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'direction', 'o': 'right'}}}

 Q: What is <has anatomical branch> of <bronchus> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3262 wd:Q181602}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has anatomical branch', 'o': 'bronchus'}

 Q: What is {disease} of {son of} of {Daniel Wayne Smith} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2566243 wdt:P25 ?X . ?X wdt:P1050 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disease', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Daniel Wayne Smith', 'p': 'son of', 'o': '$y0'}}

 Q: What is the attendee that participated in Belarus in the Eurovision Song Contest 2004?
 SPARQL: SELECT ?answer WHERE { wd:Q1899987 wdt:P1344 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'attendee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belarus in the Eurovision Song Contest 2004', 'p': 'participated in', 'o': '$y0'}}

 Q: What is the binding energy or carbon-14?
 SPARQL: select distinct ?answer where { wd:Q840660 wdt:P2154 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'carbon-14', 'p': 'binding energy', 'o': '?x0'}

 Q: What is {human population} of {location of narrative} of {White Teeth} ?
 SPARQL: SELECT ?answer WHERE { wd:Q866980 wdt:P840 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'White Teeth', 'p': 'location of narrative', 'o': '$y0'}}

 Q: What areas are located in the administrative territorial entity and are located in the time zone of The Bronx?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q18426 wdt:P131 ?ans_1 . wd:Q18426 wdt:P421 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Bronx', 'p': 'located in the administrative territorial entity', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Bronx', 'p': 'time zone', 'o': '?x1'}]

 Q: Give me {declaration of independence} that {signatory} {James Wilson} and which that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1464916 . ?sbj wdt:P1891 wd:Q365181 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'declaration of independence', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'signatory', 'o': 'James Wilson'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Oscar Niemeyer died in Rio de Janeiro, which is located in what country?
 SPARQL: SELECT ?value WHERE { wd:Q134165 p:P20 ?s . ?s ps:P20 wd:Q8678 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oscar Niemeyer', 'p': 'died in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'died in', 'o': 'Rio de Janeiro'}}}

 Q: Is Jimmy Page's instrument the Fender Telecaster electric guitar?
 SPARQL: ASK WHERE { wd:Q165467 wdt:P1303 wd:Q78987 . wd:Q165467 wdt:P1303 wd:Q623103 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jimmy Page', 'p': 'instrument', 'o': '?x0', '?x0': 'electric guitar'}, {'h': 'IS', 'v': '?x1', 's': 'Jimmy Page', 'p': 'instrument', 'o': '?x1', '?x1': 'Fender Telecaster'}]

 Q: What is {member of} of {John William Strutt, 3rd Baron Rayleigh}, that has {preceeds} is {Berlin-Brandenburg Academy of Sciences and Humanities} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83297 wdt:P463 ?answer . ?answer wdt:P156 wd:Q219989}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John William Strutt, 3rd Baron Rayleigh', 'p': 'member of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'preceeds', 'o': 'Berlin-Brandenburg Academy of Sciences and Humanities'}}

 Q: What was the position held by Louis Philippe I, later replaced by Casimir-Louis-Victurnien de Rochechouart de Mortemart?
 SPARQL: SELECT ?obj WHERE { wd:Q7771 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q2756699 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis Philippe I', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced', 'o': 'Casimir-Louis-Victurnien de Rochechouart de Mortemart'}}}

 Q: Is the spin quantum number of samarium-144 equal to 0?
 SPARQL: ASK WHERE { wd:Q1862339 wdt:P1122 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'samarium-144', 'p': 'spin quantum number', 'o': '?x0', '?x0': '0'}

 Q: Where was the royal house of life partner of Stephen Tennant?
 SPARQL: SELECT ?answer WHERE { wd:Q7610665 wdt:P451 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'house', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stephen Tennant', 'p': 'partner', 'o': '$y0'}}

 Q: What are the resource which start with the letter N
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1554231 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'resource'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is the {next job holder} in {West Germany} that is a {member of} an {Asian Development Bank}?
 SPARQL: SELECT ?answer WHERE { wd:Q713750 wdt:P1366 ?answer . ?answer wdt:P463 wd:Q188822}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'West Germany', 'p': 'next job holder', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Asian Development Bank'}}

 Q: Which is the British Council writer ID of Salman Rushdie?
 SPARQL: select distinct ?answer where { wd:Q44306 wdt:P5364 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman Rushdie', 'p': 'British Council writer ID', 'o': '?x0'}

 Q: When Michael Ellis DeBakey was awarded as Lomonosov Gold Medal?
 SPARQL: SELECT ?value WHERE { wd:Q335003 p:P166 ?s . ?s ps:P166 wd:Q1340199 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Michael Ellis DeBakey', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Lomonosov Gold Medal'}, 't': '?x0'}

 Q: What is <Nationalmuseum Sweden artist ID> of <Jean Arp> ?
 SPARQL: select distinct ?answer where { wd:Q153739 wdt:P2538 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean Arp', 'p': 'Nationalmuseum Sweden artist ID', 'o': '?x0'}

 Q: what is the {end time} for {Zeno} has {position held} as {Byzantine emperor} ?
 SPARQL: SELECT ?value WHERE { wd:Q183452 p:P39 ?s . ?s ps:P39 wd:Q18577504 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zeno', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Byzantine emperor'}}}

 Q: The Dreamers' was originally written in the language of what state?
 SPARQL: SELECT ?answer WHERE { wd:Q822946 wdt:P364 ?X . ?X wdt:P17 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'state', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Dreamers', 'p': 'language', 'o': '$y0'}}

 Q: What painting depicts Barack Obama
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P180 wd:Q76 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'Barack Obama', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: Which aircraft family has the highest glide ratio?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056993 . ?ent wdt:P1470 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum glide ratio', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: What is {school attended} of {Mohammad Mosaddegh}, that has {category for employees of the organization} is {Category:University of Paris faculty} ?
 SPARQL: SELECT ?answer WHERE { wd:Q123037 wdt:P69 ?answer . ?answer wdt:P4195 wd:Q7997009}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mohammad Mosaddegh', 'p': 'school attended', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'category for employees of the organization', 'o': 'Category:University of Paris faculty'}}

 Q: What is the ortholog of AVP?
 SPARQL: select distinct ?answer where { ?answer wdt:P684 wd:Q12009087}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'ortholog', 'o': 'AVP'}

 Q: Is it true that the unemployment rate of south africa is less than 32.64?
 SPARQL: ASK WHERE { wd:Q258 wdt:P1198 ?obj filter(?obj < 32.64) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'South Africa', 'p': 'unemployment rate', 'o': '?x0', '?x0': '32.64'}

 Q: Which is the Songfacts artist ID of Lou Reed?
 SPARQL: select distinct ?answer where { wd:Q189080 wdt:P5287 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lou Reed', 'p': 'Songfacts artist ID', 'o': '?x0'}

 Q: How many connecting lines are there for the Channel Tunnel?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q10257 wdt:P81 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Channel Tunnel', 'p': 'connecting line', 'o': '?x0'}

 Q: Give me {language} that {linguistic typology} {Zero-marking language} and which that starts with {'i'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj wdt:P4132 wd:Q17141330 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'linguistic typology', 'o': 'Zero-marking language'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: Give me the countable set with the lower limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q185478 . ?ent wdt:P5447 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'lower limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'countable set'}}

 Q: Is Etruschi the city of culture?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2596 wd:Q17161 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'culture', 'o': 'Etruschi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: Is the heart rate of Cavia porcellus greater than 300?
 SPARQL: ASK WHERE { wd:Q79803 wdt:P3395 ?obj filter(?obj > 300.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Cavia porcellus', 'p': 'heart rate', 'o': '?x0', '?x0': '300.0'}

 Q: Which is the icon for Cascading Style Sheets?
 SPARQL: select distinct ?answer where { wd:Q46441 wdt:P2910 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cascading Style Sheets', 'p': 'icon', 'o': '?x0'}

 Q: Was Thomas Edison a citizen of the United States of America?
 SPARQL: ASK WHERE { wd:Q8743 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Thomas Edison', 'p': 'citizen of', 'o': '?x0', '?x0': 'United States of America'}]

 Q: What is {preceded by} of {Big East Conference (2013-)}, that has {chairwoman} is {Michael Aresco} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7820700 wdt:P1365 ?answer . ?answer wdt:P488 wd:Q16150145}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Big East Conference', 'p': 'preceded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'chairwoman', 'o': 'Michael Aresco'}}

 Q: What is the {human} for {child} of {Walter Raleigh}
 SPARQL:  select distinct ?obj where { wd:Q189144 wdt:P40 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Walter Raleigh', 'p': 'child', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many allegiance to the Empire of Japan?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P945 wd:Q188712 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'allegiance', 'o': 'Empire of Japan'}

 Q: Tell me me a Norse deity whose name consist of the word "tyr" and whose worshipped by Norse mythology
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj wdt:P1049 wd:Q128285 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tyr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Norse deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': 'Norse mythology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tyr'}}

 Q: What is the {political party} for {affiliation} of {Mauricio Macri}
 SPARQL:  select distinct ?obj where { wd:Q561837 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mauricio Macri', 'p': 'affiliation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'party'}}

 Q: What was the logo for Airbus in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q67 p:P154 ?s . ?s ps:P154 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Airbus', 'p': 'logo', 'o': '?x0', 't': '2014'}

 Q: What is the {theatre} for {language used} of {Russian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q7737 . ?sbj wdt:P31 wd:Q24354 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Russian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theater'}}

 Q: How many time period are Carboniferous?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2348 wd:Q133738 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'Carboniferous'}

 Q: Did {U2} {award received} {Artist of the Year} and {Bill Shipsey} ?
 SPARQL: ASK WHERE { wd:Q396 wdt:P166 wd:Q19858055 . wd:Q396 wdt:P166 wd:Q4910860 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'U2', 'p': 'award received', 'o': '?x0', '?x0': 'Artist of the Year'}, {'h': 'IS', 'v': '?x1', 's': 'U2', 'p': 'award received', 'o': '?x1', '?x1': 'Bill Shipsey'}]

 Q: what is the {stated as} for {Proceedings of the National Academy of Sciences of the United States of America} has {author} as {National Academy of Sciences} ?
 SPARQL: SELECT ?value WHERE { wd:Q1146531 p:P50 ?s . ?s ps:P50 wd:Q270794 . ?s pq:P1932 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stated as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Proceedings of the National Academy of Sciences of the United States of America', 'p': 'author', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'author', 'o': 'National Academy of Sciences'}}}

 Q: What is {population} of {Tours} that is {point in time} is {2013-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q288 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tours', 'p': 'population', 'o': '?x0', 't': '2013'}

 Q: What is {tributary} of {portrait of} of {Barge Haulers on the Volga} ?
 SPARQL: SELECT ?answer WHERE { wd:Q175628 wdt:P180 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barge Haulers on the Volga', 'p': 'portrait of', 'o': '$y0'}}

 Q: At what point in time did the Red Sea Governorate have a population of 288,661?
 SPARQL: SELECT ?value WHERE { wd:Q30831 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'288661.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Red Sea Governorate', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '288661.0'}, 't': '?x0'}

 Q: What what is high speed train track gauge BY 1435 mm track gauge that starts with LETTERS V
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13402959 . ?sbj wdt:P1064 wd:Q1999572 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'high speed train', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'track gauge', 'o': '1435 mm track gauge'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {academic major} and {academic degree} of {{Indra Nooyi} has {educated at} as {Yale School of Management}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q264913 p:P69 ?s . ?s ps:P69 wd:Q8047426 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Indra Nooyi', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Yale School of Management'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Indra Nooyi', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Yale School of Management'}}}]

 Q: Does the 9820 Hempel have an orbital inclination greater than 0.21512?
 SPARQL: ASK WHERE { wd:Q538466 wdt:P2045 ?obj filter(?obj > 0.21512) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '9820 Hempel', 'p': 'orbital inclination', 'o': '?x0', '?x0': '0.21512'}

 Q: Which is the democratic republic that applies to jurisdiction of U.S. Declaration of Independence?
 SPARQL:  select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q5255892 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Declaration of Independence', 'p': 'applies to jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'democratic republic'}}

 Q: what is the {point in time} for {Friedrich Bessel} has {award received} as {Gold Medal of the Royal Astronomical Society} ?
 SPARQL: SELECT ?value WHERE { wd:Q75845 p:P166 ?s . ?s ps:P166 wd:Q753072 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Friedrich Bessel', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Gold Medal of the Royal Astronomical Society'}, 't': '?x0'}

 Q: Are there more than 14.4 employees at Overflow?
 SPARQL: ASK WHERE { wd:Q1191932 wdt:P1128 ?obj filter(?obj > 14.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '0verflow', 'p': 'employees', 'o': '?x0', '?x0': '14.4'}

 Q: Mention the person responsible for heading the chairperson-ship of Social Democratic Party of Germany
 SPARQL:  select distinct ?obj where { wd:Q49768 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Social Democratic Party of Germany', 'p': 'chairperson', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {founders} of {parent agency} of {Jio} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18643672 wdt:P749 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founders', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jio', 'p': 'parent agency', 'o': '$y0'}}

 Q: What is {position held} of {Jean-Antoine-Nicolas de Caritat de Condorcet} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q201477 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-Antoine-Nicolas de Caritat de Condorcet', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-Antoine-Nicolas de Caritat de Condorcet', 'p': 'position held', 'o': '$y0'}}]

 Q: What is <SCAR Composite Gazetteer place ID> of <West Antarctica> ?
 SPARQL: select distinct ?answer where { wd:Q530917 wdt:P3230 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'West Antarctica', 'p': 'SCAR Composite Gazetteer place ID', 'o': '?x0'}

 Q: How many {original language of work} are to/by {Malagasy} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P364 wd:Q7930 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'original language', 'o': 'Malagasy'}

 Q: What was amended by the Treaty of Lisbon?
 SPARQL: select distinct ?answer where { ?answer wdt:P2567 wd:Q52843}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'amended by', 'o': 'Treaty of Lisbon'}

 Q: When did studio album for language of work or name of English?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q208569 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'studio album'}}

 Q: What is {girlfriend} of {music by} of {The Globalist} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26964671 wdt:P86 ?X . ?X wdt:P451 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'girlfriend', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Globalist', 'p': 'music by', 'o': '$y0'}}

 Q: What is Robert Mugabe's religion and citizenship?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q10707 wdt:P140 ?ans_1 . wd:Q10707 wdt:P27 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Robert Mugabe', 'p': 'religion', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Robert Mugabe', 'p': 'citizenship', 'o': '?x1'}]

 Q: What is {holds position} of {position holder} of {Emir of Afghanistan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17323614 wdt:P1308 ?X . ?X wdt:P39 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'holds position', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emir of Afghanistan', 'p': 'position holder', 'o': '$y0'}}

 Q: "Who is {developer} of {quicksort}, which has {doctoral student} is {Augusto Sampaio} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q486598 wdt:P61 ?answer . ?answer wdt:P185 wd:Q16466596}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'quicksort', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'doctoral student', 'o': 'Augusto Sampaio'}}

 Q: What is the ranking of Russia at the FIFA World Cup?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7381959 . ?ent wdt:P1352 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ranking', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Russia at the FIFA World Cup'}}

 Q: Did {Pi} {named by} {William Jones}?
 SPARQL: ASK WHERE { wd:Q167 wdt:P3938 wd:Q371877 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Pi', 'p': 'named by', 'o': '?x0', '?x0': 'William Jones'}]

 Q: Which means{victory} at the {Wimbledon Championships} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2522 wd:Q41520}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'victory', 'o': 'Wimbledon Championships'}

 Q: Who is the {pharmaceutical product} for {has active ingredient} of {hydrogen peroxide}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3781 wd:Q171877 . ?sbj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has active ingredient', 'o': 'hydrogen peroxide', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: What is the {human spaceflight} for {astronaut mission} of {Yuri Gagarin}
 SPARQL:  select distinct ?obj where { wd:Q7327 wdt:P450 ?obj . ?obj wdt:P31 wd:Q752783 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yuri Gagarin', 'p': 'astronaut mission', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human spaceflight'}}

 Q: What is the {country} for {participant} of {Cuban Missile Crisis}
 SPARQL:  select distinct ?obj where { wd:Q128160 wdt:P710 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cuban Missile Crisis', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'countries'}}

 Q: What is the consumer price index inflation rate that comes from of Zeno's Conscience?
 SPARQL: SELECT ?answer WHERE { wd:Q2630581 wdt:P495 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Zeno's Conscience", 'p': 'comes from', 'o': '$y0'}}

 Q: What is {series} of {Nanda Empire} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q949268 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nanda Empire', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nanda Empire', 'p': 'series', 'o': '$y0'}}]

 Q: The story Hamilton, based on Alexander Hamilton, was written by what author?
 SPARQL: SELECT ?value WHERE { wd:Q19320959 p:P144 ?s . ?s ps:P144 wd:Q54016147 . ?s pq:P50 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'author', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hamilton', 'p': 'based on', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'based on', 'o': 'Alexander Hamilton'}}}

 Q: How many judges are by Ruth Bader Ginsburg?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1594 wd:Q11116 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'judge', 'o': 'Ruth Bader Ginsburg'}

 Q: What is the {human} for {sex or gender} of {eunuch}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P21 wd:Q179294 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'gender', 'o': 'eunuch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {mixture} for {active ingredient in} of {amphetamine}
 SPARQL:  select distinct ?obj where { wd:Q179452 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q169336 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'amphetamine', 'p': 'active ingredient in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mixture'}}

 Q: What is {cast member} of {Halloween} that is {character role} is {Michael Myers} ?
 SPARQL: SELECT ?obj WHERE { wd:Q221103 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q1426891 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cast member', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Halloween', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'plays', 'o': 'Michael Myers'}}}

 Q: What is the physical phenomenon measured by inertial mass that tsarts with letter I
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj wdt:P1880 wd:Q843816 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical phenomenon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'inertial mass'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: What is the diplomatic relation of Denmark, that has a total fertility rate of 4.481?
 SPARQL: SELECT ?answer WHERE { wd:Q35 wdt:P530 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'4.481'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Denmark', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '4.481'}}

 Q: What is {subject in} of {inverse} of {functional programming} ?
 SPARQL: SELECT ?answer WHERE { wd:Q193076 wdt:P461 ?X . ?X wdt:P1269 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'functional programming', 'p': 'inverse', 'o': '$y0'}}

 Q: What is the {logographic writing system} for {facet of} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1269 wd:Q5287 . ?sbj wdt:P31 wd:Q3953107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Japanese', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'logographic writing system'}}

 Q: Who gave the{co-founder} of {software publisher} of {The Fall of Kelvin Walker: A Fable of the Sixties} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7733205 wdt:P123 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'co-founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Fall of Kelvin Walker: A Fable of the Sixties', 'p': 'publisher', 'o': '$y0'}}

