 Q: What is the sex of the biological sibling of Frederick William III of Prussia?
 SPARQL: SELECT ?answer WHERE { wd:Q37134 wdt:P3373 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frederick William III of Prussia', 'p': 'sibling', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sex', 'o': 'm'}}

 Q: What is the {national association football team} for {member of sports team} of {Lionel Messi}
 SPARQL:  select distinct ?obj where { wd:Q615 wdt:P54 ?obj . ?obj wdt:P31 wd:Q6979593 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lionel Messi', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national association football team'}}

 Q: Who is a member of the crew of Enola Gay?
 SPARQL: select distinct ?answer where { ?answer wdt:P5096 wd:Q204424}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'member of the crew of', 'o': 'Enola Gay'}

 Q: Tell me military offensive whose name has the word operation in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001676 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'operation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military offensive'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'operation'}}

 Q: For what railway stations is Isambard Kingdom Brunel the architect?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q207380 . ?sbj wdt:P31 wd:Q55488 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Isambard Kingdom Brunel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway station'}}

 Q: Tell me me a musical  whose name consist of the word "woods" and whose lyrics by Stephen Sondheim
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj wdt:P676 wd:Q153579 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'woods')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'lyrics by', 'o': 'Stephen Sondheim'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'woods'}}

 Q: Who were the participants of the Attack on Pearl Harbor and what effect as the end result of the attack?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q52418 wdt:P710 ?ans_1 . wd:Q52418 wdt:P1542 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Attack on Pearl Harbor', 'p': 'participant', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Attack on Pearl Harbor', 'p': 'effect', 'o': '?x1'}]

 Q: What is the determination method for a substance dependence that has the genetic association of PLEKHG1?
 SPARQL: SELECT ?value WHERE { wd:Q182413 p:P2293 ?s . ?s ps:P2293 wd:Q18043072 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'substance dependence', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'PLEKHG1'}}}

 Q: Which is the surface tension of ethyl acetate?
 SPARQL: select distinct ?answer where { wd:Q407153 wdt:P3013 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethyl acetate', 'p': 'surface tension', 'o': '?x0'}

 Q: Which landlocked country has the highest GDP PPP?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q123480 . ?ent wdt:P4010 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'GDP PPP', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landlocked country'}}

 Q: What is the {fictional bird} for {present in work} of {Looney Tunes}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q622435 . ?sbj wdt:P31 wd:Q15832079 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Looney Tunes', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional bird'}}

 Q: What is {position held} of {Umar ibn Al-Khattāb} that is {start time} is {634-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8467 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(?x,'634-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Umar', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'starting', 'o': '634-0-0'}}}

 Q: What's the official language for Patna?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q80484 wdt:P37 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Patna', 'p': 'official language', 'o': '?x0'}

 Q: Who is the person in the significant event of the dissolution of the Soviet Union?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q5167679 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'dissolution of the Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is <mandates> of <human rights> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4424 wd:Q8458}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'mandates', 'o': 'human rights'}

 Q: What award did Sylvia Chang receive in 1986?
 SPARQL: SELECT ?obj WHERE { wd:Q292693 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1986')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sylvia Chang', 'p': 'award', 'o': '?x0', 't': '1986'}

 Q: What is the {sport in a geographic region} with the {MAX(number of clubs)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4999 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of clubs', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport in a geographic region'}}

 Q: What city in Bilbao has a twinned administrative body?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q8692 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Bilbao', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is {physically interacts with} of {glycine}, that has {subcellular localization} is {integral component of membrane} ?
 SPARQL: SELECT ?answer WHERE { wd:Q620730 wdt:P129 ?answer . ?answer wdt:P681 wd:Q14327652}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'glycine', 'p': 'physically interacts with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subcellular localization', 'o': 'integral component of membrane'}}

 Q: what is the {operating system} for {macOS} has {platform} as {PowerPC} ?
 SPARQL: SELECT ?value WHERE { wd:Q14116 p:P400 ?s . ?s ps:P400 wd:Q209860 . ?s pq:P306 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operating system', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'macOS', 'p': 'platform', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'platform', 'o': 'PowerPC'}}}

 Q: What is the indirect cause of the predecessor of street sweepers, janitors, and professionals who take care of buildings such as hospitals and schools?
 SPARQL: SELECT ?answer WHERE { wd:Q17309512 wdt:P1479 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'predecessor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'street sweeper', 'p': 'indirect cause', 'o': '$y0'}}

 Q: What is {name after} of {Dijkstra's algorithm}, that has {career} is {mathematician} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8548 wdt:P138 ?answer . ?answer wdt:P106 wd:Q170790}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Dijkstra's algorithm", 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'mathematician'}}

 Q: Does the dolabriferol C have a specific rotation equal to -36.16?
 SPARQL: ASK WHERE { wd:Q57394391 wdt:P6272 ?obj filter(?obj = -36.16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'dolabriferol C', 'p': 'specific rotation', 'o': '?x0', '?x0': '-36.16'}

 Q: When did Coventry have a population of 316900?
 SPARQL: SELECT ?value WHERE { wd:Q6225 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'316900.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Coventry', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '316900.0'}, 't': '?x0'}

 Q: Tell me the name of solstice which starts with "s"
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123524 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'solstice'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Tell me water deity whose name has the word yinglong in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1916821 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yinglong')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'water deity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yinglong'}}

 Q: What is Clochers de France ID of Notre Dame de Paris ?
 SPARQL: select distinct ?answer where { wd:Q2981 wdt:P3963 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Notre Dame', 'p': 'Clochers de France ID', 'o': '?x0'}

 Q: Give me {comics publishing company} that {replaces} {All-American Publications} and which contains the word {comics} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114515 . ?sbj wdt:P1365 wd:Q3611907 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'comics')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comics publishing company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'replaces', 'o': 'All-American Publications'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'comics'}}

 Q: What is the {empire} for {cause of destruction} of {October Revolution}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P770 wd:Q42976 . ?sbj wdt:P31 wd:Q48349 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause of destruction', 'o': 'October Revolution', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire'}}

 Q: What is {location of death} of {Feng Youlan}, that has {twin city} is {Minsk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q557220 wdt:P20 ?answer . ?answer wdt:P190 wd:Q2280}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Feng Youlan', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Minsk'}}

 Q: Who was no longer the spouse of Lisa Marie Presley on 16th May 2004?
 SPARQL: SELECT ?obj WHERE { wd:Q237324 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lisa Marie Presley', 'p': 'spouse', 'o': '?x0', 't': '2004'}

 Q: What is the country of citizenship of the Kingdom of the Netherlands?
 SPARQL: select distinct ?answer where { ?answer wdt:P27 wd:Q29999}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'Kingdom of the Netherlands'}

 Q: What is {written by} of {Clarinet Concerto in A major, K. 622}, that has {birthname} is {Johannes Chrysostomus Wolfgangus Theophilus Mozart} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1056501 wdt:P86 ?answer . ?answer wdt:P1477 ?x FILTER(contains(?x,'Johannes Chrysostomus Wolfgangus Theophilus Mozart'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Clarinet Concerto in A major, K. 622', 'p': 'written by', 'o': '?x0'}

 Q: What is {county seat for} of {Bandar Seri Begawan}, that has {member of} is {Asia-Pacific Economic Cooperation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9279 wdt:P1376 ?answer . ?answer wdt:P463 wd:Q170481}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bandar', 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'APEC'}}

 Q: What is {breed} of {characters} of {Ghost Trick: Phantom Detective} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2629796 wdt:P674 ?X . ?X wdt:P4743 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'breed', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ghost Trick: Phantom Detective', 'p': 'characters', 'o': '$y0'}}

 Q: What is {position held} of {Bernie Sanders} and {electoral district}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q359442 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernie Sanders', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernie Sanders', 'p': 'position held', 'o': '$y0'}}]

 Q: What city is the county seat of Norfolk?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1376 wd:Q23109 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'county seat of', 'o': 'Norfolk', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is the written language of Jean Arp, which is originally labeled as langue française?
 SPARQL: SELECT ?answer WHERE { wd:Q153739 wdt:P1412 ?answer . ?answer wdt:P1705 ?x FILTER(contains(?x,'langue française'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jean Arp', 'p': 'language', 'o': '?x0'}

 Q: What is {software version} of {iOS} that is {platform} is {iPod touch (1st generation)} ?
 SPARQL: SELECT ?obj WHERE { wd:Q48493 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P400 wd:Q45865128 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'version', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'iOS', 'p': 'version', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'platform', 'o': 'iPod touch (1st generation)'}}}

 Q: Give me {chemical element} that {location of discovery} {United Kingdom} and which contains the word {strontium} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11344 . ?sbj wdt:P189 wd:Q145 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'strontium')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical element', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of discovery', 'o': 'UK'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'strontium'}}

 Q: What is the Kinopoisk film ID for Dragon Ball Z?
 SPARQL: select distinct ?answer where { wd:Q477916 wdt:P2603 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dragon Ball Z', 'p': 'Kinopoisk film ID', 'o': '?x0'}

 Q: Tell me which is the commune of France with specific status which contains the word èze in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'èze')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France with specific status'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'èze'}}

 Q: What is the {World Heritage criteria} and the {history of topic} of {Great_Wall_of_China} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q12501 wdt:P2614 ?ans_1 . wd:Q12501 wdt:P2184 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Great Wall of China', 'p': 'World Heritage criteria', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Great Wall of China', 'p': 'history of topic', 'o': '?x1'}]

 Q: What is the rank of the taxon parent in the Allosaurus family?
 SPARQL: SELECT ?answer WHERE { wd:Q14400 wdt:P171 ?answer . ?answer wdt:P105 wd:Q35409}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Allosaurus', 'p': 'taxon parent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'rank', 'o': 'family'}}

 Q: What Class IIIB combustible liquid has the highest vapor pressure?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009059 . ?ent wdt:P2119 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'vapor pressure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IIIB combustible liquid'}}

 Q: what is the {start time} for {Keith Holyoake} has {position held} as {Prime Minister of New Zealand} ?
 SPARQL: SELECT ?value WHERE { wd:Q637012 p:P39 ?s . ?s ps:P39 wd:Q1071117 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Keith Holyoake', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of New Zealand'}}}

 Q: What is {yearly visitors} of {venue} of {Counter-Reformation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q128168 wdt:P276 ?X . ?X wdt:P1174 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'yearly visitors', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Counter-Reformation', 'p': 'location', 'o': '$y0'}}

 Q: What is <hair color> of <Emma Stone> ?
 SPARQL: select distinct ?answer where { wd:Q147077 wdt:P1884 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Emma Stone', 'p': 'hair color', 'o': '?x0'}

 Q: Who gave the  {food plant} of {landscape of} of {Laguiole knife} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23727 wdt:P180 ?X . ?X wdt:P1034 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'food plant', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Laguiole knife', 'p': 'landscape of', 'o': '$y0'}}

 Q: What is {nominated for} of {The Shawshank Redemption} and {nominee}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q172241 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Shawshank Redemption', 'p': 'nominated for', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'nominated for', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Shawshank Redemption', 'p': 'nominated for', 'o': '$y0'}}]

 Q: Which is the minimal incubation period in humans for malaria?
 SPARQL: select distinct ?answer where { wd:Q12156 wdt:P3488 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'malaria', 'p': 'minimal incubation period in humans', 'o': '?x0'}

 Q: Which is the standard enthalpy of formation of ethane?
 SPARQL: select distinct ?answer where { wd:Q52858 wdt:P3078 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethane', 'p': 'standard enthalpy of formation', 'o': '?x0'}

 Q: What is the {Olympic sporting event} for {victory} of {Kristi Yamaguchi}
 SPARQL:  select distinct ?obj where { wd:Q237651 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q18536594 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kristi Yamaguchi', 'p': 'won', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Olympic sporting event'}}

 Q: what is the {end time} for {Adolphe Thiers} has {position held} as {head of government of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q5738 p:P39 ?s . ?s ps:P39 wd:Q15135541 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adolphe Thiers', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'head of government of France'}}}

 Q: What group had effect on Congress of Vienna?
 SPARQL:  select distinct ?obj where { wd:Q46362 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q16887380 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Congress of Vienna', 'p': 'effect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group'}}

 Q: How many were officially opened by Prince Philip, Duke of Edinburgh?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P542 wd:Q80976 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'officially opened by', 'o': 'Prince Philip, Duke of Edinburgh'}

 Q: What tributary is on lake Saint Martin?
 SPARQL: SELECT ?answer WHERE { wd:Q25596 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saint Martin', 'p': 'on lake', 'o': '$y0'}}

 Q: What is {deity of} of {slaughtered by} of {Mahishasura} ?
 SPARQL: SELECT ?answer WHERE { wd:Q663318 wdt:P157 ?X . ?X wdt:P1049 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'deity of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mahishasura', 'p': 'slaughtered by', 'o': '$y0'}}

 Q: what is the spacecraft with the lowest orbits completed whose instance of is spacecraft?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q40218 . ?ent wdt:P1418 ?obj . ?ent wdt:P31 wd:Q40218} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'orbits completed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spacecraft'}}

 Q: What is {forename} of {José de San Martín}, that has {disputed equivalence} is {Joep} ?
 SPARQL: SELECT ?answer WHERE { wd:Q134160 wdt:P735 ?answer . ?answer wdt:P460 wd:Q2188110}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'José de San Martín', 'p': 'name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'disputed equivalence', 'o': 'Joep'}}

 Q: What is the ITF wheelchair player ID for Shingo Kunieda?
 SPARQL: select distinct ?answer where { wd:Q959958 wdt:P4299 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shingo Kunieda', 'p': 'ITF wheelchair player ID', 'o': '?x0'}

 Q: What is the {enterprise} for {product or material produced} of {CBS}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q43380 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'CBS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What is {educated at} of {Vint Cerf} that is {academic major} is {mathematics} ?
 SPARQL: SELECT ?obj WHERE { wd:Q92743 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q395 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vint Cerf', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic major', 'o': 'mathematics'}}}

 Q: What is {has kid} of {Casey Affleck}, that has {religious affiliation} is {Episcopal Church} ?
 SPARQL: SELECT ?answer WHERE { wd:Q270730 wdt:P40 ?answer . ?answer wdt:P140 wd:Q682443}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Casey Affleck', 'p': 'child', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'religious affiliation', 'o': 'Episcopal Church'}}

 Q: Give me {hypothetical planet} that {parent astronomical body} {Sun} and which contains the word {vulcan} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5961279 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vulcan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hypothetical planet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Sun'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vulcan'}}

 Q: Which {number of points/goals/set scored} and {number of matches played} of {{Matt Busby} has {member of sports team} as {Liverpool F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206237 p:P54 ?s . ?s ps:P54 wd:Q1130849 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matt Busby', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Liverpool F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matt Busby', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Liverpool F.C.'}}}]

 Q: Which is the RSL editions of Esquire?
 SPARQL: select distinct ?answer where { wd:Q762195 wdt:P1973 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esquire', 'p': 'RSL editions', 'o': '?x0'}

 Q: What is {signed language} of {Peter Singer}, that has {has case} is {genitive case} ?
 SPARQL: SELECT ?answer WHERE { wd:Q211539 wdt:P1412 ?answer . ?answer wdt:P2989 wd:Q146233}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Singer', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has case', 'o': 'genitive case'}}

 Q: What is the {human} for {country of citizenship} of {Tokugawa shogunate}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P27 wd:Q205662 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'Tokugawa Shogunate', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Tell me the hypothetical planet that has Sun as a parent astronomical body and starts with the letter v?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5961279 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hypothetical planet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Sun'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: what is the {for work} for {Diane Keaton} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q102642 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diane Keaton', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Which is the voice type of death growl?
 SPARQL: select distinct ?answer where { ?answer wdt:P412 wd:Q335499}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice type', 'o': 'death growl'}

 Q: What is {renter} of {neighborhood} of {Venus de Milo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q151952 wdt:P276 ?X . ?X wdt:P466 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'renter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venus de Milo', 'p': 'location', 'o': '$y0'}}

 Q: What are the book which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q571 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What are the Catholic cathedral which start with the letter saint
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'saint')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Catholic cathedral'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'saint'}}

 Q: Which is the collage image for Boston?
 SPARQL: select distinct ?answer where { wd:Q100 wdt:P2716 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Boston', 'p': 'collage image', 'o': '?x0'}

 Q: Which is {founded by} the {subsidiary} of {Southwest_Airlines} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q503308 wdt:P112 ?ans_1 . wd:Q503308 wdt:P355 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Southwest', 'p': 'founded by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Southwest', 'p': 'subsidiary', 'o': '?x1'}]

 Q: How many presenters are for Top Gear?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q33162 wdt:P371 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Top Gear', 'p': 'presenter', 'o': '?x0'}

 Q: What is {language spoken} of {Nancy Astor, Viscountess Astor}, that has {Wikivoyage banner} is {Welcome banner.jpg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q195013 wdt:P1412 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Welcome banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nancy Astor, Viscountess Astor', 'p': 'language', 'o': '?x0'}

 Q: Are Tintin and Snowy characters from 'The Adventures of Tintin'?
 SPARQL: ASK WHERE { wd:Q744536 wdt:P674 wd:Q52986 . wd:Q744536 wdt:P674 wd:Q1640056 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Adventures of Tintin', 'p': 'characters', 'o': '?x0', '?x0': 'Tintin'}, {'h': 'IS', 'v': '?x1', 's': 'The Adventures of Tintin', 'p': 'characters', 'o': '?x1', '?x1': 'Snowy'}]

 Q: what is the {start time} for {Sebastian Coe} has {position held} as {President of the Olympic Organizing Committee} ?
 SPARQL: SELECT ?value WHERE { wd:Q188502 p:P39 ?s . ?s ps:P39 wd:Q7241353 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sebastian Coe', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the Olympic Organizing Committee'}}}

 Q: Tell me intensive quantity whose name has the word volume in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'volume')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intensive quantity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'volume'}}

 Q: What is USHMM Holocaust Encyclopedia ID of genocide?
 SPARQL: select distinct ?answer where { wd:Q41397 wdt:P3724 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'genocide', 'p': 'USHMM Holocaust Encyclopedia ID', 'o': '?x0'}

 Q: What is the constitution of the Soviet Union?
 SPARQL:  select distinct ?obj where { wd:Q15180 wdt:P457 ?obj . ?obj wdt:P31 wd:Q7755 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Soviet Union', 'p': 'constitution', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitution'}}

