 Q: What is the {written work} for {series} of {His Dark Materials trilogy}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q129240 . ?sbj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'His Dark Materials trilogy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is {unemployment rate} of {place of origin} of {The Sugarhill Gang} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1413494 wdt:P495 ?X . ?X wdt:P1198 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'unemployment rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Sugarhill Gang', 'p': 'place of origin', 'o': '$y0'}}

 Q: What is {personal name} of {William Marwood}, that has {close to} is {Guilhem} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3568818 wdt:P735 ?answer . ?answer wdt:P460 wd:Q28048558}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Marwood', 'p': 'personal name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'close to', 'o': 'Guilhem'}}

 Q: Give me {state or insular area capital in the United States} that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21518270 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state or insular area capital in the United States'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {gospel} for {present in work} of {David}
 SPARQL:  select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q34274 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gospel'}}

 Q: Which is the eWRC-results.com racer ID for Sébastien Ogier?
 SPARQL: select distinct ?answer where { wd:Q368793 wdt:P3927 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sébastien Ogier', 'p': 'eWRC-results.com racer ID', 'o': '?x0'}

 Q: When Kassel has its population 194268.0?
 SPARQL: SELECT ?value WHERE { wd:Q2865 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'194268.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kassel', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '194268.0'}, 't': '?x0'}

 Q: What are the historic county of England which start with the letter Y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historic county of England'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: what is the {language of work or name} for {β-lactose} has {pronunciation audio} as {Sv-laktos.ogg} ?
 SPARQL: SELECT ?value WHERE { wd:Q127900 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Sv-laktos.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'β-lactose', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'sv-laktos.ogg'}}}

 Q: What is <RKD/ESD (Slovenia) ID> of <Lipizzaner> ?
 SPARQL: select distinct ?answer where { wd:Q217671 wdt:P1715 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lipizzaner', 'p': 'RKD/ESD (Slovenia) ID', 'o': '?x0'}

 Q: On December 28, 1946, who did Aristotle Onassis marry?
 SPARQL: SELECT ?obj WHERE { wd:Q180455 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aristotle Onassis', 'p': 'marry', 'o': '?x0', 't': '1946'}

 Q: What is {victor} of {prize awarded} of {John R. Pierce} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1340677 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'victor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John R. Pierce', 'p': 'award', 'o': '$y0'}}

 Q: Is the orbital inclination of the 8076 Foscarini equal 0.28578?
 SPARQL: ASK WHERE { wd:Q628640 wdt:P2045 ?obj filter(?obj = 0.28578) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '8076 Foscarini', 'p': 'orbital inclination', 'o': '?x0', '?x0': '0.28578'}

 Q: What is the {human} for {spouse} of {Betty White}
 SPARQL:  select distinct ?obj where { wd:Q373895 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Betty White', 'p': 'husband', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {publication date} of {Super Mario Bros.} that is {place of publication} is {Europe} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11168 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P291 wd:Q46 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Super Mario Brothers', 'p': 'publication date', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of publication', 'o': 'Europe'}}}

 Q: Does the Crab Pulsar have a galactic latitude over 18.29464?
 SPARQL: ASK WHERE { wd:Q1044623 wdt:P6261 ?obj filter(?obj > 18.29464) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Crab Pulsar', 'p': 'galactic latitude', 'o': '?x0', '?x0': '18.29464'}

 Q: what is land-grant university starts with v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'land-grant university'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: How many {after a work by} are to/by {Nathaniel Hawthorne} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1877 wd:Q69339 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'after a work by', 'o': 'Nathaniel Hawthorne'}

 Q: Who married Madeleine L'Engle on 1/26/1946?
 SPARQL: SELECT ?obj WHERE { wd:Q257261 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Madeleine L'Engle", 'p': 'married', 'o': '?x0', 't': '1946'}

 Q: What is {founder} of {region} of {Spring} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18147629 wdt:P276 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Spring', 'p': 'location', 'o': '$y0'}}

 Q: Give me {computer network protocol} that contains the word {widi} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15836568 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'widi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer network protocol'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'widi'}}

 Q: What Sam Kinison label has Warner Music Group stockholders?
 SPARQL: SELECT ?answer WHERE { wd:Q333505 wdt:P264 ?answer . ?answer wdt:P127 wd:Q21077}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sam Kinison', 'p': 'label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'stockholder', 'o': 'Warner Music Group'}}

 Q: How many used by are for Transport Layer Security ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q206494 wdt:P1535 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Transport Layer Security', 'p': 'used by', 'o': '?x0'}

 Q: What is Plarr ID for Edward VII  ?
 SPARQL: select distinct ?answer where { wd:Q20875 wdt:P2944 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Edward VII', 'p': 'Plarr ID', 'o': '?x0'}

 Q: What is the Nasjonalbiblioteket photographer ID for Fridtjof Nansen
 SPARQL: select distinct ?answer where { wd:Q72292 wdt:P1847 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Fridtjof Nansen', 'p': 'Nasjonalbiblioteket photographer ID', 'o': '?x0'}

 Q: What is {social media account on} of {made by} of {Xiaomi Redmi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15954223 wdt:P176 ?X . ?X wdt:P553 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'social media account on', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Redmi', 'p': 'made by', 'o': '$y0'}}

 Q: In what time was did the Yuan dynasty rule the Asian continent?
 SPARQL: SELECT ?answer WHERE { wd:Q7313 wdt:P30 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yuan', 'p': 'continent', 'o': '$y0'}}

 Q: Which is the measurement unit for measured physical quantity of temperature?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P111 wd:Q11466 . ?sbj wdt:P31 wd:Q47574 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'measured physical quantity', 'o': 'temperature', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit'}}

 Q: Which gas giant in the solar system has the biggest synodic period?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q121750 . ?ent wdt:P4341 ?obj . ?ent wdt:P361 wd:Q544 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'synodic period', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gas giant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'solar system'}}}

 Q: What is permitted food additive for citric acid ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4850 wd:Q159683}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'permitted food additive', 'o': 'citric acid'}

 Q: What is the {language of work or name} and the {owner of} of {Pinterest} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q255381 wdt:P407 ?ans_1 . wd:Q255381 wdt:P1830 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Pinterest', 'p': 'language of work or name', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Pinterest', 'p': 'owner of', 'o': '?x1'}]

 Q: What is next to the place of work of Alfred Stieglitz?
 SPARQL: SELECT ?answer WHERE { wd:Q313055 wdt:P937 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'next to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Stieglitz', 'p': 'place of work', 'o': '$y0'}}

 Q: What is {academic degree} and {academic major} of {{Christiane Amanpour} has {educated at} as {University of Rhode Island}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q236939 p:P69 ?s . ?s ps:P69 wd:Q1641788 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christiane Amanpour', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Rhode Island'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christiane Amanpour', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Rhode Island'}}}]

 Q: What is the relevant qualification of project management ?
 SPARQL: select distinct ?answer where { wd:Q179012 wdt:P4968 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'project management', 'p': 'relevant qualification', 'o': '?x0'}

 Q: I want to know Andreas Vesalius' Auckland Art Gallery artist ID.
 SPARQL: select distinct ?answer where { wd:Q170267 wdt:P3372 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andreas Vesalius', 'p': 'Auckland Art Gallery artist ID', 'o': '?x0'}

 Q: Give me {professional sports league} that {season starts} {October} and which contains the word {hockey} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991290 . ?sbj wdt:P4794 wd:Q124 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hockey')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'professional sports league', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'season starts', 'o': 'October'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hockey'}}

 Q: Which is the Babelio work ID for The Grapes of Wrath?
 SPARQL: select distinct ?answer where { wd:Q215983 wdt:P3631 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Grapes of Wrath', 'p': 'Babelio work ID', 'o': '?x0'}

 Q: Tell me female beauty pageant whose name has the word world in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'female beauty pageant'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: Did the twinned administrative body of Samarkand begin August 4, 1986?
 SPARQL: SELECT ?obj WHERE { wd:Q5753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1986')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Samarkand', 'p': 'twinned administrative body', 'o': '?x0', 't': '1986'}

 Q: What is the {business} for {product or material produced} of {Commodore 64}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q99775 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'Commodore 64', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is {production statistics} of {state} of {Paris-Charles de Gaulle Airport} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46280 wdt:P17 ?X . ?X wdt:P2746 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'production statistics', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles de Gaulle Airport', 'p': 'state', 'o': '$y0'}}

 Q: "What is the brother of Manfred von Richthofen whose burial place is Germany?"
 SPARQL: SELECT ?answer WHERE { wd:Q4701 wdt:P3373 ?answer . ?answer wdt:P119 wd:Q183}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Manfred von Richthofen', 'p': 'bro', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'burial place', 'o': 'Germany'}}

 Q: Which taxon has the longest generation time?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3337 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'generation time', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is the Swedish Literature Bank Author ID of Erasmus?
 SPARQL: select distinct ?answer where { wd:Q43499 wdt:P5101 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Erasmus', 'p': 'Swedish Literature Bank Author ID', 'o': '?x0'}

 Q: What are the Greek deity which start with the letter zeus
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greek deity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeus'}}

 Q: What is {place of burial} of {Pete Conrad} that is {burial plot reference} is {Section 11, Site 113-3} ?
 SPARQL: SELECT ?obj WHERE { wd:Q213076 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P965 ?x filter(contains(?x,'Section 11, Site 113-3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pete Conrad', 'p': 'place of burial', 'o': '?x0'}

 Q: What is {surface} of {has capital} of {Malacca sultanate} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46652 wdt:P36 ?X . ?X wdt:P2046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'surface', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malacca sultanate', 'p': 'capital', 'o': '$y0'}}

 Q: How many {studies} are to/by {jurisprudence} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2578 wd:Q4932206 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'jurisprudence'}

 Q: What are the gas law which start with the letter I
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q379231 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gas law'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: What is the {controversy} for {participant} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q22686 . ?sbj wdt:P31 wd:Q1255828 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'controversy'}}

 Q: what is the {ticker symbol} for {Chevron Corporation} has {stock exchange} as {New York Stock Exchange} ?
 SPARQL: SELECT ?value WHERE { wd:Q319642 p:P414 ?s . ?s ps:P414 wd:Q13677 . ?s pq:P249 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ticker symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chevron Corporation', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'stock exchange', 'o': 'New York Stock Exchange'}}}

 Q: Who is the daughter of Guinevere's wife?
 SPARQL: SELECT ?answer WHERE { wd:Q272054 wdt:P26 ?X . ?X wdt:P25 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guinevere', 'p': 'wife', 'o': '$y0'}}

 Q: Which is the Framalibre ID for Wilhelm Furtwängler?
 SPARQL: select distinct ?answer where { wd:Q57285 wdt:P4107 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wilhelm Furtwängler', 'p': 'Framalibre ID', 'o': '?x0'}

 Q: Which is the date of disappearance of Natalia Molchanova?
 SPARQL: select distinct ?answer where { wd:Q59920 wdt:P746 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Natalia Molchanova', 'p': 'date of disappearance', 'o': '?x0'}

 Q: Richard III of England was depicted by which film ?
 SPARQL:  select distinct ?obj where { wd:Q133028 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Richard III of England', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: What is the ruchess ID of Anatoly Karpov?
 SPARQL: select distinct ?answer where { wd:Q131674 wdt:P4994 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anatoly Karpov', 'p': 'ruchess ID', 'o': '?x0'}

 Q: Which is They Work for You ID of David Cameron?
 SPARQL: select distinct ?answer where { wd:Q192 wdt:P2171 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Cameron', 'p': 'They Work for You ID', 'o': '?x0'}

 Q: How many {distribution} are to/by {Secure Digital card} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P437 wd:Q466977 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'distribution', 'o': 'Secure Digital card'}

 Q: What are the type of business entity which start with the letter S
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1269299 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of business entity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which {telephone prefix} is {born at} {Abu Nuwas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5670 wdt:P19 ?X . ?X wdt:P473 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'telephone prefix', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abu Nuwas', 'p': 'born at', 'o': '$y0'}}

 Q: Who is noble family of has mother of Iziaslav I of Kiev ?
 SPARQL: SELECT ?answer WHERE { wd:Q332516 wdt:P25 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'family', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iziaslav I of Kiev', 'p': 'mother', 'o': '$y0'}}

 Q: What are the team which start with the letter vándormások
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327245 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vándormások')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vándormások'}}

 Q: Which are the afflicts of mercury poisoning?
 SPARQL: select distinct ?answer where { wd:Q408089 wdt:P689 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mercury poisoning', 'p': 'afflicts', 'o': '?x0'}

 Q: What is internetmedicin.se ID for breast cancer ?
 SPARQL: select distinct ?answer where { wd:Q128581 wdt:P2074 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'breast cancer', 'p': 'internetmedicin.se ID', 'o': '?x0'}

 Q: What is {date of death} and {date of birth} of {{Joseph Stalin} has {child} as {Artem Sergeev}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q4416801 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Artem Sergeev'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Artem Sergeev'}}}]

 Q: What was University of California, Berkeley students count in 2016?
 SPARQL: SELECT ?obj WHERE { wd:Q168756 p:P2196 ?s . ?s ps:P2196 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'University of California, Berkeley', 'p': 'students count', 'o': '?x0', 't': '2016'}

 Q: what is the {instance of} for {Zenobia} has {date of birth} as {240-0-0} ?
 SPARQL: SELECT ?value WHERE { wd:Q189705 p:P569 ?s . ?s ps:P569 ?x filter(contains(?x,'240-0-0')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zenobia', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'date of birth', 'o': '240-0-0'}}}

 Q: Which is the Cinema ID for Amélie?
 SPARQL: select distinct ?answer where { wd:Q484048 wdt:P3933 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amélie', 'p': 'Cinema ID', 'o': '?x0'}

 Q: What is the country calling code for Nauru?
 SPARQL: select distinct ?answer where { wd:Q697 wdt:P474 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nauru', 'p': 'country calling code', 'o': '?x0'}

 Q: What is {follows} and {followed by} of {{Louis II of Italy} has {noble title} as {monarch of Italy}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q215204 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}]

 Q: What is the Fossilworks ID for pigeon?
 SPARQL: select distinct ?answer where { wd:Q10856 wdt:P842 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pigeon', 'p': 'Fossilworks ID', 'o': '?x0'}

 Q: What is {lake} of {place of foundation} of {John England & the Western Swingers} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6231791 wdt:P740 ?X . ?X wdt:P206 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'lake', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John England & the Western Swingers', 'p': 'place of foundation', 'o': '$y0'}}

 Q: What is {population} of {Zlín Region} that is {male population} is {285855.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192536 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1540 ?x filter(contains(?x,'285855.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zlin Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'male population', 'o': '285855.0'}}}

 Q: what is an experiment that starts with the letter t.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q101965 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'experiment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which is the PagesJaunes ID for Louvre Museum?
 SPARQL: select distinct ?answer where { wd:Q19675 wdt:P4201 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Louvre Museum', 'p': 'PagesJaunes ID', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Christine Sinclair} has {member of sports team} as {Vancouver Whitecaps}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q262802 p:P54 ?s . ?s ps:P54 wd:Q3567798 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christine Sinclair', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Vancouver Whitecaps'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christine Sinclair', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Vancouver Whitecaps'}}}]

 Q: What is {award received} of {Halldór Laxness} that is {prize money} is {190214.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80321 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'190214.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Halldór Laxness', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '190214.0'}}}

 Q: Is the absolute magnitude of the 10199 Chariklo equal to 6.7?
 SPARQL: ASK WHERE { wd:Q11559 wdt:P1457 ?obj filter(?obj = 6.7) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '10199 Chariklo', 'p': 'absolute magnitude', 'o': '?x0', '?x0': '6.7'}

 Q: what is the {statement is subject of} for {Germany} has {shares border with} as {Poland} ?
 SPARQL: SELECT ?value WHERE { wd:Q183 p:P47 ?s . ?s ps:P47 wd:Q36 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'de', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'border', 'o': 'Poland'}}}

 Q: What is the inverse of the manufacturing method of pasteurization?
 SPARQL: SELECT ?answer WHERE { wd:Q58148 wdt:P2079 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inverse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pasteurization', 'p': 'manufacturing method', 'o': '$y0'}}

 Q: What is {characters} of {translation of} of {Божественная комедия (1855, Минъ)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21191066 wdt:P629 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Божественная комедия (1855, Минъ)', 'p': 'translation of', 'o': '$y0'}}

 Q: Which is the tracklist for Revolver?
 SPARQL: select distinct ?answer where { wd:Q185121 wdt:P658 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Revolver', 'p': 'tracklist', 'o': '?x0'}

 Q: which is the public policy that starts with letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q546113 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public policy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: What is the base of a cube that differs from a triangle?
 SPARQL: SELECT ?answer WHERE { wd:Q812880 wdt:P3263 ?answer . ?answer wdt:P1889 wd:Q19821}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cube', 'p': 'base', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'differs from', 'o': 'triangle'}}

 Q: What is the film genre and the name of the singer of Long Story Short?
 SPARQL: SELECT ?answer WHERE { wd:Q6673247 wdt:P175 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Long Story Short', 'p': 'singer', 'o': '$y0'}}

 Q: Who is the architect of the Chapultepec Castleon?
 SPARQL: select distinct ?answer where { wd:Q1072510 wdt:P84 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chapultepec Castle', 'p': 'architect', 'o': '?x0'}

 Q: what is the {start time} for {George II of Great Britain} has {position held} as {duke} ?
 SPARQL: SELECT ?value WHERE { wd:Q131981 p:P39 ?s . ?s ps:P39 wd:Q166886 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George II of Great Britain', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'duke'}}}

 Q: what is the {end time} for {Dragan Džajić} has {member of sports team} as {Yugoslavia national football team} ?
 SPARQL: SELECT ?value WHERE { wd:Q297357 p:P54 ?s . ?s ps:P54 wd:Q188363 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dragan Džajić', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Yugoslavia national football team'}}}

 Q: What is the Alcalá de Henares population determined by the register office?
 SPARQL: SELECT ?obj WHERE { wd:Q46940 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alcalá de Henares', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determined by', 'o': 'register office'}}}

 Q: Does a house cats bite force reach 46.4?
 SPARQL: ASK WHERE { wd:Q146 wdt:P3485 ?obj filter(?obj = 46.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'house cat', 'p': 'bite force quotient', 'o': '?x0', '?x0': '46.4'}

