 Q: What is the {human} for {religion} of {Judaism}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P140 wd:Q9268 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'Judaism', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Britney Spears} has {spouse} as {Jason Allen Alexander} ?
 SPARQL: SELECT ?value WHERE { wd:Q11975 p:P26 ?s . ?s ps:P26 wd:Q27949402 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Britney Spears', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Jason Allen Alexander'}}}

 Q: What is {material produced} of {developed by} of {McAfee VirusScan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1629915 wdt:P178 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'material produced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'McAfee VirusScan', 'p': 'developed by', 'o': '$y0'}}

 Q: What is <Gaming-History identifier> of <Xbox> ?
 SPARQL: select distinct ?answer where { wd:Q132020 wdt:P4806 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Xbox', 'p': 'Gaming-History identifier', 'o': '?x0'}

 Q: How many {participant of} are for {Ronaldinho} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q39444 wdt:P1344 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Ronaldinho', 'p': 'participant of', 'o': '?x0'}

 Q: What is {significant event} of {Mindaugas} that is {point in time} is {1251-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q242436 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1251')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mindaugas', 'p': 'significant event', 'o': '?x0', 't': '1251'}

 Q: What is the {tell} for {place of death} of {Akhenaten}
 SPARQL:  select distinct ?obj where { wd:Q81794 wdt:P20 ?obj . ?obj wdt:P31 wd:Q755017 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Akhenaten', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tell'}}

 Q: How many fathers are for Frederick I} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P22 wd:Q79789 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'father', 'o': 'Frederick I'}

 Q: What is the {country} and the {continent} of {Brussels} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q240 wdt:P17 ?ans_1 . wd:Q240 wdt:P30 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Brussels', 'p': 'country', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Brussels', 'p': 'continent', 'o': '?x1'}]

 Q: How many were injured in the Second Italo-Ethiopian War?
 SPARQL: select distinct ?answer where { wd:Q94916 wdt:P1339 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Second Italo-Ethiopian War', 'p': 'injured', 'o': '?x0'}

 Q: Which sociolect is a dialect of British English?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4913 wd:Q7979 . ?sbj wdt:P31 wd:Q207101 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dialect of', 'o': 'British English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sociolect'}}

 Q: Who was the head of government of Poznań in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q268 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Poznań', 'p': 'head of government', 'o': '?x0', 't': '2014'}

 Q: Which is the French National Assembly Lobbyist ID for SNCF?
 SPARQL: select distinct ?answer where { wd:Q13646 wdt:P3281 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'SNCF', 'p': 'French National Assembly Lobbyist ID', 'o': '?x0'}

 Q: what is the {point in time} for {Peter Jennings} has {award received} as {Disney Legends} ?
 SPARQL: SELECT ?value WHERE { wd:Q354540 p:P166 ?s . ?s ps:P166 wd:Q1150306 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Peter Jennings', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Disney Legends'}, 't': '?x0'}

 Q: What is the {military specialism} for {occupation} of {Saint George}
 SPARQL:  select distinct ?obj where { wd:Q48438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q6857706 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Saint George', 'p': 'occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military specialism'}}

 Q: What is the dredger with the highest payload mass?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5810820 . ?ent wdt:P4519 ?obj . ?ent wdt:P31 wd:Q5810820 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'payload mass', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dredger'}}

 Q: What is {position held} of {Clement Attlee} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement Attlee', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement Attlee', 'p': 'position held', 'o': '$y0'}}]

 Q: Tell me the road bridge which contains the word viaduct in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'viaduct')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road bridge'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'viaduct'}}

 Q: What is {country of jurisdiction} of {executive branch}, that has {has villages} is {Ingeniero Moneta} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35798 wdt:P1001 ?answer . ?answer wdt:P150 wd:Q16302002}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'executive branch', 'p': 'of jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has villages', 'o': 'Ingeniero Moneta'}}

 Q: What county seat of Lilongwe is divided into the Lilongwe District?
 SPARQL: SELECT ?answer WHERE { wd:Q3876 wdt:P1376 ?answer . ?answer wdt:P150 wd:Q1058453}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lilongwe', 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Lilongwe District'}}

 Q: Who is the  {legal case} for {defendant} of {Bill Cosby}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1591 wd:Q213512 . ?sbj wdt:P31 wd:Q2334719 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'defendant', 'o': 'Bill Cosby', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'legal case'}}

 Q: What is {nominated for} of {Marisa Tomei} that is {for work} is {Before the Devil Knows You're Dead} ?
 SPARQL: SELECT ?obj WHERE { wd:Q191828 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1321503 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marisa Tomei', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "Before the Devil Knows You're Dead"}}}

 Q: What was Yuri Lotman a member of starting 1977?
 SPARQL: SELECT ?obj WHERE { wd:Q360084 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1977')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yuri Lotman', 'p': 'member of', 'o': '?x0', 't': '1977'}

 Q: What is the {Wii Remote extension} for {input method} of {Wii}
 SPARQL:  select distinct ?obj where { wd:Q8079 wdt:P479 ?obj . ?obj wdt:P31 wd:Q44753009 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wii', 'p': 'input method', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wii Remote extension'}}

 Q: What is the {sovereign state} for {history of topic} of {history of Australia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2184 wd:Q174825 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'history of topic', 'o': 'history of Australia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: When was François Truffaut nominated for National Society of Film Critics Award for Best Screenplay?
 SPARQL: SELECT ?value WHERE { wd:Q53002 p:P1411 ?s . ?s ps:P1411 wd:Q6978541 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'François Truffaut', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'National Society of Film Critics Award for Best Screenplay'}, 't': '?x0'}

 Q: Tell me non-metropolitan county whose name has the word worcestershire in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q769603 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worcestershire')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'non-metropolitan county'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'worcestershire'}}

 Q: When did Kevin Durant receive the All-NBA Team award?
 SPARQL: SELECT ?value WHERE { wd:Q29545 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kevin Durant', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'All-NBA Team'}, 't': '?x0'}

 Q: In what point in time was Nepal's population 5.63848e+06?
 SPARQL: SELECT ?value WHERE { wd:Q837 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'5.63848e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nepal', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '5.63848e+06'}, 't': '?x0'}

 Q: What is {series} of {Rama} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q160213 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rama', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rama', 'p': 'series', 'o': '$y0'}}]

 Q: Is the parity of the arsenic-84 equal to -1?
 SPARQL: ASK WHERE { wd:Q18844788 wdt:P1123 ?obj filter(?obj = -1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'arsenic-84', 'p': 'parity', 'o': '?x0', '?x0': '-1'}

 Q: What are the first aid measures for mercury poisoning?
 SPARQL: select distinct ?answer where { wd:Q408089 wdt:P2239 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mercury poisoning', 'p': 'first aid measures', 'o': '?x0'}

 Q: What is the {human} for {doctoral advisor} of {Max Planck}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P184 wd:Q9021 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'doctoral advisor', 'o': 'Max Planck', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is <archINFORM ID (projects)> of <Yosemite National Park> ?
 SPARQL: select distinct ?answer where { wd:Q180402 wdt:P5383 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yosemite National Park', 'p': 'archINFORM ID (projects)', 'o': '?x0'}

 Q: Which Jade Emperor that married Nuwa had a child?
 SPARQL: SELECT ?answer WHERE { wd:Q860434 wdt:P40 ?answer . ?answer wdt:P26 wd:Q641632}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jade Emperor', 'p': 'child', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'married', 'o': 'Nuwa'}}

 Q: Which is the tributary for Euphrates?
 SPARQL: select distinct ?answer where { wd:Q34589 wdt:P974 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Euphrates', 'p': 'tributary', 'o': '?x0'}

 Q: Where are Attila's place of birth and place of death?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36724 wdt:P19 ?ans_1 . wd:Q36724 wdt:P20 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Attila', 'p': 'place of birth', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Attila', 'p': 'place of death', 'o': '?x1'}]

 Q: Is the net tonnage of the MS Nordlys less than 3322.4?
 SPARQL: ASK WHERE { wd:Q1614744 wdt:P2790 ?obj filter(?obj < 3322.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Nordlys', 'p': 'net tonnage', 'o': '?x0', '?x0': '3322.4'}

 Q: What is {pronunciation audio} of {fish} that is {language of work or name} is {American English} ?
 SPARQL: SELECT ?obj WHERE { wd:Q152 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7976 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'fish', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'American English'}}}

 Q: What is the human with the highest Elo rating whose sport is chess?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj . ?ent wdt:P641 wd:Q718 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Elo rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'chess'}}}

 Q: Who are the founders of Symantec, that have the surname Hendrix?
 SPARQL: SELECT ?answer WHERE { wd:Q677085 wdt:P112 ?answer . ?answer wdt:P734 wd:Q16870694}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Symantec', 'p': 'founders', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'surname', 'o': 'Hendrix'}}

 Q: What is {coordinate of southernmost point} of {basin countries} of {Columbia River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2251 wdt:P205 ?X . ?X wdt:P1333 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate of southernmost point', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Columbia River', 'p': 'basin countries', 'o': '$y0'}}

 Q: What is the name of a government agency that starts with the letter y.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327333 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'government agency'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is {Carnegie Classification of Institutions of Higher Education} of {employed by} of {Arthur E. Bryson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4798535 wdt:P108 ?X . ?X wdt:P2643 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Carnegie Classification of Institutions of Higher Education', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur E. Bryson', 'p': 'employed by', 'o': '$y0'}}

 Q: Does gonorrhea affect more than 654175.2 people?
 SPARQL: ASK WHERE { wd:Q101896 wdt:P2854 ?obj filter(?obj > 654175.2) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'gonorrhea', 'p': 'disease burden', 'o': '?x0', '?x0': '654175.2'}

 Q: What is {represents} of {famous for} of {Brose Partington} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4975395 wdt:P800 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'represents', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brose Partington', 'p': 'famous for', 'o': '$y0'}}

 Q: What is the Barbarian R.C. ID for Serge Blanco?
 SPARQL: select distinct ?answer where { wd:Q1322456 wdt:P4494 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Serge Blanco', 'p': 'Barbarian R.C. ID', 'o': '?x0'}

 Q: What big band type of film was inaugurated on 1900-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q207378 wdt:P136 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1900'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'big band', 'p': 'type of film', 'o': '?x0', 't': '1900'}

 Q: Give me {alcohol} that {safety classification and labelling} {Regulation (EC) No. 1272/2008} and which contains the word {ether} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q156 . ?sbj wdt:P4952 wd:Q2005334 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ether')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alcohol', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'safety classification and labelling', 'o': 'Regulation (EC) No. 1272/2008'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ether'}}

 Q: Tell me the historic county of England of the capital of Norwich and that contains the word norfolk in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj wdt:P36 wd:Q130191 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'norfolk')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historic county of England', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Norwich'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'norfolk'}}

 Q: What is {dubbed by} of {part of series} of {I Second That Emotion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1992298 wdt:P179 ?X . ?X wdt:P725 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dubbed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'I Second That Emotion', 'p': 'series', 'o': '$y0'}}

 Q: What kingdom starts with the letter "z"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q417175 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kingdom'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is the Royal Aero Club Aviator's Certificate ID of Charles Rolls?
 SPARQL: select distinct ?answer where { wd:Q313074 wdt:P1293 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Rolls', 'p': "Royal Aero Club Aviator's Certificate ID", 'o': '?x0'}

 Q: When did Benjamin Howard Baker leave the sports team Everton F.C. ?
 SPARQL: SELECT ?value WHERE { wd:Q4140865 p:P54 ?s . ?s ps:P54 wd:Q5794 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benjamin Howard Baker', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Everton F.C.'}}}

 Q: How many {programming language} are for {iOS} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q48493 wdt:P277 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'iOS', 'p': 'programming language', 'o': '?x0'}

 Q: What is {member of sports team} of {Dino Zoff} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q180661 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dino Zoff', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dino Zoff', 'p': 'team', 'o': '$y0'}}]

 Q: What sports team was Viv Richards a member of until 1977-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q738016 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1977')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Viv Richards', 'p': 'team', 'o': '?x0', 't': '1977'}

 Q: What is the penis sexually homologous with?
 SPARQL: select distinct ?answer where { ?answer wdt:P4545 wd:Q58}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sexually homologous with', 'o': 'penis'}

 Q: Did {Isaac_Newton} {place of burial} {Westminster Abbey}?
 SPARQL: ASK WHERE { wd:Q935 wdt:P119 wd:Q5933 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Isaac Newton', 'p': 'place of burial', 'o': '?x0', '?x0': 'Westminster Abbey'}]

 Q: What are the seven deadly sins  which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q166502 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'seven deadly sins'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: How many programming languages are made by Perl?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P277 wd:Q42478 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'programming language', 'o': 'Perl'}

 Q: Palm Sunday is the feast day for which biblical episode?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P841 wd:Q42236 . ?sbj wdt:P31 wd:Q22704077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'feast day', 'o': 'Palm Sunday', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical episode'}}

 Q: What are the educational stage which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18189 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'k')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'educational stage'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'k'}}

 Q: What is the {animated film} for {voice actor} of {David Spade}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q298658 . ?sbj wdt:P31 wd:Q202866 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'David Spade', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated film'}}

 Q: Is it true that the male population of the Top Springs equal to 0?
 SPARQL: ASK WHERE { wd:Q18026 wdt:P1540 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Top Springs', 'p': 'male population', 'o': '?x0', '?x0': '0'}

 Q: Give me {private university} that {member of} {Scholarly Publishing and Academic Resources Coalition} and which contains the word {university} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj wdt:P463 wd:Q647039 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'university')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private university', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Scholarly Publishing and Academic Resources Coalition'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'university'}}

 Q: What is {place of birth} of {John Perry Barlow} that is {sourcing circumstances} is {near} ?
 SPARQL: SELECT ?obj WHERE { wd:Q534428 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P1480 wd:Q21818619 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birth place', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Perry Barlow', 'p': 'birth place', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'near'}}}

 Q: which office building has the highest floors below ground?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1021645 . ?ent wdt:P1139 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'floors below ground', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'office building'}}

 Q: What is {dialect of} of {language of the original work} of {The Last Blood} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14476441 wdt:P364 ?X . ?X wdt:P4913 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dialect of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Last Blood', 'p': 'language of the original work', 'o': '$y0'}}

 Q: What is {opening days} of {school attended} of {Louis Brassin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1367651 wdt:P69 ?X . ?X wdt:P3025 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opening days', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis Brassin', 'p': 'school attended', 'o': '$y0'}}

 Q: Which is the PEGI rating for Wii Sports?
 SPARQL: select distinct ?answer where { wd:Q71936 wdt:P908 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wii Sports', 'p': 'PEGI rating', 'o': '?x0'}

 Q: What are the Bantu languages which start with the letter zulu
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zulu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Bantu'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zulu'}}

 Q: What Class IB flammable liquid has the highest ceiling exposure limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2405 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ceiling exposure limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IB flammable liquid'}}

 Q: What is the first name of Channing Tatum that is the same as Matthias?
 SPARQL: SELECT ?answer WHERE { wd:Q212064 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4927273}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Channing Tatum', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Matthias'}}

 Q: What is the {landlocked country} with the {MAX(VAT-rate)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q123480 . ?ent wdt:P2855 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'VAT', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landlocked country'}}

 Q: Was Scooby-Doo genre horror film and science fiction film?
 SPARQL: ASK WHERE { wd:Q205683 wdt:P136 wd:Q200092 . wd:Q205683 wdt:P136 wd:Q471839 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Scooby-Doo', 'p': 'genre', 'o': '?x0', '?x0': 'horror film'}, {'h': 'IS', 'v': '?x1', 's': 'Scooby-Doo', 'p': 'genre', 'o': '?x1', '?x1': 'science fiction film'}]

 Q: What is the {taxon} for {natural product of taxon} of {watermelon}
 SPARQL:  select distinct ?obj where { wd:Q38645 wdt:P1582 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'watermelon', 'p': 'natural product of taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What was the residence of Oliver Heaviside born at 1889-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q154345 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1889')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Oliver Heaviside', 'p': 'residence', 'o': '?x0', 't': '1889'}

 Q: What is the terminus of the Menai Bridge
 SPARQL: select distinct ?answer where { ?answer wdt:P559 wd:Q2655856}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'terminus', 'o': 'Menai Bridge'}

 Q: What is {award received} of {Lee Marvin} that is {for work} is {Cat Ballou} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76895 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q76824 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lee Marvin', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Cat Ballou'}}}

 Q: What is the {human} for {depicts} of {Mona Lisa}
 SPARQL:  select distinct ?obj where { wd:Q12418 wdt:P180 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mona Lisa', 'p': 'depicts', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What are the season which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'season'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {part of work} of {bibliographic citation} of {Childhood obesity: are we all speaking the same language?} ?
 SPARQL: SELECT ?answer WHERE { wd:Q34729820 wdt:P2860 ?X . ?X wdt:P1433 ?answer}
 ALIST: {}

 Q: what is the {replaces} for {Mohammad Mosaddegh} has {position held} as {Prime Minister of Iran} ?
 SPARQL: SELECT ?value WHERE { wd:Q123037 p:P39 ?s . ?s ps:P39 wd:Q13561063 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mohammad Mosaddegh', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Iran'}}}

 Q: What is the prefecture of Japan that contains administrative territorial entity of Osaka
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q35765 . ?sbj wdt:P31 wd:Q50337 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Osaka', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'prefecture of Japan'}}

 Q: What is {inhabitants} of {suspect} of {Battle of France} ?
 SPARQL: SELECT ?answer WHERE { wd:Q151340 wdt:P710 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of France', 'p': 'suspect', 'o': '$y0'}}

 Q: What is {position of head of government} of {place of work} of {Pius VII} ?
 SPARQL: SELECT ?answer WHERE { wd:Q124754 wdt:P937 ?X . ?X wdt:P1313 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position of head of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pius VII', 'p': 'place of work', 'o': '$y0'}}

 Q: What is {material used} of {paper} that is {nature of statement} is {often} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11472 p:P186 ?s . ?s ps:P186 ?obj . ?s pq:P5102 wd:Q28962312 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'material used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'paper', 'p': 'material used', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nature of statement', 'o': 'common'}}}

 Q: What is {find location} of {beryllium}, that has {diplomatic relation} is {Romania} ?
 SPARQL: SELECT ?answer WHERE { wd:Q569 wdt:P189 ?answer . ?answer wdt:P530 wd:Q218}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'beryllium', 'p': 'find location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Romania'}}

 Q: What is {bordered by} of {Kingdom of Castile}, that has {language official} is {Spanish} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179293 wdt:P47 ?answer . ?answer wdt:P37 wd:Q1321}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kingdom of Castile', 'p': 'bordered by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Spanish'}}

 Q: What is {runtime} of {medium} of {Jurassic Park: The Game} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2368168 wdt:P437 ?X . ?X wdt:P400 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'runtime', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jurassic Park: The Game', 'p': 'medium', 'o': '$y0'}}

