 Q: Which runway in LAX are made of concrete?
 SPARQL: SELECT ?obj WHERE { wd:Q8731 p:P529 ?s . ?s ps:P529 ?obj . ?s pq:P186 wd:Q22657 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'runway', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'LAX', 'p': 'runway', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'made of', 'o': 'concrete'}}}

 Q: What is the civilisation of episkyros whose starting time is -1200-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q3565742 wdt:P2596 ?answer . ?answer wdt:P580 ?x FILTER(contains(YEAR(?x),'1200'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'episkyros', 'p': 'civilisation', 'o': '?x0', 't': '1200'}

 Q: How many {office held by head of state} are for {Romania} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q218 wdt:P1906 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Romania', 'p': 'office held by head of state', 'o': '?x0'}

 Q: Is Pinto Colvig the name of the performer who plays Goofy?
 SPARQL: SELECT ?value WHERE { wd:Q111135 p:P175 ?s . ?s ps:P175 wd:Q945591 . ?s pq:P642 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Goofy', 'p': 'performer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'performer', 'o': 'Pinto Colvig'}}}

 Q: Which is the introduced feature for air conditioning?
 SPARQL: select distinct ?answer where { ?answer wdt:P751 wd:Q173725}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'introduced feature', 'o': 'air conditioning'}

 Q: What is the {country} for {language used} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q5287 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'ja', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is the {federal state} for {language used} of {Hungarian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9067 . ?sbj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Hungarian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: What kind of instrument is a vibraphone?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1303 wd:Q206987 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'instrument', 'o': 'vibraphone'}

 Q: How much more fabrication methods are need to start cloning?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2079 wd:Q120877 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'cloning'}

 Q: What is <dialect of> of <Ancient Greek> ?
 SPARQL: select distinct ?answer where { wd:Q35497 wdt:P4913 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ancient Greek', 'p': 'dialect of', 'o': '?x0'}

 Q: What is the work of inventor Lucy?
 SPARQL: SELECT ?answer WHERE { wd:Q245388 wdt:P61 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lucy', 'p': 'inventor', 'o': '$y0'}}

 Q: Name this psychoactive drug made from Papaver somniferum that contains the word "opium " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj wdt:P1582 wd:Q131584 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'opium')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'psychoactive drug', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'made from', 'o': 'Papaver somniferum'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'opium'}}

 Q: Which is the issue of tuberculosis?
 SPARQL: select distinct ?answer where { wd:Q12204 wdt:P433 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tuberculosis', 'p': 'issue', 'o': '?x0'}

 Q: What sport does Bob Pettit play that has a runtime of 40?
 SPARQL: SELECT ?answer WHERE { wd:Q368561 wdt:P641 ?answer . ?answer wdt:P2047 ?x FILTER(contains(?x,'40'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bob Pettit', 'p': 'sport', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'runtime', 'o': '40'}}

 Q: What disease burden does Brian Wilson suffers from?
 SPARQL: SELECT ?answer WHERE { wd:Q313013 wdt:P1050 ?X . ?X wdt:P2854 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disease burden', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brian Wilson', 'p': 'disease', 'o': '$y0'}}

 Q: What is a computer model which uses the word zx81 in it's name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55990535 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zx81')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zx81'}}

 Q: Is the relative permeability of vacuum equal to 1?
 SPARQL: ASK WHERE { wd:Q11475 wdt:P5676 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'vacuum', 'p': 'relative permeability', 'o': '?x0', '?x0': '1'}

 Q: What is {predecessor} of {Cretaceous}, that has {closed} is {-145000000-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44626 wdt:P155 ?answer . ?answer wdt:P582 ?x FILTER(contains(YEAR(?x),'0000'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cretaceous', 'p': 'predecessor', 'o': '?x0', 't': '0000'}

 Q: What is the {sport in a geographic region} with the {MAX(number of players in region)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4909 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of players in region', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport in a geographic region'}}

 Q: What is {academic major} and {academic degree} of {{Rowan Atkinson} has {educated at} as {Newcastle University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q23760 p:P69 ?s . ?s ps:P69 wd:Q837164 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rowan Atkinson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Newcastle University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rowan Atkinson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Newcastle University'}}}]

 Q: Which country has a disease burden from air pollution as 4.353e+06?
 SPARQL: SELECT ?value WHERE { wd:Q131123 p:P2854 ?s . ?s ps:P2854 ?x filter(contains(?x,'4.353e+06')) . ?s pq:P276 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'air pollution', 'p': 'disease burden', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'disease burden', 'o': '4.353e+06'}}}

 Q: What is the {annual event} for {based on} of {Eurovision Song Contest}
 SPARQL:  select distinct ?obj where { wd:Q276 wdt:P144 ?obj . ?obj wdt:P31 wd:Q18574946 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eurovision Song Contest', 'p': 'based on', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'annual event'}}

 Q: Who is elected in The Joong-ang Ilbo?
 SPARQL: select distinct ?answer where { ?answer wdt:P2715 wd:Q483903}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'elected in', 'o': 'The Joong-ang Ilbo'}

 Q: What is {height} and {location} of {{pole vault} has {record held} as {Steve Hooker}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q15573 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'height', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Steve Hooker'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'location', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Steve Hooker'}}}]

 Q: What is {place of activity} of {Andrea Mantegna}, that has {twin cities} is {Handan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5681 wdt:P937 ?answer . ?answer wdt:P190 wd:Q58570}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrea Mantegna', 'p': 'place of activity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin cities', 'o': 'Handan'}}

 Q: What is {governing body} of {worked for} of {Charles McLean Andrews} ?
 SPARQL: SELECT ?answer WHERE { wd:Q472498 wdt:P108 ?X . ?X wdt:P797 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'governing body', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles McLean Andrews', 'p': 'worked for', 'o': '$y0'}}

 Q: What is {inititated} of {board game publisher} of {The Eternal Champion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7732542 wdt:P123 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inititated', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Eternal Champion', 'p': 'publisher', 'o': '$y0'}}

 Q: What is {qty fatalities} of {in action} of {Matt Busby} ?
 SPARQL: SELECT ?answer WHERE { wd:Q206237 wdt:P607 ?X . ?X wdt:P1120 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fatalities', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matt Busby', 'p': 'in action', 'o': '$y0'}}

 Q: Give me {state church} that {office held by head of the organisation} {Archbishop of Canterbury} and which contains the word {church} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj wdt:P2388 wd:Q29282 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'church')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'office held by head of the organisation', 'o': 'Archbishop of Canterbury'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'church'}}

 Q: what is the {start time} for {William Howard Taft} has {position held} as {President of the United States} ?
 SPARQL: SELECT ?value WHERE { wd:Q35648 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Howard Taft', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the US'}}}

 Q: Is the marriageable age of Ireland equal to18?
 SPARQL: ASK WHERE { wd:Q27 wdt:P3000 ?obj filter(?obj = 18) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ireland', 'p': 'marriageable age', 'o': '?x0', '?x0': '18'}

 Q: What is {tributary} of {next to lake} of {Cádiz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15682 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cadiz', 'p': 'next to lake', 'o': '$y0'}}

 Q: IS THE ELECTRICAL RESISTIVITY OF GRIVORY GM-G4 EQUIVALENT TO 10000000000000?
 SPARQL: ASK WHERE { wd:Q57051271 wdt:P5679 ?obj filter(?obj = 10000000000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Grivory GM-4H', 'p': 'electrical resistivity', 'o': '?x0', '?x0': '10000000000000'}

 Q: What is the {vocabulary} for {facet of} of {Hungarian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1269 wd:Q9067 . ?sbj wdt:P31 wd:Q6499736 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Hungarian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vocabulary'}}

 Q: What is propylene a polymer of?
 SPARQL: select distinct ?answer where { ?answer wdt:P4600 wd:Q151324}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'polymer of', 'o': 'propylene'}

 Q: What is in the basin area of the Lake Balkhash tributary?
 SPARQL: SELECT ?answer WHERE { wd:Q134485 wdt:P974 ?X . ?X wdt:P2053 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'basin area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lake Balkhash', 'p': 'tributary', 'o': '$y0'}}

 Q: What product, made from raspberry, has the common name Малина?
 SPARQL: SELECT ?answer WHERE { wd:Q13179 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Малина'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'raspberry', 'p': 'made from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'common name', 'o': 'малина'}}

 Q: Tell me religious denomination whose name has the word unitarianism in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13414953 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'unitarianism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious denomination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'unitarianism'}}

 Q: What is the {art exhibition} for {exhibition history} of {Mona Lisa}
 SPARQL:  select distinct ?obj where { wd:Q12418 wdt:P608 ?obj . ?obj wdt:P31 wd:Q667276 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mona Lisa', 'p': 'exhibition history', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art exhibition'}}

 Q: What is {recognition title} of {Médecins Sans Frontières}, that has {1st place medalist} is {Richard von Weizsäcker} ?
 SPARQL: SELECT ?answer WHERE { wd:Q49330 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q2567}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Médecins Sans Frontières', 'p': 'recognition title', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': '1st place medalist', 'o': 'Richard von Weizsäcker'}}

 Q: What are theeconomic policy which start with the letter tripartism
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q582577 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tripartism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic policy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tripartism'}}

 Q: What is {work period (end)} and {work period (start)} of {{Nastia Liukin} has {sport} as {female artistic gymnastics}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q230164 p:P641 ?s . ?s ps:P641 wd:Q3122646 . ?s pq:P2032 ?value1 . ?s pq:P2031 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work period (end)', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nastia Liukin', 'p': 'sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sport', 'o': 'female artistic gymnastics'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'work period (start)', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nastia Liukin', 'p': 'sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sport', 'o': 'female artistic gymnastics'}}}]

 Q: What is the {taxon} for {natural product of taxon} of {silk}
 SPARQL:  select distinct ?obj where { wd:Q37681 wdt:P1582 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'silk', 'p': 'natural product of taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What are the castle which start with the letter o
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23413 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ö')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'castle'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ö'}}

 Q: What is the {Roman amphitheatre} for {culture} of {ancient Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2596 wd:Q1747689 . ?sbj wdt:P31 wd:Q7362268 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'culture', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Roman amphitheatre'}}

 Q: What are the academic major which start with the letter T
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4671286 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic major'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is sexually homologous with for ovary ?
 SPARQL: select distinct ?answer where { wd:Q9631 wdt:P4545 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ovary', 'p': 'sexually homologous with', 'o': '?x0'}

 Q: How many {cause of death} are to/by {cricket ball} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P509 wd:Q1139973 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'cause of death', 'o': 'cricket ball'}

 Q: When did residence of Vladimir Putin and owned by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7747 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P127 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owned by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'residence', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'residence', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'residence', 'o': '$y0'}}]

 Q: What spouse did Antonio Banderas take on starting on 1996-5-14?
 SPARQL: SELECT ?obj WHERE { wd:Q41548 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antonio Banderas', 'p': 'spouse', 'o': '?x0', 't': '1996'}

 Q: What is {nomination received} of {David Mitchell}, that has {1st place medalist} is {Kiran Desai} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40479 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q228589}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'David Mitchell', 'p': 'nomination received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': '1st place medalist', 'o': 'Kiran Desai'}}

 Q: What is {tributary} of {on harbour} of {Rarotonga} ?
 SPARQL: SELECT ?answer WHERE { wd:Q471793 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rarotonga', 'p': 'on harbour', 'o': '$y0'}}

 Q: Which is the mineral variety that starts with the letter z?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q429795 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral variety'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What literary genre is the prequel of Alien?
 SPARQL: SELECT ?answer WHERE { wd:Q103569 wdt:P156 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alien', 'p': 'prequel of', 'o': '$y0'}}

 Q: What is the {business} for {owned by} of {My Little Pony}
 SPARQL:  select distinct ?obj where { wd:Q1071312 wdt:P127 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'My Little Pony', 'p': 'owned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is the {monoanion} for {conjugate acid} of {nitric acid}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q83320 . ?sbj wdt:P31 wd:Q55523986 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'nitric acid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monoanion'}}

 Q: What is {alma mater} of {John Sinclair}, that has {parent company of} is {University of Michigan School of Music, Theatre & Dance} ?
 SPARQL: SELECT ?answer WHERE { wd:Q706977 wdt:P69 ?answer . ?answer wdt:P355 wd:Q7895775}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Sinclair', 'p': 'alma mater', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent company of', 'o': 'University of Michigan School of Music, Theatre & Dance'}}

 Q: Which is the award received for constellation?
 SPARQL: select distinct ?answer where { ?answer wdt:P166 wd:Q8928}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'award received', 'o': 'constellation'}

 Q: What is {authors} of {Suicide}, that has {alma mater} is {Leipzig University} ?
 SPARQL: SELECT ?answer WHERE { wd:Q384404 wdt:P50 ?answer . ?answer wdt:P69 wd:Q154804}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Suicide', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alma mater', 'o': 'Leipzig University'}}

 Q: what is the {image} for {Earth} has {radius} as {6339.9} ?
 SPARQL: SELECT ?value WHERE { wd:Q2 p:P2120 ?s . ?s ps:P2120 ?x filter(contains(?x,'6339.9')) . ?s pq:P18 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'image', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Earth', 'p': 'radius', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'radius', 'o': '6339.9'}}}

 Q: What is {continues from} of {developed by} of {HP-UX} ?
 SPARQL: SELECT ?answer WHERE { wd:Q847593 wdt:P178 ?X . ?X wdt:P1365 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continues from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'HP-UX', 'p': 'developed by', 'o': '$y0'}}

 Q: what is the {start time} for {Tina Fey} has {spouse} as {Jeff Richmond} ?
 SPARQL: SELECT ?value WHERE { wd:Q14540 p:P26 ?s . ?s ps:P26 wd:Q641975 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tina Fey', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Jeff Richmond'}}}

 Q: Is it true that sexual intercourse has an effect on abortion?
 SPARQL: ASK WHERE { wd:Q5873 wdt:P1542 wd:Q8452 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'sexual intercourse', 'p': 'effect', 'o': '?x0', '?x0': 'abortion'}]

 Q: What topic of the history of Wales has cities like Caerphilly County Borough as central areas?
 SPARQL: SELECT ?answer WHERE { wd:Q1063608 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q748065}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Wales', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'Caerphilly County Borough'}}

 Q: what is the {start time} for {Bolesław Bierut} has {position held} as {President of Poland} ?
 SPARQL: SELECT ?value WHERE { wd:Q55832 p:P39 ?s . ?s ps:P39 wd:Q1054799 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bolesław Bierut', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Poland'}}}

 Q: When was the part of series of Heroes of Might and Magic III: Armageddon's Blade published on?
 SPARQL: SELECT ?answer WHERE { wd:Q507074 wdt:P179 ?X . ?X wdt:P400 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published on', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Heroes of Might and Magic III: Armageddon's Blade", 'p': 'part of series', 'o': '$y0'}}

 Q: What is the name of a television series that starts with the letter z.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Give me {sausage sandwich} that {parent astronomical body} {Proxima Centauri} and which contains the word {dog} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj wdt:P397 wd:Q14266 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dog')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sausage sandwich', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Proxima Centauri'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dog'}}

 Q: What is {first recorded in} of {location of work} of {Martin Bormann} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76367 wdt:P937 ?X . ?X wdt:P1249 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first recorded in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Ludwig Bormann', 'p': 'location of work', 'o': '$y0'}}

 Q: What is the {family name} for {family} of {Genghis Khan}
 SPARQL:  select distinct ?obj where { wd:Q720 wdt:P53 ?obj . ?obj wdt:P31 wd:Q101352 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genghis Khan', 'p': 'family', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'family name'}}

 Q: Give me {metropolitan area} that {maintained by} {Metropolitan Manila Development Authority} and which contains the word {manila} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1907114 . ?sbj wdt:P126 wd:Q259278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'manila')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolitan area', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'maintained by', 'o': 'Metropolitan Manila Development Authority'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'manila'}}

 Q: What is {papers at} of {music by} of {String Quartet No. 14 (Beethoven)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q188081 wdt:P86 ?X . ?X wdt:P485 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'papers at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'String Quartet No. 14 (Beethoven)', 'p': 'music by', 'o': '$y0'}}

 Q: What is the {conflation} for {product or material produced} of {human}
 SPARQL:  select distinct ?obj where { wd:Q5 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q14946528 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'human', 'p': 'product or material produced', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conflation'}}

 Q: What is {member of sports team} of {Franz Beckenbauer} that is {number of matches played} is {103.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q4457 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'103.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Beckenbauer', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '103.0'}}}

 Q: Which is {sculptor} of {series} {First Responders} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18392016 wdt:P179 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sculptor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'First Responders', 'p': 'series', 'o': '$y0'}}

 Q: What is {in conflict} of {between} of {Battle of Ayta ash-Shab} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2888072 wdt:P710 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of Ayta ash-Shab', 'p': 'between', 'o': '$y0'}}

 Q: What is the maximum vibration of drill model?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23811262 . ?ent wdt:P2806 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'vibration', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'drill model'}}

 Q: Princeton University has how many parent organization?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P749 wd:Q21578 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Princeton University'}

 Q: What is {nominated for} of {Easy Rider} that is {nominee} is {Terry Southern} ?
 SPARQL: SELECT ?obj WHERE { wd:Q503638 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q591270 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Easy Rider', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'Terry Southern'}}}

 Q: What is the natural script for written Ancient Greek?
 SPARQL:  select distinct ?obj where { wd:Q35497 wdt:P282 ?obj . ?obj wdt:P31 wd:Q29517555 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ancient Greek', 'p': 'script', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural script'}}

 Q: What is the signed language of Nicole Oresme that started in 1350?
 SPARQL: SELECT ?answer WHERE { wd:Q310777 wdt:P1412 ?answer . ?answer wdt:P580 ?x FILTER(contains(YEAR(?x),'1350'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nicole Oresme', 'p': 'language', 'o': '?x0', 't': '1350'}

 Q: What was the parent organization of Bayer AG starting in 1925?
 SPARQL: SELECT ?obj WHERE { wd:Q152051 p:P749 ?s . ?s ps:P749 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1925')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bayer', 'p': 'parent organization', 'o': '?x0', 't': '1925'}

 Q: What is the time zone of Hebei, which is the equivalent of China Standard Time?
 SPARQL: SELECT ?answer WHERE { wd:Q21208 wdt:P421 ?answer . ?answer wdt:P460 wd:Q1143153}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hebei', 'p': 'time zone', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'equivalent of', 'o': 'China Standard Time'}}

 Q: When did Honduras have an unemployment rate of 4.0?
 SPARQL: SELECT ?value WHERE { wd:Q783 p:P1198 ?s . ?s ps:P1198 ?x filter(contains(?x,'4.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Honduras', 'p': 'unemployment rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'unemployment rate', 'o': '4.0'}, 't': '?x0'}

 Q: What is {setting location} of {King Kong}, that has {border} is {Westchester County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q309048 wdt:P840 ?answer . ?answer wdt:P47 wd:Q54066}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'King Kong', 'p': 'setting location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Westchester County'}}

 Q: Which is {used for treatment} of {capable of inhibiting or preventing pathological process} of {methenamine hippurate} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27283414 wdt:P2175 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used for treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'methenamine hippurate', 'p': 'capable of inhibiting or preventing pathological process', 'o': '$y0'}}

 Q: Who is the creator of Bart Simpson?
 SPARQL: select distinct ?answer where { wd:Q5480 wdt:P170 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bart Simpson', 'p': 'creator', 'o': '?x0'}

