 Q: what is the {of} for {Wolverine} has {subject has role} as {title character} ?
 SPARQL: SELECT ?value WHERE { wd:Q186422 p:P2868 ?s . ?s ps:P2868 wd:Q3246821 . ?s pq:P642 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wolverine', 'p': 'subject has role', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subject has role', 'o': 'title character'}}}

 Q: What is {inhabitants} of {subtopic of} of {earthquake} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7944 wdt:P1269 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'earthquake', 'p': 'topic of', 'o': '$y0'}}

 Q: Which has parts of the class of baryon?
 SPARQL: select distinct ?answer where { wd:Q159731 wdt:P2670 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'baryon', 'p': 'has parts of the class', 'o': '?x0'}

 Q: Is the Lagangilang electorate equal to 8717?
 SPARQL: ASK WHERE { wd:Q29020 wdt:P1831 ?obj filter(?obj = 8717) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lagangilang', 'p': 'electorate', 'o': '?x0', '?x0': '8717'}

 Q: Name the earthquake that showed a Mercalli scale of IX but had the least magnitude on the Richter scale?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2528 ?obj . ?ent wdt:P2784 wd:Q23925706} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'magnitude', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'earthquake', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Mercalli intensity scale', 'o': 'Mercalli scale IX'}}}

 Q: Which is the Pleiades place type identifier for estuary?
 SPARQL: select distinct ?answer where { wd:Q47053 wdt:P2938 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'estuary', 'p': 'Pleiades place type identifier', 'o': '?x0'}

 Q: What was the last position held by Ariel Sharon on 5th August 1981?
 SPARQL: SELECT ?obj WHERE { wd:Q60206 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ariel Sharon', 'p': 'position held', 'o': '?x0', 't': '1981'}

 Q: What is the Commonwealth realm with the highest number of children out of school?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q202686 . ?ent wdt:P2573 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of out of school children', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Commonwealth realm'}}

 Q: what is the {replaces} for {Tiberius} has {position held} as {Roman emperor} ?
 SPARQL: SELECT ?value WHERE { wd:Q1407 p:P39 ?s . ?s ps:P39 wd:Q842606 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tiberius', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Roman emperor'}}}

 Q: What is {safety classification and labelling} of {cellulose} that is {NFPA Instability} is {0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80294 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P995 ?x filter(contains(?x,'0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'safety classification and labelling', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cellulose', 'p': 'safety classification and labelling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'NFPA Instability', 'o': '0'}}}

 Q: What is <natural reservoir of> of <Pteropodidae> ?
 SPARQL: select distinct ?answer where { wd:Q185230 wdt:P1606 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pteropodidae', 'p': 'natural reservoir of', 'o': '?x0'}

 Q: Which is the Treccani ID for psychiatry?
 SPARQL: select distinct ?answer where { wd:Q7867 wdt:P3365 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'psychiatry', 'p': 'Treccani ID', 'o': '?x0'}

 Q: Which is the German regional key of Hesse?
 SPARQL: select distinct ?answer where { wd:Q1199 wdt:P1388 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hesse', 'p': 'German regional key', 'o': '?x0'}

 Q: Which country replaced Czechoslovakia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1365 wd:Q33946 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced', 'o': 'Czechoslovakia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Who is the {gene} for {genetic association} of {hepatitis C}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2293 wd:Q154869 . ?sbj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'hepatitis C', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: Who gave the {has grammatical person} of {used language} of {Donald Pleasence} ?
 SPARQL: SELECT ?answer WHERE { wd:Q314914 wdt:P1412 ?X . ?X wdt:P5110 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical person', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Pleasence', 'p': 'language', 'o': '$y0'}}

 Q: What is {honors} of {George IV of the United Kingdom}, that has {co-founder} is {Philip the Good} ?
 SPARQL: SELECT ?answer WHERE { wd:Q130586 wdt:P166 ?answer . ?answer wdt:P112 wd:Q239337}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George IV of the United Kingdom', 'p': 'honors', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'co-founder', 'o': 'Philip the Good'}}

 Q: What empire starts with the letter m?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What is the {republic} for {significant event} of {Indian independence movement}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q7270 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Indian independence movement', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic'}}

 Q: Which is the longest span of Humber Bridge?
 SPARQL: select distinct ?answer where { wd:Q1141014 wdt:P2787 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Humber Bridge', 'p': 'longest span', 'o': '?x0'}

 Q: What is {party} of {took part in} of {Sandra Stevens} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7416767 wdt:P1344 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'party', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sandra Stevens', 'p': 'took part', 'o': '$y0'}}

 Q: How many {head of state} are for {Georgia} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q230 wdt:P35 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Georgia', 'p': 'head of state', 'o': '?x0'}

 Q: Which is located in protected area for Loch Lomond?
 SPARQL: select distinct ?answer where { wd:Q208926 wdt:P3018 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Loch Lomond', 'p': 'located in protected area', 'o': '?x0'}

 Q: Is the race time of the 1914 Giro d'Italia less than 584491.2?
 SPARQL: ASK WHERE { wd:Q1086924 wdt:P2781 ?obj filter(?obj < 584491.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': "1914 Giro d'Italia", 'p': 'race time', 'o': '?x0', '?x0': '584491.2'}

 Q: What is the {sovereign state} with the {MAX(total exports)} whose {head of government} is {Viktor Zubkov}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P2135 ?obj . ?ent wdt:P6 wd:Q147425 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total exports', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Viktor Zubkov'}}}

 Q: What is {award received} of {Meryl Streep} that is {for work} is {The Devil Wears Prada} ?
 SPARQL: SELECT ?obj WHERE { wd:Q873 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q223316 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Meryl Streep', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Devil Wears Prada'}}}

 Q: What country was Mercedes McCambridge of Joliet born in?
 SPARQL: SELECT ?value WHERE { wd:Q140017 p:P19 ?s . ?s ps:P19 wd:Q40345 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mercedes McCambridge', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'born in', 'o': 'Joliet'}}}

 Q: what is the {for work} for {Joni Mitchell} has {award received} as {Grammy Award for Best Traditional Pop Vocal Album} ?
 SPARQL: SELECT ?value WHERE { wd:Q205721 p:P166 ?s . ?s ps:P166 wd:Q280481 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joni Mitchell', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Best Traditional Pop Vocal Album'}}}

 Q: What is {major event} of {participant of event} of {Jim Clark} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3137 wdt:P1344 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jim Clark', 'p': 'participant of event', 'o': '$y0'}}

 Q: Give me {country} that {official language} {English} and which that starts with {'z'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6256 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'en'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What award did Holly Hunter receive in 1993?
 SPARQL: SELECT ?obj WHERE { wd:Q105660 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Holly Hunter', 'p': 'award', 'o': '?x0', 't': '1993'}

 Q: What is <Relationship Science organization ID> of <Union of European Football Associations> ?
 SPARQL: select distinct ?answer where { wd:Q35572 wdt:P5181 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Union of European Football Associations', 'p': 'Relationship Science organization ID', 'o': '?x0'}

 Q: What league is the team Ospreys in?
 SPARQL: select distinct ?answer where { wd:Q1518257 wdt:P118 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ospreys', 'p': 'league', 'o': '?x0'}

 Q: Which {kind of music} do {sculptor} {Tikitotmoniki Totems} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18749240 wdt:P170 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kind of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tikitotmoniki Totems', 'p': 'sculptor', 'o': '$y0'}}

 Q: What was the capital of the Muisca Confederation starting in 1450 ?
 SPARQL: SELECT ?obj WHERE { wd:Q5782830 p:P36 ?s . ?s ps:P36 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1450')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Muisca Confederation', 'p': 'capital', 'o': '?x0', 't': '1450'}

 Q: What is {fleet} of {user} of {USAir Flight 5050} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7865889 wdt:P137 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fleet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'USAir Flight 5050', 'p': 'user', 'o': '$y0'}}

 Q: What plays were composed by The Crush Collision March?
 SPARQL: SELECT ?answer WHERE { wd:Q28158040 wdt:P86 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'plays', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Crush Collision March', 'p': 'composed by', 'o': '$y0'}}

 Q: Which skerry has the smallest focal height that is white?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q216851 . ?ent wdt:P2923 ?obj . ?ent wdt:P462 wd:Q23444} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'focal height', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skerry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'color', 'o': 'white'}}}

 Q: What are the airliner which start with the letter eiríksson
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210932 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'eiríksson')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airliner'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'eiríksson'}}

 Q: What is The Numbers movie ID of Easy Rider ?
 SPARQL: select distinct ?answer where { wd:Q503638 wdt:P3808 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Easy Rider', 'p': 'The Numbers movie ID', 'o': '?x0'}

 Q: what is the {statement is subject of} for {Harold Prince} has {award received} as {Tony Award for Best Direction of a Musical} ?
 SPARQL: SELECT ?value WHERE { wd:Q605924 p:P166 ?s . ?s ps:P166 wd:Q377293 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Prince', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Tony Award for Best Direction of a Musical'}}}

 Q: Give the highest attendance of the sports season?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q27020041 . ?ent wdt:P1110 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'attendance', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sports season'}}

 Q: What is {subdivided into} of {deathplace} of {Nikos Kazantzakis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q214622 wdt:P20 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divided into', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nikos Kazantzakis', 'p': 'deathplace', 'o': '$y0'}}

 Q: What is {nominated for} of {Max Steiner} that is {statement is subject of} is {19th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q350704 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917174 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Max Steiner', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '19th Academy Awards'}}}

 Q: Berlin is the official residence to who?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P263 wd:Q64 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'official residence', 'o': 'Berlin'}

 Q: Give me {type of sport} that contains the word {waterskiing} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q31629 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'waterskiing')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of sport'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'waterskiing'}}

 Q: What academic degree does Emmy Noether have and who was the doctoral advisor?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7099 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P184 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmy Noether', 'p': 'academic degree', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmy Noether', 'p': 'academic degree', 'o': '$y0'}}]

 Q: What academic degree did Leopold von Sacher-Masoch achieve in 1854?
 SPARQL: SELECT ?obj WHERE { wd:Q78474 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1854')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leopold von Sacher-Masoch', 'p': 'academic degree', 'o': '?x0', 't': '1854'}

 Q: Which is a medical treatment for cholera?
 SPARQL: select distinct ?answer where { wd:Q12090 wdt:P924 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cholera', 'p': 'treatment', 'o': '?x0'}

 Q: What is the {human} for {different from} of {James Brown}
 SPARQL:  select distinct ?obj where { wd:Q5950 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Brown', 'p': 'different from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {position held} of {Henry V, Holy Roman Emperor} that is {replaced by} is {Lothair III, Holy Roman Emperor} ?
 SPARQL: SELECT ?obj WHERE { wd:Q151707 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q77189 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry V', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Lothair III'}}}

 Q: What is <court> of <Bowers v. Hardwick> ?
 SPARQL: select distinct ?answer where { wd:Q2907274 wdt:P4884 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bowers v. Hardwick', 'p': 'court', 'o': '?x0'}

 Q: Which sister city of Vladivostok has a Wikivoyage banner "Manila Banner.jpg"?
 SPARQL: SELECT ?answer WHERE { wd:Q959 wdt:P190 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Manila Banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vladivostok', 'p': 'sister city', 'o': '?x0'}

 Q: tel me war deity worshipped by religion of ancient Egypt  starts with w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41863069 . ?sbj wdt:P1049 wd:Q447131 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'war deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': 'religion of ancient Egypt'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {television series} for {cast member} of {Burt Reynolds}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P161 wd:Q202148 . ?sbj wdt:P31 wd:Q5398426 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Burt Reynolds', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}}

 Q: When did the Central Bohemian Region reach a population of 1.3 million?
 SPARQL: SELECT ?value WHERE { wd:Q188399 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.3153e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Central Bohemian Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.3153e+06'}, 't': '?x0'}

 Q: What is <Member of the Hellenic Parliament ID> of <Mikis Theodorakis> ?
 SPARQL: select distinct ?answer where { wd:Q151976 wdt:P2278 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mikis Theodorakis', 'p': 'Member of the Hellenic Parliament ID', 'o': '?x0'}

 Q: What is {published by} of {on the tracklist of} of {Thickness-dependent leakage current of (polyvinylidene fluoride/lead titanate) pyroelectric detectors.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51829315 wdt:P1433 ?X . ?X wdt:P123 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thickness-dependent leakage current of (polyvinylidene fluoride/lead titanate) pyroelectric detectors.', 'p': 'on the tracklist of', 'o': '$y0'}}

 Q: What is the location in or next to body of water and time zone of Nice?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q33959 wdt:P206 ?ans_1 . wd:Q33959 wdt:P421 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Nice', 'p': 'body of water', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Nice', 'p': 'time zone', 'o': '?x1'}]

 Q: Is the prisoner count for the Auschwitz concentration camp 152000?
 SPARQL: ASK WHERE { wd:Q7341 wdt:P5630 ?obj filter(?obj = 152000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Auschwitz', 'p': 'prisoner count', 'o': '?x0', '?x0': '152000'}

 Q: When was Frederick William I of Prussia's child Louisa Ulrika of Prussia's date of birth and death?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q234251 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Louisa Ulrika of Prussia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Louisa Ulrika of Prussia'}}}]

 Q: Was Isis married to Osiris and Min?
 SPARQL: ASK WHERE { wd:Q79876 wdt:P26 wd:Q46491 . wd:Q79876 wdt:P26 wd:Q192322 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Isis', 'p': 'married to', 'o': '?x0', '?x0': 'Osiris'}, {'h': 'IS', 'v': '?x1', 's': 'Isis', 'p': 'married to', 'o': '?x1', '?x1': 'Min'}]

 Q: What is the country of Abkhazia whose statement is disputed by Russia?
 SPARQL: SELECT ?obj WHERE { wd:Q23334 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P1310 wd:Q159 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abkhazia', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'disputed by', 'o': 'Russia'}}}

 Q: What is {academic degree} of {Bernhard Riemann} that is {conferred by} is {University of Göttingen} ?
 SPARQL: SELECT ?obj WHERE { wd:Q42299 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P1027 wd:Q152838 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernhard Riemann', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'conferred by', 'o': 'University of Göttingen'}}}

 Q: What is <L'île author ID> of <Yann Martel> ?
 SPARQL: select distinct ?answer where { wd:Q13914 wdt:P5532 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yann Martel', 'p': "L'île author ID", 'o': '?x0'}

 Q: What role did Aberdeen play when it was a part of the regional government Grampian?
 SPARQL: SELECT ?value WHERE { wd:Q36405 p:P131 ?s . ?s ps:P131 wd:Q1542364 . ?s pq:P3831 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aberdeen', 'p': 'region', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'region', 'o': 'Grampian'}}}

 Q: What is the {ethnoreligious group} for {country} of {Golden Horde}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q79965 . ?sbj wdt:P31 wd:Q11197007 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Golden Horde', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnoreligious group'}}

 Q: What is <minimal lethal dose> of <acetone> ?
 SPARQL: select distinct ?answer where { wd:Q49546 wdt:P2300 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'acetone', 'p': 'minimal lethal dose', 'o': '?x0'}

 Q: What award did Umberto Eco receive in 2001?
 SPARQL: SELECT ?obj WHERE { wd:Q12807 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Umberto Eco', 'p': 'award', 'o': '?x0', 't': '2001'}

 Q: Which wiki with script conversion has the largest data size?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q36509592 . ?ent wdt:P3575 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'data size', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'wiki with script conversion'}}

 Q: How many {country} are to/by {Chile} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P17 wd:Q298 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Chile'}

 Q: Show me provincial or territorial capital city in Canada that starts with y.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21507383 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'provincial or territorial capital city in Canada'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is {border} of {Georgia}, that has {timezone} is {UTC−06:00} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1428 wdt:P47 ?answer . ?answer wdt:P421 wd:Q5385}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Georgia', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timezone', 'o': 'UTC−06:00'}}

 Q: Which religious affiliation of Qara Khitai is under the domain of Buddhist studies?
 SPARQL: SELECT ?answer WHERE { wd:Q862304 wdt:P140 ?answer . ?answer wdt:P2579 wd:Q1000976}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Qara Khitai', 'p': 'religious affiliation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'domain', 'o': 'Buddhist studies'}}

 Q: What is the {scalar physical quantity} for {measured physical quantity} of {electronvolt}
 SPARQL:  select distinct ?obj where { wd:Q83327 wdt:P111 ?obj . ?obj wdt:P31 wd:Q181175 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'electronvolt', 'p': 'measured physical quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scalar'}}

 Q: What is an historical period that starts with the letter v.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical period'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {antonym of} of {DRTL} of {back} ?
 SPARQL: SELECT ?answer WHERE { wd:Q133279 wdt:P654 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'back', 'p': 'DRTL', 'o': '$y0'}}

 Q: What is the category for employees of the organization and the member of of Yale_University ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q49112 wdt:P4195 ?ans_1 . wd:Q49112 wdt:P463 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Yale', 'p': 'category for employees of the organization', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Yale', 'p': 'member of', 'o': '?x1'}]

 Q: Which civilisation of Norse mythology had theatre seasons on Viking Age?
 SPARQL: SELECT ?answer WHERE { wd:Q128285 wdt:P2596 ?answer . ?answer wdt:P2348 wd:Q213649}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Norse mythology', 'p': 'civilisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'theatre season', 'o': 'Viking Age'}}

 Q: Name a alternative version of Gospel of Matthew
 SPARQL:  select distinct ?obj where { wd:Q392302 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gospel of Matthew', 'p': 'version', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version'}}

 Q: What is the {world view} for {opposite of} of {atheism}
 SPARQL:  select distinct ?obj where { wd:Q7066 wdt:P461 ?obj . ?obj wdt:P31 wd:Q49447 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'atheism', 'p': 'opposite of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'world view'}}

 Q: What is the Wikidata time precision for a decade?
 SPARQL: select distinct ?answer where { wd:Q39911 wdt:P2803 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'decade', 'p': 'Wikidata time precision', 'o': '?x0'}

 Q: What is {found in species} of {physically interacts with} of {acetylcholine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q180623 wdt:P129 ?X . ?X wdt:P703 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'found in species', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'acetylcholine', 'p': 'physically interacts with', 'o': '$y0'}}

 Q: How many {family} are to/by {Julio-Claudian dynasty} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P53 wd:Q192841 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'family', 'o': 'Julio-Claudian dynasty'}

 Q: What is {award received} of {Tim Berners-Lee} that is {point in time} is {2010-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tim Berners-Lee', 'p': 'award', 'o': '?x0', 't': '2010'}

 Q: Which naval artillery has the most effective firing range?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q511450 . ?ent wdt:P4176 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'effective firing range', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'naval artillery'}}

 Q: what is the {point in time} for {Gianni Rodari} has {award received} as {Hans Christian Andersen Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q193018 p:P166 ?s . ?s ps:P166 wd:Q327154 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gianni Rodari', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Hans Christian Andersen Award'}, 't': '?x0'}

 Q: Where were the birthplaces of Nawab Bai's children?
 SPARQL: SELECT ?answer WHERE { wd:Q6982746 wdt:P40 ?X . ?X wdt:P19 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthplace', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nawab Bai', 'p': 'child', 'o': '$y0'}}

 Q: What is field of exercise of publishing house has  Rock 'N' Roll Comics ?
 SPARQL: SELECT ?answer WHERE { wd:Q20874879 wdt:P123 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of exercise', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Rock 'N' Roll Comics", 'p': 'publishing house', 'o': '$y0'}}

 Q: What is {position held} of {Benedetto Croce} that is {start time} is {1946-6-25} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192348 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Benedetto Croce', 'p': 'position held', 'o': '?x0', 't': '1946'}

 Q: Which is the agglutinative language for the official language of Achaemenid Empire?
 SPARQL:  select distinct ?obj where { wd:Q389688 wdt:P37 ?obj . ?obj wdt:P31 wd:Q171263 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Achaemenid Empire', 'p': 'official language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'agglutinative language'}}

