 Q: Give me {empire} that {coat of arms} {royal coat of arms of the United Kingdom} and which contains the word {british} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P237 wd:Q165762 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'british')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coat of arms', 'o': 'royal coat of arms of the United Kingdom'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'british'}}

 Q: What is the instance of Antonio da Correggio whose date of birth is 1489-8-1?
 SPARQL: SELECT ?value WHERE { wd:Q8457 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1489')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antonio da Correggio', 'p': 'date of birth', 'o': '$y0'}}

 Q: What is {teacher of} of {supervisor} of {Shigeno Yasutsugu} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6533159 wdt:P1066 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'teacher of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shigeno Yasutsugu', 'p': 'teacher', 'o': '$y0'}}

 Q: What is the {business} for {employer} of {Alexander McQueen}
 SPARQL:  select distinct ?obj where { wd:Q207939 wdt:P108 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexander McQueen', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: Tell me the Greek deity of sibling of Zeus and that contains the word poseidon in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj wdt:P3373 wd:Q34201 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'poseidon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greek deity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Zeus'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'poseidon'}}

 Q: What is {digitiser} of {series} of {Ultima III: Exodus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2240236 wdt:P179 ?X . ?X wdt:P479 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'digitiser', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ultima III: Exodus', 'p': 'series', 'o': '$y0'}}

 Q: What is the {human} for {performer} of {Deadpool}
 SPARQL:  select distinct ?obj where { wd:Q1631090 wdt:P175 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Deadpool', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {musical duo} for {contributed to published work} of {Sasha Grey}
 SPARQL:  select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q9212979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sasha Grey', 'p': 'contributed to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical duo'}}

 Q: What award did John de Mol receive in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q470847 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John de Mol', 'p': 'award', 'o': '?x0', 't': '2011'}

 Q: Is the total fertility rate of Algeria greater than 3.4284?
 SPARQL: ASK WHERE { wd:Q262 wdt:P4841 ?obj filter(?obj > 3.4284) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Algeria', 'p': 'total fertility rate', 'o': '?x0', '?x0': '3.4284'}

 Q: What is {pressure} and {temperature} of {{water} has {phase point} as {triple point}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P2076 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'water', 'p': 'phase point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase point', 'o': 'triple point'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'temperature', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'water', 'p': 'phase point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase point', 'o': 'triple point'}}}]

 Q: Tell me physical phenomenon whose name has the word surface in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'surface')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical phenomenon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'surface'}}

 Q: What is {residence} of {Vladimir Putin} and {area}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7747 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P2046 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'residence', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'residence', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'residence', 'o': '$y0'}}]

 Q: Which is the municipality of Belgium that has the headquarters location of European Union?
 SPARQL:  select distinct ?obj where { wd:Q458 wdt:P159 ?obj . ?obj wdt:P31 wd:Q493522 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'European Union', 'p': 'headquarters location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Belgium'}}

 Q: Which is made from the goat meat having a common name as Domestic Goat?
 SPARQL: SELECT ?answer WHERE { wd:Q449506 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Domestic Goat'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'goat meat', 'p': 'made from', 'o': '?x0'}

 Q: What is <located on terrain feature> of <Multnomah Falls> ?
 SPARQL: select distinct ?answer where { wd:Q37319 wdt:P706 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Multnomah Falls', 'p': 'location', 'o': '?x0'}

 Q: What is the {battle} for {commanded by} of {Stonewall Jackson}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4791 wd:Q216124 . ?sbj wdt:P31 wd:Q178561 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commanded by', 'o': 'Stonewall Jackson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'battle'}}

 Q: which is the point time for syria has population as 8.08815e+06?
 SPARQL: SELECT ?value WHERE { wd:Q858 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'8.08815e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'sy', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '8.08815e+06'}, 't': '?x0'}

 Q: Did {Marketing} {facet of} {human communication} and {packaging and labeling} ?
 SPARQL: ASK WHERE { wd:Q39809 wdt:P1269 wd:Q1066689 . wd:Q39809 wdt:P1269 wd:Q207822 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'marketing', 'p': 'facet of', 'o': '?x0', '?x0': 'human communication'}, {'h': 'IS', 'v': '?x1', 's': 'marketing', 'p': 'facet of', 'o': '?x1', '?x1': 'packaging and labeling'}]

 Q: What is the {stage race} with the {MAX(frequency of event)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1318941 . ?ent wdt:P2257 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'frequency of event', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stage race'}}

 Q: What is <Austrian municipality key> of <Klagenfurt> ?
 SPARQL: select distinct ?answer where { wd:Q41753 wdt:P964 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Klagenfurt', 'p': 'Austrian municipality key', 'o': '?x0'}

 Q: Tell me the autonomous region of the People's Republic of China which contains the word xinjiang in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xinjiang')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': "autonomous region of the People's Republic of China"}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'xinjiang'}}

 Q: What is the Velká pardubická with the lowest race time whose winner is Peter Gehm?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P1346 wd:Q12044712} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'race time', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Velká pardubická', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Peter Gehm'}}}

 Q: Who is the author of the Watchmen and what award did they receive?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q128444 wdt:P166 ?ans_1 . wd:Q128444 wdt:P50 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Watchmen', 'p': 'award', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Watchmen', 'p': 'author', 'o': '?x1'}]

 Q: What is the {human settlement} for {patron saint} of {Joseph}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q128267 . ?sbj wdt:P31 wd:Q486972 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Joseph', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human settlement'}}

 Q: What is the {book} for {language of work or name} of {Esperanto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q143 . ?sbj wdt:P31 wd:Q571 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Esperanto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book'}}

 Q: What is the general manager of Bernard Hinault?
 SPARQL: select distinct ?answer where { ?answer wdt:P505 wd:Q109255}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'general manager', 'o': 'Bernard Hinault'}

 Q: Name the FSK 12 rated 3D film with the highest cost ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q229390 . ?ent wdt:P2130 ?obj . ?ent wdt:P1981 wd:Q20644796 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'cost', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': '3D film', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'FSK film rating', 'o': 'FSK 12'}}}

 Q: How many are interested in Daniel Dennett?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q215263 wdt:P2650 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Daniel Dennett', 'p': 'interested in', 'o': '?x0'}

 Q: What is {coordinate location} of {Rhine} that is {applies to part} is {river source} ?
 SPARQL: SELECT ?obj WHERE { wd:Q584 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rhine', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river source'}}}

 Q: What is {nominated for} of {Cate Blanchett} that is {for work} is {I'm Not There} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80966 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q816772 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cate Blanchett', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "I'm Not There"}}}

 Q: Give me {tower} that {depicted by} {Tower of Babel} and which contains the word {babel} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12518 . ?sbj wdt:P1299 wd:Q2899725 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'babel')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tower', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'depicted by', 'o': 'Tower of Babel'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'babel'}}

 Q: What is {elected in} and {end cause} of {{Harold Macmillan} has {position held} as {Member of the 34th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582587 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 34th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 34th Parliament of the United Kingdom'}}}]

 Q: is the maximum wavelength of sensitivity of the human eye equal to 700?
 SPARQL: ASK WHERE { wd:Q430024 wdt:P3737 ?obj filter(?obj = 700) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'human eye', 'p': 'maximum wavelength of sensitivity', 'o': '?x0', '?x0': '700'}

 Q: what is the {followed by} for {Mo Yan} has {award received} as {Nobel Prize in Literature} ?
 SPARQL: SELECT ?value WHERE { wd:Q8998 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P156 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mo Yan', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Literature'}}}

 Q: When did Eiji Toyoda win an award for his work in Order of Prince Henry?
 SPARQL: SELECT ?value WHERE { wd:Q1141740 p:P166 ?s . ?s ps:P166 wd:Q93488 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Eiji Toyoda', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of Prince Henry'}, 't': '?x0'}

 Q: What is {start time} and {end time} of {{Jimmy Wales} has {employer} as {Bomis}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q181 p:P108 ?s . ?s ps:P108 wd:Q935818 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jimmy Wales', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Bomis'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jimmy Wales', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Bomis'}}}]

 Q: Which is the author of afterword of Erich Fromm?
 SPARQL: select distinct ?answer where { ?answer wdt:P2680 wd:Q57085}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author of afterword', 'o': 'Erich Fromm'}

 Q: Who are worked for Michelle Wolf and its source location of group/organisation is located in New York City?
 SPARQL: SELECT ?answer WHERE { wd:Q23883085 wdt:P108 ?answer . ?answer wdt:P740 wd:Q60}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michelle Wolf', 'p': 'worked for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'source location of group/organisation', 'o': 'New York City'}}

 Q: What are the unit of measurement which start with the letter visus
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47574 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'visus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of measurement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'visus'}}

 Q: what was the publication date for iTunes which has software version as 12.7.5?
 SPARQL: SELECT ?value WHERE { wd:Q9589 p:P348 ?s . ?s ps:P348 ?x filter(contains(?x,'12.7.5')) . ?s pq:P577 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'iTunes', 'p': 'version', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'version', 'o': '12.7.5'}}}

 Q: What is the {structured programming language} for {designed by} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q28920117 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'structured programming language'}}

 Q: what is the {object has role} for {Mickey Mouse} has {contributor(s) to the creative work} as {Ben Sharpsteen} ?
 SPARQL: SELECT ?value WHERE { wd:Q11934 p:P767 ?s . ?s ps:P767 wd:Q2549739 . ?s pq:P3831 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mickey Mouse', 'p': 'contributor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'contributor', 'o': 'Ben Sharpsteen'}}}

 Q: What is the stock exchange for the ticker symbol 0700 in Tencent?
 SPARQL: SELECT ?obj WHERE { wd:Q860580 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'0700')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stock exchange', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tencent', 'p': 'stock exchange', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ticker symbol', 'o': '0700'}}}

 Q: What are the head of state and the office held by head of state of the Soviet Union?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q15180 wdt:P35 ?ans_1 . wd:Q15180 wdt:P1906 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Soviet Union', 'p': 'head of state', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Soviet Union', 'p': 'office held by head of state', 'o': '?x1'}]

 Q: What is the {international organization} for {parent organization} of {International Court of Justice}
 SPARQL:  select distinct ?obj where { wd:Q7801 wdt:P749 ?obj . ?obj wdt:P31 wd:Q484652 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'International Court of Justice', 'p': 'parent organization', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international organization'}}

 Q: what is the {start time} for {Sarajevo} has {twinned administrative body} as {Serre Chevalier} ?
 SPARQL: SELECT ?value WHERE { wd:Q11194 p:P190 ?s . ?s ps:P190 wd:Q2274046 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'beginning', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sarajevo', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Serre Chevalier'}}}

 Q: What significant event in 1978-6-1 is Michelle Bachelet known for?
 SPARQL: SELECT ?obj WHERE { wd:Q320 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michelle Bachelet', 'p': 'significant event', 'o': '?x0', 't': '1978'}

 Q: What is {solubility} of {methyl chloride} that is {solvent} is {water} ?
 SPARQL: SELECT ?obj WHERE { wd:Q422709 p:P2177 ?s . ?s ps:P2177 ?obj . ?s pq:P2178 wd:Q283 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'solubility', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'methyl chloride', 'p': 'solubility', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'solvent', 'o': 'water'}}}

 Q: What is {coordinate location} of {Delaware River} that is {applies to part} is {river source} ?
 SPARQL: SELECT ?obj WHERE { wd:Q143762 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Delaware River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river source'}}}

 Q: What is the ionization energy of the nicotine?
 SPARQL: select distinct ?answer where { wd:Q12144 wdt:P2260 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'nicotine', 'p': 'ionization energy', 'o': '?x0'}

 Q: What is <prevalence> of <tuberculosis> ?
 SPARQL: select distinct ?answer where { wd:Q12204 wdt:P1193 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tuberculosis', 'p': 'prevalence', 'o': '?x0'}

 Q: Who is {creators} of {language of the original work} {Star Trek Into Darkness} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171711 wdt:P364 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'creator', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Trek Into Darkness', 'p': 'language of the original work', 'o': '$y0'}}

 Q: What is {spouse} of {Aaliyah} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q11617 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aaliyah', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aaliyah', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is the {university building} for {affiliation} of {Columbia University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49088 . ?sbj wdt:P31 wd:Q19844914 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliation', 'o': 'Columbia University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university building'}}

 Q: What is {occupation} and {field of work} of {{Bram Stoker} has {employer} as {Dublin Castle}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 wd:Q742767 . ?s pq:P106 ?value1 . ?s pq:P101 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'occupation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bram Stoker', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Dublin Castle'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'field of work', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bram Stoker', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'Dublin Castle'}}}]

 Q: What is {ordinal number} of {season begins} of {Handball-Bundesliga} ?
 SPARQL: SELECT ?answer WHERE { wd:Q175762 wdt:P4794 ?X . ?X wdt:P1545 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Handball-Bundesliga', 'p': 'season begins', 'o': '$y0'}}

 Q: "What is place of residence of Wangari Maathai,that has inflation rate of consumer price index as 2.9?"
 SPARQL: SELECT ?answer WHERE { wd:Q46795 wdt:P551 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'2.9'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maathai', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '2.9'}}

 Q: Who is the child of Pompey and the mother, Mucia Tertia?
 SPARQL: SELECT ?obj WHERE { wd:Q125414 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q273616 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pompey', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'mother', 'o': 'Mucia Tertia'}}}

 Q: Give me {alcoholic beverage} that {fabrication method} {fermentation} and which contains the word {rum} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q154 . ?sbj wdt:P2079 wd:Q41760 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rum')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alcoholic beverage', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'fermentation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'rum'}}

 Q: How many terminus are in Vienna
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P559 wd:Q1741 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'terminus', 'o': 'Vienna'}

 Q: What is in the region of Paroo River, that divides into Ku-ring-gai Council?
 SPARQL: SELECT ?answer WHERE { wd:Q1628056 wdt:P131 ?answer . ?answer wdt:P150 wd:Q133642}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paroo River', 'p': 'is in the region of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divides into', 'o': 'Ku-ring-gai Council'}}

 Q: What is {twinned administrative body} of {Changchun} that is {start time} is {1992-8-25} ?
 SPARQL: SELECT ?obj WHERE { wd:Q92161 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Changchun', 'p': 'twinned administrative body', 'o': '?x0', 't': '1992'}

 Q: How many {lakes on river} are to/by {Lake Urmia} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P469 wd:Q199551 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'lakes on river', 'o': 'Lake Urmia'}

 Q: Tell me soil type whose name has the word vertisol in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10926413 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vertisol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'soil type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vertisol'}}

 Q: What is { award received } from { Justin Timberlake } that is { point in time } is { 2007 - 0 - 0 }?
 SPARQL: SELECT ?obj WHERE { wd:Q43432 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Justin Timberlake', 'p': 'award received', 'o': '?x0', 't': '2007'}

 Q: Which religious concept starts with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious concept'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Is it true that the explosive energy equivalent of Father of All Bombs is less than 52.8?
 SPARQL: ASK WHERE { wd:Q1049487 wdt:P2145 ?obj filter(?obj < 52.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Father of All Bombs', 'p': 'explosive energy equivalent', 'o': '?x0', '?x0': '52.8'}

 Q: Does the Becherovka alcohol by volume less than 30.4
 SPARQL: ASK WHERE { wd:Q742408 wdt:P2665 ?obj filter(?obj < 30.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Becherovka', 'p': 'alcohol by volume', 'o': '?x0', '?x0': '30.4'}

 Q: What are the prefecture-level city  which start with the letter ürümqi
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748149 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ürümqi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'prefecture-level city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ürümqi'}}

 Q: tell me ceremony whose name has the word umhlanga in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'umhlanga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ceremony'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'umhlanga'}}

 Q: What is {played by} of {symbol} of {inequality} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28113351 wdt:P913 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'inequality', 'p': 'symbol', 'o': '$y0'}}

 Q: What is edition runtime for League of Legends?
 SPARQL: SELECT ?answer WHERE { wd:Q223341 wdt:P400 ?X . ?X wdt:P747 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'edition', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'League of Legends', 'p': 'runtime', 'o': '$y0'}}

 Q: What is the name of the Dutch municipal coat of arms of Amsterdam?
 SPARQL:  select distinct ?obj where { wd:Q727 wdt:P237 ?obj . ?obj wdt:P31 wd:Q28147344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amsterdam', 'p': 'coat of arms', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Dutch municipal coat of arms'}}

 Q: What is the {sauce} for {country of origin} of {Korea}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q178359 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'Korea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sauce'}}

 Q: Which is the electric charge for antihydrogen?
 SPARQL: select distinct ?answer where { wd:Q216121 wdt:P2200 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'antihydrogen', 'p': 'electric charge', 'o': '?x0'}

 Q: Who gave the {is shown in} of {based upon} of {Clark Kent} ?
 SPARQL: SELECT ?answer WHERE { wd:Q774772 wdt:P144 ?X . ?X wdt:P1441 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is shown in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clark Kent', 'p': 'based upon', 'o': '$y0'}}

 Q: How many {direction relative to location} are to/by {west} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P654 wd:Q679 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'direction relative to location', 'o': 'west'}

 Q: Tell me national association football team whose name has the word team in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national association football team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'team'}}

 Q: What is the warheroes.ru ID for Yuri Gagarin?
 SPARQL: select distinct ?answer where { wd:Q7327 wdt:P2943 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yuri Gagarin', 'p': 'warheroes.ru ID', 'o': '?x0'}

 Q: Is the diameter pf nickel equal to 0.807?
 SPARQL: ASK WHERE { wd:Q238498 wdt:P2386 ?obj filter(?obj = 0.807) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'nickel', 'p': 'diameter', 'o': '?x0', '?x0': '0.807'}

 Q: Is the stated age of Rolf-Axel Eberhardt greater than 52?
 SPARQL: ASK WHERE { wd:Q50334841 wdt:P3629 ?obj filter(?obj > 52.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Rolf-Axel Eberhardt', 'p': 'age at event', 'o': '?x0', '?x0': '52.0'}

