 Q: What is {deity of} of {kami}, that has {has influence} is {koshintō} ?
 SPARQL: SELECT ?answer WHERE { wd:Q524158 wdt:P1049 ?answer . ?answer wdt:P737 wd:Q3096508}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'kami', 'p': 'deity of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has influence', 'o': 'koshintō'}}

 Q: How many {noble title} are for {Louis the Pious} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q43974 wdt:P97 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '?x0'}

 Q: What is WeRelate person ID of William Pitt, 1st Earl of Chatham ?
 SPARQL: select distinct ?answer where { wd:Q208663 wdt:P4159 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'William Pitt, 1st Earl of Chatham', 'p': 'WeRelate person ID', 'o': '?x0'}

 Q: What is name of the higher taxon of Medicago sativa whose vernacular name is אספסת?
 SPARQL: SELECT ?answer WHERE { wd:Q156106 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'אספסת'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Medicago sativa', 'p': 'higher taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': 'אספסת'}}

 Q: What is the {owner of} and the {home venue} of {Los_Angeles_Lakers} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q121783 wdt:P1830 ?ans_1 . wd:Q121783 wdt:P115 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Los Angeles Lakers', 'p': 'owner of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Los Angeles Lakers', 'p': 'home venue', 'o': '?x1'}]

 Q: What is the {public office} for {office held by head of government} of {Lahore}
 SPARQL:  select distinct ?obj where { wd:Q11739 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q294414 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lahore', 'p': 'office held by head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public office'}}

 Q: What is {follows} and {followed by} of {{Charlemagne} has {noble title} as {king of Lombards}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P97 ?s . ?s ps:P97 wd:Q22997793 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Lombards'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Lombards'}}}]

 Q: Does 1 E2 has a lower limit equal to 100?
 SPARQL: ASK WHERE { wd:Q13012283 wdt:P5447 ?obj filter(?obj = 100) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '1 E2', 'p': 'lower limit', 'o': '?x0', '?x0': '100'}

 Q: Did {Hypertension} {drug used for treatment} {labetalol} and {piretanide} ?
 SPARQL: ASK WHERE { wd:Q41861 wdt:P2176 wd:Q958087 . wd:Q41861 wdt:P2176 wd:Q3905617 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'hypertension', 'p': 'used for treatment', 'o': '?x0', '?x0': 'labetalol'}, {'h': 'IS', 'v': '?x1', 's': 'hypertension', 'p': 'used for treatment', 'o': '?x1', '?x1': 'piretanide'}]

 Q: Which is the Cinema Treasures ID for Canadian Museum of History>=?
 SPARQL: select distinct ?answer where { wd:Q1032269 wdt:P4129 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Canadian Museum of History', 'p': 'Cinema Treasures ID', 'o': '?x0'}

 Q: How many {occupant} are to/by {New York Yankees} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q213417 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'occupant', 'o': 'New York Yankees'}

 Q: What is {location of narrative} of {Raging Bull}, that has {divided into} is {Washtenaw County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q220780 wdt:P840 ?answer . ?answer wdt:P150 wd:Q137916}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Raging Bull', 'p': 'location of narrative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Washtenaw County'}}

 Q: Did {William_the_Conqueror} {owner of} {Tower of London} and {Windsor} ?
 SPARQL: ASK WHERE { wd:Q37594 wdt:P1830 wd:Q62378 . wd:Q37594 wdt:P1830 wd:Q464955 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'William the Conqueror', 'p': 'owner of', 'o': '?x0', '?x0': 'Tower of London'}, {'h': 'IS', 'v': '?x1', 's': 'William the Conqueror', 'p': 'owner of', 'o': '?x1', '?x1': 'Windsor'}]

 Q: What version of bitcoin software was published 11-1-2016?
 SPARQL: SELECT ?obj WHERE { wd:Q131723 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'bitcoin', 'p': 'version', 'o': '?x0', 't': '2016'}

 Q: When was the graduate of Konstantin Balmont constructed?
 SPARQL: SELECT ?answer WHERE { wd:Q314498 wdt:P69 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constructed', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Konstantin Balmont', 'p': 'graduate of', 'o': '$y0'}}

 Q: tell  me literary genre union of list values as qualifiers  starts with f
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj wdt:P2737 wd:Q23766486 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'union of', 'o': 'list values as qualifiers'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: What is the {historical country} for {culture} of {Rome}
 SPARQL:  select distinct ?obj where { wd:Q220 wdt:P2596 ?obj . ?obj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rome', 'p': 'culture', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Who is creator Criss Angel?
 SPARQL: select distinct ?answer where { ?answer wdt:P170 wd:Q131685}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'creator', 'o': 'Criss Angel'}

 Q: Which is the British Museum thesaurus ID for mineral?
 SPARQL: select distinct ?answer where { wd:Q7946 wdt:P3632 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mineral', 'p': 'British Museum thesaurus ID', 'o': '?x0'}

 Q: Which is the Encyclopædia Universalis ID of John Singer Sargent?
 SPARQL: select distinct ?answer where { wd:Q155626 wdt:P3219 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Singer Sargent', 'p': 'Encyclopædia Universalis ID', 'o': '?x0'}

 Q: What are the Hindu scriptures and texts which start with the letter b that is translated by Franklin Edgerton
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194040 . ?sbj wdt:P655 wd:Q16002981 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Hindu scriptures and texts', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'translated by', 'o': 'Franklin Edgerton'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: What is {operated by} of {railway line} of {36th Street} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4635783 wdt:P81 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '36th Street', 'p': 'railway line', 'o': '$y0'}}

 Q: What is {inflation rate of consumer price index} of {aspect of} of {history of Chad} ?
 SPARQL: SELECT ?answer WHERE { wd:Q754192 wdt:P1269 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Chad', 'p': 'aspect of', 'o': '$y0'}}

 Q: Who was the spouse of Catherine of Medici in 1533?
 SPARQL: SELECT ?obj WHERE { wd:Q131552 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1533')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Catherine of Medici', 'p': 'spouse', 'o': '?x0', 't': '1533'}

 Q: When did Charles Aznavour receive the award for Officer of the National Order of Quebec?
 SPARQL: SELECT ?value WHERE { wd:Q1785 p:P166 ?s . ?s ps:P166 wd:Q15464524 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Charles Aznavour', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Officer of the National Order of Quebec'}, 't': '?x0'}

 Q: What is {elected in} and {end cause} of {{David Trimble} has {position held} as {Member of the 1st Northern Ireland Assembly}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q192556 p:P39 ?s . ?s ps:P39 wd:Q37303731 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Trimble', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 1st Northern Ireland Assembly'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Trimble', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 1st Northern Ireland Assembly'}}}]

 Q: Who is {students} of {painters} {Elisabeth Vilhelmine Juel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50872419 wdt:P170 ?X . ?X wdt:P802 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'student', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Elisabeth Vilhelmine Juel', 'p': 'painter', 'o': '$y0'}}

 Q: What is canonization status of the saint  ?
 SPARQL: select distinct ?answer where { ?answer wdt:P411 wd:Q43115}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'canonization status', 'o': 'saint'}

 Q: What is the battery of the plane that has causes of eating?
 SPARQL: SELECT ?answer WHERE { wd:Q204260 wdt:P618 ?answer . ?answer wdt:P828 wd:Q213449}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'plane', 'p': 'battery', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cause', 'o': 'eating'}}

 Q: What is <USA Gymnastics athlete ID> of <Gabby Douglas> ?
 SPARQL: select distinct ?answer where { wd:Q233286 wdt:P3671 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gabby Douglas', 'p': 'USA Gymnastics athlete ID', 'o': '?x0'}

 Q: Name a part of a plant that contain the word "veil " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20011319 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veil')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'part of a plant'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'veil'}}

 Q: What is {works for} of {incumbent} of {Chief Official White House Photographer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28955826 wdt:P1308 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'works for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chief Official White House Photographer', 'p': 'incumbent', 'o': '$y0'}}

 Q: What are the stratus which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q40526 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stratus'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: How many {medical examinations} are for {liver cirrhosis} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q147778 wdt:P923 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'cirrhosis of the liver', 'p': 'medical examinations', 'o': '?x0'}

 Q: Was Coldplay's genre rock music?
 SPARQL: ASK WHERE { wd:Q45188 wdt:P136 wd:Q11399 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Coldplay', 'p': 'genre', 'o': '?x0', '?x0': 'rock music'}]

 Q: What was the population of Taraz in 1989?
 SPARQL: SELECT ?obj WHERE { wd:Q486545 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Taraz', 'p': 'population', 'o': '?x0', 't': '1989'}

 Q: Is it true that the sublimation temperature of starch is equal to 410?
 SPARQL: ASK WHERE { wd:Q41534 wdt:P2113 ?obj filter(?obj = 410) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'starch', 'p': 'sublimation temperature', 'o': '?x0', '?x0': '410'}

 Q: What is the number of out of school children of the continent of Kagera River ?
 SPARQL: SELECT ?answer WHERE { wd:Q2750140 wdt:P30 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kagera River', 'p': 'continent', 'o': '$y0'}}

 Q: What is in the administrative unit of Imo State, specifically the one who's capital city is Lagos?
 SPARQL: SELECT ?answer WHERE { wd:Q842939 wdt:P131 ?answer . ?answer wdt:P36 wd:Q8673}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Imo State', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Lagos'}}

 Q: Which is the coat of arms for the coat of arms of Valencia?
 SPARQL:  select distinct ?obj where { wd:Q8818 wdt:P237 ?obj . ?obj wdt:P31 wd:Q14659 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Valencia', 'p': 'coat of arms', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'coat of arms'}}

 Q: What is {educated at} of {James Heckman} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q312561 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Heckman', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Heckman', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is {titleholder} of {awards received} of {Gene Wolfe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q361149 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'titleholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gene Wolfe', 'p': 'awards', 'o': '$y0'}}

 Q: What are the coordinates for the location of the Limpopo river source?
 SPARQL: SELECT ?obj WHERE { wd:Q173017 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Limpopo', 'p': 'coordinates', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for', 'o': 'river source'}}}

 Q: Who are the carries for the Confederation Bridge?
 SPARQL: select distinct ?answer where { wd:Q865076 wdt:P2505 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Confederation Bridge', 'p': 'carries', 'o': '?x0'}

 Q: What county seat of N'Djamena contains the villages of the Kanem Region?
 SPARQL: SELECT ?answer WHERE { wd:Q3659 wdt:P1376 ?answer . ?answer wdt:P150 wd:Q849841}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "N'Djamena", 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'contains', 'o': 'Kanem Region'}}

 Q: What is {end time} and {start time} of {{Kim Novak} has {spouse} as {Richard Johnson}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q212879 p:P26 ?s . ?s ps:P26 wd:Q166422 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kim Novak', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Richard Johnson'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kim Novak', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Richard Johnson'}}}]

 Q: What is {inventory number} of {Liberty Leading the People} that is {collection} is {Department of Paintings of the Louvre} ?
 SPARQL: SELECT ?obj WHERE { wd:Q29530 p:P217 ?s . ?s ps:P217 ?obj . ?s pq:P195 wd:Q3044768 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inventory number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Liberty Leading the People', 'p': 'inventory number', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'collection', 'o': 'Department of Paintings of the Louvre'}}}

 Q: Is it true that the Gini coefficient of Tunisia equals to 36.1?
 SPARQL: ASK WHERE { wd:Q948 wdt:P1125 ?obj filter(?obj = 36.1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tunisia', 'p': 'Gini coefficient', 'o': '?x0', '?x0': '36.1'}

 Q: What are the animated series that executive producer Ken Keeler and which contains the word futurama in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q581714 . ?sbj wdt:P1431 wd:Q1339527 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'futurama')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated series', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'executive producer', 'o': 'Ken Keeler'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'futurama'}}

 Q: Mayor John Purroy Mitchel is the mayor of what place which is also the deathplace of William Magear Tweed?
 SPARQL: SELECT ?answer WHERE { wd:Q1353450 wdt:P20 ?answer . ?answer wdt:P6 wd:Q3182321}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Magear Tweed', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mayor', 'o': 'John Purroy Mitchel'}}

 Q: Is the Alexa rank of Wolfram Alpha less than 1290.4?
 SPARQL: ASK WHERE { wd:Q207006 wdt:P1661 ?obj filter(?obj < 1290.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Wolfram Alpha', 'p': 'Alexa rank', 'o': '?x0', '?x0': '1290.4'}

 Q: What is the {people} for {indigenous to} of {Norwegian}
 SPARQL:  select distinct ?obj where { wd:Q9043 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q2472587 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'no', 'p': 'indigenous to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: Is it true that the stroke of the SNCF 232.P.1 equals 255?
 SPARQL: ASK WHERE { wd:Q2815068 wdt:P2557 ?obj filter(?obj = 255) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'SNCF 232.P.1', 'p': 'stroke', 'o': '?x0', '?x0': '255'}

 Q: Did {Jerry_Heller} {military branch} {United States Army}?
 SPARQL: ASK WHERE { wd:Q2748625 wdt:P241 wd:Q9212 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jerry Heller', 'p': 'military branch', 'o': '?x0', '?x0': 'U.S. Army'}]

 Q: What GSRR rating did World of Warcraft get?
 SPARQL: select distinct ?answer where { wd:Q131007 wdt:P916 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'World of Warcraft', 'p': 'GSRR rating', 'o': '?x0'}

 Q: tell  me document that editor National Constituent Assembly  starts withc
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'document', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'editor', 'o': 'National Constituent Assembly'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: What is {is in the region of} of {Zealand}, that has {state headed by} is {Christopher of Bavaria} ?
 SPARQL: SELECT ?answer WHERE { wd:Q25535 wdt:P131 ?answer . ?answer wdt:P35 wd:Q58056}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zealand', 'p': 'region', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'state headed by', 'o': 'Christopher of Bavaria'}}

 Q: What is {diplomatic relation} of {Mexico} that is {statement is subject of} is {Holy See–Mexico relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q96 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q5886105 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mexico', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Holy See–Mexico relations'}}}

 Q: what is the {series ordinal} for {Montserrat Caballé i Folch} has {given name} as {María de Montserrat} ?
 SPARQL: SELECT ?value WHERE { wd:Q151435 p:P735 ?s . ?s ps:P735 wd:Q47487249 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montserrat Caballé', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'María de Montserrat'}}}

 Q: what is the {start time} for {Philipp Kirkorov} has {educated at} as {Gnessin Russian Academy of Music} ?
 SPARQL: SELECT ?value WHERE { wd:Q494596 p:P69 ?s . ?s ps:P69 wd:Q372040 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philipp Kirkorov', 'p': 'education', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'education', 'o': 'Gnessin Russian Academy of Music'}}}

 Q: What is the {human} for {place of birth} of {Monterrey}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P19 wd:Q81033 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Monterrey', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {award received} of {8½} that is {winner} is {Piero Gherardi} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12018 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q506734 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '8 1/2', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'winner', 'o': 'Piero Gherardi'}}}

 Q: what is the {nature of statement} for {Tacitus} has {student of} as {Quintilian} ?
 SPARQL: SELECT ?value WHERE { wd:Q2161 p:P1066 ?s . ?s ps:P1066 wd:Q193769 . ?s pq:P5102 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nature of statement', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tacitus', 'p': 'student of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'student of', 'o': 'Quintilian'}}}

 Q: What is {etymology} of {lynching}, that has {born at} is {Colony of Virginia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q486775 wdt:P138 ?answer . ?answer wdt:P19 wd:Q1070529}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'lynching', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born at', 'o': 'Colony of Virginia'}}

 Q: What is the HDI of the city of Ceuta?
 SPARQL: SELECT ?answer WHERE { wd:Q5823 wdt:P131 ?answer . ?answer wdt:P1081 ?x FILTER(contains(?x,'0.803'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ceuta', 'p': 'city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'HDI', 'o': '0.803'}}

 Q: What is {musician} of {sequel of} of {I Will Be Here} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5979779 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musician', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'I Will Be Here', 'p': 'sequel of', 'o': '$y0'}}

 Q: When Tsung-Dao Lee was award Nobel Prize in Physics?
 SPARQL: SELECT ?value WHERE { wd:Q183679 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tsung-Dao Lee', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Nobel Prize in Physics'}, 't': '?x0'}

 Q: What is the {human} with the {MIN(time in space)} whose {country of citizenship} is {United States of America}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2873 ?obj . ?ent wdt:P27 wd:Q30} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'time in space', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'America'}}}

 Q: What are feature film which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'feature film'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which is the Shironet song ID of O Captain! My Captain!?
 SPARQL: select distinct ?answer where { wd:Q2008338 wdt:P4035 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'O Captain! My Captain!', 'p': 'Shironet song ID', 'o': '?x0'}

 Q: Tell me atmospheric electricity whose name has the word ball in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427085 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ball')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'atmospheric electricity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ball'}}

 Q: Which bridge did Isambard Kingdom Brunel engineer?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P631 wd:Q207380 . ?sbj wdt:P31 wd:Q12280 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'engineer', 'o': 'Isambard Kingdom Brunel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bridge'}}

 Q: What is established by the Rurik dynasty that has been born in Europe?
 SPARQL: SELECT ?answer WHERE { wd:Q210398 wdt:P112 ?answer . ?answer wdt:P19 wd:Q46}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rurik dynasty', 'p': 'established by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Europe'}}

 Q: what is the {point in time} for {Bryan Adams} has {nominated for} as {Juno Award for Single of the Year} ?
 SPARQL: SELECT ?value WHERE { wd:Q482907 p:P1411 ?s . ?s ps:P1411 wd:Q6314103 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Bryan Adams', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Juno Award for Single of the Year'}, 't': '?x0'}

 Q: What is the {open content} for {programming language} of {PHP}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P277 wd:Q59 . ?sbj wdt:P31 wd:Q1293664 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'programming language', 'o': 'PHP', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'open content'}}

 Q: What is the {symbol of the European Union} for {anthem} of {European Union}
 SPARQL:  select distinct ?obj where { wd:Q458 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23774077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'EU', 'p': 'anthem', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'symbol of the European Union'}}

 Q: what is the {point in time} for {Julian Barnes} has {nominated for} as {Man Booker Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q295431 p:P1411 ?s . ?s ps:P1411 wd:Q160082 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Julian Barnes', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Booker Prize'}, 't': '?x0'}

 Q: What is the {human} for {student} of {John the Baptist}
 SPARQL:  select distinct ?obj where { wd:Q40662 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John the Baptist', 'p': 'student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Name a uninformed search that uses graph that starts with letter F
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4443425 . ?sbj wdt:P2283 wd:Q2479726 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'uninformed search', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'graph'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: what is the {end time} for {Sasha Grey} has {member of} as {aTelecine} ?
 SPARQL: SELECT ?value WHERE { wd:Q2709 p:P463 ?s . ?s ps:P463 wd:Q4033106 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sasha Grey', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'aTelecine'}}}

 Q: what is the start time for Rashi has residence as Worms ?
 SPARQL: SELECT ?value WHERE { wd:Q26456 p:P551 ?s . ?s ps:P551 wd:Q3852 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rashi', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Worms'}}}

 Q: What is {inhabitants} of {place of origin} of {The Fresh Prince of Bel-Air} ?
 SPARQL: SELECT ?answer WHERE { wd:Q309063 wdt:P495 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Fresh Prince of Bel-Air', 'p': 'place of origin', 'o': '$y0'}}

 Q: What is Hepatitis health specialty and medical examinations?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q131742 wdt:P923 ?ans_1 . wd:Q131742 wdt:P1995 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hepatitis', 'p': 'medical examinations', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hepatitis', 'p': 'health specialty', 'o': '?x1'}]

 Q: What is the programming language used for JavaScript?
 SPARQL: select distinct ?answer where { ?answer wdt:P277 wd:Q2005}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'programming language', 'o': 'JavaScript'}

 Q: Whichs {house} of {characters} of {Benvenuto Cellini} ?
 SPARQL: SELECT ?answer WHERE { wd:Q277846 wdt:P674 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'house', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benvenuto Cellini', 'p': 'characters', 'o': '$y0'}}

 Q: Which taxon has the highest frequency of audible sound?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3465 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum frequency of audible sound', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: Tell me studio album whose name has the word wolf in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208569 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolf')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'studio album'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wolf'}}

