 Q: what is honorific prefix for John Chrysostom?
 SPARQL: select distinct ?answer where { wd:Q43706 wdt:P511 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Chrysostom', 'p': 'honorific prefix', 'o': '?x0'}

 Q: What is the {member of} and the {student of} of {Quincy_Jones} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q193645 wdt:P463 ?ans_1 . wd:Q193645 wdt:P1066 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Q', 'p': 'member of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Q', 'p': 'student of', 'o': '?x1'}]

 Q: Who is the manager of Josh Taves's team?
 SPARQL: SELECT ?answer WHERE { wd:Q6289430 wdt:P54 ?X . ?X wdt:P286 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manager', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josh Taves', 'p': 'team', 'o': '$y0'}}

 Q: What is <La Vie des idées ID> of <Thomas Piketty> ?
 SPARQL: select distinct ?answer where { wd:Q984448 wdt:P5550 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thomas Piketty', 'p': 'La Vie des idées ID', 'o': '?x0'}

 Q: What is the {painting} for {commissioned by} of {Catholic Church}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P88 wd:Q9592 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'Catholic Church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: what is the {for work} for {Kendrick Lamar} has {nominated for} as {BET Award for Best Collaboration} ?
 SPARQL: SELECT ?value WHERE { wd:Q130798 p:P1411 ?s . ?s ps:P1411 wd:Q4835467 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kendrick Lamar', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'BET Award for Best Collaboration'}}}

 Q: Which is the record or record progression for decathlon?
 SPARQL: select distinct ?answer where { wd:Q184654 wdt:P2869 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'decathlon', 'p': 'record or record progression', 'o': '?x0'}

 Q: What is <RPO poet ID> of <Bessie Smith> ?
 SPARQL: select distinct ?answer where { wd:Q93349 wdt:P5478 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bessie Smith', 'p': 'RPO poet ID', 'o': '?x0'}

 Q: What is the etymology of the Cooper pair that has a Nobel Prize in Physics nomination received?
 SPARQL: SELECT ?answer WHERE { wd:Q620057 wdt:P138 ?answer . ?answer wdt:P1411 wd:Q38104}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cooper pair', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'nomination received', 'o': 'Nobel Prize in Physics'}}

 Q: Who has superpartner of muon?
 SPARQL: select distinct ?answer where { wd:Q3151 wdt:P2375 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'muon', 'p': 'has superpartner', 'o': '?x0'}

 Q: What is {user} of {shape} of {conical Asian hat} ?
 SPARQL: SELECT ?answer WHERE { wd:Q526863 wdt:P1419 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'user', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'conical Asian hat', 'p': 'shape', 'o': '$y0'}}

 Q: what is the {character role} for {Beverly Hills, 90210} has {cast member} as {James Pickens} ?
 SPARQL: SELECT ?value WHERE { wd:Q117590 p:P161 ?s . ?s ps:P161 wd:Q39965 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'character role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Beverly Hills, 90210', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'James Pickens'}}}

 Q: What is the {human} for {field of work} of {psychoanalysis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P101 wd:Q41630 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'field of work', 'o': 'psychoanalysis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is Google+ ID for Federal Communications Commission?
 SPARQL: select distinct ?answer where { wd:Q128831 wdt:P2847 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Federal Communications Commission', 'p': 'Google+ ID', 'o': '?x0'}

 Q: Is the max capacity of the FAT32 2576980376.4?
 SPARQL: ASK WHERE { wd:Q2622047 wdt:P3559 ?obj filter(?obj = 2576980376.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'FAT32', 'p': 'maximum size or capacity', 'o': '?x0', '?x0': '2576980376.4'}

 Q: What is the {enterprise} for {manager/director} of {Alan Sugar}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1037 wd:Q336520 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manager', 'o': 'Alan Sugar', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What is the name of a market structure that starts with the letter o.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q877707 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'market structure'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: Which is commissioned by Sears?
 SPARQL: select distinct ?answer where { ?answer wdt:P88 wd:Q6499202}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'Sears'}

 Q: Who gave the {head office location} of {graduated from} of {Lisa Harriton} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2994135 wdt:P69 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'head office location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lisa Harriton', 'p': 'graduated from', 'o': '$y0'}}

 Q: What is the {human} for {doctoral student} of {J. Robert Oppenheimer}
 SPARQL:  select distinct ?obj where { wd:Q132537 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Oppenheimer', 'p': 'doctoral student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Does Santa Monica's tax revenue equal 44142068.6
 SPARQL: ASK WHERE { wd:Q28958 wdt:P3087 ?obj filter(?obj = 44142068.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Santa Monica', 'p': 'fiscal/tax revenue', 'o': '?x0', '?x0': '44142068.6'}

 Q: Which business is owned by the Empire State Building?
 SPARQL:  select distinct ?obj where { wd:Q9188 wdt:P127 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire State Building', 'p': 'owned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is <via> of <Río de la Plata> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2825 wd:Q35827}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'via', 'o': 'Río de la Plata'}

 Q: What is {ITU-T country identifier} of {country of jurisdiction} of {Bush v. Gore} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2065434 wdt:P1001 ?X . ?X wdt:P2258 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ITU-T country identifier', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bush v. Gore', 'p': 'jurisdiction', 'o': '$y0'}}

 Q: What is {position held} of {Peter Fraser} that is {replaced by} is {Walter Nash} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1400226 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q721770 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Fraser', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Walter Nash'}}}

 Q: Where was Jon Jones born in 1803-0-0.
 SPARQL: SELECT ?answer WHERE { wd:Q285450 wdt:P19 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1803'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jon Jones', 'p': 'born in', 'o': '?x0', 't': '1803'}

 Q: What is <Ramsar Sites Information Service ID> of <Lake Chapala> ?
 SPARQL: select distinct ?answer where { wd:Q318350 wdt:P2525 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Chapala', 'p': 'Ramsar Sites Information Service ID', 'o': '?x0'}

 Q: What record label released the albums of Eminem ?
 SPARQL:  select distinct ?obj where { wd:Q5608 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eminem', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record label'}}

 Q: What is <sublimation temperature> of <graphite> ?
 SPARQL: select distinct ?answer where { wd:Q5309 wdt:P2113 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'graphite', 'p': 'sublimation temperature', 'o': '?x0'}

 Q: What is zenith of range for East Lake ?
 SPARQL: SELECT ?answer WHERE { wd:Q28656991 wdt:P4552 ?X . ?X wdt:P610 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zenith', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'East Lake', 'p': 'range', 'o': '$y0'}}

 Q: Is 8.8 the slope of the El Dorado Speedway?
 SPARQL: ASK WHERE { wd:Q16559802 wdt:P4184 ?obj filter(?obj = 8.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'El Dorado Speedway', 'p': 'slope', 'o': '?x0', '?x0': '8.8'}

 Q: What is {champ} of {nomination received} of {Arthur Hunnicutt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q709942 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Hunnicutt', 'p': 'nomination received', 'o': '$y0'}}

 Q: What is coordinate location of Mekong River that is applies to part of river mouth ?
 SPARQL: SELECT ?obj WHERE { wd:Q41179 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mekong River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river mouth'}}}

 Q: How many {legislated by} are to/by {Tokugawa shogunate} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P467 wd:Q205662 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'legislated by', 'o': 'Tokugawa shogunate'}

 Q: Give me {national association football team} that {head coach} {Tite} and which contains the word {brazil} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj wdt:P286 wd:Q40652 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'brazil')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national association football team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coach', 'o': 'Tite'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'brazil'}}

 Q: What is {papers at} of {songwriter} of {Symphony No. 3} ?
 SPARQL: SELECT ?answer WHERE { wd:Q157489 wdt:P86 ?X . ?X wdt:P485 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'papers at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Symphony No. 3', 'p': 'songwriter', 'o': '$y0'}}

 Q: What is The Baseball Cube player ID of Honus Wagner?
 SPARQL: select distinct ?answer where { wd:Q1316903 wdt:P4731 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Honus Wagner', 'p': 'The Baseball Cube player ID', 'o': '?x0'}

 Q: What is the {business} for {manager/director} of {Alan Sugar}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1037 wd:Q336520 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'boss', 'o': 'Alan Sugar', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: who won by of honorary title of P. H. Newby ?
 SPARQL: SELECT ?answer WHERE { wd:Q531194 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'won by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'P. H. Newby', 'p': 'honorary title', 'o': '$y0'}}

 Q: What is {position held} of {Alexander VI} that is {start time} is {1483-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q108316 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1483')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alexander VI', 'p': 'position held', 'o': '?x0', 't': '1483'}

 Q: What is {first name} of {James Hargreaves}, that has {same} is {Yakub} ?
 SPARQL: SELECT ?answer WHERE { wd:Q140696 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4537101}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'James Hargreaves', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same', 'o': 'Yakub'}}

 Q: What is the mean lifetime of a neutron?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q2348 wdt:P2645 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'neutron', 'p': 'mean lifetime', 'o': '?x0'}

 Q: IS THE ROTATION PERIOD OF 15 EUNOMIA IS GREATER THAN 7.2996
 SPARQL: ASK WHERE { wd:Q107528 wdt:P2147 ?obj filter(?obj > 7.2996) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '15 Eunomia', 'p': 'rotation period', 'o': '?x0', '?x0': '7.2996'}

 Q: What is the name of the project affiliated with Harvard University?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q13371 . ?sbj wdt:P31 wd:Q170584 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliated with', 'o': 'Harvard University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'project'}}

 Q: What is the birthplace of the son of Louis IX of France?
 SPARQL: SELECT ?answer WHERE { wd:Q346 wdt:P40 ?X . ?X wdt:P19 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthplace', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'son', 'o': '$y0'}}

 Q: what is the {end time} for {Philip II of France} has {spouse} as {Isabella of Hainault} ?
 SPARQL: SELECT ?value WHERE { wd:Q34428 p:P26 ?s . ?s ps:P26 wd:Q230050 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divorced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philip II of France', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Isabella of Hainault'}}}

 Q: what is the {point in time} for {Marc Chagall} has {award received} as {Erasmus Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q93284 p:P166 ?s . ?s ps:P166 wd:Q974780 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Marc Chagall', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Erasmus Prize'}, 't': '?x0'}

 Q: What is the {Abrahamic religion} for {practiced by} of {Jewish people}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3095 wd:Q7325 . ?sbj wdt:P31 wd:Q47280 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'Jewish people', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Abrahamic religion'}}

 Q: which sect starts with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19097 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sect'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Did {William_Henry_Harrison} {position held} {Governor of Indiana} and {United States senator} ?
 SPARQL: ASK WHERE { wd:Q11869 wdt:P39 wd:Q16147601 . wd:Q11869 wdt:P39 wd:Q13217683 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'William Henry Harrison', 'p': 'position held', 'o': '?x0', '?x0': 'Governor of Indiana'}, {'h': 'IS', 'v': '?x1', 's': 'William Henry Harrison', 'p': 'position held', 'o': '?x1', '?x1': 'United States senator'}]

 Q: What is capable of inhibiting or preventing pathological process of treated by  bleeding ?
 SPARQL: SELECT ?answer WHERE { wd:Q166019 wdt:P2176 ?X . ?X wdt:P2175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capable of inhibiting or preventing pathological process', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'bleeding', 'p': 'treated by', 'o': '$y0'}}

 Q: What town is the Walmart headquarters located at 702 Southwest 8th St?
 SPARQL: SELECT ?obj WHERE { wd:Q483551 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter(contains(?x,'702 Southwest 8th ST')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Walmart', 'p': 'headquarters', 'o': '?x0'}

 Q: What is {location of work} of {Arturo Toscanini}, that has {has counties} is {Staten Island} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13003 wdt:P937 ?answer . ?answer wdt:P150 wd:Q18432}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arturo Toscanini', 'p': 'work location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has counties', 'o': 'Staten Island'}}

 Q: Who is the {book} for {author} of {Cheryl Strayed}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q5092780 . ?sbj wdt:P31 wd:Q571 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Cheryl Strayed', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book'}}

 Q: What are the programming language implementation that contains the word yarv in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4117406 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yarv')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'programming language implementation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yarv'}}

 Q: Name a magazine article published in Rolling Stone.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q30070590 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'Rolling Stone', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine article'}}

 Q: What is the {film character} for {sibling} of {Wonder Woman}
 SPARQL:  select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q15773347 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wonder Woman', 'p': 'sibling', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character'}}

 Q: What are the baseball teams that start with the letter A
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13027888 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'á')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'baseball team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'á'}}

 Q: What is the child astronomical body of Tau Ceti?
 SPARQL: select distinct ?answer where { wd:Q15820 wdt:P398 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tau Ceti', 'p': 'child astronomical body', 'o': '?x0'}

 Q: Is the shear strength of the thread-locking fluid less than .6?
 SPARQL: ASK WHERE { wd:Q2249485 wdt:P5706 ?obj filter(?obj < 0.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'thread-locking fluid', 'p': 'shear strength', 'o': '?x0', '?x0': '0.6'}

 Q: Is the conversion to standard unit of the minute equal to .01666667?
 SPARQL: ASK WHERE { wd:Q7727 wdt:P2442 ?obj filter(?obj = 0.01666667) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'minute', 'p': 'conversion to standard unit', 'o': '?x0', '?x0': '0.01666667'}

 Q: What is {profession} of {Abū Ḥanīfa Dīnawarī}, that has {field of this profession} is {botany} ?
 SPARQL: SELECT ?answer WHERE { wd:Q293520 wdt:P106 ?answer . ?answer wdt:P425 wd:Q441}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Abū Ḥanīfa Dīnawarī', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'field of this profession', 'o': 'botany'}}

 Q: Which is the bicameral legislature for the legislative body of the Kingdom of Great Britain?
 SPARQL:  select distinct ?obj where { wd:Q161885 wdt:P194 ?obj . ?obj wdt:P31 wd:Q189445 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Great Britain', 'p': 'legislative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bicameral legislature'}}

 Q: What is {using} of {sports} of {Team England} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7691477 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'using', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Team England', 'p': 'sport', 'o': '$y0'}}

 Q: Did {Will_Smith} {award received} {Grammy Award for Best Rap Performance by a Duo or Group}?
 SPARQL: ASK WHERE { wd:Q40096 wdt:P166 wd:Q4809486 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Will Smith', 'p': 'award received', 'o': '?x0', '?x0': 'Grammy Award for Best Rap Performance by a Duo or Group'}]

 Q: Which essential medicine has the most surface tension?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q35456 . ?ent wdt:P3013 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'surface tension', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essential medicine'}}

 Q: What is {partner} of {Rose McGowan} that is {end time} is {2009-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q211040 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rose McGowan', 'p': 'partner', 'o': '?x0', 't': '2009'}

 Q: Which is the birth place of Robert Rayford with abbreviation as
 SPARQL: SELECT ?answer WHERE { wd:Q288055 wdt:P19 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'ארה"ב'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Robert Rayford', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'abbreviation', 'o': 'ארה"ב'}}

 Q: What infectious disease has had the most cases?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q18123741 . ?ent wdt:P1603 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of cases', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'infectious disease'}}

 Q: When did significant event of Nicholas II of Russia and place of marriage?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q40787 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P2842 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nicholas II of Russia', 'p': 'significant event', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'significant event', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nicholas II of Russia', 'p': 'significant event', 'o': '$y0'}}]

 Q: Is Dirk Nowitzki a relative of Martin Olsson and Marcus Olsson?
 SPARQL: ASK WHERE { wd:Q44068 wdt:P1038 wd:Q312935 . wd:Q44068 wdt:P1038 wd:Q1374528 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Dirk Nowitzki', 'p': 'relative', 'o': '?x0', '?x0': 'Martin Olsson'}, {'h': 'IS', 'v': '?x1', 's': 'Dirk Nowitzki', 'p': 'relative', 'o': '?x1', '?x1': 'Marcus Olsson'}]

 Q: Which {tributary} is {outlet} of {Amazon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3783 wdt:P403 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amazon', 'p': 'outlet', 'o': '$y0'}}

 Q: what is the {for work} for {Marlon Brando} has {nominated for} as {Academy Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q34012 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marlon Brando', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}}}

 Q: What is the shape of penis whose domain is geometry?
 SPARQL: SELECT ?answer WHERE { wd:Q58 wdt:P1419 ?answer . ?answer wdt:P2579 wd:Q8087}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'penis', 'p': 'shape', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'domain', 'o': 'geometry'}}

 Q: What is the {single entity of population} for {capital of} of {Seville}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1376 wd:Q8717 . ?sbj wdt:P31 wd:Q3055118 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital of', 'o': 'Seville', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single entity of population'}}

 Q: What is <Paris Faculty of Letters professor ID (1809-1908)> of <Émile Durkheim> ?
 SPARQL: select distinct ?answer where { wd:Q15948 wdt:P5545 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Émile Durkheim', 'p': 'Paris Faculty of Letters professor ID (1809-1908)', 'o': '?x0'}

 Q: What political catch phrase used in the United States of America which applies to jurisdiction starts with the letter d?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3377406 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political catch phrase', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'United States of America'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is an ethnic conflict that begins with the letter w?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q766875 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic conflict'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which is the production statistics of Champagne?
 SPARQL: select distinct ?answer where { ?answer wdt:P2746 wd:Q134862}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'production statistics', 'o': 'Champagne'}

 Q: Is the minimum age at which education is compulsory in Brazil equal to 8.4?
 SPARQL: ASK WHERE { wd:Q155 wdt:P3270 ?obj filter(?obj = 8.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Brazil', 'p': 'compulsory education (minimum age)', 'o': '?x0', '?x0': '8.4'}

 Q: Which is the IPNI publication ID for American Journal of Botany?
 SPARQL: select distinct ?answer where { wd:Q2664693 wdt:P2008 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American Journal of Botany', 'p': 'IPNI publication ID', 'o': '?x0'}

 Q: What is the Digital Rights Management system of Madden NFL?
 SPARQL: select distinct ?answer where { wd:Q1883234 wdt:P1032 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Madden NFL', 'p': 'Digital Rights Management system', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Tim Cahill} has {member of sports team} as {Millwall F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q187238 p:P54 ?s . ?s ps:P54 wd:Q19487 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tim Cahill', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Millwall F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tim Cahill', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Millwall F.C.'}}}]

 Q: How many {member of} are for {United Arab Emirates} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q878 wdt:P463 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'United Arab Emirates', 'p': 'member of', 'o': '?x0'}

 Q: who is the Christian chapel for patron saint of Anthony of Padua?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q167477 . ?sbj wdt:P31 wd:Q108325 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Anthony of Padua', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chapel'}}

 Q: Which charitable organization is McGill University affiliated with?
 SPARQL:  select distinct ?obj where { wd:Q201492 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q708676 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'McGill University', 'p': 'affiliated with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'charitable organization'}}

 Q: Give me {alphabet} that {based on} {Proto-Sinaitic script} and which contains the word {alphabet} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9779 . ?sbj wdt:P144 wd:Q1065250 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'alphabet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alphabet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'Proto-Sinaitic script'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'alphabet'}}

 Q: Where is University of Colorado Boulder's administrative territorial entity?
 SPARQL: select distinct ?answer where { wd:Q736674 wdt:P131 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Colorado Boulder', 'p': 'in', 'o': '?x0'}

 Q: What is Guardian topic id of Ryan Giggs?
 SPARQL: select distinct ?answer where { wd:Q10524 wdt:P3106 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryan Giggs', 'p': 'Guardian', 'o': '?x0'}

 Q: Which is the incarnation of Shiva?
 SPARQL: select distinct ?answer where { ?answer wdt:P3701 wd:Q11378}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'incarnation of', 'o': 'Shiva'}

 Q: What is <work period (end)> of <Joan Crawford> ?
 SPARQL: select distinct ?answer where { wd:Q40475 wdt:P2032 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joan Crawford', 'p': 'work period (end)', 'o': '?x0'}

 Q: What is the {umbrella organization} for {allegiance} of {Abu Musab al-Zarqawir}
 SPARQL:  select distinct ?obj where { wd:Q181049 wdt:P945 ?obj . ?obj wdt:P31 wd:Q1156831 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Abu Musab al-Zarqawi', 'p': 'allegiance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'umbrella organization'}}

 Q: How many {operator} are to/by {Greenpeace} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P137 wd:Q81307 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Greenpeace'}

 Q: what is the {nominee} for {Saving Private Ryan} has {nominated for} as {Academy Award for Best Sound Mixing} ?
 SPARQL: SELECT ?value WHERE { wd:Q165817 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saving Private Ryan', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Sound'}}}

 Q: Does the LOHAS park station have less than 2.4 number of platform faces
 SPARQL: ASK WHERE { wd:Q718069 wdt:P5595 ?obj filter(?obj < 2.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'LOHAS Park station', 'p': 'number of platform faces', 'o': '?x0', '?x0': '2.4'}

