 Q: Give me {particle radiation} that contains the word {cosmic} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cosmic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'particle radiation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cosmic'}}

 Q: Give me {Cyprinus rubrofuscus} that contains the word {koi} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'koi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Cyprinus rubrofuscus'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'koi'}}

 Q: Which is the period The Great Gatsby was set in?
 SPARQL: select distinct ?answer where { wd:Q214371 wdt:P2408 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Great Gatsby', 'p': 'period', 'o': '?x0'}

 Q: what is the {end time} for {Ana Kasparian} has {educated at} as {California State University, Northridge} ?
 SPARQL: SELECT ?value WHERE { wd:Q19661 p:P69 ?s . ?s ps:P69 wd:Q1026939 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ana Kasparian', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'California State University, Northridge'}}}

 Q: What is the {television series episode} for {series} of {The X-Files}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21191270 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'The X-Files', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series episode'}}

 Q: Who is The X-Files' creator and executive producer?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P170 ?ans_1 . wd:Q2744 wdt:P1431 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The X-Files', 'p': 'creator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The X-Files', 'p': 'executive producer', 'o': '?x1'}]

 Q: On December 31, 2012, what were Nokia's total assets?
 SPARQL: SELECT ?obj WHERE { wd:Q1418 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nokia', 'p': 'total assets', 'o': '?x0', 't': '2012'}

 Q: Where was Louise Bourgeois completed education in the year 1938?
 SPARQL: SELECT ?obj WHERE { wd:Q159409 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1938')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Louise Bourgeois', 'p': 'education', 'o': '?x0', 't': '1938'}

 Q: What is {official language} of {Vantaa} that is {object has role} is {minority language} ?
 SPARQL: SELECT ?obj WHERE { wd:Q127623 p:P37 ?s . ?s ps:P37 ?obj . ?s pq:P3831 wd:Q61566 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vantaa', 'p': 'official language', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'object has role', 'o': 'minority language'}}}

 Q: What is {known for} of {scriptwriter} of {Barefoot Gen: Explosion of Tears} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16164415 wdt:P58 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'known for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barefoot Gen: Explosion of Tears', 'p': 'scriptwriter', 'o': '$y0'}}

 Q: what is the {replaced by} for {Clovis I} has {position held} as {king of Franks} ?
 SPARQL: SELECT ?value WHERE { wd:Q82339 p:P39 ?s . ?s ps:P39 wd:Q22923081 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clovis I', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'king of Franks'}}}

 Q: Which is the sign language for the signed form of Esperanto?
 SPARQL:  select distinct ?obj where { wd:Q143 wdt:P3969 ?obj . ?obj wdt:P31 wd:Q34228 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'signed form', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sign language'}}

 Q: Which detached object has the highest mean of anomalies?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2449475 . ?ent wdt:P2325 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'mean anomaly', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'detached object'}}

 Q: What is {admin HQ} of {alma mater} of {Victor Hugo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q535 wdt:P69 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'HQ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'alma mater', 'o': '$y0'}}

 Q: What is Northern England's total imports?
 SPARQL: select distinct ?answer where { wd:Q1788657 wdt:P2136 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Northern England', 'p': 'total imports', 'o': '?x0'}

 Q: Tell me Mahavidya whose name has the word tara in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Mahavidya'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tara'}}

 Q: What is <magnetic moment> of <electron> ?
 SPARQL: select distinct ?answer where { wd:Q2225 wdt:P2069 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'electron', 'p': 'magnetic moment', 'o': '?x0'}

 Q: Which is the mathematical formula of the shape of the cooling tower?
 SPARQL: SELECT ?answer WHERE { wd:Q193886 wdt:P1419 ?X . ?X wdt:P2534 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formula', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cooling tower', 'p': 'shape', 'o': '$y0'}}

 Q: Which {musical instrument} of {musician}  is used on {A Theme from The Threepenny Opera} ?
 SPARQL: SELECT ?answer WHERE { wd:Q51801055 wdt:P175 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'A Theme from The Threepenny Opera', 'p': 'musician', 'o': '$y0'}}

 Q: Which is the FIPS 55-3 (locations in the US) of Fresno?
 SPARQL: select distinct ?answer where { wd:Q43301 wdt:P774 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Fresno', 'p': 'FIPS 55-3 (locations in the US)', 'o': '?x0'}

 Q: Which is the automobile model that is manufactured by Honda?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q9584 . ?sbj wdt:P31 wd:Q3231690 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufactured by', 'o': 'Honda', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'automobile model'}}

 Q: Did {Michael_Jordan} {wears} {jewellery}?
 SPARQL: ASK WHERE { wd:Q41421 wdt:P3828 wd:Q161439 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Michael Jordan', 'p': 'wears', 'o': '?x0', '?x0': 'jewellery'}]

 Q: what is the {start time} for {Andrei Mironov} has {spouse} as {Yekaterina Gradova} ?
 SPARQL: SELECT ?value WHERE { wd:Q469550 p:P26 ?s . ?s ps:P26 wd:Q4147409 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andrei Mironov', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Yekaterina Gradova'}}}

 Q: Which is the historic house museum of the residence of Rembrandt?
 SPARQL:  select distinct ?obj where { wd:Q5598 wdt:P551 ?obj . ?obj wdt:P31 wd:Q2087181 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rembrandt', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historic house museum'}}

 Q: How many {twinned administrative body} are there for {Monterrey} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q81033 wdt:P190 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Monterrey', 'p': 'twinned administrative body', 'o': '?x0'}

 Q: Was Chandragupta Maurya the student of both Chanakya and Vidyananda?
 SPARQL: ASK WHERE { wd:Q188541 wdt:P1066 wd:Q9045 . wd:Q188541 wdt:P1066 wd:Q7928209 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chandragupta Maurya', 'p': 'student of', 'o': '?x0', '?x0': 'Chanakya'}, {'h': 'IS', 'v': '?x1', 's': 'Chandragupta Maurya', 'p': 'student of', 'o': '?x1', '?x1': 'Vidyananda'}]

 Q: Which nonprofit organization has the highest total expenditure?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q163740 . ?ent wdt:P2402 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total expenditure', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonprofit organization'}}

 Q: Which is the extensive physical quantity that is measured by the inertial mass and starts with the letter m?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3386703 . ?sbj wdt:P1880 wd:Q843816 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'extensive physical quantity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'inertial mass'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Tell me the position held by Joseph Lister, 1st Baron Lister in the year 1902 and thereafter.
 SPARQL: SELECT ?obj WHERE { wd:Q155768 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1902')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Lister, 1st Baron Lister', 'p': 'position held', 'o': '?x0', 't': '1902'}

 Q: Which is tributary for Sea of Okhotsk having gps coordinate of 51.49694445 156.4758333?
 SPARQL: SELECT ?answer WHERE { wd:Q41602 wdt:P974 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'51.49694445 156.4758333'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sea of Okhotsk', 'p': 'tributary', 'o': '?x0'}

 Q: What is <biography at the Bundestag of Germany> of <Gerhard Schröder> ?
 SPARQL: select distinct ?answer where { wd:Q2530 wdt:P1713 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gerhard Schröder', 'p': 'biography at the Bundestag of Germany', 'o': '?x0'}

 Q: What is <metasubclass of> of <diaspora> ?
 SPARQL: select distinct ?answer where { wd:Q133004 wdt:P2445 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'diaspora', 'p': 'metasubclass of', 'o': '?x0'}

 Q: What is {owned by} of {4chan} that is {start time} is {2015-9-21} ?
 SPARQL: SELECT ?obj WHERE { wd:Q238330 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '4chan', 'p': 'owned by', 'o': '?x0', 't': '2015'}

 Q: When did Oberhausen have a population of 209292.0?
 SPARQL: SELECT ?value WHERE { wd:Q2838 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'209292.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Oberhausen', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '209292.0'}, 't': '?x0'}

 Q: what is the {point in time} for {A. R. Rahman} has {award received} as {IIFA Award for Best Music Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q108560 p:P166 ?s . ?s ps:P166 wd:Q492560 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'A. R. Rahman', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'IIFA Award for Best Music Director'}, 't': '?x0'}

 Q: How many country citizenship are taken by Antonio José de Sucre Farell?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q189779 wdt:P27 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Antonio José de Sucre', 'p': 'citizenship', 'o': '?x0'}

 Q: What are the winged horse which start with the letter pegasus
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pegasus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'winged horse'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pegasus'}}

 Q: Which is the crystal habit for albite?
 SPARQL: select distinct ?answer where { wd:Q182264 wdt:P565 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'albite', 'p': 'crystal habit', 'o': '?x0'}

 Q: What is {academic major} and {academic degree} of {{Robert J. Shiller} has {educated at} as {Massachusetts Institute of Technology}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert J. Shiller', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Massachusetts Institute of Technology'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert J. Shiller', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Massachusetts Institute of Technology'}}}]

 Q: What is the award received of Harold Pinter that is prized money that is 7 digits
 SPARQL: SELECT ?obj WHERE { wd:Q41042 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'1e+07')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Pinter', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'money', 'o': '1e+07'}}}

 Q: What is the {human} for {head of government} of {Vancouver}
 SPARQL:  select distinct ?obj where { wd:Q24639 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vancouver', 'p': 'head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many courts are there in the Supreme Court of Canada?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4884 wd:Q196615 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'court', 'o': 'Supreme Court of Canada'}

 Q: Which is the group that caused the Congress of Vienna?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q16887380 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause', 'o': 'Congress of Vienna', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group'}}

 Q: Which is the LoC and MARC vocabularies ID of Albania?
 SPARQL: select distinct ?answer where { wd:Q222 wdt:P4801 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albania', 'p': 'LoC and MARC vocabularies ID', 'o': '?x0'}

 Q: What is {award received} of {Brokeback Mountain} that is {statement is subject of} is {78th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q160618 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q319132 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brokeback Mountain', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '78th Academy Awards'}}}

 Q: What is {is the antonym of} of {inorganic chemistry}, that has {timeline of topic} is {history of organic chemistry} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11165 wdt:P461 ?answer . ?answer wdt:P2184 wd:Q17480697}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'inorganic chemistry', 'p': 'opposite of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timeline of topic', 'o': 'history of organic chemistry'}}

 Q: What is the {colonial power} for {country} of {Lisbon}
 SPARQL:  select distinct ?obj where { wd:Q597 wdt:P17 ?obj . ?obj wdt:P31 wd:Q20181813 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lisbon', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'colonial power'}}

 Q: Which is the Thai cultural heritage ID for Khlong Saen Saeb?
 SPARQL: select distinct ?answer where { wd:Q1431800 wdt:P1626 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Khlong Saen Saeb', 'p': 'Thai cultural heritage ID', 'o': '?x0'}

 Q: What is the number of those maintained by Fukuoka?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P126 wd:Q26600 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'maintained by', 'o': 'Fukuoka'}

 Q: What is the {fictional universe} for {takes place in fictional universe} of {The Matrix}
 SPARQL:  select distinct ?obj where { wd:Q83495 wdt:P1434 ?obj . ?obj wdt:P31 wd:Q559618 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Matrix', 'p': 'takes place in fictional universe', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional universe'}}

 Q: Give the name of the hill with the highest isolation whose is at a high range.
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q54050 . ?ent wdt:P2659 ?obj . ?ent wdt:P31 wd:Q46831 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'isolation', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hill', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'range'}}}

 Q: What are the Wikimedia set index article which start with the letter typhoon
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'typhoon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia set index article'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'typhoon'}}

 Q: What is {end cause} and {elected in} of {{Chiang Kai-shek} has {position held} as {President of the Republic of China}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q16574 p:P39 ?s . ?s ps:P39 wd:Q887003 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chiang Kai-shek', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the Republic of China'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chiang Kai-shek', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the Republic of China'}}}]

 Q: How many things are founded by Oprah Winfrey?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q55800 wdt:P112 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Oprah Winfrey', 'p': 'founded by', 'o': '?x0'}

 Q: DOES THE NUMBER OF CYLINDERS OF THE KKSTB 197 EQUALS 2
 SPARQL: ASK WHERE { wd:Q310348 wdt:P1100 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'kkStB 197', 'p': 'number of cylinders', 'o': '?x0', '?x0': '2'}

 Q: What is {participant of} of {Lin Dan} that is {ranking} is {1.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1390341 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P1352 ?x filter(contains(?x,'1.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'participant of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lin Dan', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'rank', 'o': '1.0'}}}

 Q: Give me {highly urbanized city} that {language used} {Tagalog} and which that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj wdt:P2936 wd:Q34057 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'highly urbanized city', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Tagalog'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Tell me town in Croatia whose name has the word šibenik in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15105893 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'šibenik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'town in Croatia'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'šibenik'}}

 Q: What is TORA ID for Uppsala ?
 SPARQL: select distinct ?answer where { wd:Q25286 wdt:P4820 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Uppsala', 'p': 'TORA ID', 'o': '?x0'}

 Q: What is  the Flora of North America taxon ID for Amaranthus?
 SPARQL: select distinct ?answer where { wd:Q156344 wdt:P1727 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amaranthus', 'p': 'Flora of North America taxon ID', 'o': '?x0'}

 Q: How many participants are there in the Kingdom of Castile?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P710 wd:Q179293 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Kingdom of Castile'}

 Q: What is the project codename for Windows 10?
 SPARQL: select distinct ?answer where { wd:Q18168774 wdt:P1638 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Windows 10', 'p': 'codename', 'o': '?x0'}

 Q: What is {edition} of {game platform} of {Second Life} ?
 SPARQL: SELECT ?answer WHERE { wd:Q106827 wdt:P400 ?X . ?X wdt:P747 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'edition', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Second Life', 'p': 'platform', 'o': '$y0'}}

 Q: what is the {start time} for {Peter Freuchen} has {member of political party} as {Social Democrats} ?
 SPARQL: SELECT ?value WHERE { wd:Q945641 p:P102 ?s . ?s ps:P102 wd:Q212101 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Freuchen', 'p': 'member of political party', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of political party', 'o': 'Social Democrats'}}}

 Q: What is the {sovereign state} with the {MAX(central government debt as a percent of GDP)} whose {diplomatic relation} is {Israel}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1689 ?obj . ?ent wdt:P530 wd:Q801 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'central government debt as a percent of GDP', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Israel'}}}

 Q: Is it true that the maximal incubation period in humans with leprosy equals to 21?
 SPARQL: ASK WHERE { wd:Q36956 wdt:P3487 ?obj filter(?obj = 21) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'leprosy', 'p': 'maximal incubation period in humans', 'o': '?x0', '?x0': '21'}

 Q: What is the {essence} for {studied by} of {social science}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2579 wd:Q34749 . ?sbj wdt:P31 wd:Q190995 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'social science', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essence'}}

 Q: What is a product of the automotive industry that is similar to a power-driven vehicle?
 SPARQL: SELECT ?answer WHERE { wd:Q190117 wdt:P1056 ?answer . ?answer wdt:P460 wd:Q16589333}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'automotive industry', 'p': 'product', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'similar to', 'o': 'power-driven vehicle'}}

 Q: What are the form of government which start with the letter unicameralism
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307214 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'unicameralism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'form of government'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'unicameralism'}}

 Q: Is it true that the number of episodes of Mansfield Park is greater than 0.8?
 SPARQL: ASK WHERE { wd:Q280295 wdt:P1113 ?obj filter(?obj > 0.8) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Mansfield Park', 'p': 'number of episodes', 'o': '?x0', '?x0': '0.8'}

 Q: What is the {railway gun} with the {MIN(muzzle velocity)} whose {country} is {France}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1049358 . ?ent wdt:P4137 ?obj . ?ent wdt:P17 wd:Q142} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'muzzle velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway gun', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'France'}}}

 Q: DOES THE EFFECTIVE FIRING RNGE OF THE 70 K EQUALS 13120
 SPARQL: ASK WHERE { wd:Q4031056 wdt:P4176 ?obj filter(?obj = 13120) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '70-K', 'p': 'effective firing range', 'o': '?x0', '?x0': '13120'}

 Q: what is the {end time} for {Andhra Pradesh} has {capital} as {Hyderabad} ?
 SPARQL: SELECT ?value WHERE { wd:Q1159 p:P36 ?s . ?s ps:P36 wd:Q1361 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andhra Pradesh', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Hyderabad'}}}

 Q: Give the name of the gram-negative strain that has the highest maximum viable temperature.
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3252 ?obj . ?ent wdt:P2597 wd:Q632006 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum viable temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'strain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Gram staining', 'o': 'Gram-negative'}}}

 Q: What is <Austrian Parliament ID> of <Kurt Waldheim> ?
 SPARQL: select distinct ?answer where { wd:Q1260 wdt:P2280 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kurt Waldheim', 'p': 'Austrian Parliament ID', 'o': '?x0'}

 Q: How many constellations are by Scorpius?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P59 wd:Q8865 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Scorpius'}

 Q: What is <Smithsonian volcano ID> of <Taal Volcano> ?
 SPARQL: select distinct ?answer where { wd:Q818475 wdt:P1886 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Taal Volcano', 'p': 'Smithsonian volcano ID', 'o': '?x0'}

 Q: What are winged horse which start with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'winged horse'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is {twin town} of {from} of {2NE1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q171885 wdt:P740 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2NE1', 'p': 'from', 'o': '$y0'}}

 Q: Give me {art genre} that {studied by} {ballet studies} and which contains the word {ballet} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ballet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'ballet studies'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ballet'}}

 Q: What is the {theatre} for {architect} of {Frank Gehry}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q180374 . ?sbj wdt:P31 wd:Q24354 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Frank Gehry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theatre'}}

 Q: What is the taxon synonym of angiosperms?
 SPARQL: select distinct ?answer where { ?answer wdt:P1420 wd:Q25314}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'taxon synonym', 'o': 'angiosperms'}

 Q: Is the gestation period of the Gorilla less than 324.0?
 SPARQL: ASK WHERE { wd:Q36611 wdt:P3063 ?obj filter(?obj < 324.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Gorilla', 'p': 'gestation period', 'o': '?x0', '?x0': '324.0'}

 Q: How does it emulates in the {PlayStation} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4043 wd:Q10677 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'emulates', 'o': 'PlayStation'}

 Q: What is the VAT rate in Hungary?
 SPARQL: select distinct ?answer where { wd:Q28 wdt:P2855 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hungary', 'p': 'VAT', 'o': '?x0'}

 Q: What is the short-term exposure limit of chloroform over a 60-minute period?
 SPARQL: SELECT ?obj WHERE { wd:Q172275 p:P2407 ?s . ?s ps:P2407 ?obj . ?s pq:P2047 ?x filter(contains(?x,'60.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'short-term exposure limit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'chloroform', 'p': 'short-term exposure limit', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'period', 'o': '60.0'}}}

 Q: Does the proton have a magnetic moment that is equal to 0.0015210322053?
 SPARQL: ASK WHERE { wd:Q2294 wdt:P2069 ?obj filter(?obj = 0.0015210322053) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'proton', 'p': 'magnetic moment', 'o': '?x0', '?x0': '0.0015210322053'}

 Q: What is the {spice} for {this taxon is source of} of {Cuminum cyminum}
 SPARQL:  select distinct ?obj where { wd:Q132624 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q42527 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cuminum cyminum', 'p': 'this taxon is source of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spice'}}

 Q: Who is the member of Canada that was elected on January 1st, 1966?
 SPARQL: SELECT ?obj WHERE { wd:Q16 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1966')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Canada', 'p': 'member of', 'o': '?x0', 't': '1966'}

