 Q: What is {position held} of {Nawaz Sharif} that is {replaces} is {Ghulam Mustafa Jatoi} ?
 SPARQL: SELECT ?obj WHERE { wd:Q134068 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q2039548 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nawaz Sharif', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Ghulam Mustafa Jatoi'}}}

 Q: what is the {start time} for {Billy Hughes} has {position held} as {Prime Minister of Australia} ?
 SPARQL: SELECT ?value WHERE { wd:Q152666 p:P39 ?s . ?s ps:P39 wd:Q319145 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Billy Hughes', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Australia'}}}

 Q: Is Matthew McConaughey a citizen of the United States of America?
 SPARQL: ASK WHERE { wd:Q188955 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Matthew McConaughey', 'p': 'citizen of', 'o': '?x0', '?x0': 'United States of America'}]

 Q: Which is the discovery that the inventor of CERN made?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P61 wd:Q42944 . ?sbj wdt:P31 wd:Q753297 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'inventor', 'o': 'CERN', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'discovery'}}

 Q: Does the salinity of the Borovoe equals 0.15?
 SPARQL: ASK WHERE { wd:Q5092054 wdt:P4350 ?obj filter(?obj = 0.15) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Borovoe', 'p': 'salinity', 'o': '?x0', '?x0': '0.15'}

 Q: Does Johnny Depp have Christoph as another forename that is said to be different from Johnny?
 SPARQL: SELECT ?answer WHERE { wd:Q37175 wdt:P735 ?answer . ?answer wdt:P460 wd:Q17689481}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Johnny Depp', 'p': 'forename', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be different from', 'o': 'Christoph'}}

 Q: What was the academic major of Donald Knuth and where was he educated at?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q17457 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Knuth', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Knuth', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is ITRA runner ID  for Dean Karnazes ?
 SPARQL: select distinct ?answer where { wd:Q331288 wdt:P3584 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dean Karnazes', 'p': 'ITRA runner ID', 'o': '?x0'}

 Q: "Which participants of the Battle of Leuthen, had a brother named Francis I, Holy Roman Emperor?"
 SPARQL: SELECT ?answer WHERE { wd:Q313435 wdt:P710 ?answer . ?answer wdt:P3373 wd:Q151075}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Battle of Leuthen', 'p': 'participant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'bro', 'o': 'Francis I, Holy Roman Emperor'}}

 Q: What is {quantity} of {foot-pound}, that has {measured by} is {mass} ?
 SPARQL: SELECT ?answer WHERE { wd:Q730251 wdt:P111 ?answer . ?answer wdt:P1880 wd:Q11423}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'foot-pound', 'p': 'quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'mass'}}

 Q: What is {elected in} and {end cause} of {{Harold Macmillan} has {position held} as {Member of the 38th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582597 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 38th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harold Macmillan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 38th Parliament of the United Kingdom'}}}]

 Q: What award did Boris Yeltsin receive on January 30th, 1981?
 SPARQL: SELECT ?obj WHERE { wd:Q34453 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Boris Yeltsin', 'p': 'award', 'o': '?x0', 't': '1981'}

 Q: What is {member of sports team} of {Fritz Walter} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q22717 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fritz Walter', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fritz Walter', 'p': 'team', 'o': '$y0'}}]

 Q: What was the item used by Malcolm Perry's doctoral supervisor?
 SPARQL: SELECT ?answer WHERE { wd:Q6742553 wdt:P184 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'item used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Perry', 'p': 'doctoral supervisor', 'o': '$y0'}}

 Q: what is the {end time} for {Palermo} has {head of government} as {Leoluca Orlando} ?
 SPARQL: SELECT ?value WHERE { wd:Q2656 p:P6 ?s . ?s ps:P6 wd:Q703503 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Palermo', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Leoluca Orlando'}}}

 Q: what is the {start time} for {Paul Hindemith} has {educated at} as {Hoch Conservatory} ?
 SPARQL: SELECT ?value WHERE { wd:Q57244 p:P69 ?s . ?s ps:P69 wd:Q466029 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Hindemith', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Hoch Conservatory'}}}

 Q: What is personal best for Valerie Adams ?
 SPARQL: select distinct ?answer where { wd:Q6357 wdt:P2415 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Valerie Adams', 'p': 'personal best', 'o': '?x0'}

 Q: What is the {literary character} for {present in work} of {Harry Potter}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q8337 . ?sbj wdt:P31 wd:Q3658341 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Harry Potter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary character'}}

 Q: What is <emissivity> of <cement> ?
 SPARQL: select distinct ?answer where { wd:Q45190 wdt:P1295 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cement', 'p': 'emissivity', 'o': '?x0'}

 Q: When was Natalia Makarova nominated for the Laurence Olivier Award for Best Actress in a Musical?
 SPARQL: SELECT ?value WHERE { wd:Q267796 p:P1411 ?s . ?s ps:P1411 wd:Q6500775 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Natalia Makarova', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Laurence Olivier Award for Best Actress in a Musical'}, 't': '?x0'}

 Q: What is the {county seat} for {twinned administrative body} of {Nagasaki}
 SPARQL:  select distinct ?obj where { wd:Q38234 wdt:P190 ?obj . ?obj wdt:P31 wd:Q62049 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nagasaki', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'county seat'}}

 Q: What is the role model of the doctoral supervisor of Carl Neumann?
 SPARQL: SELECT ?answer WHERE { wd:Q77313 wdt:P184 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role model', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Neumann', 'p': 'doctoral supervisor', 'o': '$y0'}}

 Q: What are theGreco-Roman mysteries which start with the letter M
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greco-Roman mysteries'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What is {place of activity} of {Erich von dem Bach-Zelewski}, that has {on lake} is {Westhafen Canal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57267 wdt:P937 ?answer . ?answer wdt:P206 wd:Q1532109}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Erich von dem Bach-Zelewski', 'p': 'place of activity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'on lake', 'o': 'Westhafen Canal'}}

 Q: What is {genetic association} of {regulates (molecular biology)} of {hsa-miR-335-3p} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27594933 wdt:P128 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hsa-miR-335-3p', 'p': 'regulates (molecular biology)', 'o': '$y0'}}

 Q: What is {patron saint} of {accountant}, that has {is son of} is {Alphaeus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q326653 wdt:P417 ?answer . ?answer wdt:P22 wd:Q1542853}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'accountant', 'p': 'patron saint', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'son of', 'o': 'Alphaeus'}}

 Q: Which is the single execution of an artwork as the exemplar of The Great Wave off Kanagawa?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1574 wd:Q252485 . ?sbj wdt:P31 wd:Q28912688 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'exemplar of', 'o': 'The Great Wave off Kanagawa', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single execution of an artwork'}}

 Q: What is {member of} of {coined} of {molybdenum} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1053 wdt:P61 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'molybdenum', 'p': 'coined', 'o': '$y0'}}

 Q: Tell me the series by Rama.
 SPARQL:  select distinct ?obj where { wd:Q160213 wdt:P179 ?obj . ?obj wdt:P31 wd:Q20937557 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rama', 'p': 'series', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'series'}}

 Q: When did Evonne Goolagong Cawley receive the Companion of the Order of Australia award?
 SPARQL: SELECT ?value WHERE { wd:Q228559 p:P166 ?s . ?s ps:P166 wd:Q9680541 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Evonne Goolagong Cawley', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Companion of the Order of Australia'}, 't': '?x0'}

 Q: What is the {supreme court} for {highest judicial authority} of {Hong Kong}
 SPARQL:  select distinct ?obj where { wd:Q8646 wdt:P209 ?obj . ?obj wdt:P31 wd:Q190752 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hong Kong', 'p': 'highest judicial authority', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'supreme court'}}

 Q: What is {pronunciation audio} of {life stance} of {Tulunids} ?
 SPARQL: SELECT ?answer WHERE { wd:Q726798 wdt:P140 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tulunids', 'p': 'life stance', 'o': '$y0'}}

 Q: Which is the ICD-9-CM for migraine?
 SPARQL: select distinct ?answer where { wd:Q133823 wdt:P1692 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'migraine', 'p': 'ICD-9-CM', 'o': '?x0'}

 Q: Is the partition coefficient water/octanol of raloxifene equal to 5.2?
 SPARQL: ASK WHERE { wd:Q425223 wdt:P2993 ?obj filter(?obj = 5.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'raloxifene', 'p': 'partition coefficient water/octanol', 'o': '?x0', '?x0': '5.2'}

 Q: What terrain feature of Hokkaido has the tributary Bol'shaya Sarannaya?
 SPARQL: SELECT ?answer WHERE { wd:Q35581 wdt:P706 ?answer . ?answer wdt:P974 wd:Q4091645}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hokkaido', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': "Bol'shaya Sarannaya"}}

 Q: What is {administrator} of {service operated} of {WOW air} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1156931 wdt:P121 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'administrator', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'WOW air', 'p': 'service operated', 'o': '$y0'}}

 Q: Tell me spaceport whose name has the word station in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194188 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'station')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spaceport'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'station'}}

 Q: What is {forename} of {Jan Tschichold}, that has {is said to be the same as} is {Juan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q455232 wdt:P735 ?answer . ?answer wdt:P460 wd:Q475210}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jan Tschichold', 'p': 'forename', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Juan'}}

 Q: What is the {subsidiary company} for {parent organization} of {American Broadcasting Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q169889 . ?sbj wdt:P31 wd:Q658255 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent company', 'o': 'American Broadcasting Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'subsidiary'}}

 Q: What is {aspect of} of {history of Los Angeles}, that has {dialling code} is {424} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3136743 wdt:P1269 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'424'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Los Angeles', 'p': 'aspect of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'area code', 'o': '424'}}

 Q: John Diefenbaker is the incumbent for what public office held by Justin Trudeau?
 SPARQL: SELECT ?answer WHERE { wd:Q3099714 wdt:P39 ?answer . ?answer wdt:P1308 wd:Q128614}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Justin Trudeau', 'p': 'public office', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'incumbent', 'o': 'John Diefenbaker'}}

 Q: What is the production rate for the tennis ball?
 SPARQL: select distinct ?answer where { wd:Q246514 wdt:P2197 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'tennis ball', 'p': 'production rate', 'o': '?x0'}

 Q: During the February Revolution was Santiago de Cuba known as twin town?
 SPARQL: SELECT ?answer WHERE { wd:Q101534 wdt:P276 ?answer . ?answer wdt:P190 wd:Q117040}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'February Revolution', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin town', 'o': 'Santiago de Cuba'}}

 Q: Which is the writable file format of iTunes?
 SPARQL: select distinct ?answer where { wd:Q9589 wdt:P1073 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'iTunes', 'p': 'writable file format', 'o': '?x0'}

 Q: What is {location} and {height} of {{pole vault} has {record held} as {Igor Potapovich}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Igor Potapovich'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'height', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Igor Potapovich'}}}]

 Q: what is the {point in time} for {Jude Law} has {award received} as {Theatre World Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q160432 p:P166 ?s . ?s ps:P166 wd:Q1131356 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jude Law', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Theatre World Award'}, 't': '?x0'}

 Q: How many {newspaper format} are to/by {magazine} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3912 wd:Q41298 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'newspaper format', 'o': 'magazine'}

 Q: what is the {start time} for {Karlsruhe Institute of Technology} has {manager/director} as {Eberhard Umbach} ?
 SPARQL: SELECT ?value WHERE { wd:Q309988 p:P1037 ?s . ?s ps:P1037 wd:Q77995 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karlsruhe Institute of Technology', 'p': 'director', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'director', 'o': 'Eberhard Umbach'}}}

 Q: What is Actorenregister ID for Utrecht University?
 SPARQL: select distinct ?answer where { wd:Q221653 wdt:P3273 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Utrecht University', 'p': 'Actorenregister ID', 'o': '?x0'}

 Q: To which country does Prince Salman pledge allegiance?
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P945 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman', 'p': 'allegiance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is {population} of {Almería} that is {determination method} is {register office} ?
 SPARQL: SELECT ?obj WHERE { wd:Q10400 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Almería', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'register office'}}}

 Q: Which is the direction relative to location of west?
 SPARQL: select distinct ?answer where { ?answer wdt:P654 wd:Q679}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'direction relative to location', 'o': 'west'}

 Q: Which is the UN/LOCODE of Bari?
 SPARQL: select distinct ?answer where { wd:Q3519 wdt:P1937 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bari', 'p': 'UN/LOCODE', 'o': '?x0'}

 Q: What is the {international reactions to the United States presidential election, 2016} for {participant} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q22686 . ?sbj wdt:P31 wd:Q27822033 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international reactions to the United States presidential election, 2016'}}

 Q: What is the codomain of  natural logarithm ?
 SPARQL: select distinct ?answer where { wd:Q204037 wdt:P1571 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'natural logarithm', 'p': 'codomain', 'o': '?x0'}

 Q: Did {Boston} {legislative body} {Boston City Council}?
 SPARQL: ASK WHERE { wd:Q100 wdt:P194 wd:Q4947808 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Boston', 'p': 'legislative body', 'o': '?x0', '?x0': 'Boston City Council'}]

 Q: Give me {municipality of the Netherlands} that contains the word {zwolle} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zwolle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of the Netherlands'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zwolle'}}

 Q: Name a movie directed by Ang Lee
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P57 wd:Q160726 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'directed by', 'o': 'Ang Lee', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'movie'}}

 Q: What is {position held} of {Robert Peel} and {end cause}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q181875 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Peel', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Peel', 'p': 'position held', 'o': '$y0'}}]

 Q: Which is the inferior planet with maximum albedo?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3901935 . ?ent wdt:P4501 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'albedo', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inferior planet'}}

 Q: What is <country for sport> of <Zinedine Zidane> ?
 SPARQL: select distinct ?answer where { wd:Q1835 wdt:P1532 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zinedine Zidane', 'p': 'country for sport', 'o': '?x0'}

 Q: Which is the Twitter hashtag for Emmanuel Macron?
 SPARQL: select distinct ?answer where { wd:Q3052772 wdt:P2572 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Emmanuel Macron', 'p': 'hashtag', 'o': '?x0'}

 Q: What is {physically interacts with} of {adenosine triphosphate} that is {subject has role} is {agonist} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80863 p:P129 ?s . ?s ps:P129 ?obj . ?s pq:P2868 wd:Q389934 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'physically interacts with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'adenosine triphosphate', 'p': 'physically interacts with', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'as', 'o': 'agonist'}}}

 Q: What is the {mineral species} for {fabrication method} of {uranium}
 SPARQL:  select distinct ?obj where { wd:Q1098 wdt:P2079 ?obj . ?obj wdt:P31 wd:Q55076514 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'U', 'p': 'fabrication method', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral species'}}

 Q: what is the {type of kinship} for {Barbara W. Tuchman} has {relative} as {Henry Morgenthau} ?
 SPARQL: SELECT ?value WHERE { wd:Q59112 p:P1038 ?s . ?s ps:P1038 wd:Q47946 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbara W. Tuchman', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Henry Morgenthau'}}}

 Q: what is the {symbolizes} for {flag of the United States of America} has {depicts} as {field} ?
 SPARQL: SELECT ?value WHERE { wd:Q42537 p:P180 ?s . ?s ps:P180 wd:Q372254 . ?s pq:P4878 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbolizes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'flag of the United States', 'p': 'depicts', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'depicts', 'o': 'field'}}}

 Q: What was the nomination received by Anjelica Huston, but had a prizewinner of Mira Sorvino?
 SPARQL: SELECT ?answer WHERE { wd:Q190998 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q212026}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anjelica Huston', 'p': 'nomination received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Mira Sorvino'}}

 Q: What is {death place} of {Karl von Frisch}, that has {has cities} is {Altstadt-Lehel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q60060 wdt:P20 ?answer . ?answer wdt:P150 wd:Q971198}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Karl von Frisch', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has cities', 'o': 'Altstadt-Lehel'}}

 Q: What develops from gynoecium?
 SPARQL: select distinct ?answer where { ?answer wdt:P3094 wd:Q588964}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'develops from', 'o': 'gynoecium'}

 Q: What multiple starts with the letter "h"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1055293 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'multiple'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What is {type species} of {higher taxon} of {Piper mollipilosum} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18036791 wdt:P171 ?X . ?X wdt:P427 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type species', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piper mollipilosum', 'p': 'higher taxon', 'o': '$y0'}}

 Q: who champ of awards of Joyce Carol Oates ?
 SPARQL: SELECT ?answer WHERE { wd:Q217557 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joyce Carol Oates', 'p': 'awards', 'o': '$y0'}}

 Q: What was the population of Iasi in 1910?
 SPARQL: SELECT ?obj WHERE { wd:Q46852 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1912')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Iasi', 'p': 'population', 'o': '?x0', 't': '1912'}

 Q: What is {place of birth} of {Jared Leto} that is {located in the administrative territorial entity} is {Louisiana} ?
 SPARQL: SELECT ?obj WHERE { wd:Q484523 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1588 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jared Leto', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Louisiana'}}}

 Q: Who is {member of} {coined} {Köppen climate classification} ?
 SPARQL: SELECT ?answer WHERE { wd:Q124095 wdt:P61 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Köppen climate classification', 'p': 'coined', 'o': '$y0'}}

 Q: Give the name of film character in the fictional analog of George II of Great Britain?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1074 wd:Q131981 . ?sbj wdt:P31 wd:Q15773347 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fictional analog of', 'o': 'George II of Great Britain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character'}}

 Q: Who are the disciples of Christiaan Huygens who were informed by Maimonides?
 SPARQL: SELECT ?answer WHERE { wd:Q39599 wdt:P802 ?answer . ?answer wdt:P737 wd:Q127398}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Christiaan Huygens', 'p': 'disciple', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'informed by', 'o': 'Maimonides'}}

 Q: what is the {start time} for {Aarhus} has {twinned administrative body} as {Rostock} ?
 SPARQL: SELECT ?value WHERE { wd:Q25319 p:P190 ?s . ?s ps:P190 wd:Q2861 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aarhus', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Rostock'}}}

 Q: What is {co-founded by} of {member of} of {Inge Morath} ?
 SPARQL: SELECT ?answer WHERE { wd:Q112033 wdt:P463 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Inge Morath', 'p': 'member of', 'o': '$y0'}}

 Q: Which is the color of the red wine?
 SPARQL: select distinct ?answer where { wd:Q1827 wdt:P462 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'red wine', 'p': 'color', 'o': '?x0'}

 Q: What notable work did Thomas Nagel publish in 2012?
 SPARQL: SELECT ?obj WHERE { wd:Q350239 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thomas Nagel', 'p': 'notable work', 'o': '?x0', 't': '2012'}

 Q: what is the {for work} for {Catherine Deneuve} has {nominated for} as {César Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q106418 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Catherine Deneuve', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'César Award for Best Actress'}}}

 Q: The parent taxon of a Nematoda belongs to what taxonomic ranking?
 SPARQL: SELECT ?answer WHERE { wd:Q5185 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'taxonomic rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nematoda', 'p': 'parent taxon', 'o': '$y0'}}

 Q: What is <Norwegian organisation number> of <KPMG> ?
 SPARQL: select distinct ?answer where { wd:Q493751 wdt:P2333 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'KPMG', 'p': 'Norwegian organisation number', 'o': '?x0'}

 Q: What is {prequel of} of {colors} of {The Secret of the Black Widow} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1168051 wdt:P462 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prequel of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Secret of the Black Widow', 'p': 'color', 'o': '$y0'}}

 Q: what is the {end time} for {Chandragupta Maurya} has {spouse} as {Durdhara} ?
 SPARQL: SELECT ?value WHERE { wd:Q188541 p:P26 ?s . ?s ps:P26 wd:Q5316334 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chandragupta Maurya', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Durdhara'}}}

 Q: Who is the doctoral student of Martin Weitzman supervisor?
 SPARQL: SELECT ?answer WHERE { wd:Q591572 wdt:P184 ?X . ?X wdt:P185 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral student', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Weitzman', 'p': 'supervisor', 'o': '$y0'}}

 Q: Which is the zenith of the jurisdiction of Citizens United v. Federal Election Commission?
 SPARQL: SELECT ?answer WHERE { wd:Q1092602 wdt:P1001 ?X . ?X wdt:P610 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zenith', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Citizens United v. Federal Election Commission', 'p': 'jurisdiction', 'o': '$y0'}}

 Q: What political party is Julian Assange a member of?
 SPARQL:  select distinct ?obj where { wd:Q360 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Julian Assange', 'p': 'party', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: What is the {Population I star} with the {MAX(temperature)} whose {child astronomical body} is {(341958) Chrétien}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3592493 . ?ent wdt:P2076 ?obj . ?ent wdt:P398 wd:Q25397081 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Population I star', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Chrétien'}}}

