 Q: What is the fictional analog of The Gingerbread Man?
 SPARQL: select distinct ?answer where { wd:Q6616486 wdt:P1074 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Gingerbread Man', 'p': 'fictional analog of', 'o': '?x0'}

 Q: What borders Senegal and yet is a member of AFRISTAT?
 SPARQL: SELECT ?answer WHERE { wd:Q1041 wdt:P47 ?answer . ?answer wdt:P463 wd:Q3348506}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Senegal', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'AFRISTAT'}}

 Q: What is graduated from Wendy Wasserstein located at street address of 160 Convent Ave, New York, NY, 10031?
 SPARQL: SELECT ?answer WHERE { wd:Q450050 wdt:P69 ?answer . ?answer wdt:P969 ?x FILTER(contains(?x,'160 Convent Ave, New York, NY, 10031'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wendy Wasserstein', 'p': 'graduated from', 'o': '?x0'}

 Q: What is the {member of} and the {chairperson} of {BP} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q152057 wdt:P463 ?ans_1 . wd:Q152057 wdt:P488 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'BP', 'p': 'member of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'BP', 'p': 'chairperson', 'o': '?x1'}]

 Q: what is the {mother} for {Julio Iglesias} has {child} as {Enrique Iglesias} ?
 SPARQL: SELECT ?value WHERE { wd:Q122003 p:P40 ?s . ?s ps:P40 wd:Q47122 . ?s pq:P25 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julio Iglesias', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Enrique Iglesias'}}}

 Q: Who is {writer} of {bibliographic citation} of {Survey of human genes of retroviral origin: identification and transcriptome of the genes with coding capacity for complete envelope proteins} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24645644 wdt:P2860 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'writer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Survey of human genes of retroviral origin: identification and transcriptome of the genes with coding capacity for complete envelope proteins', 'p': 'bibliographic citation', 'o': '$y0'}}

 Q: Which is the {crystal system} who {discoverer or inventor} of {Titanium} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P556 ?ans_1 . wd:Q716 wdt:P61 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Ti', 'p': 'crystal system', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Ti', 'p': 'discoverer or inventor', 'o': '?x1'}]

 Q: What is {number of points/goals/set scored} and {number of matches played} of {{Brian Clough} has {member of sports team} as {England national football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brian Clough', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'games played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brian Clough', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'England'}}}]

 Q: What is {place of death} of {Andrei Bely} that is {country} is {Soviet Union} ?
 SPARQL: SELECT ?obj WHERE { wd:Q212632 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q15180 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andrei Bely', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Soviet Union'}}}

 Q: Is it true that the melting point of mercury is less than -45.6?
 SPARQL: ASK WHERE { wd:Q925 wdt:P2101 ?obj filter(?obj < -45.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'mercury', 'p': 'melting point', 'o': '?x0', '?x0': '-45.6'}

 Q: What is the base of a cube?
 SPARQL: select distinct ?answer where { ?answer wdt:P3263 wd:Q812880}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'base', 'o': 'cube'}

 Q: Which is Japanese Baseball Hall of Fame ID for Hideo Nomo?
 SPARQL: select distinct ?answer where { wd:Q486690 wdt:P4562 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hideo Nomo', 'p': 'Japanese Baseball Hall of Fame ID', 'o': '?x0'}

 Q: What is {has surname} of {Mireille Mathieu}, that has {similar to} is {Matías} ?
 SPARQL: SELECT ?answer WHERE { wd:Q71452 wdt:P734 ?answer . ?answer wdt:P460 wd:Q29905256}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mireille Mathieu', 'p': 'surname', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'similar to', 'o': 'Matías'}}

 Q: What is Fawlty Towers' AlloCine series ID?
 SPARQL: select distinct ?answer where { wd:Q212731 wdt:P1267 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Fawlty Towers', 'p': 'AlloCine series ID', 'o': '?x0'}

 Q: What is <appears in the form of> of <Pinocchio> ?
 SPARQL: select distinct ?answer where { wd:Q6502703 wdt:P4675 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pinocchio', 'p': 'appears in the form of', 'o': '?x0'}

 Q: How many {languages spoken, written or signed} are for {Kamal Haasan} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q381477 wdt:P1412 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Kamal Haasan', 'p': 'languages spoken, written or signed', 'o': '?x0'}

 Q: What is physiology comprised of?
 SPARQL: select distinct ?answer where { ?answer wdt:P642 wd:Q521}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'of', 'o': 'physiology'}

 Q: Is the conversion to SI unit of the statcoulomb greater than 2.6685128e-10?
 SPARQL: ASK WHERE { wd:Q21131 wdt:P2370 ?obj filter(?obj > 2.6685128e-10) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'statcoulomb', 'p': 'conversion to SI unit', 'o': '?x0', '?x0': '2.6685128e-10'}

 Q: Tell me recurring sporting event whose name has the word world in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18608583 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring sporting event'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: How many saints have obtained canonization status?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P411 wd:Q43115 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'canonization status', 'o': 'saint'}

 Q: When did educated at of Peggy Whitson and academic major?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q235523 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peggy Whitson', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peggy Whitson', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {human} for {discoverer or inventor} of {boron}
 SPARQL:  select distinct ?obj where { wd:Q618 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'boron', 'p': 'discoverer or inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When did Maule Region have a population of 836141.0?
 SPARQL: SELECT ?value WHERE { wd:Q2166 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'836141.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Maule Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '836141.0'}, 't': '?x0'}

 Q: Which is the rank of the taxon parent of Physalis philadelphica?
 SPARQL: SELECT ?answer WHERE { wd:Q622525 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Physalis philadelphica', 'p': 'taxon parent', 'o': '$y0'}}

 Q: What is {member of sports team} of {Rabah Madjer} that is {number of matches played} is {94.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q431343 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'94.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rabah Madjer', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '94.0'}}}

 Q: Tell me reference model whose name has the word model in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'reference model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'model'}}

 Q: Tell me theorem whose name has the word theorem in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q65943 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'theorem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theorem'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'theorem'}}

 Q: What is {end time} and {start time} of {{Honolulu} has {located in the administrative territorial entity} as {Territory of Hawaii}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q18094 p:P131 ?s . ?s ps:P131 wd:Q547795 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honolulu', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Territory of Hawaii'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honolulu', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Territory of Hawaii'}}}]

 Q: Tell me the house cat that contains the word мyka in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q146 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'мyka')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'house cat'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'мyka'}}

 Q: Give me {season} that contains the word {winter} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'season'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'winter'}}

 Q: Which is the date of burial or cremation of Miloš Forman?
 SPARQL: select distinct ?answer where { wd:Q51525 wdt:P4602 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miloš Forman', 'p': 'date of burial or cremation', 'o': '?x0'}

 Q: Which the {subject has role} and the {location of discovery} of {Iodine} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1103 wdt:P2868 ?ans_1 . wd:Q1103 wdt:P189 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'I', 'p': 'subject has role', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'I', 'p': 'location of discovery', 'o': '?x1'}]

 Q: DOES THE LITERATE POPULATION OF DHARAMPUR EQUALS 0
 SPARQL: ASK WHERE { wd:Q60383142 wdt:P6499 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Dharampur', 'p': 'literate population', 'o': '?x0', '?x0': '0'}

 Q: What is the {3D film} for {voice actor} of {Tom Hanks}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q2263 . ?sbj wdt:P31 wd:Q229390 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Tom Hanks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': '3D film'}}

 Q: Which is the organization that has it's headquarters located in Aachen?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q1017 . ?sbj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters', 'o': 'Aachen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: What mythical character that contains the word zau in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zau')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythical character'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zau'}}

 Q: What is the {enterprise} for {business division} of {Ford Motor Company}
 SPARQL:  select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ford Motor Company', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: Is it true that the valency of monotransitive verb equals to 2?
 SPARQL: ASK WHERE { wd:Q4118301 wdt:P5526 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'monotransitive verb', 'p': 'valency', 'o': '?x0', '?x0': '2'}

 Q: How many mothers did Eros have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q121973 wdt:P25 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Eros', 'p': 'mother', 'o': '?x0'}

 Q: What is {member of sports team} of {Thierry Henry} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q45901 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thierry Henry', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thierry Henry', 'p': 'team', 'o': '$y0'}}]

 Q: What is {child} of {Isabella I of Castile} and {date of birth}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P569 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella I of Castile', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella I of Castile', 'p': 'child', 'o': '$y0'}}]

 Q: What is the {constituency of the Rajya Sabha} for {coextensive with} of {Mizoram}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3403 wd:Q1502 . ?sbj wdt:P31 wd:Q57156205 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'coextensive with', 'o': 'Mizoram', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constituency of the Rajya Sabha'}}

 Q: What branch of science starts with the letter "v"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of science'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: what is the {statement is subject of} for {Michelle Pfeiffer} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q159778 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michelle Pfeiffer', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Who is the {municipal archive} for {archives at} of {Aachen}
 SPARQL:  select distinct ?obj where { wd:Q1017 wdt:P485 ?obj . ?obj wdt:P31 wd:Q604177 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aachen', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal archive'}}

 Q: What is {number of out of school children} of {continent} of {Eritrea} ?
 SPARQL: SELECT ?answer WHERE { wd:Q986 wdt:P30 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eritrea', 'p': 'continent', 'o': '$y0'}}

 Q: Tell me physical quantity whose name has the word work in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q107715 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'work')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'physical quantity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'work'}}

 Q: What is the {powerplant} and the {manufacturer} of {Rockwell_B-1_Lancer} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q218636 wdt:P516 ?ans_1 . wd:Q218636 wdt:P176 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'B-1 Lancer', 'p': 'powerplant', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'B-1 Lancer', 'p': 'manufacturer', 'o': '?x1'}]

 Q: Tell me about animated feature film for voice actor of Ellen DeGeneres?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q483325 . ?sbj wdt:P31 wd:Q29168811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated feature film'}}

 Q: Tell me superhero that contains the word wolfsbane in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolfsbane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'superhero'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wolfsbane'}}

 Q: What is {subject in} of {Śūnyatā}, that has {science, that studies} is {Buddhist studies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q546054 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q1000976}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Śūnyatā', 'p': 'subject in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'science, that studies', 'o': 'Buddhist studies'}}

 Q: What is {has proponent} of {subject of the statement} of {language change} ?
 SPARQL: SELECT ?answer WHERE { wd:Q524648 wdt:P805 ?X . ?X wdt:P3095 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has proponent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'language change', 'p': 'subject of', 'o': '$y0'}}

 Q: what is the {number of matches played} for {Diego Maradona} has {member of sports team} as {A.A. Argentinos Juniors} ?
 SPARQL: SELECT ?value WHERE { wd:Q17515 p:P54 ?s . ?s ps:P54 wd:Q220621 . ?s pq:P1350 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diego Maradona', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Argentinos Juniors'}}}

 Q: What is {diplomatic relation} of {sovereign state} of {University of Iowa} ?
 SPARQL: SELECT ?answer WHERE { wd:Q182973 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'University of Iowa', 'p': 'state', 'o': '$y0'}}

 Q: Tell me about spouse of Julio Iglesias and end cause?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q122003 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1534 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julio Iglesias', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julio Iglesias', 'p': 'spouse', 'o': '$y0'}}]

 Q: What are the state church which start with the letter M
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state church'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Is it true that the thermal diffusivity of adobe is less than 0.216?
 SPARQL: ASK WHERE { wd:Q183496 wdt:P5674 ?obj filter(?obj < 0.216) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'adobe', 'p': 'thermal diffusivity', 'o': '?x0', '?x0': '0.216'}

 Q: What award did Carrie Underwood receive in 2007?
 SPARQL: SELECT ?obj WHERE { wd:Q215546 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carrie Underwood', 'p': 'award', 'o': '?x0', 't': '2007'}

 Q: what is the {start time} for {Ryan Giggs} has {member of sports team} as {Manchester United F.C.} ?
 SPARQL: SELECT ?value WHERE { wd:Q10524 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ryan Giggs', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Manchester United F.C.'}}}

 Q: What is the {taxon} for {taxonomic type} of {Piper nigrum}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P427 wd:Q43084 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Piper nigrum', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is {head of government} of {Vaduz} that is {start time} is {2007-1-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1844 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vaduz', 'p': 'head of government', 'o': '?x0', 't': '2007'}

 Q: What is the solitary with the lowest height whose instance of is Tilia platyphyllos?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2438638 . ?ent wdt:P2048 ?obj . ?ent wdt:P31 wd:Q156831} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'height', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'solitary', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Tilia platyphyllos'}}}

 Q: Which is {continent} of {death place} of {Thomas Morley} ?
 SPARQL: SELECT ?answer WHERE { wd:Q438141 wdt:P20 ?X . ?X wdt:P30 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Morley', 'p': 'death place', 'o': '$y0'}}

 Q: What is the twin town of Port Vila, with the license plate code 沪A?
 SPARQL: SELECT ?answer WHERE { wd:Q37806 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER(contains(?x,'沪A'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Port Vila', 'p': 'twin town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'license plate code', 'o': '沪a'}}

 Q: Who is the brother of the actress Trishna?
 SPARQL: SELECT ?answer WHERE { wd:Q3417235 wdt:P161 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bro', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Trishna', 'p': 'actress', 'o': '$y0'}}

 Q: How many {time period} are to/by {Hellenistic period} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2348 wd:Q428995 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'Hellenistic period'}

 Q: What is {position held} of {Charles XIV John of Sweden} that is {replaces} is {Charles XIII of Sweden} ?
 SPARQL: SELECT ?obj WHERE { wd:Q52927 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q52928 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles XIV John of Sweden', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Charles XIII of Sweden'}}}

 Q: Which is {official language} of {basin countries} of {White Sea} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44133 wdt:P205 ?X . ?X wdt:P37 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'White Sea', 'p': 'basin countries', 'o': '$y0'}}

 Q: What is the {brand} for {manufacturer} of {SpaceX}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q431289 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'SpaceX', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'brand'}}

 Q: When did Betty White win the Daytime Emmy Award for Outstanding Game Show Host?
 SPARQL: SELECT ?value WHERE { wd:Q373895 p:P166 ?s . ?s ps:P166 wd:Q5243447 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Betty White', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Daytime Emmy Award for Outstanding Game Show Host'}, 't': '?x0'}

 Q: What is {birthplace} of {Chris Rock}, that has {geotag} is {33.45} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4109 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'33.45'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chris Rock', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'geotag', 'o': '33.45'}}

 Q: Give me {document} that {editor} {National Constituent Assembly} and which contains the word {citizen} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'document', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'editor', 'o': 'National Constituent Assembly'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'citizen'}}

 Q: What is the daughter of Leopold II, Holy Roman Emperor, whose sister is Maria Anna d'Asburgo-Lorena?
 SPARQL: SELECT ?answer WHERE { wd:Q151321 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q1032317}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leopold II, Holy Roman Emperor', 'p': 'daughter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister', 'o': "Maria Anna d'Asburgo-Lorena"}}

 Q: what is the {replaces} for {Charles Evans Hughes} has {position held} as {Chief Justice of the United States} ?
 SPARQL: SELECT ?value WHERE { wd:Q313252 p:P39 ?s . ?s ps:P39 wd:Q11147 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Evans Hughes', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chief Justice'}}}

 Q: what is the key incident in the provenance of Glencore?
 SPARQL: SELECT ?answer WHERE { wd:Q169339 wdt:P127 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key incident', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Glencore', 'p': 'provenance', 'o': '$y0'}}

 Q: Tell me written work whose name has the word war in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'war'}}

 Q: What is {part of constellation} of {parent body} of {Messier 35} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13736 wdt:P397 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 35', 'p': 'parent body', 'o': '$y0'}}

 Q: Name the eponym of volt, who is professor by profession.
 SPARQL: SELECT ?answer WHERE { wd:Q25250 wdt:P138 ?answer . ?answer wdt:P106 wd:Q121594}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'volt', 'p': 'eponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'profession', 'o': 'professor'}}

 Q: What is {from work} of {motif} of {David with the Head of Goliath} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20354514 wdt:P180 ?X . ?X wdt:P1441 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David with the Head of Goliath', 'p': 'motif', 'o': '$y0'}}

 Q: Which document is the main regulatory text of the Soviet Union?
 SPARQL:  select distinct ?obj where { wd:Q15180 wdt:P92 ?obj . ?obj wdt:P31 wd:Q49848 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Soviet Union', 'p': 'main regulatory text', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'document'}}

 Q: What is the {university} for {parent organization} of {Purdue University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q217741 . ?sbj wdt:P31 wd:Q3918 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Purdue University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university'}}

 Q: How many {member of the crew of} are for {John Jellicoe, 1st Earl Jellicoe} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q335028 wdt:P5096 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'John Jellicoe, 1st Earl Jellicoe', 'p': 'member of the crew of', 'o': '?x0'}

 Q: What is <companion of> of <Proxima Centauri> ?
 SPARQL: select distinct ?answer where { wd:Q14266 wdt:P399 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Proxima Centauri', 'p': 'companion of', 'o': '?x0'}

 Q: Who is the writer of "The Murder of Roger Ackroyd", which has been active since 1920-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q224078 wdt:P50 ?answer . ?answer wdt:P2031 ?x FILTER(contains(YEAR(?x),'1920'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Murder of Roger Ackroyd', 'p': 'writer', 'o': '?x0', 't': '1920'}

 Q: Which is the sector of the software publisher for Horticultural classification of tulip cultivars?
 SPARQL: SELECT ?answer WHERE { wd:Q18402072 wdt:P123 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sector', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Horticultural classification of tulip cultivars', 'p': 'publisher', 'o': '$y0'}}

 Q: Who is the candidacy in election for United States Congress?
 SPARQL: select distinct ?answer where { ?answer wdt:P3602 wd:Q11268}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'candidacy in election', 'o': 'United States Congress'}

