 Q: Which is the diagnostic test that is a health specialty of anatomical pathology and contains the word pap in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762591 . ?sbj wdt:P1995 wd:Q683455 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pap')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'diagnostic test', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'health specialty', 'o': 'anatomical pathology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pap'}}

 Q: Give me {daily newspaper} that {editor} {Alan Rusbridger} and which contains the word {guardian} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1110794 . ?sbj wdt:P98 wd:Q921140 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'guardian')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'daily newspaper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'editor', 'o': 'Alan Rusbridger'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'guardian'}}

 Q: Name the anion for conjugate acid of ammonia?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q4087 . ?sbj wdt:P31 wd:Q107968 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'ammonia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anion'}}

 Q: What is {spouse} of {Julius Caesar} that is {end time} is {-68-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1048 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(?x,'-68-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'wife', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julius Caesar', 'p': 'wife', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end time', 'o': '-68-0-0'}}}

 Q: Which is the endianness for x86?
 SPARQL: select distinct ?answer where { wd:Q182933 wdt:P3374 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'x86', 'p': 'endianness', 'o': '?x0'}

 Q: What is {informed by} of {musician} of {Tout le monde} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29555703 wdt:P175 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'informed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tout le monde', 'p': 'artist', 'o': '$y0'}}

 Q: When did Donald Crisp win the Academy Award for Best Supporting Actor?
 SPARQL: SELECT ?value WHERE { wd:Q367073 p:P166 ?s . ?s ps:P166 wd:Q106291 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Donald Crisp', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Academy Award for Best Supporting Actor'}, 't': '?x0'}

 Q: Is it true that the Mohs' hardness of pyrite equals to 6?
 SPARQL: ASK WHERE { wd:Q50769 wdt:P1088 ?obj filter(?obj = 6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'pyrite', 'p': "Mohs' hardness", 'o': '?x0', '?x0': '6'}

 Q: What is {academic major} and {academic degree} of {{Katherine Dunham} has {educated at} as {University of Chicago}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katherine Dunham', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Chicago'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katherine Dunham', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Chicago'}}}]

 Q: Give me {formula} that starts with {'z'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q976981 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'formula'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What are the  type of software which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28530532 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of software'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {disputed equivalence} of {restaurant}, that has {is different from} is {high-class restaurant} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11707 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q19316447}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'restaurant', 'p': 'disputed equivalence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'different from', 'o': 'high-class restaurant'}}

 Q: What is {nominated for} of {Judi Dench} that is {for work} is {Notes on a Scandal} ?
 SPARQL: SELECT ?obj WHERE { wd:Q28054 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q756849 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Judi Dench', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Notes on a Scandal'}}}

 Q: Does the bore of the DRG Class 03 equal 570?
 SPARQL: ASK WHERE { wd:Q201801 wdt:P2556 ?obj filter(?obj = 570) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'DRG Class 03', 'p': 'bore', 'o': '?x0', '?x0': '570'}

 Q: For Saint Kitts and Nevis when was the inflation rate as 6.5?
 SPARQL: SELECT ?value WHERE { wd:Q763 p:P1279 ?s . ?s ps:P1279 ?x filter(contains(?x,'6.5')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Saint Kitts and Nevis', 'p': 'inflation rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'inflation rate', 'o': '6.5'}, 't': '?x0'}

 Q: Which Kazakhstan landing Soyuz-TM has the greatest orbital period?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2705481 . ?ent wdt:P2146 ?obj . ?ent wdt:P1158 wd:Q232 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'orbital period', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Soyuz-TM', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of landing', 'o': 'Kazakhstan'}}}

 Q: What is {first recorded in} of {death type} of {David Koresh} ?
 SPARQL: SELECT ?answer WHERE { wd:Q431015 wdt:P1196 ?X . ?X wdt:P1249 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first recorded in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Koresh', 'p': 'death type', 'o': '$y0'}}

 Q: What is {written by} of {sequel of} of {Lila: An Inquiry into Morals} ?
 SPARQL: SELECT ?answer WHERE { wd:Q694346 wdt:P155 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'author', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lila: An Inquiry into Morals', 'p': 'sequel of', 'o': '$y0'}}

 Q: What is <measured by> of <cubic metre> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1880 wd:Q25517}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'cubic meter'}

 Q: what is the {start time} for {Gamal Abdel Nasser} has {position held} as {Prime Minister of Egypt} ?
 SPARQL: SELECT ?value WHERE { wd:Q39524 p:P39 ?s . ?s ps:P39 wd:Q1571396 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gamal Abdel Nasser', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Egypt'}}}

 Q: What is {voice actor} of {Family Guy} that is {character role} is {Loretta Brown} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5930 p:P725 ?s . ?s ps:P725 ?obj . ?s pq:P453 wd:Q589480 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'voice actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Family Guy', 'p': 'voice actor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'character role', 'o': 'Loretta Brown'}}}

 Q: What is {total fertility rate} of {subitem of} of {history of Peru} ?
 SPARQL: SELECT ?answer WHERE { wd:Q316648 wdt:P1269 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Peru', 'p': 'subitem of', 'o': '$y0'}}

 Q: What was the population of Melilla in 2016-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q5831 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Melilla', 'p': 'population', 'o': '?x0', 't': '2016'}

 Q: How many developers are placed at Department of Defense?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P178 wd:Q11209 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Department of Defense'}

 Q: What is {royal house} of {manager} of {Order of Saint John (Bailiwick of Brandenburg)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4498889 wdt:P1037 ?X . ?X wdt:P53 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'house', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Order of Saint John (Bailiwick of Brandenburg)', 'p': 'manager', 'o': '$y0'}}

 Q: What is {relative} of {Henry the Lion} that is {type of kinship} is {male first cousin} ?
 SPARQL: SELECT ?obj WHERE { wd:Q105378 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q41805519 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cousin', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry the Lion', 'p': 'cousin', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'male first cousin'}}}

 Q: What area in Sevastopol is disputed territory?
 SPARQL:  select distinct ?obj where { wd:Q7525 wdt:P706 ?obj . ?obj wdt:P31 wd:Q15239622 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sevastopol', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disputed territory'}}

 Q: What is {portrayed by} of {split from} of {Virgin Mary} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6163695 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrayed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Virgin Mary', 'p': 'split from', 'o': '$y0'}}

 Q: Sergei Eisenstein is the screenwriter of which silent film?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P58 wd:Q8003 . ?sbj wdt:P31 wd:Q226730 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'screenwriter', 'o': 'Sergei Eisenstein', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'silent film'}}

 Q: What is {human population} of {located in} of {Battle of Midway} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173034 wdt:P276 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of Midway', 'p': 'location', 'o': '$y0'}}

 Q: Does Daft Punk perform in the genres of New Wave and Nu-Disco?
 SPARQL: ASK WHERE { wd:Q185828 wdt:P136 wd:Q187760 . wd:Q185828 wdt:P136 wd:Q4045538 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Daft Punk', 'p': 'genre', 'o': '?x0', '?x0': 'New Wave'}, {'h': 'IS', 'v': '?x1', 's': 'Daft Punk', 'p': 'genre', 'o': '?x1', '?x1': 'Nu-Disco'}]

 Q: what is the {start time} for {Cathay Pacific} has {item operated} as {Bristol Britannia} ?
 SPARQL: SELECT ?value WHERE { wd:Q32141 p:P121 ?s . ?s ps:P121 wd:Q917907 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cathay Pacific', 'p': 'item operated', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'item operated', 'o': 'Bristol Britannia'}}}

 Q: Tell me the intelligence agency which has as parent organization the Foreign and Commonwealth Office and contains the word intelligence in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47913 . ?sbj wdt:P749 wd:Q358834 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'intelligence')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intelligence agency', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Foreign and Commonwealth Office'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'intelligence'}}

 Q: Who is born at Tilda Swinton, which has a partner town of Baku?
 SPARQL: SELECT ?answer WHERE { wd:Q200534 wdt:P19 ?answer . ?answer wdt:P190 wd:Q9248}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tilda Swinton', 'p': 'born at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Baku'}}

 Q: What commodity did the creators of the Logitech 3D mouse at Musée Bolo use?
 SPARQL: SELECT ?answer WHERE { wd:Q30177125 wdt:P170 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'commodity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Logitech 3D mouse at Musée Bolo', 'p': 'creator', 'o': '$y0'}}

 Q: What are the DNB editions of the King James Version?
 SPARQL: select distinct ?answer where { wd:Q623398 wdt:P1292 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'King James Version', 'p': 'DNB editions', 'o': '?x0'}

 Q: What is the {disease} for {drug used for treatment} of {biotin}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2176 wd:Q181354 . ?sbj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'used for treatment', 'o': 'Biotin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: What is the {country for sport} and the {position played on team / speciality} of {Isiah_Thomas} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q298512 wdt:P1532 ?ans_1 . wd:Q298512 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Isiah Thomas', 'p': 'country for sport', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Isiah Thomas', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: What award did Yuri Gagarin receive on April 29, 1961?
 SPARQL: SELECT ?obj WHERE { wd:Q7327 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yuri Gagarin', 'p': 'award', 'o': '?x0', 't': '1961'}

 Q: Was Andy Murray nominated for the Best Moment ESPY Award?
 SPARQL: ASK WHERE { wd:Q10125 wdt:P1411 wd:Q4896742 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Andy Murray', 'p': 'nominated for', 'o': '?x0', '?x0': 'Best Moment ESPY Award'}]

 Q: What is the religious affiliation of Jin, who has a Universal Decimal Classification of 221.3?
 SPARQL: SELECT ?answer WHERE { wd:Q912043 wdt:P140 ?answer . ?answer wdt:P1190 ?x FILTER(contains(?x,'221.3'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jin', 'p': 'religious affiliation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Universal Decimal Classification', 'o': '221.3'}}

 Q: Is the total fertility rate of the Belize greater than 2.0632?
 SPARQL: ASK WHERE { wd:Q242 wdt:P4841 ?obj filter(?obj > 2.0632) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Belize', 'p': 'total fertility rate', 'o': '?x0', '?x0': '2.0632'}

 Q: What is {quantity} of {torr}, that has {symbol} is {P} ?
 SPARQL: SELECT ?answer WHERE { wd:Q185648 wdt:P111 ?answer . ?answer wdt:P416 ?x FILTER(contains(?x,'P'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'torr', 'p': 'quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'symbol', 'o': 'p'}}

 Q: What is {spouse} of {Aisha} that is {start time} is {619-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q4730963 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(?x,'619-1-1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'marry', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aisha', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'start time', 'o': '619-1-1'}}}

 Q: What is {owned by} of {Houston Chronicle} that is {start time} is {1937-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q595564 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1937')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Houston Chronicle', 'p': 'owned by', 'o': '?x0', 't': '1937'}

 Q: Give me {project} that {objective of project or mission} {nuclear weapon} and which contains the word {manhattan} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170584 . ?sbj wdt:P3712 wd:Q12802 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'manhattan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'project', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'objective', 'o': 'nuclear weapon'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'manhattan'}}

 Q: Which is the JMK film rating for Titanic?
 SPARQL: select distinct ?answer where { wd:Q44578 wdt:P3650 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Titanic', 'p': 'JMK film rating', 'o': '?x0'}

 Q: Which is Star Wars Databank ID for Princess Leia?
 SPARQL: select distinct ?answer where { wd:Q51797 wdt:P3798 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Princess Leia', 'p': 'Star Wars Databank ID', 'o': '?x0'}

 Q: What are the music genre which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'music genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the {cooperative} for {maintained by} of {Dewey Decimal Classification}
 SPARQL:  select distinct ?obj where { wd:Q48460 wdt:P126 ?obj . ?obj wdt:P31 wd:Q4539 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dewey Decimal Classification', 'p': 'maintained by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cooperative'}}

 Q: Who is {chief executive} of {manufacturer} of {IBM 7030 Stretch} ?
 SPARQL: SELECT ?answer WHERE { wd:Q984038 wdt:P176 ?X . ?X wdt:P169 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chief executive', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'IBM 7030 Stretch', 'p': 'manufacturer', 'o': '$y0'}}

 Q: Which award did Jacinto Benavente receive in the year 1922?
 SPARQL: SELECT ?obj WHERE { wd:Q83184 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1922')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacinto Benavente', 'p': 'award', 'o': '?x0', 't': '1922'}

 Q: Was Yul Brynner nominated for both the Academy Award for Best Actor and Drama Desk Award for Outstanding Featured Actor in a Musical?
 SPARQL: ASK WHERE { wd:Q102813 wdt:P1411 wd:Q103916 . wd:Q102813 wdt:P1411 wd:Q5305711 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Yul Brynner', 'p': 'nominated for', 'o': '?x0', '?x0': 'Academy Award for Best Actor'}, {'h': 'IS', 'v': '?x1', 's': 'Yul Brynner', 'p': 'nominated for', 'o': '?x1', '?x1': 'Drama Desk Award for Outstanding Featured Actor in a Musical'}]

 Q: Tell me about academic degree of Ludwig Wittgenstein and educated at?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9391 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P69 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ludwig Wittgenstein', 'p': 'academic degree', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ludwig Wittgenstein', 'p': 'academic degree', 'o': '$y0'}}]

 Q: What is the creation date of the Daimler AG subsidiary company?
 SPARQL: SELECT ?answer WHERE { wd:Q27530 wdt:P355 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'creation date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Daimler AG', 'p': 'subsidiary', 'o': '$y0'}}

 Q: What is the native label of Izhevsk since 1984-12-27?
 SPARQL: SELECT ?obj WHERE { wd:Q5426 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Izhevsk', 'p': 'native label', 'o': '?x0', 't': '1984'}

 Q: What is Wiki Loves Monuments ID for Knossos?
 SPARQL: select distinct ?answer where { wd:Q173527 wdt:P2186 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Knossos', 'p': 'Wiki Loves Monuments ID', 'o': '?x0'}

 Q: What is {position held} of {Itamar Franco} that is {elected in} is {Brazilian legislative election, 1982} ?
 SPARQL: SELECT ?obj WHERE { wd:Q485946 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q4958850 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Itamar Franco', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'elected in', 'o': 'Brazilian legislative election, 1982'}}}

 Q: Did {Mariah_Carey} {ethnic group} {Cubans}?
 SPARQL: ASK WHERE { wd:Q41076 wdt:P172 wd:Q1195125 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Carey', 'p': 'ethnic group', 'o': '?x0', '?x0': 'Cubans'}]

 Q: Which is the elCinema film ID for The Godfather Part II?
 SPARQL: select distinct ?answer where { wd:Q184768 wdt:P3135 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Godfather Part II', 'p': 'elCinema film ID', 'o': '?x0'}

 Q: Which is the foods traditionally associated for Meleagris gallopavo?
 SPARQL: select distinct ?answer where { ?answer wdt:P868 wd:Q26844}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'foods traditionally associated', 'o': 'Meleagris gallopavo'}

 Q: What is Eason Chan youngster?
 SPARQL: select distinct ?answer where { ?answer wdt:P40 wd:Q704041}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'son', 'o': 'Eason Chan'}

 Q: What is {total fertility rate} of {citizen of} of {John Betjeman} ?
 SPARQL: SELECT ?answer WHERE { wd:Q962308 wdt:P27 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Betjeman', 'p': 'citizen of', 'o': '$y0'}}

 Q: What is Dictionary of Sydney ID for Sydney Harbour Bridge ?
 SPARQL: select distinct ?answer where { wd:Q54495 wdt:P3794 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sydney Harbour Bridge', 'p': 'Dictionary of Sydney ID', 'o': '?x0'}

 Q: What is {academic degree} and {academic major} of {{Emma Watson} has {educated at} as {Brown University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q39476 p:P69 ?s . ?s ps:P69 wd:Q49114 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emma Watson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Brown University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emma Watson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Brown University'}}}]

 Q: What is {field of exercise} of {developed by} of {Minecraft – Pocket Edition} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6016926 wdt:P178 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of exercise', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pocket Edition', 'p': 'developed by', 'o': '$y0'}}

 Q: Which is the Fotografen.nl ID of Harold Eugene Edgerton?
 SPARQL: select distinct ?answer where { wd:Q475733 wdt:P3269 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Harold Eugene Edgerton', 'p': 'Fotografen.nl ID', 'o': '?x0'}

 Q: What award did Gwen Stefani win with Eve?
 SPARQL: SELECT ?obj WHERE { wd:Q483379 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q239464 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gwen Stefani', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'with', 'o': 'Eve'}}}

 Q: What is {located in the administrative unit} of {Aguascalientes}, that has {has boroughs} is {Nayarit} ?
 SPARQL: SELECT ?answer WHERE { wd:Q79952 wdt:P131 ?answer . ?answer wdt:P150 wd:Q79920}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aguascalientes', 'p': 'located in the administrative unit', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has boroughs', 'o': 'Nayarit'}}

 Q: what is the {point in time} for {Edward Coke} has {award received} as {National Book Award for Nonfiction} ?
 SPARQL: SELECT ?value WHERE { wd:Q332435 p:P166 ?s . ?s ps:P166 wd:Q3873147 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Edward Coke', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'National Book Award for Nonfiction'}, 't': '?x0'}

 Q: What is {causes} of {comes after} of {embryo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q33196 wdt:P155 ?X . ?X wdt:P1542 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'causes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'embryo', 'p': 'comes after', 'o': '$y0'}}

 Q: what is the {defender} for {Nuremberg trials} has {defendant} as {Arthur Seyss-Inquart} ?
 SPARQL: SELECT ?value WHERE { wd:Q80130 p:P1591 ?s . ?s ps:P1591 wd:Q650219 . ?s pq:P1593 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'defender', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nuremberg trials', 'p': 'defendant', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'defendant', 'o': 'Arthur Seyss-Inquart'}}}

 Q: Who finished serving as the manager/director of the Organization for Security and Co-operation in Europe in the year 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q81299 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Organization for Security and Co-operation in Europe', 'p': 'manager', 'o': '?x0', 't': '2011'}

 Q: What is {employed by} of {grandmother} of {Rob Kardashian} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26318 wdt:P1038 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rob Kardashian', 'p': 'grandmother', 'o': '$y0'}}

 Q: What are the ssociation football stadium which start with the letter U
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1154710 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'football stadium'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: what is the {nominee} for {Fight Club} has {award received} as {AWARDS CIRCUIT COMMUNITY AWARDS} ?
 SPARQL: SELECT ?value WHERE { wd:Q190050 p:P166 ?s . ?s ps:P166 wd:Q28044785 . ?s pq:P2453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fight Club', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'AWARDS CIRCUIT COMMUNITY AWARDS'}}}

 Q: What is {type locality (geology)} of {sylvite}, that has {significant incident} is {Mount Vesuvius eruption of 1631} ?
 SPARQL: SELECT ?answer WHERE { wd:Q409091 wdt:P2695 ?answer . ?answer wdt:P793 wd:Q954201}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'sylvite', 'p': 'type locality (geology)', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant incident', 'o': 'Mount Vesuvius eruption of 1631'}}

 Q: What is {death location} of {has father} of {Mashhur bin Abdulaziz Al Saud} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4549135 wdt:P22 ?X . ?X wdt:P20 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mashhur bin Abdulaziz Al Saud', 'p': 'father', 'o': '$y0'}}

 Q: Does Delta Air Lines make $552,284,000,000?
 SPARQL: ASK WHERE { wd:Q188920 wdt:P2232 ?obj filter(?obj = 5528400000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Delta Air Lines', 'p': 'cash', 'o': '?x0', '?x0': '5528400000.0'}

 Q: What is position held by Charles VIII of France who replaces Louis XI of France?
 SPARQL: SELECT ?obj WHERE { wd:Q134452 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q8058 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles VIII of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Louis XI of France'}}}

 Q: what is the {determination method} for {Vermont} has {population} as {359231.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q16551 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'359231.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vermont', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '359231.0'}}}

 Q: What is the {television series} with the {MAX(publication interval)} whose {cast member} is {Christine Prayon}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P2896 ?obj . ?ent wdt:P161 wd:Q1083743 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'publication interval', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV series', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Christine Prayon'}}}

 Q: who sister town of born in of Huban Öztoprak ?
 SPARQL: SELECT ?answer WHERE { wd:Q16588877 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Huban Öztoprak', 'p': 'born in', 'o': '$y0'}}

 Q: What is the most natural abundance of the isotope of cadmium that decays to palladium -106?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1321542 . ?ent wdt:P2374 ?obj . ?ent wdt:P816 wd:Q2541204 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'natural abundance', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of cadmium', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'decays to', 'o': 'palladium-106'}}}

 Q: What is the author and the chief executive officer of Reddit ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1136 wdt:P50 ?ans_1 . wd:Q1136 wdt:P169 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Reddit', 'p': 'author', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Reddit', 'p': 'chief executive officer', 'o': '?x1'}]

 Q: who is author of afterword of Nineteen Eighty-Four ?
 SPARQL: select distinct ?answer where { wd:Q208460 wdt:P2680 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nineteen Eighty-Four', 'p': 'author of afterword', 'o': '?x0'}

