 Q: what is the {start time} for {Podgorica} has {country} as {Principality of Montenegro} ?
 SPARQL: SELECT ?value WHERE { wd:Q23564 p:P17 ?s . ?s ps:P17 wd:Q779011 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Podgorica', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Principality of Montenegro'}}}

 Q: IS THE ENTHALPY OF VAPORIZATION OF METHANOL IS EQUAL TO 37400
 SPARQL: ASK WHERE { wd:Q14982 wdt:P2116 ?obj filter(?obj = 37400) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'methanol', 'p': 'enthalpy of vaporization', 'o': '?x0', '?x0': '37400'}

 Q: What award was received Mary Tyler Moore ?
 SPARQL:  select distinct ?obj where { wd:Q41342 wdt:P166 ?obj . ?obj wdt:P31 wd:Q618779 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mary Tyler Moore', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award'}}

 Q: what is the {language of work or name} for {Tuesday} has {named after} as {3} ?
 SPARQL: SELECT ?value WHERE { wd:Q127 p:P138 ?s . ?s ps:P138 wd:Q201 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language of work or name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tuesday', 'p': 'named after', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'named after', 'o': '3'}}}

 Q: How many {archives at} are for {Grace Hopper} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q11641 wdt:P485 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Grace Hopper', 'p': 'archives at', 'o': '?x0'}

 Q: Which is the narrative location of Siddhartha?
 SPARQL: select distinct ?answer where { wd:Q457289 wdt:P840 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Siddhartha', 'p': 'narrative location', 'o': '?x0'}

 Q: What is {place of first performance} of {Tartuffe}, that has {farthest east} is {48.8363848 2.4697602} ?
 SPARQL: SELECT ?answer WHERE { wd:Q205875 wdt:P4647 ?answer . ?answer wdt:P1334 ?x FILTER(contains(?x,'48.8363848 2.4697602'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tartuffe', 'p': 'place of first performance', 'o': '?x0'}

 Q: What are the military operation which start with the letter o
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q645883 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military operation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: Who is the mother and husband of Candice Bergen?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q106942 wdt:P25 ?ans_1 . wd:Q106942 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Candice Bergen', 'p': 'mother', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Candice Bergen', 'p': 'husband', 'o': '?x1'}]

 Q: What is {language written} of {Romy Schneider}, that has {has grammatical person} is {third-person plural} ?
 SPARQL: SELECT ?answer WHERE { wd:Q78469 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q51929517}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Romy Schneider', 'p': 'language written', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical person', 'o': 'third-person plural'}}

 Q: Does the cash back of the Gold  ADAC Credit Card equals 5?
 SPARQL: ASK WHERE { wd:Q56746601 wdt:P4448 ?obj filter(?obj = 5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'ADAC Credit Card GOLD', 'p': 'cash back', 'o': '?x0', '?x0': '5'}

 Q: What is the {character type} for {opposite of} of {superhero}
 SPARQL:  select distinct ?obj where { wd:Q188784 wdt:P461 ?obj . ?obj wdt:P31 wd:Q636497 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'superhero', 'p': 'opposite of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'character type'}}

 Q: What is {using} of {sport played} of {World Rugby} ?
 SPARQL: SELECT ?answer WHERE { wd:Q369225 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'using', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'World Rugby', 'p': 'play', 'o': '$y0'}}

 Q: What is {population} of {Aden} that is {determination method} is {estimation process} ?
 SPARQL: SELECT ?obj WHERE { wd:Q131694 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aden', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'estimation process'}}}

 Q: what is spouse of Carlos Saura that is start time is 2006?
 SPARQL: SELECT ?obj WHERE { wd:Q295855 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2006')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carlos Saura', 'p': 'spouse', 'o': '?x0', 't': '2006'}

 Q: How many {exclave of} are to/by {Azerbaijan} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P500 wd:Q227 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'exclave of', 'o': 'Azerbaijan'}

 Q: Which is the total equity of Micron Technology?
 SPARQL: select distinct ?answer where { wd:Q1197548 wdt:P2137 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Micron Technology', 'p': 'total equity', 'o': '?x0'}

 Q: Was Michael J. Fox's place of birth in Edmonton?
 SPARQL: ASK WHERE { wd:Q395274 wdt:P19 wd:Q2096 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Michael J. Fox', 'p': 'place of birth', 'o': '?x0', '?x0': 'Edmonton'}]

 Q: What is Palace of Westminster's architect and heritage designation?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q62408 wdt:P84 ?ans_1 . wd:Q62408 wdt:P1435 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Palace of Westminster', 'p': 'architect', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Palace of Westminster', 'p': 'heritage designation', 'o': '?x1'}]

 Q: is it true that the SSK6-1s optimum viable temperature is greater than 24.0?
 SPARQL: ASK WHERE { wd:Q29565582 wdt:P3253 ?obj filter(?obj > 24.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'SSK6-1', 'p': 'optimum viable temperature', 'o': '?x0', '?x0': '24.0'}

 Q: What is the {country} for {significant event} of {Indian independence movement}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Indian Independence Movement', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Give me {nonmetal} that {location of discovery} {England} and which that starts with {'o'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19600 . ?sbj wdt:P189 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonmetal', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of discovery', 'o': 'England'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: What is <drafted by> of <Sidney Crosby> ?
 SPARQL: select distinct ?answer where { wd:Q311280 wdt:P647 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sidney Crosby', 'p': 'drafted by', 'o': '?x0'}

 Q: What is {student of} of {Strabo} that is {sourcing circumstances} is {presumably} ?
 SPARQL: SELECT ?obj WHERE { wd:Q45936 p:P1066 ?s . ?s ps:P1066 ?obj . ?s pq:P1480 wd:Q18122778 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'student of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Strabo', 'p': 'student of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'presumably'}}}

 Q: What is {elected in} and {end cause} of {{John Hume} has {position held} as {Member of the 53rd Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q193630 p:P39 ?s . ?s ps:P39 wd:Q35921591 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hume', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 53rd Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hume', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 53rd Parliament of the United Kingdom'}}}]

 Q: Gordon Lightfoot was nominated for what at what time?
 SPARQL: SELECT ?obj WHERE { wd:Q359552 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gordon Lightfoot', 'p': 'nominated for', 'o': '?x0', 't': '1977'}

 Q: What is {date of death} of {John X} that is {sourcing circumstances} is {presumably} ?
 SPARQL: SELECT ?obj WHERE { wd:Q227976 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q18122778 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John X', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'presumably'}}}

 Q: Which is the patron saint of the place of death of Anna de' Medici?
 SPARQL: SELECT ?answer WHERE { wd:Q3617854 wdt:P20 ?X . ?X wdt:P417 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'patron saint', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Anna de' Medici", 'p': 'place of death', 'o': '$y0'}}

 Q: Is it true that the fee of Harvard University is less than 90?
 SPARQL: ASK WHERE { wd:Q13371 wdt:P2555 ?obj filter(?obj < 90.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Harvard University', 'p': 'fee', 'o': '?x0', '?x0': '90.0'}

 Q: What is BIA PSY person ID for Carl Rogers ?
 SPARQL: select distinct ?answer where { wd:Q191004 wdt:P5450 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Carl Rogers', 'p': 'BIA PSY person ID', 'o': '?x0'}

 Q: What are the autonomous region of the People's Republic of China which start with the letter X
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': "autonomous region of the People's Republic of China"}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'x'}}

 Q: What is {located in time zone} of {Marseille} that is {valid in period} is {standard time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23482 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marseille', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'standard time'}}}

 Q: What is {award received} of {Harry Martinson} that is {together with} is {Eyvind Johnson} ?
 SPARQL: SELECT ?obj WHERE { wd:Q132695 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131326 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harry Martinson', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'together with', 'o': 'Eyvind Johnson'}}}

 Q: What is the {monastery} for {headquarters location} of {Russian Orthodox Church}
 SPARQL:  select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russian Orthodox Church', 'p': 'headquarters location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monastery'}}

 Q: What is Bandysidan player ID for Sergey Lomanov ?
 SPARQL: select distinct ?answer where { wd:Q542364 wdt:P4831 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sergey Lomanov', 'p': 'Bandysidan player ID', 'o': '?x0'}

 Q: Who are the writers of the academic subject Ten simple rules for editing Wikipedia?
 SPARQL: SELECT ?answer WHERE { wd:Q21145331 wdt:P50 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ten simple rules for editing Wikipedia', 'p': 'writer', 'o': '$y0'}}

 Q: What is {discoverer or inventor of} of {Horsehead Nebula}, that has {biological sex} is {female} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14271 wdt:P61 ?answer . ?answer wdt:P21 wd:Q6581072}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Horsehead Nebula', 'p': 'discoverer or inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'female'}}

 Q: Give me {fruit} that {natural product of taxon} {Citrullus lanatus} and which that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1364 . ?sbj wdt:P1582 wd:Q17507129 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fruit', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'natural product of taxon', 'o': 'Citrullus lanatus'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {in conflict} of {depiction of} of {Raising the Flag on Iwo Jima} ?
 SPARQL: SELECT ?answer WHERE { wd:Q117693 wdt:P180 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Raising the Flag on Iwo Jima', 'p': 'depiction of', 'o': '$y0'}}

 Q: What what is unary operation notation by integral symbol and which that starts with {'i'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj wdt:P913 wd:Q1665420 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unary operation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'notation', 'o': 'integral symbol'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'i'}}

 Q: What is {treated by} of {because} of {arteriosclerosis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q184559 wdt:P828 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'arteriosclerosis', 'p': 'cause', 'o': '$y0'}}

 Q: What is <category for recipients of this award> of <Nobel Prize> ?
 SPARQL: select distinct ?answer where { wd:Q7191 wdt:P2517 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nobel Prize', 'p': 'category for recipients of this award', 'o': '?x0'}

 Q: What is {inflation rate} of {Venezuela} that is {point in time} is {1996-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q717 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Venezuela', 'p': 'inflation rate', 'o': '?x0', 't': '1996'}

 Q: When was Vittorio De Sica nominated for an Academy Award for Best Supporting Actor?
 SPARQL: SELECT ?value WHERE { wd:Q53004 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Vittorio De Sica', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}, 't': '?x0'}

 Q: What is Auñamendi ID of Miguel López de Legazpi ?
 SPARQL: select distinct ?answer where { wd:Q318500 wdt:P3218 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miguel López de Legazpi', 'p': 'Auñamendi ID', 'o': '?x0'}

 Q: What is {timezone} of {death location} of {Sallust} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7170 wdt:P20 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'timezone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sallust', 'p': 'death location', 'o': '$y0'}}

 Q: Did {East_India_Company} {owner of} {Britannia} and {Busbridge (1782 EIC ship)} ?
 SPARQL: ASK WHERE { wd:Q83164 wdt:P1830 wd:Q4801940 . wd:Q83164 wdt:P1830 wd:Q55606211 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'East India Company', 'p': 'owner of', 'o': '?x0', '?x0': 'Britannia'}, {'h': 'IS', 'v': '?x1', 's': 'East India Company', 'p': 'owner of', 'o': '?x1', '?x1': 'Busbridge (1782 EIC ship)'}]

 Q: Which is the ISNI for Marit Bjørgen?
 SPARQL: select distinct ?answer where { wd:Q216256 wdt:P213 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marit Bjørgen', 'p': 'ISNI', 'o': '?x0'}

 Q: What is total fertility rate of Trinidad and Tobago that is determination method is estimation process ?
 SPARQL: SELECT ?obj WHERE { wd:Q754 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Trinidad and Tobago', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'estimation process'}}}

 Q: Which church is located in the parish border Krukengrund?
 SPARQL: SELECT ?answer WHERE { wd:Q32068316 wdt:P131 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Krukengrund', 'p': 'is located in', 'o': '$y0'}}

 Q: What was Philip Roth nominated for in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q187019 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Philip Roth', 'p': 'nominated for', 'o': '?x0', 't': '2011'}

 Q: Where is the deathplace of Gediminas, whose twin town is Irkutsk?
 SPARQL: SELECT ?answer WHERE { wd:Q244852 wdt:P20 ?answer . ?answer wdt:P190 wd:Q6576}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gediminas', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin town', 'o': 'Irkutsk'}}

 Q: What is the fuel system of electricity?
 SPARQL: select distinct ?answer where { ?answer wdt:P1211 wd:Q12725}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fuel system', 'o': 'electricity'}

 Q: What is {nominated for} of {Mira Sorvino} that is {statement is subject of} is {68th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q212026 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q903494 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mira Sorvino', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '68th Academy Awards'}}}

 Q: Tell me interface standard whose name has the word virtuallink in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6046311 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virtuallink')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'interface standard'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'virtuallink'}}

 Q: What is Ferenc Molnar's compArt person ID?
 SPARQL: select distinct ?answer where { wd:Q296809 wdt:P4772 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ferenc Molnar', 'p': 'compArt person ID', 'o': '?x0'}

 Q: Which is the Great Aragonese Encyclopedia ID for Allium cepa?
 SPARQL: select distinct ?answer where { wd:Q23485 wdt:P1807 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Allium cepa', 'p': 'Great Aragonese Encyclopedia ID', 'o': '?x0'}

 Q: Tell me medical specialty whose name has the word trichology in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930752 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trichology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical specialty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'trichology'}}

 Q: How many {performer} are to/by {Jimi Hendrix} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P175 wd:Q5928 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Jimi Hendrix'}

 Q: What is the state of India that contain the word "uttarakhand" in its name ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13390680 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uttarakhand')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state of India'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'uttarakhand'}}

 Q: Who is drafted by the Boston Celtics?
 SPARQL: select distinct ?answer where { ?answer wdt:P647 wd:Q131371}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'drafted by', 'o': 'Boston Celtics'}

 Q: What is {is in the settlement of} of {British Academy of Film and Television Arts}, that has {postcode} is {DA} ?
 SPARQL: SELECT ?answer WHERE { wd:Q159661 wdt:P131 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'DA'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'BAFTA', 'p': 'is in the settlement of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'postcode', 'o': 'da'}}

 Q: Is the maximum number of players for the coxless four 0.0?
 SPARQL: ASK WHERE { wd:Q81032 wdt:P1873 ?obj filter(?obj = 0.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'coxless four', 'p': 'maximum number of players', 'o': '?x0', '?x0': '0.0'}

 Q: Give me {religious concept} that {facet of} {Hinduism} and which contains the word {yatra} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yatra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious concept', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Hinduism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yatra'}}

 Q: What is the {golf course} for {designed by} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q22686 . ?sbj wdt:P31 wd:Q1048525 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'golf course'}}

 Q: What is the {Wikimedia list article} for {is a list of} of {dance}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P360 wd:Q11639 . ?sbj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is a list of', 'o': 'dance', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia list article'}}

 Q: What is {religious affiliation} of {child of} of {Vladimir the Great} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14974 wdt:P22 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'religious affiliation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir the Great', 'p': 'child of', 'o': '$y0'}}

 Q: What was the population of the Maldives in 1967?
 SPARQL: SELECT ?obj WHERE { wd:Q826 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maldives', 'p': 'population', 'o': '?x0', 't': '1967'}

 Q: What year did Le Corbusier win the Frank P. Brown Medal?
 SPARQL: SELECT ?value WHERE { wd:Q4724 p:P166 ?s . ?s ps:P166 wd:Q19873358 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Le Corbusier', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Frank P. Brown Medal'}, 't': '?x0'}

 Q: What is the {city or town} for {enclave within} of {Montreal}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P501 wd:Q340 . ?sbj wdt:P31 wd:Q27676416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'enclave within', 'o': 'Montreal', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city or town'}}

 Q: what is the {replaced by} for {Honorius I} has {position held} as {pope} ?
 SPARQL: SELECT ?value WHERE { wd:Q170502 p:P39 ?s . ?s ps:P39 wd:Q19546 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Honorius I', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'pope'}}}

 Q: What is <used metre> of <Iliad> ?
 SPARQL: select distinct ?answer where { wd:Q8275 wdt:P2551 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iliad', 'p': 'used metre', 'o': '?x0'}

 Q: "Where is {on harbour} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q157137 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1633893}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kryvyi Rih', 'p': 'on harbour', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Saksahan'}}

 Q: What is {starring} of {in work} of {Ian Carlyle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42421333 wdt:P1441 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starring', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ian Carlyle', 'p': 'in work', 'o': '$y0'}}

 Q: What is the {phenomenon} for {has effect} of {rain}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1542 wd:Q7925 . ?sbj wdt:P31 wd:Q483247 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'causes', 'o': 'rain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phenomenon'}}

 Q: What is the service branch  by Julius and Ethel Rosenberg, which has subsidiary entities including Arlington National Cemetery?
 SPARQL: SELECT ?answer WHERE { wd:Q769097 wdt:P241 ?answer . ?answer wdt:P355 wd:Q216344}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Julius and Ethel Rosenberg', 'p': 'branch', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'Arlington National Cemetery'}}

 Q: what is the {statement is subject of} for {Aaron Kwok} has {award received} as {Golden Horse Award for Best Leading Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q16872 p:P166 ?s . ?s ps:P166 wd:Q17500591 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aaron Kwok', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Golden Horse Award for Best Leading Actor'}}}

 Q: what is the {start time} for {Marco Polo} has {spouse} as {Donata Badoer} ?
 SPARQL: SELECT ?value WHERE { wd:Q6101 p:P26 ?s . ?s ps:P26 wd:Q3713678 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marco Polo', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Donata Badoer'}}}

 Q: Who was Al Gore's spouse beginning in 1970?
 SPARQL: SELECT ?obj WHERE { wd:Q19673 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Al Gore', 'p': 'spouse', 'o': '?x0', 't': '1970'}

 Q: What is {manifestation of} of {Christmas tree}, that has {recurring event} is {January 19} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47128 wdt:P1557 ?answer . ?answer wdt:P837 wd:Q2266}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Christmas tree', 'p': 'manifestation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'recurring event', 'o': 'January 19'}}

 Q: What is the {stadium} for {home venue} of {Green Bay Packers}
 SPARQL:  select distinct ?obj where { wd:Q213837 wdt:P115 ?obj . ?obj wdt:P31 wd:Q483110 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Green Bay Packers', 'p': 'home venue', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stadium'}}

 Q: Which is the enterprise for the parent organization of Sears?
 SPARQL:  select distinct ?obj where { wd:Q6499202 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sears', 'p': 'parent organization', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What is {developer} of {proper motion}, that has {has surname} is {Halley} ?
 SPARQL: SELECT ?answer WHERE { wd:Q193223 wdt:P61 ?answer . ?answer wdt:P734 wd:Q16870415}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'proper motion', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'surname', 'o': 'Halley'}}

 Q: What head coach is the New York Yankees named after?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P286 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'New York Yankees', 'p': 'head coach', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'New York Yankees', 'p': 'named after', 'o': '?x1'}]

 Q: What are the national cuisine which start with the letter m
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national cuisine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: Which is the television series which contains the word zigby in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zigby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zigby'}}

 Q: Tell me about spouse of Barbara Walters and start time?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q231417 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbara Walters', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barbara Walters', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is {second language} of {Peter Faber}, that has {regulatory body} is {Pontifical Academy for Latin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q454814 wdt:P1412 ?answer . ?answer wdt:P1018 wd:Q48509}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Faber', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'regulatory body', 'o': 'Pontifical Academy for Latin'}}

 Q: What is {honorary title} of {Albert Günther}, that has {won by} is {P. A. Buxton} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57514 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q15994338}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Albert Günther', 'p': 'honorary title', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'won by', 'o': 'P.A. Buxton'}}

