 Q: What is Portuguese Job Code CPP-2010 for astronomer?
 SPARQL: select distinct ?answer where { wd:Q11063 wdt:P1052 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'astronomer', 'p': 'Portuguese Job Code CPP-2010', 'o': '?x0'}

 Q: who is brother for children of Eleanor of Aquitaine ?
 SPARQL: SELECT ?answer WHERE { wd:Q178525 wdt:P40 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bro', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eleanor of Aquitaine', 'p': 'child', 'o': '$y0'}}

 Q: Who is {headed by} of {party membership} of {Luis Alberto Sánchez} ?
 SPARQL: SELECT ?answer WHERE { wd:Q969753 wdt:P102 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Luis Alberto Sánchez', 'p': 'party', 'o': '$y0'}}

 Q: What is {record held} of {Hicham El Guerrouj} that is {criterion used} is {world record} ?
 SPARQL: SELECT ?obj WHERE { wd:Q83905 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P1013 wd:Q688615 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'record held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hicham El Guerrouj', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'criterion used', 'o': 'world record'}}}

 Q: What are the intergovernmental organization that contains the word southern in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'southern')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intergovernmental organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'southern'}}

 Q: Is the elevation above sea level of the Markermeer equal to -3.2?
 SPARQL: ASK WHERE { wd:Q939766 wdt:P2044 ?obj filter(?obj = -3.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Markermeer', 'p': 'elevation above sea level', 'o': '?x0', '?x0': '-3.2'}

 Q: What is {position held} of {Michael Manley} that is {start time} is {1969-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q365395 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michael Manley', 'p': 'position held', 'o': '?x0', 't': '1969'}

 Q: Which is EIRIN film rating for Breakfast at Tiffany's?
 SPARQL: select distinct ?answer where { wd:Q193066 wdt:P2756 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Breakfast at Tiffany's", 'p': 'EIRIN film rating', 'o': '?x0'}

 Q: What is postsynaptic connection of frontal lobe?
 SPARQL: select distinct ?answer where { ?answer wdt:P926 wd:Q749520}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'postsynaptic connection', 'o': 'frontal lobe'}

 Q: What are the unit of area which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1371562 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of area'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {musical score by} of {edition of} of {Via col vento} ?
 SPARQL: SELECT ?answer WHERE { wd:Q29478369 wdt:P629 ?X . ?X wdt:P86 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musical score by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Via col vento', 'p': 'edition of', 'o': '$y0'}}

 Q: what is the {start time} for {Ingvar Kamprad} has {spouse} as {Kerstin Wadling} ?
 SPARQL: SELECT ?value WHERE { wd:Q216932 p:P26 ?s . ?s ps:P26 wd:Q47519864 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ingvar Kamprad', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Kerstin Wadling'}}}

 Q: Who is the {human} for {father} of {Alexander Graham Bell}
 SPARQL:  select distinct ?obj where { wd:Q34286 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexander Graham Bell', 'p': 'father', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What team is Radamel Falcao Garcia a member of sports team and what is his number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q138172 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Radamel Falcao', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Radamel Falcao', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is {child} of {Peter Sellers} and {date of birth}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q177984 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P569 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Sellers', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Sellers', 'p': 'child', 'o': '$y0'}}]

 Q: What is the {human} for {screenwriter} of {Neon Genesis Evangelion}
 SPARQL:  select distinct ?obj where { wd:Q662 wdt:P58 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Neon Genesis Evangelion', 'p': 'screenwriter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {location of item} of {pendant to} of {Portrait of Maria Bockenolle (Wife of Johannes Elison)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20557706 wdt:P1639 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Portrait of Maria Bockenolle (Wife of Johannes Elison)', 'p': 'pendant to', 'o': '$y0'}}

 Q: What is the {position} for {office held by head of the organisation} of {Church of England}
 SPARQL:  select distinct ?obj where { wd:Q82708 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Church of England', 'p': 'office held by head of the organisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: At what point in time did Birmingham have a population of 1123000?
 SPARQL: SELECT ?value WHERE { wd:Q2256 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1123000')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Birmingham', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1123000'}, 't': '?x0'}

 Q: Name the item operator of the object accessed by Air Mauritius
 SPARQL: SELECT ?answer WHERE { wd:Q407556 wdt:P121 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operator', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Air Mauritius', 'p': 'operator of', 'o': '$y0'}}

 Q: What is the name of the ethnic group that originates from Korea?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q41710 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'originates from', 'o': 'Korea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic group'}}

 Q: Give me the name of the award received of Renzo Piano that of point in time is 2000-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q190148 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Renzo Piano', 'p': 'award received', 'o': '?x0', 't': '2000'}

 Q: What is the economy whose name contains the word russia in it?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q159810 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'russia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'russia'}}

 Q: What is <WALS lect code> of <Ukrainian> ?
 SPARQL: select distinct ?answer where { wd:Q8798 wdt:P1466 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ukrainian', 'p': 'WALS lect code', 'o': '?x0'}

 Q: What what is programming language programming paradigm non-structured programming  and  alsowhich that starts with letter b
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj wdt:P3966 wd:Q905156 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'programming language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'programming paradigm', 'o': 'non-structured programming'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: what is the {point in time} for {São Paulo} has {population} as {4.50949e+07} ?
 SPARQL: SELECT ?value WHERE { wd:Q175 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4.50949e+07')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'São Paulo', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '4.50949e+07'}, 't': '?x0'}

 Q: Is Hydrogen different from dihydrogen?
 SPARQL: ASK WHERE { wd:Q556 wdt:P1889 wd:Q3027893 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'hydrogen', 'p': 'different from', 'o': '?x0', '?x0': 'dihydrogen'}]

 Q: What is the namesake of Cassini-Huygens, that died in 9/14/1712?
 SPARQL: SELECT ?answer WHERE { wd:Q165585 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1712'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cassini-Huygens', 'p': 'namesake', 'o': '?x0', 't': '1712'}

 Q: What is {musician} of {predecessor} of {Right Here Right Now Tour} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3935739 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musician', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Right Here Right Now Tour', 'p': 'predecessor', 'o': '$y0'}}

 Q: What is {agent} of {competed in} of {Kerri Walsh Jennings} ?
 SPARQL: SELECT ?answer WHERE { wd:Q232666 wdt:P1344 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'agent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kerri Walsh Jennings', 'p': 'competed in', 'o': '$y0'}}

 Q: Tell me system of units whose name has the word units in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q932268 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'units')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'system of units'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'units'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Michel Platini} has {member of sports team} as {France national football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q4261 p:P54 ?s . ?s ps:P54 wd:Q47774 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michel Platini', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'France national football team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michel Platini', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'France national football team'}}}]

 Q: Is the hydraulic head of the Mykstufoss powerplant more than 49.6?
 SPARQL: ASK WHERE { wd:Q19382111 wdt:P4441 ?obj filter(?obj > 49.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Mykstufoss', 'p': 'hydraulic head', 'o': '?x0', '?x0': '49.6'}

 Q: what is the {applies to part} for {Morava} has {coordinate location} as {48.1739} ?
 SPARQL: SELECT ?value WHERE { wd:Q179251 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'48.1739')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Morava', 'p': 'location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'location', 'o': '48.1739'}}}

 Q: What is the soundtrack album of Symphony No. 5?
 SPARQL: select distinct ?answer where { ?answer wdt:P406 wd:Q188709}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'soundtrack album', 'o': 'Symphony No. 5'}

 Q: What is {namesake} of {Lagrangian point}, that has {royal title} is {count} ?
 SPARQL: SELECT ?answer WHERE { wd:Q190463 wdt:P138 ?answer . ?answer wdt:P97 wd:Q3519259}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lagrangian point', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'royal title', 'o': 'count'}}

 Q: Which television show does Ellen DeGeneres host?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q15416 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'host', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television show'}}

 Q: What is the twin city of Klaipeda, which has a size of 25.0?
 SPARQL: SELECT ?answer WHERE { wd:Q776965 wdt:P190 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'25.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Klaipeda', 'p': 'twin city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'size', 'o': '25.0'}}

 Q: what is the {start time} for {Carl Sagan} has {spouse} as {Ann Druyan} ?
 SPARQL: SELECT ?value WHERE { wd:Q410 p:P26 ?s . ?s ps:P26 wd:Q27167 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Sagan', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Ann Druyan'}}}

 Q: Who is {manager/director} of {European Southern Observatory} where {end time} is {1974-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q151991 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'European Southern Observatory', 'p': 'manager', 'o': '?x0', 't': '1974'}

 Q: What is the name of a roof shape that starts with the letter t.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1156686 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'roof shape'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {disease} for {studies} of {psychotherapy}
 SPARQL:  select distinct ?obj where { wd:Q183257 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'psychotherapy', 'p': 'study of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: What is Castor's luminosity?
 SPARQL: select distinct ?answer where { wd:Q13029 wdt:P2060 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Castor', 'p': 'luminosity', 'o': '?x0'}

 Q: How many {lake inflows} are for {Lake Baikal} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q5513 wdt:P200 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Lake Baikal', 'p': 'inflows', 'o': '?x0'}

 Q: What is {country} of {Mantua} that is {start time} is {1805-3-17} ?
 SPARQL: SELECT ?obj WHERE { wd:Q6247 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1805')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mantua', 'p': 'country', 'o': '?x0', 't': '1805'}

 Q: What is the copy of steradian with the unit conversion of 0.00053996?
 SPARQL: SELECT ?answer WHERE { wd:Q177612 wdt:P144 ?answer . ?answer wdt:P2442 ?x FILTER(contains(?x,'0.00053996'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'steradian', 'p': 'copy of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'unit conversion', 'o': '0.00053996'}}

 Q: What is the {Wikimedia category} for {category for films shot at this location} of {Montreal}
 SPARQL:  select distinct ?obj where { wd:Q340 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Montreal', 'p': 'category for films shot at this location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: Tell me health specialty whose name has the word sam in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44597158 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sexology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'health specialty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'sexology'}}

 Q: Which is the ICSC ID of sodium hydroxide?
 SPARQL: select distinct ?answer where { wd:Q102769 wdt:P5220 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'sodium hydroxide', 'p': 'ICSC ID', 'o': '?x0'}

 Q: Name the multiple star constellation where you can find Centaurus that starts with letter H
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q878367 . ?sbj wdt:P59 wd:Q8844 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'multiple star', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Centaurus'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What is the capital of Henan with a location of 34.7578?
 SPARQL: SELECT ?answer WHERE { wd:Q43684 wdt:P36 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'34.7578'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henan', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': '34.7578'}}

 Q: What is music genre of comes before  I mine øjne ?
 SPARQL: SELECT ?answer WHERE { wd:Q3791021 wdt:P156 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'I mine øjne', 'p': 'comes before', 'o': '$y0'}}

 Q: Which is replaced by North Carolina?
 SPARQL: select distinct ?answer where { wd:Q1454 wdt:P1365 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'North Carolina', 'p': 'replaced', 'o': '?x0'}

 Q: Name a color that contain the word "yellow " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1075 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yellow')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'color'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yellow'}}

 Q: What is {colour} of {team} of {Maurice Wellock} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6793531 wdt:P54 ?X . ?X wdt:P462 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'colour', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maurice Wellock', 'p': 'team', 'o': '$y0'}}

 Q: What is the {intergovernmental organization} for {subsidiary} of {United Nations General Assembly}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P355 wd:Q47423 . ?sbj wdt:P31 wd:Q245065 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'United Nations General Assembly', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'IGO'}}

 Q: What is the {essay} for {published in} of {Federalist Papers}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1433 wd:Q858036 . ?sbj wdt:P31 wd:Q35760 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'Federalist Papers', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'essay'}}

 Q: Give me {W3C Recommendation} that {series} {HyperText Markup Language} and which contains the word {html5} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj wdt:P179 wd:Q8811 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'html5')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'W3C Recommendation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'HyperText Markup Language'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'html5'}}

 Q: What are the orbits of the Local Bubble that are part of the constellation Orion?
 SPARQL: SELECT ?answer WHERE { wd:Q329182 wdt:P397 ?answer . ?answer wdt:P59 wd:Q8860}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Local Bubble', 'p': 'orbits', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Orion'}}

 Q: What is the {municipal flag} for {applies to jurisdiction} of {Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q220 . ?sbj wdt:P31 wd:Q21850100 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'jurisdiction', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal flag'}}

 Q: What are the direct-controlled municipality which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1208802 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'direct-controlled municipality'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: Which is Flanders Arts Institute organisation ID for Tate Modern?
 SPARQL: select distinct ?answer where { wd:Q193375 wdt:P5164 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tate Modern', 'p': 'Flanders Arts Institute organisation ID', 'o': '?x0'}

 Q: How many honorific prefixes relate to Sir?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P511 wd:Q209690 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'honorific prefix', 'o': 'Sir'}

 Q: Which country is the Hebrew language spoken?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q9288 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language spoken', 'o': 'Hebrew', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Which jobs did the characters of Pinocchio have?
 SPARQL: SELECT ?answer WHERE { wd:Q4341553 wdt:P674 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'job', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pinocchio', 'p': 'characters', 'o': '$y0'}}

 Q: What is <linguistic typology> of <Austro-Asiatic languages> ?
 SPARQL: select distinct ?answer where { wd:Q33199 wdt:P4132 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Austro-Asiatic languages', 'p': 'linguistic typology', 'o': '?x0'}

 Q: What is {divisions} of {service operator} of {Airbus A380} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5830 wdt:P137 ?X . ?X wdt:P199 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divisions', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Airbus A380', 'p': 'operator', 'o': '$y0'}}

 Q: What is {place held} of {took part in} of {Allies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q329888 wdt:P1344 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Allies', 'p': 'took part', 'o': '$y0'}}

 Q: What is the {human} for {founded by} of {Society of Jesus}
 SPARQL:  select distinct ?obj where { wd:Q36380 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Society of Jesus', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What was the position held by Bramwell Booth in 1929?
 SPARQL: SELECT ?obj WHERE { wd:Q2923664 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1929')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bramwell Booth', 'p': 'position held', 'o': '?x0', 't': '1929'}

 Q: what is the {applies to part} for {Malmö} has {area} as {2.371} ?
 SPARQL: SELECT ?value WHERE { wd:Q2211 p:P2046 ?s . ?s ps:P2046 ?x filter(contains(?x,'2.371')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malmö', 'p': 'area', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'area', 'o': '2.371'}}}

 Q: What is {associated with} of {item used} of {sailing ship} ?
 SPARQL: SELECT ?answer WHERE { wd:Q170483 wdt:P2283 ?X . ?X wdt:P3095 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'associated with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sailing ship', 'p': 'item used', 'o': '$y0'}}

 Q: What is {painting of} of {coat of arms} of {Overbetuwe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q600871 wdt:P237 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'painting of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Overbetuwe', 'p': 'coat of arms', 'o': '$y0'}}

 Q: Is the toughness of the polycarbonate  27.5?
 SPARQL: ASK WHERE { wd:Q62246 wdt:P5520 ?obj filter(?obj = 27.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'polycarbonate', 'p': 'toughness', 'o': '?x0', '?x0': '27.5'}

 Q: What is {sister or brother} of {portrait of} of {Flaying of Marsyas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21723151 wdt:P180 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Flaying of Marsyas', 'p': 'portrait of', 'o': '$y0'}}

 Q: Tell me municipal corporation in India whose name has the word nagar in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6936225 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nagar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal corporation in India'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'nagar'}}

 Q: What was Nastassja Kinski nominated for in 1980?
 SPARQL: SELECT ?obj WHERE { wd:Q76711 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nastassja Kinski', 'p': 'nominated for', 'o': '?x0', 't': '1980'}

 Q: What is { award received } from { Mario Puzo } which is the subject of { 47th Academy Awards }?
 SPARQL: SELECT ?obj WHERE { wd:Q182870 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q369706 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mario Puzo', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subject of', 'o': '47th Academy Awards'}}}

 Q: Which applies to taxon of protist?
 SPARQL: select distinct ?answer where { ?answer wdt:P2352 wd:Q10892}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'applies to taxon', 'o': 'protist'}

 Q: When did Las Palmas de Gran Canaria have a population of 383050.0?
 SPARQL: SELECT ?value WHERE { wd:Q11974 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'383050.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Las Palmas de Gran Canaria', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '383050.0'}, 't': '?x0'}

 Q: Give me {textile fibre} that {natural product of taxon} {Bombyx mori} and which that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj wdt:P1582 wd:Q134747 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'textile fibre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'natural product of taxon', 'o': 'Bombyx mori'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {item used} of {formation} of {Victor E. Renuart, Jr.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2522312 wdt:P241 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'item used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor E. Renuart, Jr.', 'p': 'formation', 'o': '$y0'}}

 Q: When did the life stance of saint governing text ?
 SPARQL: SELECT ?answer WHERE { wd:Q43115 wdt:P140 ?X . ?X wdt:P92 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'governing text', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'saint', 'p': 'life stance', 'o': '$y0'}}

 Q: What is the {aircraft model} with the {MAX(takeoff roll)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'takeoff roll', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft model'}}

 Q: What is the {college town} for {shares border with} of {Munich}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q1726 . ?sbj wdt:P31 wd:Q1187811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Munich', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'college town'}}

 Q: Did {Hunter_S._Thompson} {notable work} {Hell's Angels: The Strange and Terrible Saga of the Outlaw Motorcycle Gangs} and {The Kentucky Derby Is Decadent and Depraved} ?
 SPARQL: ASK WHERE { wd:Q219780 wdt:P800 wd:Q841931 . wd:Q219780 wdt:P800 wd:Q4158685 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Hunter S. Thompson', 'p': 'notable work', 'o': '?x0', '?x0': "Hell's Angels: The Strange and Terrible Saga of the Outlaw Motorcycle Gangs"}, {'h': 'IS', 'v': '?x1', 's': 'Hunter S. Thompson', 'p': 'notable work', 'o': '?x1', '?x1': 'The Kentucky Derby Is Decadent and Depraved'}]

 Q: Is the number of works for the school equal 7?
 SPARQL: ASK WHERE { wd:Q30668273 wdt:P3740 ?obj filter(?obj = 7) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'School', 'p': 'number of works', 'o': '?x0', '?x0': '7'}

 Q: What is {route of administration} of {led to} of {starch} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41534 wdt:P1542 ?X . ?X wdt:P636 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'route of administration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'starch', 'p': 'led to', 'o': '$y0'}}

 Q: when was the price for the united states dollar at 0.77101 around?
 SPARQL: SELECT ?value WHERE { wd:Q4917 p:P2284 ?s . ?s ps:P2284 ?x filter(contains(?x,'0.77101')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'dollar', 'p': 'price', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'price', 'o': '0.77101'}, 't': '?x0'}

