 Q: What is the {news conference} for {participant} of {Donald Trump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q22686 . ?sbj wdt:P31 wd:Q272281 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Donald Trump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'news conference'}}

 Q: who unit of density for measured by of density?
 SPARQL:  select distinct ?obj where { wd:Q29539 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q10387685 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'density', 'p': 'measured by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of density'}}

 Q: Which  anatomical location of place built of zygote ?
 SPARQL: SELECT ?answer WHERE { wd:Q170145 wdt:P1071 ?X . ?X wdt:P927 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'anatomical location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'zygote', 'p': 'place built', 'o': '$y0'}}

 Q: Which is Greek nymph which was the partner of Apollo?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P451 wd:Q37340 . ?sbj wdt:P31 wd:Q3346693 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Apollo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greek nymph'}}

 Q: what is the {start time} for {Prince Philip, Duke of Edinburgh} has {coat of arms image} as {Arms of Philip Mountbatten (1947-1949).svg} ?
 SPARQL: SELECT ?value WHERE { wd:Q80976 p:P94 ?s . ?s ps:P94 ?x filter(contains(?x,'Arms of Philip Mountbatten (1947-1949).svg')) . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Prince Philip, Duke of Edinburgh', 'p': 'coat of arms image', 'o': '$y0'}}

 Q: what is the {nominee} for {Gladiator} has {nominated for} as {Academy Award for Best Sound Mixing} ?
 SPARQL: SELECT ?value WHERE { wd:Q128518 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gladiator', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Sound'}}}

 Q: What are the national sports team  which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national sports team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What children did the brothers and sisters of Emmanuel Philibert, Prince of Carignano, have?
 SPARQL: SELECT ?answer WHERE { wd:Q2349136 wdt:P3373 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmanuel Philibert, Prince of Carignano', 'p': 'sister', 'o': '$y0'}}

 Q: What is {position held} of {John Tyler} that is {replaces} is {William Henry Harrison} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11881 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q11869 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Tyler', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'William Henry Harrison'}}}

 Q: Which is FIFA player ID for Stanislav Cherchesov?
 SPARQL: select distinct ?answer where { wd:Q699557 wdt:P1469 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stanislav Cherchesov', 'p': 'FIFA player ID', 'o': '?x0'}

 Q: Who is {followed by} and {follows} of {{Guy of Lusignan} has {noble title} as {King of Jerusalem}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'King of Jerusalem'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'King of Jerusalem'}}}]

 Q: Which is the historic era in Epaminondas having completed in 600-1-1?
 SPARQL: SELECT ?answer WHERE { wd:Q190436 wdt:P2348 ?answer . ?answer wdt:P582 ?x FILTER(contains(?x,'600-1-1'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Epaminondas', 'p': 'era', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'completed in', 'o': '600-1-1'}}

 Q: What was George Washington's military rank between 1774 and 1796?
 SPARQL: SELECT ?obj WHERE { wd:Q23 p:P410 ?s . ?s ps:P410 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1796')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Washington', 'p': 'military rank', 'o': '?x0', 't': '1796'}

 Q: What is {nominated for} of {Laurence Olivier} that is {statement is subject of} is {12th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q55245 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508513 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Laurence Olivier', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '12th Academy Awards'}}}

 Q: What is the SIRUTA code of Constanta?
 SPARQL: select distinct ?answer where { wd:Q79808 wdt:P843 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Constanta', 'p': 'SIRUTA code', 'o': '?x0'}

 Q: What is <Brockhaus Enzyklopädie online ID> of <Chile> ?
 SPARQL: select distinct ?answer where { wd:Q298 wdt:P5019 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chile', 'p': 'Brockhaus Enzyklopädie online ID', 'o': '?x0'}

 Q: Name a Luther city that contain the word "worms " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worms')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Luther city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'worms'}}

 Q: what is the {start time} for {Roman Abramovich} has {spouse} as {Irina Abramovich} ?
 SPARQL: SELECT ?value WHERE { wd:Q171428 p:P26 ?s . ?s ps:P26 wd:Q46109451 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roman Abramovich', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Irina Abramovich'}}}

 Q: Is it true that the target interest rate of Central Bank of Azerbaijan equals to 5.25?
 SPARQL: ASK WHERE { wd:Q190230 wdt:P2661 ?obj filter(?obj = 5.25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Central Bank of Azerbaijan', 'p': 'target interest rate', 'o': '?x0', '?x0': '5.25'}

 Q: Was Rupert Grint's occupation a actor and child actor?
 SPARQL: ASK WHERE { wd:Q19190 wdt:P106 wd:Q33999 . wd:Q19190 wdt:P106 wd:Q970153 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Rupert Grint', 'p': 'occupation', 'o': '?x0', '?x0': 'actor'}, {'h': 'IS', 'v': '?x1', 's': 'Rupert Grint', 'p': 'occupation', 'o': '?x1', '?x1': 'child actor'}]

 Q: Which is stated in Tripitaka?
 SPARQL: select distinct ?answer where { ?answer wdt:P248 wd:Q1321432}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stated in', 'o': 'Tripitaka'}

 Q: What is the  Mississippi Sports Hall of Fame ID  for Brett Favre ?
 SPARQL: select distinct ?answer where { wd:Q267088 wdt:P4368 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brett Favre', 'p': 'Mississippi Sports Hall of Fame ID', 'o': '?x0'}

 Q: What is {academic area} of {works at} of {Viktor Bespalov} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28792298 wdt:P108 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Viktor Bespalov', 'p': 'works at', 'o': '$y0'}}

 Q: Which is the GCatholic church ID of Archbasilica of St. John Lateran?
 SPARQL: select distinct ?answer where { wd:Q84090 wdt:P2971 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Archbasilica of St. John Lateran', 'p': 'GCatholic church ID', 'o': '?x0'}

 Q: What is {end time} and {place of marriage} of {{Marilyn Monroe} has {spouse} as {James Dougherty}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 wd:Q946783 . ?s pq:P582 ?value1 . ?s pq:P2842 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marilyn Monroe', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'James Dougherty'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'place of marriage', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marilyn Monroe', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'James Dougherty'}}}]

 Q: Which is the Kinopoisk person ID for Stanley Donen?
 SPARQL: select distinct ?answer where { wd:Q48765 wdt:P2604 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stanley Donen', 'p': 'Kinopoisk person ID', 'o': '?x0'}

 Q: Name a disease that starts with the letter Y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is on geographical feature of Greater Antilles whose continent is North America ?
 SPARQL: SELECT ?answer WHERE { wd:Q128011 wdt:P706 ?answer . ?answer wdt:P30 wd:Q49}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Greater Antilles', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'North America'}}

 Q: Ignatius of Loyola belongs to which Catholic order?
 SPARQL:  select distinct ?obj where { wd:Q44281 wdt:P611 ?obj . ?obj wdt:P31 wd:Q391009 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ignatius of Loyola', 'p': 'order', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Catholic order'}}

 Q: What is the {product} of {papermaking} which is {made of} {bleach} called?
 SPARQL: SELECT ?answer WHERE { wd:Q335415 wdt:P1056 ?answer . ?answer wdt:P186 wd:Q11587}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'papermaking', 'p': 'product', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'made of', 'o': 'bleach'}}

 Q: What is {fate} of {operated by} of {SS Naronic} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1298146 wdt:P137 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'SS Naronic', 'p': 'operated by', 'o': '$y0'}}

 Q: What is {chairwoman} of {working for} of {Vannevar Bush} ?
 SPARQL: SELECT ?answer WHERE { wd:Q299595 wdt:P108 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chairwoman', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vannevar Bush', 'p': 'working for', 'o': '$y0'}}

 Q: What is the {human} for {doctoral student} of {Jonas Salk}
 SPARQL:  select distinct ?obj where { wd:Q200101 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jonas Salk', 'p': 'doctoral student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {location of publication} of {Shen Bao}, that has {partner city} is {Rotterdam} ?
 SPARQL: SELECT ?answer WHERE { wd:Q919710 wdt:P291 ?answer . ?answer wdt:P190 wd:Q34370}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Shen Bao', 'p': 'location of publication', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'Rotterdam'}}

 Q: What is {has regions} of {Lower Saxony}, that has {on the coast of} is {Maade} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1197 wdt:P150 ?answer . ?answer wdt:P206 wd:Q1882240}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lower Saxony', 'p': 'has regions', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'on the coast of', 'o': 'Maade'}}

 Q: How many {medical condition treated} are for {diazepam} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q210402 wdt:P2175 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'diazepam', 'p': 'medical condition treated', 'o': '?x0'}

 Q: What is {has rural cities} of {Pará}, that has {inhabitants} is {13155} ?
 SPARQL: SELECT ?answer WHERE { wd:Q39517 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'13155'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Para', 'p': 'has rural cities', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '13155'}}

 Q: What is {position held} of {John Jay} that is {replaced by} is {William Carmichael} ?
 SPARQL: SELECT ?obj WHERE { wd:Q310847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q8006569 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Jay', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'William Carmichael'}}}

 Q: What are the type of food or dish that contains the word torta in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19861951 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'torta')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of food or dish'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'torta'}}

 Q: which type of quantum particle has highest gyromagnetic ratio?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2222 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'gyromagnetic ratio', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: Tell me literary genre whose name has the word vita in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vita')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vita'}}

 Q: What is {parent company of} of {works at} of {Roberta Bondar} ?
 SPARQL: SELECT ?answer WHERE { wd:Q258385 wdt:P108 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent company of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberta Bondar', 'p': 'works at', 'o': '$y0'}}

 Q: What is {working language} of {sovereign state} of {Alice Springs} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17872 wdt:P17 ?X . ?X wdt:P2936 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'working language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alice Springs', 'p': 'state', 'o': '$y0'}}

 Q: What is {short name} of {Aruba} that is {instance of} is {emoji flag sequence} ?
 SPARQL: SELECT ?obj WHERE { wd:Q21203 p:P1813 ?s . ?s ps:P1813 ?obj . ?s pq:P31 wd:Q28840786 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'short name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aruba', 'p': 'short name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'emoji flag sequence'}}}

 Q: What is native language for Vincent Auriol ?
 SPARQL: select distinct ?answer where { wd:Q158772 wdt:P103 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vincent Auriol', 'p': 'native language', 'o': '?x0'}

 Q: What is the {human} for {member of} of {Oracle Corporation}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P463 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Oracle Corporation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {musical composition} for {characters} of {Dionysus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'characters', 'o': 'Dionysus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical composition'}}

 Q: What is the {goddess} for {said to be the same as} of {Artemis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P460 wd:Q39503 . ?sbj wdt:P31 wd:Q205985 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'said to be the same as', 'o': 'Artemis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'goddess'}}

 Q: What is {position held} of {Martin V} that is {replaced by} is {Eugene IV} ?
 SPARQL: SELECT ?obj WHERE { wd:Q169612 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q167561 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin V', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Eugene IV'}}}

 Q: What was the {award won} by {Cream}, that was {introduced} in {1983-0-0}?
 SPARQL: SELECT ?answer WHERE { wd:Q203736 wdt:P166 ?answer . ?answer wdt:P1619 ?x FILTER(contains(YEAR(?x),'1983'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cream', 'p': 'award', 'o': '?x0', 't': '1983'}

 Q: Which  is farthest north of place held by Balkans Campaign?
 SPARQL: SELECT ?answer WHERE { wd:Q789406 wdt:P276 ?X . ?X wdt:P1332 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'farthest north', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Balkans Campaign', 'p': 'location', 'o': '$y0'}}

 Q: What is the {position} for {officeholder} of {Jacinda Ardern}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q3606816 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Jacinda Ardern', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is {category of associated people} of {theatre season} of {Odoacer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q103333 wdt:P2348 ?X . ?X wdt:P1792 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'category of associated people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Odoacer', 'p': 'theatre season', 'o': '$y0'}}

 Q: Which is dantai code for Kyōto Prefecture?
 SPARQL: select distinct ?answer where { wd:Q120730 wdt:P429 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kyōto Prefecture', 'p': 'dantai code', 'o': '?x0'}

 Q: What topic of the history of Estonia has the inflation rate of consumer price index of 1.2?
 SPARQL: SELECT ?answer WHERE { wd:Q949423 wdt:P1269 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'1.2'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Estonia', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '1.2'}}

 Q: Who gave the{route of administration} of {consequence} of {cyclohexane} ?
 SPARQL: SELECT ?answer WHERE { wd:Q211433 wdt:P1542 ?X . ?X wdt:P636 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'route of administration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cyclohexane', 'p': 'consequence', 'o': '$y0'}}

 Q: What is {religious affiliation} of {ethnicity} {Sirhan Sirhan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q297112 wdt:P172 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'religious affiliation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sirhan Sirhan', 'p': 'ethnicity', 'o': '$y0'}}

 Q: what is the {burial plot reference} for {Jean-François Champollion} has {place of burial} as {Père Lachaise Cemetery} ?
 SPARQL: SELECT ?value WHERE { wd:Q260 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'burial plot reference', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-François Champollion', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of burial', 'o': 'Père Lachaise Cemetery'}}}

 Q: What is {speakers of language} of {working languages} of {Kingdom of England} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179876 wdt:P2936 ?X . ?X wdt:P1098 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'speakers of language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kingdom of England', 'p': 'working languages', 'o': '$y0'}}

 Q: Who is the general manager of the Chicago Cubs?
 SPARQL: select distinct ?answer where { wd:Q246782 wdt:P505 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chicago Cubs', 'p': 'general manager', 'o': '?x0'}

 Q: Is the power consumed by the World Space Observatory more than 1200?
 SPARQL: ASK WHERE { wd:Q2569316 wdt:P2791 ?obj filter(?obj > 1200.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'World Space Observatory', 'p': 'power consumed', 'o': '?x0', '?x0': '1200.0'}

 Q: Is Vidhan Sabha executive body of Assam?
 SPARQL:  select distinct ?obj where { wd:Q1164 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Assam', 'p': 'executive body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Vidhan Sabha'}}

 Q: When was Vasily Chuikov awarded the Order of Lenin?
 SPARQL: SELECT ?value WHERE { wd:Q157594 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Vasily Chuikov', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of Lenin'}, 't': '?x0'}

 Q: Give me {guide book} that contains the word {ארץ} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ארץ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'guide book'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ארץ'}}

 Q: What is {working for} of {film producer} of {My Blue Heaven} ?
 SPARQL: SELECT ?answer WHERE { wd:Q733607 wdt:P162 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'working for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'My Blue Heaven', 'p': 'producer', 'o': '$y0'}}

 Q: Tell me kinship whose name has the word uncle in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uncle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kinship'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'uncle'}}

 Q: what are the painting which start with the letter y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: what is the {statement is subject of} for {Mercedes Ruehl} has {nominated for} as {Academy Award for Best Supporting Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q232933 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mercedes Ruehl', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Best Supporting Actress'}}}

 Q: What number follows -2?
 SPARQL: SELECT ?obj WHERE { wd:Q204 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P155 wd:Q3827340 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'o', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': '-2'}}}

 Q: Was the thickness of the Bronze Age equal to .615?
 SPARQL: ASK WHERE { wd:Q526178 wdt:P2610 ?obj filter(?obj = 0.615) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'The Age of Bronze', 'p': 'thickness', 'o': '?x0', '?x0': '0.615'}

 Q: What what is gas giant child astronomical body by Enceladus and also which starts with letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P398 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gas giant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Enceladus'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Is the Z scale scale 1:220?
 SPARQL: ASK WHERE { wd:Q1967226 wdt:P1752 ?obj filter(?obj = 220) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Z scale', 'p': 'scale', 'o': '?x0', '?x0': '220'}

 Q: Did {The_X-Files} {cast member} {George Murdock}?
 SPARQL: ASK WHERE { wd:Q2744 wdt:P161 wd:Q132217 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The X-Files', 'p': 'cast member', 'o': '?x0', '?x0': 'George Murdock'}]

 Q: What is the CDB Chemical ID for isopropyl alcohol?
 SPARQL: select distinct ?answer where { wd:Q16392 wdt:P2072 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'isopropyl alcohol', 'p': 'CDB Chemical ID', 'o': '?x0'}

 Q: Is the beats per minute of the Colorless Aura equal 50?
 SPARQL: ASK WHERE { wd:Q54906840 wdt:P1725 ?obj filter(?obj = 50) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Colorless Aura', 'p': 'beats per minute', 'o': '?x0', '?x0': '50'}

 Q: Which is the Darts Database player ID of Phil Taylor?
 SPARQL: select distinct ?answer where { wd:Q550313 wdt:P3621 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phil Taylor', 'p': 'Darts Database player ID', 'o': '?x0'}

 Q: What is {county seat for} of {died in} of {Innokenty Smoktunovsky} ?
 SPARQL: SELECT ?answer WHERE { wd:Q380250 wdt:P20 ?X . ?X wdt:P1376 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'county seat for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Innokenty Smoktunovsky', 'p': 'died in', 'o': '$y0'}}

 Q: What is {language official} of {World Baseball Softball Confederation}, that has {typology} is {nominative–accusative language} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11362472 wdt:P37 ?answer . ?answer wdt:P4132 wd:Q178435}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'World\xa0Baseball Softball\xa0Confederation', 'p': 'language official', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'typology', 'o': 'nominative–accusative language'}}

 Q: what is the {start time} for {Arab League} has {shares border with} as {Ethiopia} ?
 SPARQL: SELECT ?value WHERE { wd:Q7172 p:P47 ?s . ?s ps:P47 wd:Q115 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arab League', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'border', 'o': 'Ethiopia'}}}

 Q: Who is the  {human} for {doctoral advisor} of {Claude Shannon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P184 wd:Q92760 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'doctoral advisor', 'o': 'Claude Shannon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is SIC code of forestry ?
 SPARQL: select distinct ?answer where { wd:Q38112 wdt:P3242 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'forestry', 'p': 'SIC code', 'o': '?x0'}

 Q: What is {head of government} of {Seattle} and {work period (start)}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q5083 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P2031 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work period (start)', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seattle', 'p': 'head of government', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'head of government', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seattle', 'p': 'head of government', 'o': '$y0'}}]

 Q: What is Angela Merkel's abgeordnetenwatch.de politician ID?
 SPARQL: select distinct ?answer where { wd:Q567 wdt:P5355 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Angela Merkel', 'p': 'abgeordnetenwatch.de politician ID', 'o': '?x0'}

 Q: What award did Marie Curie receive in 1911?
 SPARQL: SELECT ?obj WHERE { wd:Q7186 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1911')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marie Curie', 'p': 'award', 'o': '?x0', 't': '1911'}

 Q: What are the comic strip which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q838795 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comic strip'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Is the age of majority of the USA equal to t1410874016?
 SPARQL: ASK WHERE { wd:Q30 wdt:P2997 ?obj filter(?obj = t1410874016) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'USA', 'p': 'age of majority', 'o': '?x0', '?x0': 't1410874016'}

 Q: When did award received of Alice Munro and followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q234819 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alice Munro', 'p': 'award received', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award received', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alice Munro', 'p': 'award received', 'o': '$y0'}}]

 Q: which organization name starts with z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Who is the {aircraft fleet} for {uses} of {airplane}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2283 wd:Q197 . ?sbj wdt:P31 wd:Q17372500 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'airplane', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft fleet'}}

