 Q: Which is the CAS Registry Number for calcium chloride?
 SPARQL: select distinct ?answer where { wd:Q208451 wdt:P231 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'calcium chloride', 'p': 'CAS Registry Number', 'o': '?x0'}

 Q: What is the weapon model with the maximum rate of fire whose subclass of is naval artillery?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P3792 ?obj . ?ent wdt:P279 wd:Q511450 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'rate of fire', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weapon model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'naval artillery'}}}

 Q: What is the {religious text} for {has edition} of {King James Version}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P747 wd:Q623398 . ?sbj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'King James Version', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: What is <Invaluable.com artist ID> of <Johannes V. Jensen> ?
 SPARQL: select distinct ?answer where { wd:Q159552 wdt:P4927 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Johannes V. Jensen', 'p': 'Invaluable.com artist ID', 'o': '?x0'}

 Q: What award did Karl von Frisch receive in 1921?
 SPARQL: SELECT ?obj WHERE { wd:Q60060 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1921')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Karl von Frisch', 'p': 'award', 'o': '?x0', 't': '1921'}

 Q: What is {discoverer of} of {runes}, that has {girlfriend} is {Gunnlöð} ?
 SPARQL: SELECT ?answer WHERE { wd:Q82996 wdt:P61 ?answer . ?answer wdt:P451 wd:Q166380}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'runes', 'p': 'discoverer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'girlfriend', 'o': 'Gunnlöð'}}

 Q: What is {start time} and {end time} of {{Anne Hathaway} has {educated at} as {New York University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36301 p:P69 ?s . ?s ps:P69 wd:Q49210 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anne Hathaway', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'New York University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'ending', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anne Hathaway', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'New York University'}}}]

 Q: which public educational institution of the United States starts with letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002039 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public educational institution of the United States'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is orbited by of star of Messier 4 ?
 SPARQL: SELECT ?answer WHERE { wd:Q11212 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'orbited by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 4', 'p': 'star', 'o': '$y0'}}

 Q: Is the earthquake magnitude on the Richter magnitude scale of the 2000 Yunnan earthquake more than 7.08?
 SPARQL: ASK WHERE { wd:Q4598012 wdt:P2528 ?obj filter(?obj > 7.08) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '2000 Yunnan earthquake', 'p': 'earthquake magnitude on the Richter magnitude scale', 'o': '?x0', '?x0': '7.08'}

 Q: Which is the BSD Portal athlete ID of Felix Loch?
 SPARQL: select distinct ?answer where { wd:Q60711 wdt:P4650 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Felix Loch', 'p': 'BSD Portal athlete ID', 'o': '?x0'}

 Q: What is {appointed by} and {end cause} of {{Eugenio Montale} has {position held} as {senatore a vita}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'appointed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eugenio Montale', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'senatore a vita'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eugenio Montale', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'senatore a vita'}}}]

 Q: What is {award received} of {Henry Mancini} that is {statement is subject of} is {34th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q185928 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q917163 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'win', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Mancini', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '34th Academy Awards'}}}

 Q: : What are the Cyprinus rubrofuscus which start with the letter k
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'k')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Cyprinus rubrofuscus'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'k'}}

 Q: Is the perimeter of Lai Lung .11?
 SPARQL: ASK WHERE { wd:Q682014 wdt:P2547 ?obj filter(?obj = 0.11) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lai Lung', 'p': 'perimeter', 'o': '?x0', '?x0': '0.11'}

 Q: Are the number of cases of the yellow fever equal to 136000.0?
 SPARQL: ASK WHERE { wd:Q154874 wdt:P1603 ?obj filter(?obj = 136000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'yellow fever', 'p': 'number of cases', 'o': '?x0', '?x0': '136000.0'}

 Q: What is the {type of quantum particle} for {antiparticle} of {elementary particle}
 SPARQL:  select distinct ?obj where { wd:Q43116 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'elementary particle', 'p': 'antiparticle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: what is the {point in time} for {Daniel Ellsberg} has {award received} as {American Book Awards} ?
 SPARQL: SELECT ?value WHERE { wd:Q431085 p:P166 ?s . ?s ps:P166 wd:Q463606 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Daniel Ellsberg', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'American Book Awards'}, 't': '?x0'}

 Q: What academic subject is Euler's identity the discoverer of?
 SPARQL: SELECT ?answer WHERE { wd:Q204819 wdt:P61 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Euler's identity", 'p': 'discoverer', 'o': '$y0'}}

 Q: Michael Dell is CEO of what privately held company?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q1589009 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'CEO', 'o': 'Michael Dell', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'privately held company'}}

 Q: What is the {political ideology} for {movement} of {Leon Trotsky}
 SPARQL:  select distinct ?obj where { wd:Q33391 wdt:P135 ?obj . ?obj wdt:P31 wd:Q14934048 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leon Trotsky', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political ideology'}}

 Q: Is it true that the magnetic moment of the helion is -0.000000000000000000000000010746174?
 SPARQL: ASK WHERE { wd:Q902715 wdt:P2069 ?obj filter(?obj = -0.000000000000000000000000010746174) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'helion', 'p': 'magnetic moment', 'o': '?x0', '?x0': '-0.000000000000000000000000010746174'}

 Q: What is the {mythological Greek character} for {relative} of {Hermes}
 SPARQL:  select distinct ?obj where { wd:Q41484 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q22988604 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hermes', 'p': 'relative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythological Greek character'}}

 Q: Is the personal best of Caster Semenya greater than 138.396
 SPARQL: ASK WHERE { wd:Q5834 wdt:P2415 ?obj filter(?obj > 138.396) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Caster Semenya', 'p': 'personal best', 'o': '?x0', '?x0': '138.396'}

 Q: What is {mother} and {date of birth} of {{Joseph Stalin} has {child} as {Vasily Dzhugashvili}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stalin', 'p': 'kid', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kid', 'o': 'Vasily Dzhugashvili'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stalin', 'p': 'kid', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kid', 'o': 'Vasily Dzhugashvili'}}}]

 Q: Is it true that the production rate of Jumilla more than 203978.4?
 SPARQL: ASK WHERE { wd:Q1112057 wdt:P2197 ?obj filter(?obj > 203978.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Jumilla', 'p': 'production rate', 'o': '?x0', '?x0': '203978.4'}

 Q: What is {creates} of {developed by} of {Autodesk Vault} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4826246 wdt:P178 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'creates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Autodesk Vault', 'p': 'developed by', 'o': '$y0'}}

 Q: what is the {start time} for {Fidel Castro} has {partner} as {Natalia Revuelta Clews} ?
 SPARQL: SELECT ?value WHERE { wd:Q11256 p:P451 ?s . ?s ps:P451 wd:Q19516418 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Castro', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Natalia Revuelta Clews'}}}

 Q: What prequel of plasma state of matter is using condensation?
 SPARQL: SELECT ?answer WHERE { wd:Q166583 wdt:P2283 ?answer . ?answer wdt:P156 wd:Q29148313}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'condensation', 'p': 'using', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'prequel of', 'o': 'plasma state of matter'}}

 Q: What is the birthplace of Saint Wenceslaus I, Duke of Bohemia, where the country is Czech Republic?
 SPARQL: SELECT ?answer WHERE { wd:Q196527 wdt:P19 ?answer . ?answer wdt:P3896 ?x FILTER(contains(?x,'Data:Czech Republic/Hlavní město Praha.map'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saint Wenceslaus I, Duke of Bohemia', 'p': 'birthplace', 'o': '?x0'}

 Q: Tell me the name of a religious denomination which starts with the letter u.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13414953 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious denomination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: Tell me me a allotrope of carbon whose name consist of the word "carbon" and whose shape crystal structure
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q622460 . ?sbj wdt:P1419 wd:Q895901 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'carbon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'allotrope of carbon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shape', 'o': 'crystal structure'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'carbon'}}

 Q: What is the {fallen angel} for {worshipped by} of {Christianity}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1049 wd:Q5043 . ?sbj wdt:P31 wd:Q581450 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': 'Christianity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fallen angel'}}

 Q: What is the {Special Administrative Region Basic Law} for {foundational text} of {Hong Kong}
 SPARQL:  select distinct ?obj where { wd:Q8646 wdt:P457 ?obj . ?obj wdt:P31 wd:Q10872094 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hong Kong', 'p': 'foundational text', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Special Administrative Region Basic Law'}}

 Q: What is the Women's Sports Foundation ID for Jennie Finch?
 SPARQL: select distinct ?answer where { wd:Q2406028 wdt:P4377 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jennie Finch', 'p': "Women's Sports Foundation ID", 'o': '?x0'}

 Q: What is the {Esperanto organization} for {language regulatory body} of {Esperanto}
 SPARQL:  select distinct ?obj where { wd:Q143 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q15494038 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'language regulatory body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Esperanto organization'}}

 Q: When did educated at of Venus Williams and academic major?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venus Williams', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venus Williams', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {empire} for {followed by} of {Parthian Empire}
 SPARQL:  select distinct ?obj where { wd:Q1986139 wdt:P156 ?obj . ?obj wdt:P31 wd:Q48349 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Parthian Empire', 'p': 'followed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire'}}

 Q: Is the Bohler N680's hardness 59?
 SPARQL: ASK WHERE { wd:Q55755747 wdt:P5483 ?obj filter(?obj = 59) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Bohler N680', 'p': 'hardness', 'o': '?x0', '?x0': '59'}

 Q: Is the employment by economic sector of Amsterdam equal to 209100.0?
 SPARQL: ASK WHERE { wd:Q9899 wdt:P2297 ?obj filter(?obj = 209100.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Amsterdam', 'p': 'employment by economic sector', 'o': '?x0', '?x0': '209100.0'}

 Q: What is the {human} for {mother} of {Richard I of England}
 SPARQL:  select distinct ?obj where { wd:Q42305 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Richard I of England', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {middle name} of {Frederick I}, that has {close to} is {Frederick} ?
 SPARQL: SELECT ?answer WHERE { wd:Q79789 wdt:P735 ?answer . ?answer wdt:P460 wd:Q3273004}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frederick I', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'close to', 'o': 'Frederick'}}

 Q: What is {movie director} of {part of series} of {Home Court Disadvantage} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50383471 wdt:P179 ?X . ?X wdt:P57 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'director', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Home Court Disadvantage', 'p': 'part of series', 'o': '$y0'}}

 Q: Tell me programming paradigm whose name the word programming in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188267 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'programming')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'programming paradigm'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'programming'}}

 Q: What is the alma mater of Elgin Baylor whose position is -122.319?
 SPARQL: SELECT ?answer WHERE { wd:Q357458 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-122.319'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Elgin Baylor', 'p': 'alma mater', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'position', 'o': '-122.319'}}

 Q: What are the mythological serpent which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16326794 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ž')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythological serpent'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ž'}}

 Q: How many {country of citizenship} are for {Mikhail Fridman} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q732142 wdt:P27 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Mikhail Fridman', 'p': 'country of citizenship', 'o': '?x0'}

 Q: which laws applied for potassium hydroxide ?
 SPARQL: select distinct ?answer where { wd:Q132298 wdt:P3014 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'potassium hydroxide', 'p': 'laws applied', 'o': '?x0'}

 Q: What is {followed by} and {follows} of {{Victor Hugo} has {member of} as {Académie française}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q535 p:P463 ?s . ?s ps:P463 wd:Q161806 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Académie française'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Hugo', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Académie française'}}}]

 Q: What is {position held} of {Arthur Griffith} that is {electoral district} is {East Cavan} ?
 SPARQL: SELECT ?obj WHERE { wd:Q342765 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q5328039 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Griffith', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'electoral district', 'o': 'East Cavan'}}}

 Q: Which is the BDCYL authority ID for José Echegaray?
 SPARQL: select distinct ?answer where { wd:Q127349 wdt:P3964 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'José Echegaray', 'p': 'BDCYL authority ID', 'o': '?x0'}

 Q: Is the vapor pressure of the Nonane equal to 3?
 SPARQL: ASK WHERE { wd:Q150694 wdt:P2119 ?obj filter(?obj = 3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nonan', 'p': 'vapor pressure', 'o': '?x0', '?x0': '3'}

 Q: What is {makes use of} of {sport played} of {Mariano Rivera} ?
 SPARQL: SELECT ?answer WHERE { wd:Q382303 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'makes use of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mariano Rivera', 'p': 'sport', 'o': '$y0'}}

 Q: Which is the discontinued date of PlayStation 3?
 SPARQL: select distinct ?answer where { wd:Q10683 wdt:P2669 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'PlayStation 3', 'p': 'discontinued date', 'o': '?x0'}

 Q: How much full-time work is available at the North Atlantic Treaty?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q877399 wdt:P953 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'North Atlantic Treaty', 'p': 'available at', 'o': '?x0'}

 Q: What is {governor} of {Aosta Valley}, that has {employment} is {veterinarian} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1222 wdt:P6 ?answer . ?answer wdt:P106 wd:Q202883}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aosta Valley', 'p': 'governor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'employment', 'o': 'veterinarian'}}

 Q: Which is the Arch Linux package for PHP?
 SPARQL: select distinct ?answer where { wd:Q59 wdt:P3454 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'PHP', 'p': 'Arch Linux package', 'o': '?x0'}

 Q: Which is the age of candidacy for South Korea?
 SPARQL: select distinct ?answer where { wd:Q884 wdt:P2998 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'South Korea', 'p': 'age of candidacy', 'o': '?x0'}

 Q: How many medical examinations are required for medical ultrasonography} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P923 wd:Q234904 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'medical examinations', 'o': 'medical ultrasonography'}

 Q: What type of relationship did the siblings Carl Philipp Emanuel Bach and Wilhelm Friedemann Bach have?
 SPARQL: SELECT ?value WHERE { wd:Q76428 p:P3373 ?s . ?s ps:P3373 wd:Q107277 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of relationship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Philipp Emanuel Bach', 'p': 'sibling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sibling', 'o': 'Wilhelm Friedemann Bach'}}}

 Q: Was Benedict Arnold from the military branch of the Royal Navy and Continental Army?
 SPARQL: ASK WHERE { wd:Q298237 wdt:P241 wd:Q172771 . wd:Q298237 wdt:P241 wd:Q54122 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Benedict Arnold', 'p': 'military branch', 'o': '?x0', '?x0': 'Royal Navy'}, {'h': 'IS', 'v': '?x1', 's': 'Benedict Arnold', 'p': 'military branch', 'o': '?x1', '?x1': 'Continental Army'}]

 Q: What is {language} of {William John Macquorn Rankine}, that has {typology} is {place–manner–time} ?
 SPARQL: SELECT ?answer WHERE { wd:Q232149 wdt:P1412 ?answer . ?answer wdt:P4132 wd:Q7200373}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William John Macquorn Rankine', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'typology', 'o': 'place–manner–time'}}

 Q: What is the {markup language} for {has edition} of {HTML5}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q37045 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'HTML5', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'markup language'}}

 Q: What is {diplomatic relation} of {Algeria} that is {statement is subject of} is {Algeria–Indonesia relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q262 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948965 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Algeria', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Algeria–Indonesia relations'}}}

 Q: what is the {point in time} for {Tomáš Garrigue Masaryk} has {nominated for} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q78492 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tomáš Garrigue Masaryk', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: Which is the cardinality of this set of 1?
 SPARQL: select distinct ?answer where { ?answer wdt:P2820 wd:Q199}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cardinality of this set', 'o': '1'}

 Q: Which is the British Book Trade Index ID for John Knox?
 SPARQL: select distinct ?answer where { wd:Q189937 wdt:P2945 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Knox', 'p': 'British Book Trade Index ID', 'o': '?x0'}

 Q: What is {member of} of {Margaret Thatcher} that is {end time} is {2013-4-8} ?
 SPARQL: SELECT ?obj WHERE { wd:Q7416 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Margaret Thatcher', 'p': 'member of', 'o': '?x0', 't': '2013'}

 Q: What is the {television series} for {executive producer} of {Francis Ford Coppola}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1431 wd:Q56094 . ?sbj wdt:P31 wd:Q5398426 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'executive producer', 'o': 'Francis Ford Coppola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}}

 Q: What are the United States Supreme Court decision which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19692072 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'United States Supreme Court decision'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {music by} of {Rhapsody in Blue}, that has {profession} is {songwriter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q722599 wdt:P86 ?answer . ?answer wdt:P106 wd:Q753110}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rhapsody in Blue', 'p': 'songwriter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'profession', 'o': 'songwriter'}}

 Q: What is <may prevent> of <aspirin> ?
 SPARQL: select distinct ?answer where { wd:Q18216 wdt:P4954 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aspirin', 'p': 'may prevent', 'o': '?x0'}

 Q: What is developed from fruit?
 SPARQL: select distinct ?answer where { wd:Q1364 wdt:P3094 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fruit', 'p': 'developed from', 'o': '?x0'}

 Q: What is the {municipality of the Philippines} with the {MAX(electorate)} whose {located in the administrative territorial entity} is {Bohol}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q24764 . ?ent wdt:P1831 ?obj . ?ent wdt:P131 wd:Q13752 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'electorate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of the Philippines', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Bohol'}}}

 Q: DOES THE MAXIMUM THRUST OF THE CONCORDE EQUALS 676800
 SPARQL: ASK WHERE { wd:Q6505 wdt:P2228 ?obj filter(?obj = 676800) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Concorde', 'p': 'maximum thrust', 'o': '?x0', '?x0': '676800'}

 Q: What is Vancouver Island bordered by in administrative units?
 SPARQL: SELECT ?answer WHERE { wd:Q170479 wdt:P131 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bordered by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vancouver Island', 'p': 'in administrative unit', 'o': '$y0'}}

 Q: Which Class IIIA combustible liquid has the highest IDLH?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009058 . ?ent wdt:P2129 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'IDLH', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IIIA combustible liquid'}}

 Q: What custom contains the word zwänzgerle in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q251777 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zwänzgerle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'custom'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zwänzgerle'}}

 Q: What is {position held} of {Mahathir Mohamad} that is {start time} is {2018-5-10} ?
 SPARQL: SELECT ?obj WHERE { wd:Q181383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mahathir Mohamad', 'p': 'position held', 'o': '?x0', 't': '2018'}

 Q: What is <product or material produced> of <Chevron Corporation> ?
 SPARQL: select distinct ?answer where { wd:Q319642 wdt:P1056 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chevron', 'p': 'product or material produced', 'o': '?x0'}

 Q: what is the {subject has role} for {John Hope Franklin} has {member of} as {American Historical Association} ?
 SPARQL: SELECT ?value WHERE { wd:Q1367397 p:P463 ?s . ?s ps:P463 wd:Q464915 . ?s pq:P2868 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hope Franklin', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'American Historical Association'}}}

 Q: What is the {geometric concept} for {manifestation of} of {spacetime}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q133327 . ?sbj wdt:P31 wd:Q21550639 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'spacetime', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geometric concept'}}

 Q: What is the {business enterprise} with the {MAX(target interest rate)} whose {instance of} is {central bank}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2661 ?obj . ?ent wdt:P31 wd:Q66344 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'target interest rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'central bank'}}}

 Q: Did {Paul_Simon} {award received} {60th Primetime Emmy Awards} and {Grammy Lifetime Achievement Award} ?
 SPARQL: ASK WHERE { wd:Q4028 wdt:P166 wd:Q1338928 . wd:Q4028 wdt:P166 wd:Q935843 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Paul Simon', 'p': 'award received', 'o': '?x0', '?x0': '60th Primetime Emmy Awards'}, {'h': 'IS', 'v': '?x1', 's': 'Paul Simon', 'p': 'award received', 'o': '?x1', '?x1': 'Grammy Lifetime Achievement Award'}]

 Q: What is {instruction set} of {runtime} of {Windows 95} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83370 wdt:P400 ?X . ?X wdt:P1068 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instruction set', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Windows 95', 'p': 'runtime', 'o': '$y0'}}

 Q: Name a mutant in X-MEN that starts with letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1094617 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mutant'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {traditional story} for {characters} of {Robin Hood}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P674 wd:Q122634 . ?sbj wdt:P31 wd:Q7832362 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'characters', 'o': 'Robin Hood', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'traditional story'}}

