 Q: What's Andrew Gaze's Australian Olympic Committee athlete ID.
 SPARQL: select distinct ?answer where { wd:Q504835 wdt:P3682 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andrew Gaze', 'p': 'Australian Olympic Committee athlete ID', 'o': '?x0'}

 Q: What is the date of birth and date of death of the child of Joseph Stalin, Vasily Dzhugashvili?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Vasily Dzhugashvili'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Vasily Dzhugashvili'}}}]

 Q: Which is the title of honor for the honorific prefix of the Salman of Saudi Arabia?
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P511 ?obj . ?obj wdt:P31 wd:Q3320743 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'honorific prefix', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'title of honor'}}

 Q: what is the {start time} for {Ann Dunham} has {spouse} as {Lolo Soetoro} ?
 SPARQL: SELECT ?value WHERE { wd:Q766106 p:P26 ?s . ?s ps:P26 wd:Q4115068 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ann Dunham', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': 'Lolo Soetoro'}}}

 Q: What is the {neighborhood} for {located in the administrative territorial entity} of {Milwaukee}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q37836 . ?sbj wdt:P31 wd:Q123705 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Milwaukee', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'neighborhood'}}

 Q: How many programmers does Yuji Naka have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q726119 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'programmer', 'o': 'Yuji Naka'}

 Q: What is {field of this profession} of {profession} of {Davide Bassan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3703492 wdt:P106 ?X . ?X wdt:P425 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of this profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Davide Bassan', 'p': 'profession', 'o': '$y0'}}

 Q: What is {eponym} of {Turing test}, that has {dissertation} is {Systems of Logic Based on Ordinals} ?
 SPARQL: SELECT ?answer WHERE { wd:Q189223 wdt:P138 ?answer . ?answer wdt:P1026 wd:Q7663875}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Turing test', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'dissertation', 'o': 'Systems of Logic Based on Ordinals'}}

 Q: What is portrayed by track list of Morning Musume no Hyokkori Hyōtanjima ?
 SPARQL: SELECT ?answer WHERE { wd:Q1137292 wdt:P658 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrayed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Morning Musume no Hyokkori Hyōtanjima', 'p': 'track list', 'o': '$y0'}}

 Q: Did {Scott Stevens} {award received} {Hart Memorial Trophy} and {Art Ross Trophy} ?
 SPARQL: ASK WHERE { wd:Q281303 wdt:P166 wd:Q678383 . wd:Q281303 wdt:P166 wd:Q705707 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Scott Stevens', 'p': 'award received', 'o': '?x0', '?x0': 'Hart Memorial Trophy'}, {'h': 'IS', 'v': '?x1', 's': 'Scott Stevens', 'p': 'award received', 'o': '?x1', '?x1': 'Art Ross Trophy'}]

 Q: Which is the business for which Steve Jobs was a board member?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3320 wd:Q19837 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'board member', 'o': 'Steve Jobs', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is the capital of the secular state of Montevideo?
 SPARQL:  select distinct ?obj where { wd:Q1335 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q859563 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Montevideo', 'p': 'capital of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'secular state'}}

 Q: What is the {metropolitan region in Germany} for {located on terrain feature} of {Frankfurt}
 SPARQL:  select distinct ?obj where { wd:Q1794 wdt:P706 ?obj . ?obj wdt:P31 wd:Q1132300 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Frankfurt', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolitan region in Germany'}}

 Q: Is the Trans-Gabon Railway maximum gradient equal to 8?
 SPARQL: ASK WHERE { wd:Q32215 wdt:P2595 ?obj filter(?obj = 8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Trans-Gabon Railway', 'p': 'maximum gradient', 'o': '?x0', '?x0': '8'}

 Q: What is the {filmography} for {filmography} of {Mary Pickford}
 SPARQL:  select distinct ?obj where { wd:Q104109 wdt:P1283 ?obj . ?obj wdt:P31 wd:Q1371849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mary Pickford', 'p': 'filmography', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'filmography'}}

 Q: what is the field of action of the works for of Michael Stipe?
 SPARQL: SELECT ?answer WHERE { wd:Q215182 wdt:P108 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of action', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Stipe', 'p': 'works for', 'o': '$y0'}}

 Q: Which platforms have software versions of Fallout release 10.14 beta 4?
 SPARQL: SELECT ?answer WHERE { wd:Q167835 wdt:P400 ?answer . ?answer wdt:P348 ?x FILTER(contains(?x,'10.14 beta 4'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fallout', 'p': 'platform', 'o': '?x0'}

 Q: What is {etymology} of {Planck time}, that has {doctoral student} is {Walther Bothe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q202642 wdt:P138 ?answer . ?answer wdt:P185 wd:Q76474}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Planck time', 'p': 'etymology', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'doctoral student', 'o': 'Walther Bothe'}}

 Q: Tell me the intergovernmental organization of the coat of arms of Emblem of the Association of Southeast Asian Nations that starts with the letter a!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj wdt:P237 wd:Q128544 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intergovernmental organization', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coat of arms', 'o': 'Emblem of the Association of Southeast Asian Nations'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: What is {afterword by} of {in work} of {Room 101} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1186638 wdt:P1441 ?X . ?X wdt:P2680 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'afterword by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Room 101', 'p': 'in work', 'o': '$y0'}}

 Q: What is the {human} for {manager/director} of {Secret Intelligence Service}
 SPARQL:  select distinct ?obj where { wd:Q184560 wdt:P1037 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Secret Intelligence Service', 'p': 'director', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Tell me the newspaper that has English as language of work and contains the word tribune in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj wdt:P407 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tribune')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newspaper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'language of work', 'o': 'English'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tribune'}}

 Q: Which is the organization for the subsidiary of Rutgers University?
 SPARQL:  select distinct ?obj where { wd:Q499451 wdt:P355 ?obj . ?obj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rutgers University', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: what is the {end time} for {Taipei 101} has {significant event} as {construction} ?
 SPARQL: SELECT ?value WHERE { wd:Q83101 p:P793 ?s . ?s ps:P793 wd:Q385378 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taipei 101', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'significant event', 'o': 'construction'}}}

 Q: How many {convicted of} are for {Andrei Chikatilo} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q44496 wdt:P1399 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Andrei Chikatilo', 'p': 'convicted of', 'o': '?x0'}

 Q: Who succeeds to John McIntosh, the inventor of Honeycrisp?
 SPARQL: SELECT ?answer WHERE { wd:Q3140024 wdt:P155 ?answer . ?answer wdt:P61 wd:Q3182058}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Honeycrisp', 'p': 'succeeds to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inventor', 'o': 'John McIntosh'}}

 Q: What is the works for of the movie director of  Primate ?
 SPARQL: SELECT ?answer WHERE { wd:Q3403168 wdt:P57 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'works for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Primate', 'p': 'director', 'o': '$y0'}}

 Q: Who did Rod Steiger marry in 1959?
 SPARQL: SELECT ?obj WHERE { wd:Q273215 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1959')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rod Steiger', 'p': 'marry', 'o': '?x0', 't': '1959'}

 Q: What is the sister city of Kharkiv which has a population of 850?
 SPARQL: SELECT ?answer WHERE { wd:Q42308 wdt:P190 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'850.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kharkiv', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '850.0'}}

 Q: What is MusicBrainz place ID for Cardiff University ?
 SPARQL: select distinct ?answer where { wd:Q1035745 wdt:P1004 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardiff University', 'p': 'MusicBrainz place ID', 'o': '?x0'}

 Q: What is {field of study} of {writers} of {René Leduc. Pionnier de la propulsion à réaction. 2000} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50810219 wdt:P50 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of study', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'René Leduc. Pionnier de la propulsion à réaction. 2000', 'p': 'writer', 'o': '$y0'}}

 Q: Who gave the{deathdate} of {directed by} of {The World According to Garp} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2507282 wdt:P57 ?X . ?X wdt:P570 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'deathdate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The World According to Garp', 'p': 'directed by', 'o': '$y0'}}

 Q: what is the {start time} for {Doris Lessing} has {spouse} as {Gottfried Lessing} ?
 SPARQL: SELECT ?value WHERE { wd:Q40874 p:P26 ?s . ?s ps:P26 wd:Q215347 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Doris Lessing', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Gottfried Lessing'}}}

 Q: What is {member of} of {attendee} of {Battle of Vittorio Veneto} ?
 SPARQL: SELECT ?answer WHERE { wd:Q662961 wdt:P710 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Battle of Vittorio Veneto', 'p': 'attendee', 'o': '$y0'}}

 Q: Which {diplomatic relation} of {sovereign state} of {Adelaide} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5112 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adelaide', 'p': 'sovereign state', 'o': '$y0'}}

 Q: How many head coaches are there for FC Bayern Munich?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q15789 wdt:P286 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'FC Bayern Munich', 'p': 'head coach', 'o': '?x0'}

 Q: What is {this taxon is a source of} of {taxon parent} of {Musa juwiniana} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10590521 wdt:P171 ?X . ?X wdt:P1672 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'this taxon is a source of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Musa juwiniana', 'p': 'taxon parent', 'o': '$y0'}}

 Q: Which is the patron saint for Sabadell?
 SPARQL: select distinct ?answer where { wd:Q12258 wdt:P417 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sabadell', 'p': 'patron saint', 'o': '?x0'}

 Q: What is a taxonomic rank that starts with the letter v.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427626 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxonomic rank'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is <official religion> of <Parthian Empire> ?
 SPARQL: select distinct ?answer where { wd:Q1986139 wdt:P3075 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Parthian Empire', 'p': 'official religion', 'o': '?x0'}

 Q: What is {principal place} of {Khmer Empire}, that has {point on a map} is {13.433333333333 103.83333333333} ?
 SPARQL: SELECT ?answer WHERE { wd:Q201705 wdt:P36 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'13.433333333333 103.83333333333'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Khmer Empire', 'p': 'capital', 'o': '?x0'}

 Q: What are the unit of mass which start with the letter zuz
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zuz')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of mass'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zuz'}}

 Q: what is the {end time} for {Louis XV of France} has {position held} as {King of France and Navarre} ?
 SPARQL: SELECT ?value WHERE { wd:Q7738 p:P39 ?s . ?s ps:P39 wd:Q3439798 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis XV of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of France and Navarre'}}}

 Q: Did {Transport_Layer_Security} {used by} {Extensible Authentication Protocol} and {SMTPS} ?
 SPARQL: ASK WHERE { wd:Q206494 wdt:P1535 wd:Q1146165 . wd:Q206494 wdt:P1535 wd:Q949493 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Transport Layer Security', 'p': 'used by', 'o': '?x0', '?x0': 'Extensible Authentication Protocol'}, {'h': 'IS', 'v': '?x1', 's': 'Transport Layer Security', 'p': 'used by', 'o': '?x1', '?x1': 'SMTPS'}]

 Q: tell me about sedative contains the word nutmeg in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q847705 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nutmeg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sedative'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'nutmeg'}}

 Q: What is <Crunchyroll ID> of <Cowboy Bebop> ?
 SPARQL: select distinct ?answer where { wd:Q232246 wdt:P4110 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cowboy Bebop', 'p': 'Crunchyroll ID', 'o': '?x0'}

 Q: What is {characters} of {is shown in} of {Bobby Smiles} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10431845 wdt:P1441 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bobby Smiles', 'p': 'is shown in', 'o': '$y0'}}

 Q: IS THE PARALLAX OF THE VEGA EQUALS 128.93
 SPARQL: ASK WHERE { wd:Q3427 wdt:P2214 ?obj filter(?obj = 128.93) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vega', 'p': 'parallax', 'o': '?x0', '?x0': '128.93'}

 Q: How many feast days are done by Pentecost?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P841 wd:Q39864 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'feast day', 'o': 'Pentecost'}

 Q: What is the {pharmaceutical product} for {active ingredient in} of {niacin}
 SPARQL:  select distinct ?obj where { wd:Q134658 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'niacin', 'p': 'active ingredient in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: What are the  heavy metal band which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'heavy metal band'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which is the island nation for the country of pound sterling?
 SPARQL:  select distinct ?obj where { wd:Q25224 wdt:P17 ?obj . ?obj wdt:P31 wd:Q112099 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pound sterling', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'island nation'}}

 Q: Was 201 the total number of valid votes cast n the 2015 Catalan regional election in Malla?
 SPARQL: ASK WHERE { wd:Q44877325 wdt:P1697 ?obj filter(?obj = 201) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Catalan regional election 2015 in Malla', 'p': 'valid votes', 'o': '?x0', '?x0': '201'}

 Q: Did {NASA} {subsidiary} {German Aerospace Center} and {NASA Astrobiology Institute} ?
 SPARQL: ASK WHERE { wd:Q23548 wdt:P355 wd:Q157332 . wd:Q23548 wdt:P355 wd:Q1147312 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'NASA', 'p': 'subsidiary', 'o': '?x0', '?x0': 'German Aerospace Center'}, {'h': 'IS', 'v': '?x1', 's': 'NASA', 'p': 'subsidiary', 'o': '?x1', '?x1': 'NASA Astrobiology Institute'}]

 Q: Is the fiscal/tax revenue of Manabo under 44305723.128?
 SPARQL: ASK WHERE { wd:Q29082 wdt:P3087 ?obj filter(?obj < 44305723.128) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Manabo', 'p': 'fiscal/tax revenue', 'o': '?x0', '?x0': '44305723.128'}

 Q: what is the {start time} for {Zhejiang} has {located in the administrative territorial entity} as {Ming dynasty} ?
 SPARQL: SELECT ?value WHERE { wd:Q16967 p:P131 ?s . ?s ps:P131 wd:Q9903 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zhejiang', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Ming dynasty'}}}

 Q: What are the  freeway network which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55504191 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'freeway network'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which river has the most throughput?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4022 . ?ent wdt:P2957 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'throughput', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: What is {nominated for} of {Billy Wilder} that is {statement is subject of} is {39th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51547 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q167214 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Billy Wilder', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '39th Academy Awards'}}}

 Q: Which is the edition or translation of Internet Protocol version 6?
 SPARQL: select distinct ?answer where { wd:Q2551624 wdt:P629 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Internet Protocol version 6', 'p': 'edition or translation of', 'o': '?x0'}

 Q: What is the locomotive class with the most stroke whose operator is Lancashire, Derbyshire and East Coast Railway?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P2557 ?obj . ?ent wdt:P137 wd:Q6482976 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'stroke', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'locomotive class', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Lancashire, Derbyshire and East Coast Railway'}}}

 Q: who is video game publisher of safety classification and labelling of β-lactose ?
 SPARQL: SELECT ?answer WHERE { wd:Q127900 wdt:P4952 ?X . ?X wdt:P123 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'β-lactose', 'p': 'safety classification and labelling', 'o': '$y0'}}

 Q: Which is the TheFinalBall player ID of Cristiano Ronaldo?
 SPARQL: select distinct ?answer where { wd:Q11571 wdt:P3047 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cristiano Ronaldo', 'p': 'TheFinalBall player ID', 'o': '?x0'}

 Q: Who is {subject} of {inventor or discoverer} of {Bogdanov-Takens bifurcation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4937510 wdt:P61 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bogdanov-Takens bifurcation', 'p': 'inventor', 'o': '$y0'}}

 Q: What vein is connected to the small intestine?
 SPARQL: SELECT ?answer WHERE { wd:Q11090 wdt:P2789 ?X . ?X wdt:P2289 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'vein', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'small intestine', 'p': 'connected to', 'o': '$y0'}}

 Q: What is {number of out of school children} of {continent} of {Scotland} ?
 SPARQL: SELECT ?answer WHERE { wd:Q22 wdt:P30 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Scotland', 'p': 'continent', 'o': '$y0'}}

 Q: What is the {county of Norway} for {shares border with} of {Oslo}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q585 . ?sbj wdt:P31 wd:Q192299 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Oslo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'county of Norway'}}

 Q: Which is the College Football HoF ID for Red Grange?
 SPARQL: select distinct ?answer where { wd:Q1399654 wdt:P3044 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Red Grange', 'p': 'College Football HoF ID', 'o': '?x0'}

 Q: Was William McKinley educated at the Allegheny College and the New York Law School?
 SPARQL: ASK WHERE { wd:Q35041 wdt:P69 wd:Q4062566 . wd:Q35041 wdt:P69 wd:Q3339059 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'William McKinley', 'p': 'educated at', 'o': '?x0', '?x0': 'Allegheny College'}, {'h': 'IS', 'v': '?x1', 's': 'William McKinley', 'p': 'educated at', 'o': '?x1', '?x1': 'New York Law School'}]

 Q: What is the {human} for {sibling} of {Aisha}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3373 wd:Q4730963 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Aisha', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What was the award received by The Great Dictator that is point in time was 1940-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q109116 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1940')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Great Dictator', 'p': 'award received', 'o': '?x0', 't': '1940'}

 Q: How many {presenter} are to/by {Dick Clark} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P371 wd:Q366563 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'Dick Clark'}

 Q: which method starts with w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1799072 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'method'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is endemic to kangaroo ?
 SPARQL: select distinct ?answer where { wd:Q5070208 wdt:P183 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'kangaroo', 'p': 'endemic to', 'o': '?x0'}

 Q: What is the alphabet of Furutachi based upon?
 SPARQL: SELECT ?answer WHERE { wd:Q27306164 wdt:P282 ?X . ?X wdt:P144 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'based upon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Furutachi', 'p': 'alphabet', 'o': '$y0'}}

 Q: What is {grave at} of {son of} of {Sancha of Castile, Queen of Navarre} ?
 SPARQL: SELECT ?answer WHERE { wd:Q939696 wdt:P25 ?X . ?X wdt:P119 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'grave at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sancha of Castile, Queen of Navarre', 'p': 'son of', 'o': '$y0'}}

 Q: Which lake has the largest length?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q23397 . ?ent wdt:P2043 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'length', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lake'}}

 Q: Which is the NNDB people ID for Orson Welles?
 SPARQL: select distinct ?answer where { wd:Q24829 wdt:P1263 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Orson Welles', 'p': 'NNDB people ID', 'o': '?x0'}

 Q: What is {home venue} of {New York Yankees} that is {end time} is {1922-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q213417 p:P115 ?s . ?s ps:P115 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1922')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New York Yankees', 'p': 'home venue', 'o': '?x0', 't': '1922'}

 Q: What is  in the hymenium attachment of Boletus edulis ?
 SPARQL: select distinct ?answer where { wd:Q19740 wdt:P785 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Boletus edulis', 'p': 'hymenium attachment', 'o': '?x0'}

 Q: When did Lublin cease to be a Kingdom of Poland?
 SPARQL: SELECT ?value WHERE { wd:Q37333 p:P17 ?s . ?s ps:P17 wd:Q696908 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lublin', 'p': 'land', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'land', 'o': 'Kingdom of Poland'}}}

 Q: what is the {start time} for {Peyton Manning} has {member of sports team} as {Tennessee Volunteers football} ?
 SPARQL: SELECT ?value WHERE { wd:Q7539 p:P54 ?s . ?s ps:P54 wd:Q12070759 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peyton Manning', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Tennessee Volunteers football'}}}

 Q: Is the service life of the Gran Turismo 5 Prologue equal to 10?
 SPARQL: ASK WHERE { wd:Q2324928 wdt:P5069 ?obj filter(?obj = 10) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Gran Turismo 5 Prologue', 'p': 'service life', 'o': '?x0', '?x0': '10'}

 Q: Who is the {human} for {founded by} of {Safavid dynasty}
 SPARQL:  select distinct ?obj where { wd:Q161205 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Safavid dynasty', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What award did The Smashing Pumpkins receive in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q184217 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Smashing Pumpkins', 'p': 'award', 'o': '?x0', 't': '1996'}

 Q: What is the maximum peak exposure limit of carbon tetrachloride?
 SPARQL: select distinct ?answer where { wd:Q225045 wdt:P2406 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'carbon tetrachloride', 'p': 'maximum peak exposure limit', 'o': '?x0'}

 Q: Which is the PremiershipRugby.com ID of Jonny Wilkinson?
 SPARQL: select distinct ?answer where { wd:Q318920 wdt:P861 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jonny Wilkinson', 'p': 'PremiershipRugby.com ID', 'o': '?x0'}

 Q: What is {place of birth} of {Sofia Coppola} that is {located in the administrative territorial entity} is {New York} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193628 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sofia Coppola', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'New York'}}}

 Q: Which is the position that applies to jurisdiction of Weimar Republic?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q41304 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'Weimar Republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: Where was Niels Bohr educated at, and who was his doctoral advisor?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7085 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P184 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Niels Bohr', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Niels Bohr', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the dual of the facet of a polytope of the grand 120-cell ?
 SPARQL: SELECT ?answer WHERE { wd:Q5594220 wdt:P1312 ?X . ?X wdt:P1322 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dual of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'grand 120-cell', 'p': 'facet of a polytope', 'o': '$y0'}}

 Q: What is {principal place} of {state} of {Loreng} ?
 SPARQL: SELECT ?answer WHERE { wd:Q35368261 wdt:P17 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'principal place', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Loreng', 'p': 'state', 'o': '$y0'}}

