 Q: Tell me an human who may be fictional whose name starts with the letter č
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21070568 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'č')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human who may be fictional'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'č'}}

 Q: What is {number of out of school children} of {is in} of {Melanesia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37394 wdt:P706 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Melanesia', 'p': 'location', 'o': '$y0'}}

 Q: What is <open period to> of <Friday> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3028 wd:Q130}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'open period to', 'o': 'Friday'}

 Q: What is {decays to} of {uranium-238}, that has {proton number} is {90} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1148503 wdt:P816 ?answer . ?answer wdt:P1086 ?x FILTER(contains(?x,'90'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'uranium-238', 'p': 'decays to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'proton number', 'o': '90'}}

 Q: which academy that contains the word university in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162633 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'university')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'university'}}

 Q: Is it true that the borrowing rate of Barclaycard Visa equals to 16.99?
 SPARQL: ASK WHERE { wd:Q56489433 wdt:P5898 ?obj filter(?obj = 16.99) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Barclaycard Visa', 'p': 'borrowing rate', 'o': '?x0', '?x0': '16.99'}

 Q: What is the {location of discovery} and the {discoverer or inventor} of {Iodine} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1103 wdt:P189 ?ans_1 . wd:Q1103 wdt:P61 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'I', 'p': 'location of discovery', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'I', 'p': 'discoverer or inventor', 'o': '?x1'}]

 Q: What is {member of sports team} of {Leontien van Moorsel} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q234158 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leontien van Moorsel', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leontien van Moorsel', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Tell me the occupational carcinogen that has a safety classification and labelling as Regulation (EC) No. 1272/2008 whose name contains the word benzene?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21074597 . ?sbj wdt:P4952 wd:Q2005334 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'benzene')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'occupational carcinogen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'safety classification and labelling', 'o': 'Regulation (EC) No. 1272/2008'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'benzene'}}

 Q: Which is {treatment} {murder method} of {Ted Hughes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q272194 wdt:P509 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ted Hughes', 'p': 'murder method', 'o': '$y0'}}

 Q: Did {R._Kelly} {award received} {Grammy Award for Best Song Written for Visual Media} and {Grammy Award for Best Male R&B Vocal Performance} ?
 SPARQL: ASK WHERE { wd:Q273055 wdt:P166 wd:Q428808 . wd:Q273055 wdt:P166 wd:Q1333798 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'R. Kelly', 'p': 'award received', 'o': '?x0', '?x0': 'Grammy Award for Best Song Written for Visual Media'}, {'h': 'IS', 'v': '?x1', 's': 'R. Kelly', 'p': 'award received', 'o': '?x1', '?x1': 'Grammy Award for Best Male R&B Vocal Performance'}]

 Q: What is {half-life} of {neutron} that is {uncertainty corresponds to} is {standard deviation} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2348 p:P2114 ?s . ?s ps:P2114 ?obj . ?s pq:P2571 wd:Q159375 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'half-life', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'neutron', 'p': 'half-life', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'uncertainty corresponds to', 'o': 'standard deviation'}}}

 Q: What is <Harmonized System Code> of <gin> ?
 SPARQL: select distinct ?answer where { wd:Q959362 wdt:P5471 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'gin', 'p': 'Harmonized System Code', 'o': '?x0'}

 Q: What is the {amusement ride} for {presenter} of {Ellen DeGeneres}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q1144661 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'amusement ride'}}

 Q: What is gender of non-binary?
 SPARQL: select distinct ?answer where { ?answer wdt:P21 wd:Q48270}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'gender', 'o': 'non-binary'}

 Q: What award did the short story "Flowers for Algernon" receive?
 SPARQL: SELECT ?value WHERE { wd:Q837934 p:P31 ?s . ?s ps:P31 wd:Q49084 . ?s pq:P166 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Flowers for Algernon', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'short story'}}}

 Q: IDoes the house mouse have a minimum frequency of audible sound of 1000
 SPARQL: ASK WHERE { wd:Q83310 wdt:P3387 ?obj filter(?obj = 1000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'house mouse', 'p': 'minimum frequency of audible sound', 'o': '?x0', '?x0': '1000'}

 Q: What is {first name} of {John J. Pershing}, that has {the same as} is {Ioann} ?
 SPARQL: SELECT ?answer WHERE { wd:Q272383 wdt:P735 ?answer . ?answer wdt:P460 wd:Q17125945}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John J. Pershing', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Ioann'}}

 Q: Is it true that the incidence of hepatitis C equals to 0.4?
 SPARQL: ASK WHERE { wd:Q154869 wdt:P2844 ?obj filter(?obj = 0.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'hepatitis C', 'p': 'incidence', 'o': '?x0', '?x0': '0.4'}

 Q: Name a song produced by Quincy Jones that starts with letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7366 . ?sbj wdt:P162 wd:Q193645 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'produced by', 'o': 'Quincy Jones'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {maritime museum} with the {MAX(luminous intensity)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1863818 . ?ent wdt:P3041 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'luminous intensity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'maritime museum'}}

 Q: When did the spouse of Vytautas die?
 SPARQL: SELECT ?obj WHERE { wd:Q218186 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1430')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vytautas', 'p': 'spouse', 'o': '?x0', 't': '1430'}

 Q: Name an open content from the LAMP platform that contains the word " wikipedia" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293664 . ?sbj wdt:P400 wd:Q191342 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wikipedia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'open content', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'platform', 'o': 'LAMP'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wikipedia'}}

 Q: "What is the {language used} by {A. E. van Vogt}, that is {endemic to} {England} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q315059 wdt:P1412 ?answer . ?answer wdt:P2341 wd:Q21}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'A. E. van Vogt', 'p': 'language used', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'endemic to', 'o': 'England'}}

 Q: What is the anatomical branch of the adrenal gland artery?
 SPARQL: SELECT ?answer WHERE { wd:Q712294 wdt:P2286 ?X . ?X wdt:P3261 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'anatomical branch of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'adrenal gland', 'p': 'artery', 'o': '$y0'}}

 Q: What is MP3's PRONOM file format identifier?
 SPARQL: select distinct ?answer where { wd:Q42591 wdt:P2748 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'MP3', 'p': 'PRONOM file format identifier', 'o': '?x0'}

 Q: How many {victory} are to/by {24 Hours of Le Mans} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2522 wd:Q187579 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'victory', 'o': '24 Hours of Le Mans'}

 Q: Is Christopher Nolan a citizen of the UK?
 SPARQL: ASK WHERE { wd:Q25191 wdt:P27 wd:Q145 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Christopher Nolan', 'p': 'citizen of', 'o': '?x0', '?x0': 'UK'}]

 Q: What is {is in the district of} of {Tokushima}, that has {human population} is {740783} ?
 SPARQL: SELECT ?answer WHERE { wd:Q207309 wdt:P131 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'740783'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tokushima', 'p': 'is in the district of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '740783'}}

 Q: What is quantity symbol of mass flow rate ?
 SPARQL: select distinct ?answer where { wd:Q1366187 wdt:P416 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mass flow rate', 'p': 'symbol', 'o': '?x0'}

 Q: Is the price of the Danish krone equal to 0.14216?
 SPARQL: ASK WHERE { wd:Q25417 wdt:P2284 ?obj filter(?obj = 0.14216) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Danish krone', 'p': 'price', 'o': '?x0', '?x0': '0.14216'}

 Q: What is the {plantation} for {residence} of {Thomas Jefferson}
 SPARQL:  select distinct ?obj where { wd:Q11812 wdt:P551 ?obj . ?obj wdt:P31 wd:Q188913 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thomas Jefferson', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'plantation'}}

 Q: Is the prevalence of leprosy less than 280.8?
 SPARQL: ASK WHERE { wd:Q36956 wdt:P1193 ?obj filter(?obj < 280.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'leprosy', 'p': 'prevalence', 'o': '?x0', '?x0': '280.8'}

 Q: Which  is total liabilities of Goldman Sachs?
 SPARQL: select distinct ?answer where { wd:Q193326 wdt:P2138 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Goldman Sachs', 'p': 'total liabilities', 'o': '?x0'}

 Q: Give me {space station} that {start point} {Baikonur Cosmodrome Site 200} and which that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25956 . ?sbj wdt:P1427 wd:Q4365460 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space station', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'Baikonur Cosmodrome Site 200'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What Tel Aviv partner town is the place of formation of Sinopec?
 SPARQL: SELECT ?answer WHERE { wd:Q831445 wdt:P740 ?answer . ?answer wdt:P190 wd:Q33935}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sinopec', 'p': 'place of formation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Tel Aviv'}}

 Q: What is {place of marriage} and {start time} of {{Rajinikanth} has {spouse} as {Latha Rajinikanth}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q60068 p:P26 ?s . ?s ps:P26 wd:Q6495834 . ?s pq:P2842 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of marriage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rajinikanth', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Latha Rajinikanth'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rajinikanth', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Latha Rajinikanth'}}}]

 Q: What football team does Ryan Giggs play for?
 SPARQL:  select distinct ?obj where { wd:Q10524 wdt:P54 ?obj . ?obj wdt:P31 wd:Q15944511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryan Giggs', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'football team'}}

 Q: What is {source location of group/organisation} of {Megadeth}, that has {border} is {Pasadena} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83431 wdt:P740 ?answer . ?answer wdt:P47 wd:Q485176}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Megadeth', 'p': 'source location of group/organisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Pasadena'}}

 Q: What is the type of music of the music by of Beethoven's piano sonatas?
 SPARQL: SELECT ?answer WHERE { wd:Q11887907 wdt:P86 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Beethoven's piano sonatas", 'p': 'music by', 'o': '$y0'}}

 Q: What is the town with min male population located in the administrative territorial entity Tasmania?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3957 . ?ent wdt:P1540 ?obj . ?ent wdt:P131 wd:Q34366} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'male population', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'town', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Tasmania'}}}

 Q: What is {is located in} of {location born} of {Satoshi Urushihara} ?
 SPARQL: SELECT ?answer WHERE { wd:Q549755 wdt:P19 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is located in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Satoshi Urushihara', 'p': 'location born', 'o': '$y0'}}

 Q: Who was the spouse of Ridley Scott prior to their divorce in 1975?
 SPARQL: SELECT ?obj WHERE { wd:Q56005 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ridley Scott', 'p': 'spouse', 'o': '?x0', 't': '1975'}

 Q: which point in time for Alicia de Larrocha has award received as Princess of Asturias Award for the Arts ?
 SPARQL: SELECT ?value WHERE { wd:Q232255 p:P166 ?s . ?s ps:P166 wd:Q3319305 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alicia de Larrocha', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Princess of Asturias Award for the Arts'}, 't': '?x0'}

 Q: What is {given name} of {Stephen Paddock} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41529365 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'given name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stephen Paddock', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: What is {HQ location} of {member of party} of {Izzy Asper} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3155643 wdt:P102 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'HQ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Izzy Asper', 'p': 'party', 'o': '$y0'}}

 Q: what is the {start time} for {Netanya} has {country} as {Mandatory Palestine} ?
 SPARQL: SELECT ?value WHERE { wd:Q192225 p:P17 ?s . ?s ps:P17 wd:Q193714 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Netanya', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Mandatory Palestine'}}}

 Q: How many {vehicle range} are for {Airbus A340} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q6481 wdt:P2073 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Airbus A340', 'p': 'vehicle range', 'o': '?x0'}

 Q: What is the {category for films shot at this location} and the {category of associated people} of {Honolulu} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q18094 wdt:P1740 ?ans_1 . wd:Q18094 wdt:P1792 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Honolulu', 'p': 'category for films shot at this location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Honolulu', 'p': 'category of associated people', 'o': '?x1'}]

 Q: Who was the employer of Alan M. Kriegsman that ended in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q2636772 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alan M. Kriegsman', 'p': 'employer', 'o': '?x0', 't': '1996'}

 Q: Is the consumption rate per capita of petroleum equal to 0.013?
 SPARQL: ASK WHERE { wd:Q22656 wdt:P2662 ?obj filter(?obj = 0.013) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'petroleum', 'p': 'consumption rate per capita', 'o': '?x0', '?x0': '0.013'}

 Q: What human biblical figure starts with the letter "z"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20643955 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human biblical figure'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Which board game that practiced by backgammon player and which that starts with the letter b
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131436 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'board game', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'backgammon player'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: What is the {national association football team} for {member of sports team} of {Ryan Giggs}
 SPARQL:  select distinct ?obj where { wd:Q10524 wdt:P54 ?obj . ?obj wdt:P31 wd:Q6979593 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryan Giggs', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national association football team'}}

 Q: What is the native language of the Khazars?
 SPARQL:  select distinct ?obj where { wd:Q173282 wdt:P103 ?obj . ?obj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Khazars', 'p': 'native language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Who is the Piano Concerto No. 3 music by, that died on 3-28-1943?
 SPARQL: SELECT ?answer WHERE { wd:Q223337 wdt:P86 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1943'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Piano Concerto No. 3', 'p': 'music by', 'o': '?x0', 't': '1943'}

 Q: What is the the capital city of the state where you can find Sam Dale Lake State Fish and Wildlife Area?
 SPARQL: SELECT ?answer WHERE { wd:Q7407386 wdt:P131 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sam Dale Lake State Fish and Wildlife Area', 'p': 'in', 'o': '$y0'}}

 Q: What is {position held} of {Nelson Rockefeller} that is {end time} is {1973-12-18} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11237 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1973')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nelson Rockefeller', 'p': 'position held', 'o': '?x0', 't': '1973'}

 Q: IS THE EULER CHARACTERISTIC OF  BARLOW SURFACE EQUALS 13.2
 SPARQL: ASK WHERE { wd:Q4861234 wdt:P6438 ?obj filter(?obj = 13.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Barlow surface', 'p': 'Euler characteristic', 'o': '?x0', '?x0': '13.2'}

 Q: Of which terrorist group is Abu Musab al-Zarqawir chairperson?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q181049 . ?sbj wdt:P31 wd:Q4456236 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Abu Musab al-Zarqawi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'terrorist group'}}

 Q: What is the {24 Hours of Le Mans entry} with the {MIN(laps completed)} whose {item operated} is {Englebert racing tire}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q55096520 . ?ent wdt:P5349 ?obj . ?ent wdt:P121 wd:Q54988955} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'laps completed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': '24 Hours of Le Mans entry', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'item operated', 'o': 'Englebert racing tire'}}}

 Q: What is the {historical country} for {head of state} of {Paul von Hindenburg}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q2667 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Paul von Hindenburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: What are the painting movement which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3326867 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting movement'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is <State Water Register Code (Russia)> of <Lake Ladoga> ?
 SPARQL: select distinct ?answer where { wd:Q15288 wdt:P884 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Ladoga', 'p': 'State Water Register Code (Russia)', 'o': '?x0'}

 Q: What is {constructed out of} of {portrait of} of {Brothel Scene} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17189254 wdt:P180 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constructed out of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brothel Scene', 'p': 'portrait of', 'o': '$y0'}}

 Q: What is {place of death} of {George Balanchine} that is {located in the administrative territorial entity} is {New York} ?
 SPARQL: SELECT ?obj WHERE { wd:Q310184 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q1384 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Balanchine', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'New York'}}}

 Q: How many goals scored and matches played does Juan Alberto Schiaffino have as a member of the Uruguay national football team?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q332064 p:P54 ?s . ?s ps:P54 wd:Q134916 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'goals scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Juan Alberto Schiaffino', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Uruguay national football team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'matches played', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Juan Alberto Schiaffino', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Uruguay national football team'}}}]

 Q: How many {studied by} are to/by {logic} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2579 wd:Q8078 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'logic'}

 Q: Which team did Serge Blanco start on in 1/1/1984?
 SPARQL: SELECT ?obj WHERE { wd:Q1322456 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Serge Blanco', 'p': 'team', 'o': '?x0', 't': '1984'}

 Q: DOES TH NUMBER OF SURVIVORS OF UNITED AIRLINES FLIGHT 823 IS LESS THAN 0.0
 SPARQL: ASK WHERE { wd:Q7887363 wdt:P1561 ?obj filter(?obj < 0.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'United Airlines Flight 823', 'p': 'number of survivors', 'o': '?x0', '?x0': '0.0'}

 Q: Give me {first professional degree} that starts with {'m'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3273292 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'professional degree'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What is Leopoldina member ID for Otto Hahn ?
 SPARQL: select distinct ?answer where { wd:Q57065 wdt:P3413 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Otto Hahn', 'p': 'Leopoldina member ID', 'o': '?x0'}

 Q: What are Julie Andrews spouse's and child's names?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q161819 wdt:P40 ?ans_1 . wd:Q161819 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Julie Andrews', 'p': 'child', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Julie Andrews', 'p': 'spouse', 'o': '?x1'}]

 Q: Is it true that the number of perpetrators of the 1999 Armenian parliament shooting equal 8?
 SPARQL: ASK WHERE { wd:Q1975720 wdt:P3886 ?obj filter(?obj = 8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '1999 Armenian parliament shooting', 'p': 'number of perpetrators', 'o': '?x0', '?x0': '8'}

 Q: What is {major works} of {coined} of {Rubik’s Tangle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2171608 wdt:P61 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rubik’s Tangle', 'p': 'coined', 'o': '$y0'}}

 Q: what is the {reference URL} for {Zaporizhzhia} has {stated in} as {New Encyclopedic Dictionary} ?
 SPARQL: SELECT ?value WHERE { wd:Q157835 p:P248 ?s . ?s ps:P248 wd:Q19190511 . ?s pq:P854 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'URL', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zaporizhzhia', 'p': 'stated in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'stated in', 'o': 'New Encyclopedic Dictionary'}}}

 Q: Does the Independent have a publication interval that is equal to 1.2?
 SPARQL: ASK WHERE { wd:Q11149 wdt:P2896 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'The Independent', 'p': 'publication interval', 'o': '?x0', '?x0': '1.2'}

 Q: When did Neil deGrasse Tyson recieve the Hubbard Medal award?
 SPARQL: SELECT ?value WHERE { wd:Q310903 p:P166 ?s . ?s ps:P166 wd:Q4287207 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Neil deGrasse Tyson', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Hubbard Medal'}, 't': '?x0'}

 Q: what is less than gas
 SPARQL: select distinct ?answer where { wd:Q11432 wdt:P5136 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'gas', 'p': 'less than', 'o': '?x0'}

 Q: What is aircraft operated of managed by mortar?
 SPARQL: SELECT ?answer WHERE { wd:Q7905205 wdt:P137 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'aircraft operated', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mortar', 'p': 'managed by', 'o': '$y0'}}

 Q: what is the {point in time} for {Gregory Hines} has {nominated for} as {Tony Award for Best Actor in a Musical} ?
 SPARQL: SELECT ?value WHERE { wd:Q367653 p:P1411 ?s . ?s ps:P1411 wd:Q1723064 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Gregory Hines', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Tony Award for Best Actor in a Musical'}, 't': '?x0'}

 Q: what is the flag of Dominica?
 SPARQL: select distinct ?answer where { wd:Q784 wdt:P163 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dominica', 'p': 'flag', 'o': '?x0'}

 Q: Which is the life expectancy for Cardigan Welsh Corgi?
 SPARQL: select distinct ?answer where { wd:Q29072 wdt:P2250 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardigan Welsh Corgi', 'p': 'life expectancy', 'o': '?x0'}

 Q: Where is the birth place of Chloë Grace Moretz, who has the Women in Red banner pf Atlanta skyline from Piedmont Park banner.jpg?
 SPARQL: SELECT ?answer WHERE { wd:Q4509 wdt:P19 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Atlanta skyline from Piedmont Park banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chloë Grace Moretz', 'p': 'birth place', 'o': '?x0'}

 Q: What medical specialty of gangrene is a result of genetic disease?
 SPARQL: SELECT ?answer WHERE { wd:Q168805 wdt:P1995 ?answer . ?answer wdt:P1542 wd:Q200779}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'gangrene', 'p': 'medical specialty', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'result', 'o': 'genetic disease'}}

 Q: What is {shares border with} of {Northern Territory} that is {statement is subject of} is {26th parallel south} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3235 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P805 wd:Q1390493 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Northern Territory', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '26th parallel south'}}}

 Q: What is the key event of the terminating connection of Britz Canal?
 SPARQL: SELECT ?answer WHERE { wd:Q315302 wdt:P559 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Britz Canal', 'p': 'terminating connection', 'o': '$y0'}}

 Q: Tell me about member of sports team of Lionel Messi and number of matches played?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q615 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lionel Messi', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lionel Messi', 'p': 'member of sports team', 'o': '$y0'}}]

