 Q: Which is the GDPR data controller for the product or material produced by Facebook?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q59859818 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product or material produced', 'o': 'Facebook', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'data controller'}}

 Q: Tell me the version, edition or translation that starts with "K".
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'к')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'edition'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'к'}}

 Q: What is the citizenship of Henry Cavendish whose end cause is Acts of Union 1800?
 SPARQL: SELECT ?obj WHERE { wd:Q131733 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P1534 wd:Q343100 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'citizenship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Cavendish', 'p': 'citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end cause', 'o': 'Acts of Union 1800'}}}

 Q: How many architects are by Buckminster Fuller
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P84 wd:Q102289 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Buckminster Fuller'}

 Q: What is the file extension for Prolog?
 SPARQL: select distinct ?answer where { wd:Q163468 wdt:P1195 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Prolog', 'p': 'file extension', 'o': '?x0'}

 Q: How many {lake inflows} are to/by {Irtysh river} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P200 wd:Q128102 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'inflows', 'o': 'Irtysh'}

 Q: What is Vision of Britain place ID for Isles of Scilly ?
 SPARQL: select distinct ?answer where { wd:Q180209 wdt:P3616 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Isles of Scilly', 'p': 'Vision of Britain place ID', 'o': '?x0'}

 Q: Which is the inner planet that is a child astronomical body of Mir?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q48604 . ?sbj wdt:P31 wd:Q3504248 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Mir', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'inner planet'}}

 Q: Who was the head of government of Montreuil in 1971?
 SPARQL: SELECT ?obj WHERE { wd:Q193370 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1971')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Montreuil', 'p': 'head of government', 'o': '?x0', 't': '1971'}

 Q: What is the {cemetery} for {religion} of {United Methodist Church}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P140 wd:Q329646 . ?sbj wdt:P31 wd:Q39614 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'United Methodist Church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cemetery'}}

 Q: When did Fujitsu have a total revenue of 5.0317e + 10?
 SPARQL: SELECT ?value WHERE { wd:Q186394 p:P2139 ?s . ?s ps:P2139 ?x filter(contains(?x,'5.0317e+10')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Fujitsu', 'p': 'total revenue', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'total revenue', 'o': '5.0317e+10'}, 't': '?x0'}

 Q: what is the {replaces} for {José Mujica} has {position held} as {President pro tempore of the Union of South American Nations} ?
 SPARQL: SELECT ?value WHERE { wd:Q9094 p:P39 ?s . ?s ps:P39 wd:Q3068962 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jose Mujica', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President pro tempore of the Union of South American Nations'}}}

 Q: What is the {oxyanion} for {conjugate acid} of {nitric acid}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q83320 . ?sbj wdt:P31 wd:Q3269344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'nitric acid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'oxyanion'}}

 Q: What is <oath made by> of <Aleksandr Medved> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P543 wd:Q435761}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'oath made by', 'o': 'Aleksandr Medved'}

 Q: Who is the diplomatic relations citizen of Kitty Wells
 SPARQL: SELECT ?answer WHERE { wd:Q272913 wdt:P27 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kitty Wells', 'p': 'citizen of', 'o': '$y0'}}

 Q: What is {agent} of {participated in conflict} of {Lajos Mórocz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47462699 wdt:P607 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'agent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lajos Mórocz', 'p': 'conflict', 'o': '$y0'}}

 Q: What is <cause of destruction> of <flood> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P770 wd:Q8068}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause of destruction', 'o': 'flood'}

 Q: What was Charles Barkley award received for All-NBA Team?
 SPARQL: SELECT ?value WHERE { wd:Q192707 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Charles Barkley', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'All-NBA Team'}, 't': '?x0'}

 Q: what is the {number of points/goals/set scored} for {Gianluigi Buffon} has {member of sports team} as {Italy national under-23 football team} ?
 SPARQL: SELECT ?value WHERE { wd:Q68060 p:P54 ?s . ?s ps:P54 wd:Q3873569 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'score for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianluigi Buffon', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Italy national under-23 football team'}}}

 Q: What city became Guanajuato's sister city on November 6, 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q46475 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guanajuato', 'p': 'sister city', 'o': '?x0', 't': '2014'}

 Q: What is number of seats for United States House of Representatives ?
 SPARQL: select distinct ?answer where { wd:Q11701 wdt:P1342 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'United States House of Representatives', 'p': 'number of seats', 'o': '?x0'}

 Q: What is {result} of {cellulose}, that has {route of administration} is {eye contact} ?
 SPARQL: SELECT ?answer WHERE { wd:Q80294 wdt:P1542 ?answer . ?answer wdt:P636 wd:Q21074571}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cellulose', 'p': 'effect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'route of administration', 'o': 'eye contact'}}

 Q: What is the shortest duration color film?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2047 ?obj . ?ent wdt:P462 wd:Q22006653} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'duration', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'color', 'o': 'color'}}}

 Q: Which golf course with the highest par is in California?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1048525 . ?ent wdt:P3530 ?obj . ?ent wdt:P131 wd:Q99 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'par', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'golf course', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'California'}}}

 Q: What is {position held} of {Robert Bork} that is {replaced by} is {Wade H. McCree} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1365780 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q2538688 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Bork', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Wade H. McCree'}}}

 Q: What is the {art genre} for {genre} of {David Blaine}
 SPARQL:  select distinct ?obj where { wd:Q353983 wdt:P136 ?obj . ?obj wdt:P31 wd:Q1792379 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Blaine', 'p': 'genre', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art genre'}}

 Q: What is {mass} of {general manager} of {Montreal Canadiens} ?
 SPARQL: SELECT ?answer WHERE { wd:Q188143 wdt:P505 ?X . ?X wdt:P2067 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'weight', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montreal Canadiens', 'p': 'general manager', 'o': '$y0'}}

 Q: derive me that wikimedia set index article which starts with the letter t in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'set index article'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is <destroyed> of <infrastructure> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3082 wd:Q121359}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'destroyed', 'o': 'infrastructure'}

 Q: What is the informed by of the film script by The Elevator?
 SPARQL: SELECT ?answer WHERE { wd:Q7731771 wdt:P58 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'informed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Elevator', 'p': 'film script by', 'o': '$y0'}}

 Q: What is the by-product of combustion?
 SPARQL: select distinct ?answer where { ?answer wdt:P2822 wd:Q133235}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'by-product of', 'o': 'combustion'}

 Q: What was Ben Bernanke a member of when he left in June of 2005?
 SPARQL: SELECT ?obj WHERE { wd:Q201795 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ben Bernanke', 'p': 'member of', 'o': '?x0', 't': '2005'}

 Q: What is Marine Regions Geographic ID for Timor Sea?
 SPARQL: select distinct ?answer where { wd:Q131418 wdt:P3006 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Timor Sea', 'p': 'Marine Regions Geographic ID', 'o': '?x0'}

 Q: Which is the outcome of using treatment for chemotherapy?
 SPARQL: SELECT ?answer WHERE { wd:Q974135 wdt:P1542 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'chemotherapy', 'p': 'outcome', 'o': '$y0'}}

 Q: Did {Education} {studied by} {social work}?
 SPARQL: ASK WHERE { wd:Q8434 wdt:P2579 wd:Q205398 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'education', 'p': 'studied by', 'o': '?x0', '?x0': 'social work'}]

 Q: What is the {system on a chip} with the {MAX(clock speed)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q610398 . ?ent wdt:P2149 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'clock speed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'system on a chip'}}

 Q: When will Shandong have a population of 9.57931e+07?
 SPARQL: SELECT ?value WHERE { wd:Q43407 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'9.57931e+07')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Shandong', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '9.57931e+07'}, 't': '?x0'}

 Q: What is the {ship} for {manufacturer} of {Dutch East India Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q159766 . ?sbj wdt:P31 wd:Q11446 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'Dutch East India Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ship'}}

 Q: Which is the gene for the genetic association with lung cancer?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2293 wd:Q47912 . ?sbj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'lung cancer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: what is the {start time} for {Mahmoud Abbas} has {position held} as {President of the State of Palestine} ?
 SPARQL: SELECT ?value WHERE { wd:Q127998 p:P39 ?s . ?s ps:P39 wd:Q3911022 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mahmoud Abbas', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of the State of Palestine'}}}

 Q: Is the female population of the Yerranderie equal to 0.0?
 SPARQL: ASK WHERE { wd:Q8052661 wdt:P1539 ?obj filter(?obj = 0.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Yerranderie', 'p': 'female population', 'o': '?x0', '?x0': '0.0'}

 Q: Was Helen_of_Troy spouse Paris and Pandarus?
 SPARQL: ASK WHERE { wd:Q164061 wdt:P26 wd:Q167646 . wd:Q164061 wdt:P26 wd:Q1057384 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Helen', 'p': 'spouse', 'o': '?x0', '?x0': 'Paris'}, {'h': 'IS', 'v': '?x1', 's': 'Helen', 'p': 'spouse', 'o': '?x1', '?x1': 'Pandarus'}]

 Q: Who is the head coach of Arsenal F.C.?
 SPARQL: select distinct ?answer where { wd:Q9617 wdt:P286 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arsenal F.C.', 'p': 'head coach', 'o': '?x0'}

 Q: What is {has boroughs} of {birth place} of {Zhao Tuo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q701895 wdt:P19 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has boroughs', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zhao Tuo', 'p': 'birth place', 'o': '$y0'}}

 Q: What are the religious text which start with the letter tohorot
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179461 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tohorot')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tohorot'}}

 Q: what is the {start time} for {Saddam Hussein} has {educated at} as {Cairo  University} ?
 SPARQL: SELECT ?value WHERE { wd:Q1316 p:P69 ?s . ?s ps:P69 wd:Q194445 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saddam Hussein', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Cairo University'}}}

 Q: What are theartistic theme which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1406161 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'artistic theme'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is Wikipedia's F-Droid package?
 SPARQL: select distinct ?answer where { wd:Q52 wdt:P3597 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wikipedia', 'p': 'F-Droid package', 'o': '?x0'}

 Q: What is {uses} of {Dick Cheney} that is {start time} is {2001-6-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q48259 p:P2283 ?s . ?s ps:P2283 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dick Cheney', 'p': 'uses', 'o': '?x0', 't': '2001'}

 Q: Is Steve's specific age inside the fictional universe 18?
 SPARQL: ASK WHERE { wd:Q62545285 wdt:P6249 ?obj filter(?obj = 18) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Steve', 'p': 'specific age inside fictional universe', 'o': '?x0', '?x0': '18'}

 Q: What is the {group of chemical substances} with the {MAX(ultimate tensile strength)} whose {instance of} is {group of chemical substances}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q17339814 . ?ent wdt:P5479 ?obj . ?ent wdt:P31 wd:Q17339814 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ultimate tensile strength', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group of chemical substances'}}

 Q: What is the {place of birth} and the {place of death} of {Constantine_the_Great} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8413 wdt:P19 ?ans_1 . wd:Q8413 wdt:P20 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Constantine the Great', 'p': 'place of birth', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Constantine the Great', 'p': 'place of death', 'o': '?x1'}]

 Q: What is the award of Al Gore whose 1st place medalist is David Trimble?
 SPARQL: SELECT ?answer WHERE { wd:Q19673 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q192556}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Al Gore', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': '1st place medalist', 'o': 'David Trimble'}}

 Q: Is water density more than 1.1998074?
 SPARQL: ASK WHERE { wd:Q283 wdt:P2054 ?obj filter(?obj > 1.1998074) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'water', 'p': 'density', 'o': '?x0', '?x0': '1.1998074'}

 Q: In the Mauna Kea Observatories, which asteroid had the maximum radius?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2120 ?obj . ?ent wdt:P65 wd:Q831790 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'radius', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asteroid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'site of astronomical discovery', 'o': 'Mauna Kea Observatories'}}}

 Q: Is the maximum frequency of audible sound of the sheep less than 24000.0?
 SPARQL: ASK WHERE { wd:Q7368 wdt:P3465 ?obj filter(?obj < 24000.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'sheep', 'p': 'maximum frequency of audible sound', 'o': '?x0', '?x0': '24000.0'}

 Q: When did the South Sudan have a total fertility rate of 5.969?
 SPARQL: SELECT ?value WHERE { wd:Q958 p:P4841 ?s . ?s ps:P4841 ?x filter(contains(?x,'5.969')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'South Sudan', 'p': 'total fertility rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'total fertility rate', 'o': '5.969'}, 't': '?x0'}

 Q: What is the affiliation of the Hebrew University of Jerusalem?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1416 wd:Q174158 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'affiliation', 'o': 'Hebrew University of Jerusalem'}

 Q: Give me {web search engine} that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4182287 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'search engine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: Did Colin Farrell receive his education at Quinnipiac University School of Law?
 SPARQL: ASK WHERE { wd:Q172035 wdt:P69 wd:Q7272316 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Colin Farrell', 'p': 'education', 'o': '?x0', '?x0': 'Quinnipiac University School of Law'}]

 Q: What is {name in native language} of {Park Geun-hye} that is {writing system} is {Hanja} ?
 SPARQL: SELECT ?obj WHERE { wd:Q138048 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P282 wd:Q485619 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name in native language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Geun-hye', 'p': 'name in native language', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'writing system', 'o': 'Hanja'}}}

 Q: What is {pronunciation audio} of {ingredient} of {marmalade} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5834964 wdt:P186 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'marmalade', 'p': 'ingredient', 'o': '$y0'}}

 Q: Is the flash point of lead azide more than 396.0?
 SPARQL: ASK WHERE { wd:Q111213 wdt:P2128 ?obj filter(?obj > 396.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'lead azide', 'p': 'flash point', 'o': '?x0', '?x0': '396.0'}

 Q: what is the {point in time} for {University of Leeds} has {follows} as {Yorkshire College} ?
 SPARQL: SELECT ?value WHERE { wd:Q503424 p:P155 ?s . ?s ps:P155 wd:Q24637302 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'University of Leeds', 'p': 'follows', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'Yorkshire College'}, 't': '?x0'}

 Q: What is {relative} of {Ferdinand II of Aragon} that is {type of kinship} is {son-in-law} ?
 SPARQL: SELECT ?obj WHERE { wd:Q12860 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q3752578 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son-in-law', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ferdinand II of Aragon', 'p': 'son-in-law', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'son-in-law'}}}

 Q: What is {prize money} and {together with} of {{Henry Dunant} has {award received} as {Nobel Peace Prize}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q12091 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Dunant', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Nobel Peace Prize'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Dunant', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Nobel Peace Prize'}}}]

 Q: Which is the HelveticArchives ID of Glasgow?
 SPARQL: select distinct ?answer where { wd:Q4093 wdt:P1255 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Glasgow', 'p': 'HelveticArchives ID', 'o': '?x0'}

 Q: Are the ballots cast in the Catalan regional election 2015 in Pontons more than 225.6?
 SPARQL: ASK WHERE { wd:Q44910740 wdt:P1868 ?obj filter(?obj > 225.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Catalan regional election 2015 in Pontons', 'p': 'ballots cast', 'o': '?x0', '?x0': '225.6'}

 Q: What is {followed by} and {follows} of {{Communist Party of China} has {chairperson} as {Hu Yaobang}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q99850 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Hu Yaobang'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Hu Yaobang'}}}]

 Q: What is <Red Bull athlete ID> of <Felix Baumgartner> ?
 SPARQL: select distinct ?answer where { wd:Q4203 wdt:P3883 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Felix Baumgartner', 'p': 'Red Bull athlete ID', 'o': '?x0'}

 Q: What are the based on and the influenced by of Linux?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q388 wdt:P144 ?ans_1 . wd:Q388 wdt:P737 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Linux', 'p': 'based on', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Linux', 'p': 'influenced by', 'o': '?x1'}]

 Q: who is marry accused of Kirkorov vs Aroyan Scandal?
 SPARQL: SELECT ?answer WHERE { wd:Q4421556 wdt:P710 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'marry', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kirkorov vs Aroyan Scandal', 'p': 'accused', 'o': '$y0'}}

 Q: Which is the Nederlands Soortenregister ID of Castor?
 SPARQL: select distinct ?answer where { wd:Q47542 wdt:P3405 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Castor', 'p': 'Nederlands Soortenregister ID', 'o': '?x0'}

 Q: What is {connected with} of {vein}, that has {pronunciation audio} is {Ta-இதயம்.ogg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9609 wdt:P2789 ?answer . ?answer wdt:P443 ?x FILTER(contains(?x,'Ta-இதயம்.ogg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'vein', 'p': 'connected with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'pronunciation audio', 'o': 'ta-இதயம்.ogg'}}

 Q: What is {nominated for} of {Nick Park} that is {statement is subject of} is {66th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q336206 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q944352 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nick Park', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '66th Academy Awards'}}}

 Q: Which are the characters for Tosca?
 SPARQL: select distinct ?answer where { wd:Q192941 wdt:P674 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tosca', 'p': 'characters', 'o': '?x0'}

 Q: What is the published in journal of the bibliographic citation of The Five Marks of the Mental.?
 SPARQL: SELECT ?answer WHERE { wd:Q38652945 wdt:P2860 ?X . ?X wdt:P1433 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Five Marks of the Mental.', 'p': 'bibliographic citation', 'o': '$y0'}}

 Q: what is the {start time} for {Black Mirror} has {production company} as {Zeppotron} ?
 SPARQL: SELECT ?value WHERE { wd:Q558112 p:P272 ?s . ?s ps:P272 wd:Q8069350 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Black Mirror', 'p': 'production company', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'production company', 'o': 'Zeppotron'}}}

 Q: What is the first name of Jerzy Rubach, that is equivalent to the Gorch?
 SPARQL: SELECT ?answer WHERE { wd:Q11725319 wdt:P735 ?answer . ?answer wdt:P460 wd:Q13188334}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jerzy Rubach', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'equivalent to', 'o': 'Gorch'}}

 Q: What is {member of} of {sovereign state} of {Lexington} ?
 SPARQL: SELECT ?answer WHERE { wd:Q49241 wdt:P17 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lexington', 'p': 'state', 'o': '$y0'}}

 Q: What genre is Rear Window?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q34414 wdt:P136 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Rear Window', 'p': 'genre', 'o': '?x0'}

 Q: Tell me the theory that was named by Fred Hoyle and contains the word bang in the name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17737 . ?sbj wdt:P3938 wd:Q183397 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bang')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theory', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'named by', 'o': 'Fred Hoyle'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'bang'}}

 Q: What is {head of national government} of {death place} of {Jan Dismas Zelenka} ?
 SPARQL: SELECT ?answer WHERE { wd:Q157777 wdt:P20 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'head of national government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jan Dismas Zelenka', 'p': 'death place', 'o': '$y0'}}

 Q: What is {member of sports team} of {Richie McCaw} and {number of points/goals/set scored}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q726148 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richie McCaw', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richie McCaw', 'p': 'team', 'o': '$y0'}}]

 Q: What is the {human} for {child} of {Leif Erikson}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P40 wd:Q42838 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child', 'o': 'Leif Erikson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the power consumed by the Montmartre funicular 129000?
 SPARQL: ASK WHERE { wd:Q99562 wdt:P2791 ?obj filter(?obj = 129000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Montmartre funicular', 'p': 'power consumed', 'o': '?x0', '?x0': '129000'}

 Q: Tell me the medication used for the treatment of post-traumatic stress disorder.
 SPARQL:  select distinct ?obj where { wd:Q202387 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'post-traumatic stress disorder', 'p': 'treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medication'}}

 Q: Is it true that the total debt of Accor is greater than -100800000.0?
 SPARQL: ASK WHERE { wd:Q212599 wdt:P2133 ?obj filter(?obj > -100800000.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Accor', 'p': 'total debt', 'o': '?x0', '?x0': '-100800000.0'}

 Q: What genetic association with type I hypersensitivity has ortholog of abl2?
 SPARQL: SELECT ?answer WHERE { wd:Q42982 wdt:P2293 ?answer . ?answer wdt:P684 wd:Q29773403}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'hypersensitivity', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'ortholog', 'o': 'abl2'}}

 Q: What is the total exports for Northern England?
 SPARQL: select distinct ?answer where { wd:Q1788657 wdt:P2135 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Northern England', 'p': 'total exports', 'o': '?x0'}

 Q: What is the same as a Christian?
 SPARQL: select distinct ?answer where { ?answer wdt:P460 wd:Q229188}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Christian'}

 Q: What award did Alice Hamilton receive in 1947?
 SPARQL: SELECT ?obj WHERE { wd:Q275600 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1947')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alice Hamilton', 'p': 'award', 'o': '?x0', 't': '1947'}

 Q: What are the album which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'album'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

