 Q: How many {statistical leader} are to/by {Wilt Chamberlain} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3279 wd:Q182455 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'statistical leader', 'o': 'Wilt Chamberlain'}

 Q: How many {connecting line} are to/by {Acela Express} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P81 wd:Q481759 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'connecting line', 'o': 'Acela'}

 Q: What is the {type of quantum particle} with the {MAX(g-factor)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P1097 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'g-factor', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: what is the {end time} for {John F. Kennedy} has {position held} as {United States representative} ?
 SPARQL: SELECT ?value WHERE { wd:Q9696 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John F. Kennedy', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States representative'}}}

 Q: Is the partition coefficient water/octanol of acetic acid equal to -0.17?
 SPARQL: ASK WHERE { wd:Q47512 wdt:P2993 ?obj filter(?obj = -0.17) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'acetic acid', 'p': 'partition coefficient water/octanol', 'o': '?x0', '?x0': '-0.17'}

 Q: What's buried at Jean Pierre Boyer's on the street?
 SPARQL: SELECT ?answer WHERE { wd:Q449421 wdt:P119 ?X . ?X wdt:P669 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'street', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean Pierre Boyer', 'p': 'buried at', 'o': '$y0'}}

 Q: What is the script of the language that Hans Kelsen speaks?
 SPARQL: SELECT ?answer WHERE { wd:Q84165 wdt:P1412 ?X . ?X wdt:P282 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'script', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Kelsen', 'p': 'language', 'o': '$y0'}}

 Q: what is the {type of kinship} for {Sophia of Hanover} has {relative} as {Elizabeth Charlotte, Princess Palatine} ?
 SPARQL: SELECT ?value WHERE { wd:Q57224 p:P1038 ?s . ?s ps:P1038 wd:Q57221 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sophia of Hanover', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Elizabeth Charlotte, Princess Palatine'}}}

 Q: Whar are the months that compose winter ?
 SPARQL:  select distinct ?obj where { wd:Q1311 wdt:P2922 ?obj . ?obj wdt:P31 wd:Q47018901 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'winter', 'p': 'month', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'month'}}

 Q: What is {minimal incubation period in humans} of {target disease} of {MMR vaccine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q908104 wdt:P1924 ?X . ?X wdt:P3488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'minimal incubation period in humans', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'MMR vaccine', 'p': 'target disease', 'o': '$y0'}}

 Q: What natural language has been influenced by English?
 SPARQL:  select distinct ?obj where { wd:Q1860 wdt:P737 ?obj . ?obj wdt:P31 wd:Q33742 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'English', 'p': 'influenced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural language'}}

 Q: Which is the BoxRec ID for Mickey Rourke?
 SPARQL: select distinct ?answer where { wd:Q178552 wdt:P1967 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mickey Rourke', 'p': 'BoxRec ID', 'o': '?x0'}

 Q: What is the {human} for {employer} of {Georgetown University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P108 wd:Q333886 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Georgetown University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {summit} of {located on astronomical body} of {Reykholt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q24065207 wdt:P376 ?X . ?X wdt:P610 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'summit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reykholt', 'p': 'located on astronomical body', 'o': '$y0'}}

 Q: Which is the standards organization that is affiliated with United Nations Economic and Social Council that contains the word international in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1328899 . ?sbj wdt:P1416 wd:Q170075 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'international')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'standards organization', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'affiliated with', 'o': 'United Nations Economic and Social Council'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'international'}}

 Q: What is the taxon common name of hoatzin?
 SPARQL: select distinct ?answer where { wd:Q188660 wdt:P1843 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hoatzin', 'p': 'taxon common name', 'o': '?x0'}

 Q: What is {played by} of {makes use of} of {AirAsia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q406643 wdt:P2283 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'AirAsia', 'p': 'used', 'o': '$y0'}}

 Q: Which is the enclosure of the dome?
 SPARQL: select distinct ?answer where { ?answer wdt:P3158 wd:Q12493}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'enclosure', 'o': 'dome'}

 Q: Which is the church building for religion of the United Methodist Church?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P140 wd:Q329646 . ?sbj wdt:P31 wd:Q16970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'United Methodist Church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'church building'}}

 Q: what is the {end time} for {Septimius Severus} has {position held} as {Roman emperor} ?
 SPARQL: SELECT ?value WHERE { wd:Q1442 p:P39 ?s . ?s ps:P39 wd:Q842606 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Septimius Severus', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Roman emperor'}}}

 Q: When was the population of Nevada recorded as 488738.0?
 SPARQL: SELECT ?value WHERE { wd:Q1227 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'488738.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nevada', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '488738.0'}, 't': '?x0'}

 Q: What are the image compression which start with the letter g
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q412438 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'image compression'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: what is the {point in time} for {Pat Summitt} has {award received} as {USBWA Most Courageous Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q460394 p:P166 ?s . ?s ps:P166 wd:Q23055174 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Pat Summitt', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'USBWA Most Courageous Award'}, 't': '?x0'}

 Q: What is {nominated for} of {Phil Jackson} that is {point in time} is {2001-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q316246 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Phil Jackson', 'p': 'nominated for', 'o': '?x0', 't': '2001'}

 Q: What is the {animated film} for {voice actor} of {Ellen DeGeneres}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q483325 . ?sbj wdt:P31 wd:Q202866 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated film'}}

 Q: what is the {point in time} for {William Henry Bragg} has {award received} as {Rumford Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q133747 p:P166 ?s . ?s ps:P166 wd:Q285167 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'William Henry Bragg', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Rumford Medal'}, 't': '?x0'}

 Q: Which is the measured physical quantity of siemens?
 SPARQL: select distinct ?answer where { wd:Q169893 wdt:P111 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'siemens', 'p': 'measured physical quantity', 'o': '?x0'}

 Q: What is {educated at} of {W. H. Auden} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q178698 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'W. H. Auden', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'W. H. Auden', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {proprietary software} for {language of work or name} of {Hebrew}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q9288 . ?sbj wdt:P31 wd:Q218616 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language', 'o': 'Hebrew', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'proprietary software'}}

 Q: Tell me hole whose name has the word depletion in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20204151 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'depletion')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hole'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'depletion'}}

 Q: What is located in the administrative territorial entity and capital of Lagos?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8673 wdt:P131 ?ans_1 . wd:Q8673 wdt:P1376 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Lagos', 'p': 'located in the administrative territorial entity', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Lagos', 'p': 'capital of', 'o': '?x1'}]

 Q: What is the {battle} for {participant} of {Soviet Union}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q15180 . ?sbj wdt:P31 wd:Q178561 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'battle'}}

 Q: What are the philosophical concept which start with the letter übermensch
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33104279 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'übermensch')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'philosophical concept'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'übermensch'}}

 Q: Richard Dawkins is influenced by which generalization?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P737 wd:Q44461 . ?sbj wdt:P31 wd:Q170084 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'influenced by', 'o': 'Richard Dawkins', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'generalization'}}

 Q: What is {child} of {Charlemagne} and {date of death}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P570 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0'}}]

 Q: Tell me flammable gas whose name has the word vinyl in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10913792 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vinyl')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable gas'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vinyl'}}

 Q: How many manufacturers make the Xbox 360?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q48263 wdt:P176 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Xbox 360', 'p': 'manufacturer', 'o': '?x0'}

 Q: Why did the lyricist split from the Fatal Illusion?
 SPARQL: SELECT ?answer WHERE { wd:Q21186583 wdt:P155 ?X . ?X wdt:P676 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'lyricist', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fatal Illusion', 'p': 'split from', 'o': '$y0'}}

 Q: What is the {video game developer} for {business division} of {Nintendo}
 SPARQL:  select distinct ?obj where { wd:Q8093 wdt:P199 ?obj . ?obj wdt:P31 wd:Q210167 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nintendo', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game developer'}}

 Q: Which are the Bantu languages which start with letter z?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Bantu'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is the {human} for {discoverer or inventor} of {quicksort}
 SPARQL:  select distinct ?obj where { wd:Q486598 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'quicksort', 'p': 'discoverer or inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {established by} of {political office held} of {Thomas de Lisle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7795481 wdt:P39 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas de Lisle', 'p': 'political office held', 'o': '$y0'}}

 Q: What is the {human} for {student of} of {Francisco Goya}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1066 wd:Q5432 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'student of', 'o': 'Francisco Goya', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the{compression ratio} on {Fiat A.22} {equals} {4.4}
 SPARQL: ASK WHERE { wd:Q3744416 wdt:P1247 ?obj filter(?obj = 4.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Fiat A.22', 'p': 'compression ratio', 'o': '?x0', '?x0': '4.4'}

 Q: who Wikimedia duplicated page for said to be the same as of Nintendo Entertainment System?
 SPARQL:  select distinct ?obj where { wd:Q172742 wdt:P460 ?obj . ?obj wdt:P31 wd:Q17362920 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nintendo Entertainment System', 'p': 'said to be the same as', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia duplicated page'}}

 Q: Is 1 the lower limit of the set of positive integers?
 SPARQL: ASK WHERE { wd:Q47339953 wdt:P5447 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'set of positive integers', 'p': 'lower limit', 'o': '?x0', '?x0': '1'}

 Q: What is {final year} of {product of} of {DC-8} ?
 SPARQL: SELECT ?answer WHERE { wd:Q223315 wdt:P176 ?X . ?X wdt:P576 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'final year', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'DC-8', 'p': 'product of', 'o': '$y0'}}

 Q: Who is {born on} {daddy} of {Shah Jahan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83672 wdt:P22 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born on', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shah Jahan', 'p': 'dad', 'o': '$y0'}}

 Q: What is {academic degree} of {Emmy Noether} and {location}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7099 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P276 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmy Noether', 'p': 'academic degree', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emmy Noether', 'p': 'academic degree', 'o': '$y0'}}]

 Q: What is the {profession} for {patron saint} of {Thomas Aquinas}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q9438 . ?sbj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Thomas Aquinas', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: What is the {globular cluster} with the {MAX(metallicity)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11276 . ?ent wdt:P2227 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'metallicity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'globular cluster'}}

 Q: What is {nominated for} of {The Dark Knight} that is {nominee} is {Wally Pfister} ?
 SPARQL: SELECT ?obj WHERE { wd:Q163872 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q460144 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Dark Knight', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'Wally Pfister'}}}

 Q: What is the {animated film} for {voice actor} of {Sarah Silverman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q229013 . ?sbj wdt:P31 wd:Q202866 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Sarah Silverman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated film'}}

 Q: What was Senegal’s inflation rate in 2016?
 SPARQL: SELECT ?obj WHERE { wd:Q1041 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Senegal', 'p': 'inflation rate', 'o': '?x0', 't': '2016'}

 Q: What are the part of speech which start with the letter verb
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82042 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'verb')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'part of speech'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'verb'}}

 Q: Tell me ceremonial county of England whose name has the word yorkshire in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180673 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yorkshire')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ceremonial county of England'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yorkshire'}}

 Q: Which is the voltage for Jersey?
 SPARQL: select distinct ?answer where { wd:Q785 wdt:P2436 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jersey', 'p': 'voltage', 'o': '?x0'}

 Q: Give me {feature film} that {director of photography} {László Kovács} and which that starts with {'g'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj wdt:P344 wd:Q498696 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'feature film', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'director of photography', 'o': 'Laszlo Kovacs'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: Who gave the {is son of} of {sister or brother} of {Stephen Báthory} ?
 SPARQL: SELECT ?answer WHERE { wd:Q54030 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stephen Báthory', 'p': 'sister', 'o': '$y0'}}

 Q: Is the wingspan of the Airbus A300 measure 44.84?
 SPARQL: ASK WHERE { wd:Q6437 wdt:P2050 ?obj filter(?obj = 44.84) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Airbus A300', 'p': 'wingspan', 'o': '?x0', '?x0': '44.84'}

 Q: Where is the location of work by Yayoi Kusama that also has counties in Shinjuku-ku?
 SPARQL: SELECT ?answer WHERE { wd:Q231121 wdt:P937 ?answer . ?answer wdt:P150 wd:Q179645}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yayoi Kusama', 'p': 'location of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has counties', 'o': 'Shinjuku-ku'}}

 Q: What is <Inventario Sculture - Polo Museale Fiorentino> of <David> ?
 SPARQL: select distinct ?answer where { wd:Q179900 wdt:P3467 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David', 'p': 'Inventario Sculture - Polo Museale Fiorentino', 'o': '?x0'}

 Q: What is {portrait of} of {artistic genre} of {The Deer Park} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7729563 wdt:P136 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrait of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Deer Park', 'p': 'genre', 'o': '$y0'}}

 Q: Give me {historical period} that {official religion} {Christianity} and which that starts with {'e'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj wdt:P3075 wd:Q5043 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical period', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official religion', 'o': 'Christianity'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'e'}}

 Q: What is the {distributed revision control system} for {programming language} of {Structured Query Language}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P277 wd:Q47607 . ?sbj wdt:P31 wd:Q1186723 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'programming language', 'o': 'SQL', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'distributed revision control system'}}

 Q: What is the {country} for {head of government} of {Mauricio Macri}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q561837 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Mauricio Macri', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: What is {position held} of {Winnie Madikizela-Mandela} that is {parliamentary term} is {26th South African Parliament} ?
 SPARQL: SELECT ?obj WHERE { wd:Q239062 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2937 wd:Q18109299 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Winnie Madikizela-Mandela', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'parliamentary term', 'o': '26th South African Parliament'}}}

 Q: What is <Bashkir encyclopedia (Bashkir version) ID> of <Chinghiz Aitmatov> ?
 SPARQL: select distinct ?answer where { wd:Q484292 wdt:P4210 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chinghiz Aitmatov', 'p': 'Bashkir encyclopedia (Bashkir version) ID', 'o': '?x0'}

 Q: Give me {cable-stayed bridge} that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q158555 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cable-stayed bridge'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: Iroquois is depicted by what statue?
 SPARQL:  select distinct ?obj where { wd:Q68518 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q179700 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iroquois', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'statue'}}

 Q: Who is the video game publisher of Hex whose shareholder is Hasbro, Inc.?
 SPARQL: SELECT ?answer WHERE { wd:Q844874 wdt:P123 ?answer . ?answer wdt:P127 wd:Q501476}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hex', 'p': 'publisher', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shareholder', 'o': 'Hasbro'}}

 Q: Which is the provisional designation of 90377 Sedna?
 SPARQL: select distinct ?answer where { wd:Q15610 wdt:P490 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '90377 Sedna', 'p': 'provisional designation', 'o': '?x0'}

 Q: what is the {series ordinal} for {Alvar Aalto} has {given name} as {Alvar} ?
 SPARQL: SELECT ?value WHERE { wd:Q82840 p:P735 ?s . ?s ps:P735 wd:Q15831157 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alvar Aalto', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'name', 'o': 'Alvar'}}}

 Q: What is {takes place in} of {reason of failure} of {Yan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1055713 wdt:P770 ?X . ?X wdt:P706 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yan', 'p': 'reason of failure', 'o': '$y0'}}

 Q: what is the {point in time} for {Rita Moreno} has {award received} as {California Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q230151 p:P166 ?s . ?s ps:P166 wd:Q5020532 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Rita Moreno', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'California Hall of Fame'}, 't': '?x0'}

 Q: What is {forename} of {Aphex Twin}, that has {is the same as} is {Rikardo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q223161 wdt:P735 ?answer . ?answer wdt:P460 wd:Q39164767}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aphex Twin', 'p': 'forename', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Rikardo'}}

 Q: What is the {literary character} for {characters} of {The Da Vinci Code}
 SPARQL:  select distinct ?obj where { wd:Q81689 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3658341 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Da Vinci Code', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary character'}}

 Q: What is {occupation} of {Michael Schumacher} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9671 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Schumacher', 'p': 'job', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'job', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Schumacher', 'p': 'job', 'o': '$y0'}}]

 Q: what is the {academic degree} for {Mario Vargas Llosa} has {educated at} as {Leoncio Prado Military Academy} ?
 SPARQL: SELECT ?value WHERE { wd:Q39803 p:P69 ?s . ?s ps:P69 wd:Q839058 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mario Vargas Llosa', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Leoncio Prado Military Academy'}}}

 Q: what is the {criterion used} for {Proboscidea} has {different from} as {Proboscidea} ?
 SPARQL: SELECT ?value WHERE { wd:Q26308 p:P1889 ?s . ?s ps:P1889 wd:Q137309 . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Proboscidea', 'p': 'different from', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'different from', 'o': 'Proboscidea'}}}

 Q: What is {diplomatic relation} of {People's Republic of China} that is {statement is subject of} is {China–Eritrea relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q148 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q5100211 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'China', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'China–Eritrea relations'}}}

 Q: What is the {street} for {located in the administrative territorial entity} of {Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q220 . ?sbj wdt:P31 wd:Q79007 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'street'}}

 Q: What was composed by Giselle that had his father as Louis Adam?
 SPARQL: SELECT ?answer WHERE { wd:Q827436 wdt:P86 ?answer . ?answer wdt:P22 wd:Q1349517}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Giselle', 'p': 'composed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'father', 'o': 'Louis Adam'}}

 Q: What is the Corago opera ID for Tosca?
 SPARQL: select distinct ?answer where { wd:Q192941 wdt:P5251 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tosca', 'p': 'Corago opera ID', 'o': '?x0'}

 Q: Give me {decay mode} that {has effect} {gamma ray} and which contains the word {beta} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3317792 . ?sbj wdt:P1542 wd:Q11523 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'beta')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'decay mode', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has effect', 'o': 'gamma ray'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'beta'}}

 Q: What are the belligerents of competes in Liu Xiang?
 SPARQL: SELECT ?answer WHERE { wd:Q211088 wdt:P1344 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'belligerents', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Liu Xiang', 'p': 'competes in', 'o': '$y0'}}

 Q: Which is adapted by Andrei Tarkovsky?
 SPARQL: select distinct ?answer where { ?answer wdt:P5202 wd:Q853}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'adapted by', 'o': 'Andrei Tarkovsky'}

