 Q: Name the door commissioned by Frederick William II of Prussia that contains the word " brandenburg" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36794 . ?sbj wdt:P88 wd:Q152229 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'brandenburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'door', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'Frederick William II of Prussia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'brandenburg'}}

 Q: What is {award received} of {Cherry Jones} that is {statement is subject of} is {49th Tony Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q239046 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q4638847 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cherry Jones', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '49th Tony Awards'}}}

 Q: Alexander McQueen is the employer of what fashion label?
 SPARQL:  select distinct ?obj where { wd:Q207939 wdt:P108 ?obj . ?obj wdt:P31 wd:Q1618899 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexander McQueen', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fashion label'}}

 Q: What is {nomination received} of {discoverer or inventor of} of {oscilloscope} ?
 SPARQL: SELECT ?answer WHERE { wd:Q174320 wdt:P61 ?X . ?X wdt:P1411 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nomination received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'oscilloscope', 'p': 'inventor', 'o': '$y0'}}

 Q: Who was married to Walter Sickert in 1911?
 SPARQL: SELECT ?obj WHERE { wd:Q703369 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1911')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Walter Sickert', 'p': 'married to', 'o': '?x0', 't': '1911'}

 Q: What is {end time} and {start time} of {{Park Geun-hye} has {educated at} as {Sacred Heart Girls' High School}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q138048 p:P69 ?s . ?s ps:P69 wd:Q21577152 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Geun-hye', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': "Sacred Heart Girls' High School"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Geun-hye', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': "Sacred Heart Girls' High School"}}}]

 Q: What is the {video game publisher} for {manufacturer} of {Commodore 64}
 SPARQL:  select distinct ?obj where { wd:Q99775 wdt:P176 ?obj . ?obj wdt:P31 wd:Q1137109 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Commodore 64', 'p': 'manufacturer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game publisher'}}

 Q: Which {coat of arms} {is in the administrative region of} of {Western Canada} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1145847 wdt:P131 ?X . ?X wdt:P237 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coat of arms', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Western Canada', 'p': 'is in the administrative region of', 'o': '$y0'}}

 Q: What is playing hand of Novak Djokovic ?
 SPARQL: select distinct ?answer where { wd:Q5812 wdt:P741 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Novak Djokovic', 'p': 'playing hand', 'o': '?x0'}

 Q: What is <FAI ID> of <Neil Armstrong> ?
 SPARQL: select distinct ?answer where { wd:Q1615 wdt:P4556 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Neil Armstrong', 'p': 'FAI ID', 'o': '?x0'}

 Q: What is the patronym or matronym for Vladimir Putin's name?
 SPARQL: select distinct ?answer where { wd:Q7747 wdt:P2976 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Putin', 'p': 'patronym', 'o': '?x0'}

 Q: What is the sister city of Bethlehem with a surface area of 17236.0?
 SPARQL: SELECT ?answer WHERE { wd:Q5776 wdt:P190 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'17236.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bethlehem', 'p': 'sister city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'area', 'o': '17236.0'}}

 Q: What is the {gazetteer} with the {MIN(number of records)} whose {Wikidata property} is {Bulgarian Antarctic Gazetteer ID}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1006160 . ?ent wdt:P4876 ?obj . ?ent wdt:P1687 wd:P5388} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of records', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gazetteer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Wikidata property', 'o': 'Bulgarian Antarctic Gazetteer ID'}}}

 Q: Name the submarine power cable with the least throughput whose CEO is Nasos Ktorides
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4117949 . ?ent wdt:P2957 ?obj . ?ent wdt:P169 wd:Q47459088} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'throughput', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'submarine power cable', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'CEO', 'o': 'Nasos Ktorides'}}}

 Q: Tell me horse breed  whose name has the word zangersheide in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zangersheide')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'horse breed'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zangersheide'}}

 Q: what is the {start time} for {Luc Besson} has {spouse} as {Milla Jovovich} ?
 SPARQL: SELECT ?value WHERE { wd:Q484779 p:P26 ?s . ?s ps:P26 wd:Q170576 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Luc Besson', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': 'Milla Jovovich'}}}

 Q: What is the {sexual orientation} and the {sex or gender} of {Deadpool} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1631090 wdt:P91 ?ans_1 . wd:Q1631090 wdt:P21 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Deadpool', 'p': 'sexual orientation', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Deadpool', 'p': 'sex or gender', 'o': '?x1'}]

 Q: What is the {business} for {member of sports team} of {Zinedine Zidane}
 SPARQL:  select distinct ?obj where { wd:Q1835 wdt:P54 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zinedine Zidane', 'p': 'member of sports team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: Tell me about talk show for presenter of Ellen DeGeneres?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q622812 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'talk show'}}

 Q: what is the {end time} for {George Harrison} has {part of} as {The Beatles} ?
 SPARQL: SELECT ?value WHERE { wd:Q2643 p:P361 ?s . ?s ps:P361 wd:Q1299 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Harrison', 'p': 'part of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'part of', 'o': 'Beatles'}}}

 Q: What is the {ruins} for {patron saint} of {Anthony of Padua}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q167477 . ?sbj wdt:P31 wd:Q109607 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Anthony of Padua', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ruins'}}

 Q: What is the {dominion of the British Empire} for {country} of {Wellington}
 SPARQL:  select distinct ?obj where { wd:Q23661 wdt:P17 ?obj . ?obj wdt:P31 wd:Q223832 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wellington', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dominion of the British Empire'}}

 Q: What is list of characters from narrative of Mario ?
 SPARQL: SELECT ?answer WHERE { wd:Q12379 wdt:P1441 ?X . ?X wdt:P1881 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'list of characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mario', 'p': 'from narrative', 'o': '$y0'}}

 Q: Which films did screenwriter Andrew Lloyd Webber produce?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'screenwriter', 'o': 'Andrew Lloyd Webber', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: What is the {anime} for {language of work or name} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q5287 . ?sbj wdt:P31 wd:Q1107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Japanese', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anime'}}

 Q: What is {inhabitants} of {sovereign state} of {Razavi Khorasan Province} ?
 SPARQL: SELECT ?answer WHERE { wd:Q587090 wdt:P17 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Razavi Khorasan Province', 'p': 'sovereign state', 'o': '$y0'}}

 Q: What is the topic's main category for divination?
 SPARQL: select distinct ?answer where { wd:Q1043197 wdt:P910 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'divination', 'p': "topic's main category", 'o': '?x0'}

 Q: what is the {statement is subject of} for {Asian elephant} has {uses} as {self-awareness} ?
 SPARQL: SELECT ?value WHERE { wd:Q133006 p:P2283 ?s . ?s ps:P2283 wd:Q1314553 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asian elephant', 'p': 'uses', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'uses', 'o': 'self-awareness'}}}

 Q: What is the {human} for {cast member} of {Friends}
 SPARQL:  select distinct ?obj where { wd:Q79784 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Friends', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which sausage sandwich starts with the letter d?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sausage sandwich'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: Is the river mouth of Esperanto Island less than 802.56 miles?
 SPARQL: ASK WHERE { wd:Q12349285 wdt:P2148 ?obj filter(?obj < 802.56) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Esperanto island', 'p': 'distance from river mouth', 'o': '?x0', '?x0': '802.56'}

 Q: What is {namesake} of {Planck constant}, that has {member of} is {Lincean Academy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q122894 wdt:P138 ?answer . ?answer wdt:P463 wd:Q338432}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Planck constant', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Lincean Academy'}}

 Q: What is the {flammable solid} with the {MIN(decomposition point)} whose {instance of} is {insecticide}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21073024 . ?ent wdt:P2107 ?obj . ?ent wdt:P31 wd:Q181322} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'decomposition point', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable solid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'insecticide'}}}

 Q: What is {county seat for} of {Apia}, that has {subdivided into} is {Palauli} ?
 SPARQL: SELECT ?answer WHERE { wd:Q36260 wdt:P1376 ?answer . ?answer wdt:P150 wd:Q1147216}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Apia', 'p': 'capital of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Palauli'}}

 Q: What is {award received} of {Ansel Adams} that is {follows} is {Lennart Nilsson} ?
 SPARQL: SELECT ?obj WHERE { wd:Q60809 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q568506 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ansel Adams', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'Lennart Nilsson'}}}

 Q: What is {award received} of {Yaşar Kemal} that is {speaker} is {Günter Grass} ?
 SPARQL: SELECT ?obj WHERE { wd:Q327142 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P823 wd:Q6538 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yaşar Kemal', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'speaker', 'o': 'Günter Grass'}}}

 Q: Who is the teacher of the kids of Ali al-Hadi?
 SPARQL: SELECT ?answer WHERE { wd:Q315377 wdt:P802 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kid', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ali al-Hadi', 'p': 'teacher of', 'o': '$y0'}}

 Q: What is the NUTTAB food ID for Port wine?
 SPARQL: select distinct ?answer where { wd:Q191034 wdt:P2760 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Port wine', 'p': 'NUTTAB food ID', 'o': '?x0'}

 Q: What is the {science museum} with the {MAX(visitors per year)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q588140 . ?ent wdt:P1174 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'visitors per year', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'science museum'}}

 Q: Name the nuclear weapons test with the lowest explosive energy equivalent whose country of origin is soviet union?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q210112 . ?ent wdt:P2145 ?obj . ?ent wdt:P495 wd:Q15180} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'explosive energy equivalent', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nuclear weapons test', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'Soviet Union'}}}

 Q: What employer did Gilles Deleuze work at until 1964?
 SPARQL: SELECT ?obj WHERE { wd:Q184226 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1964')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gilles Deleuze', 'p': 'employer', 'o': '?x0', 't': '1964'}

 Q: What is Information Center for Israeli Art artist ID for Daniel Libeskind ?
 SPARQL: select distinct ?answer where { wd:Q154538 wdt:P1736 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Daniel Libeskind', 'p': 'Information Center for Israeli Art artist ID', 'o': '?x0'}

 Q: Did {John_Glenn} {award received} {Congressional Gold Medal} and {Achievement Medal} ?
 SPARQL: ASK WHERE { wd:Q182642 wdt:P166 wd:Q721743 . wd:Q182642 wdt:P166 wd:Q2823025 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Glenn', 'p': 'award received', 'o': '?x0', '?x0': 'Congressional Gold Medal'}, {'h': 'IS', 'v': '?x1', 's': 'John Glenn', 'p': 'award received', 'o': '?x1', '?x1': 'Achievement Medal'}]

 Q: Which is the retail chain that is founded by the Verizon?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P112 wd:Q467752 . ?sbj wdt:P31 wd:Q507619 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Verizon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'retail chain'}}

 Q: Which is the RXNO Ontology of aldol condensation?
 SPARQL: select distinct ?answer where { wd:Q1027170 wdt:P2106 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'aldol condensation', 'p': 'RXNO Ontology', 'o': '?x0'}

 Q: What is the {automobile model} with the {MAX(vehicle range)} whose {subclass of} is {compact car}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3231690 . ?ent wdt:P2073 ?obj . ?ent wdt:P279 wd:Q946808 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'range', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'automobile model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'compact car'}}}

 Q: What is {birth city} of {Jon Finkel}, that has {contains} is {New York County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6270695 wdt:P19 ?answer . ?answer wdt:P150 wd:Q500416}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jon Finkel', 'p': 'birth city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'contains', 'o': 'New York County'}}

 Q: What is the place of birth of Alvin Ailey located in the administrative territorial entity known as Rogers?
 SPARQL: SELECT ?value WHERE { wd:Q449037 p:P19 ?s . ?s ps:P19 wd:Q978155 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alvin Ailey', 'p': 'place of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of birth', 'o': 'Rogers'}}}

 Q: What is the avionics of radar?
 SPARQL: select distinct ?answer where { ?answer wdt:P878 wd:Q47528}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'avionics', 'o': 'radar'}

 Q: What are weapon studio which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weapon'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What famous people were born in Yekaterinburg?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P19 wd:Q887 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Yekaterinburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: What is {famous works} of {written by} of {Mule Bone} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6933876 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mule Bone', 'p': 'written by', 'o': '$y0'}}

 Q: What is <reservoir created> of <Grand Coulee Dam> ?
 SPARQL: select distinct ?answer where { wd:Q930391 wdt:P4661 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Grand Coulee Dam', 'p': 'reservoir created', 'o': '?x0'}

 Q: What is {deathplace} of {Sigmund Freud}, that has {partner city} is {Zagreb} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9215 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1435}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sigmund Freud', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner city', 'o': 'Zagreb'}}

 Q: What is {work location} of {Thomas Eakins} that is {point in time} is {1868-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q214905 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1868')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thomas Eakins', 'p': 'work location', 'o': '?x0', 't': '1868'}

 Q: What community of Belgium uses Dutch as its official language?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q7411 . ?sbj wdt:P31 wd:Q89934 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Dutch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'community of Belgium'}}

 Q: Which is the ISBN publisher prefix for DC Comics?
 SPARQL: select distinct ?answer where { wd:Q2924461 wdt:P3035 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'DC Comics', 'p': 'ISBN publisher prefix', 'o': '?x0'}

 Q: Is the number of representations of A Seaside Rendezvous less than 2.4?
 SPARQL: ASK WHERE { wd:Q2448568 wdt:P5027 ?obj filter(?obj < 2.4) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'A Seaside Rendezvous', 'p': 'number of representations', 'o': '?x0', '?x0': '2.4'}

 Q: What is Lou Reed's MusicBrainz artist ID?
 SPARQL: select distinct ?answer where { wd:Q189080 wdt:P434 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lou Reed', 'p': 'MusicBrainz artist ID', 'o': '?x0'}

 Q: What is {head of government} of {Navarre} that is {start time} is {1996-9-18} ?
 SPARQL: SELECT ?obj WHERE { wd:Q4018 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Navarre', 'p': 'head of government', 'o': '?x0', 't': '1996'}

 Q: what is the {applies to part} for {Paraguay River} has {coordinate location} as {-27.290027966206 -58.60725402832} ?
 SPARQL: SELECT ?value WHERE { wd:Q179396 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'-27.290027966206 -58.60725402832')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paraguay River', 'p': 'coordinate location', 'o': '$y0'}}

 Q: How much alkanol is in the highest autoignition temperature?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11685431 . ?ent wdt:P2199 ?obj . ?ent wdt:P31 wd:Q11685431 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'autoignition temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alkanol'}}

 Q: Which business enterprise has the most total liabilities?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2138 ?obj . ?ent wdt:P31 wd:Q4830453 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'total liabilities', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: In the tetrahedral group, does the cardinality of the group equal to 14.4?
 SPARQL: ASK WHERE { wd:Q45034192 wdt:P1164 ?obj filter(?obj = 14.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'tetrahedral group', 'p': 'cardinality of the group', 'o': '?x0', '?x0': '14.4'}

 Q: which is the  country for August has named after as Alp Arslan?
 SPARQL: SELECT ?value WHERE { wd:Q122 p:P138 ?s . ?s ps:P138 wd:Q200193 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'August', 'p': 'named after', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'named after', 'o': 'Alp Arslan'}}}

 Q: What is the name of the stockholder who worked for Ray Kurzweil?
 SPARQL: SELECT ?answer WHERE { wd:Q298341 wdt:P108 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stockholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ray Kurzweil', 'p': 'worked for', 'o': '$y0'}}

 Q: Did {Patricia_Arquette} {nominated for} {Academy Award for Best Supporting Actress} and {Golden Raspberry Award for Worst Supporting Actor} ?
 SPARQL: ASK WHERE { wd:Q215976 wdt:P1411 wd:Q106301 . wd:Q215976 wdt:P1411 wd:Q641316 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Patricia Arquette', 'p': 'nominated for', 'o': '?x0', '?x0': 'Academy Award for Best Supporting Actress'}, {'h': 'IS', 'v': '?x1', 's': 'Patricia Arquette', 'p': 'nominated for', 'o': '?x1', '?x1': 'Golden Raspberry Award for Worst Supporting Actor'}]

 Q: what is the {point in time} for {William Bateson} has {award received} as {Croonian Lecture} ?
 SPARQL: SELECT ?value WHERE { wd:Q297302 p:P166 ?s . ?s ps:P166 wd:Q1192912 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'William Bateson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Croonian Lecture'}, 't': '?x0'}

 Q: Who's the employer's at Nissan?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P108 wd:Q20165 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Nissan'}

 Q: What is {profession} of {Aloysius Bertrand}, that has {field of this profession} is {journalism} ?
 SPARQL: SELECT ?answer WHERE { wd:Q366464 wdt:P106 ?answer . ?answer wdt:P425 wd:Q11030}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aloysius Bertrand', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'field of this profession', 'o': 'journalism'}}

 Q: What is {had reason} of {Revolutions of 1917–1923}, that has {between} is {Central Powers} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7318933 wdt:P828 ?answer . ?answer wdt:P710 wd:Q152283}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Revolutions of 1917–1923', 'p': 'reason', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'between', 'o': 'Central Powers'}}

 Q: What is the {rugby union team} for {league} of {Super Rugby}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P118 wd:Q855988 . ?sbj wdt:P31 wd:Q14645593 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'league', 'o': 'Super Rugby', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rugby union team'}}

 Q: Who is the game artist of Final Fantasy VII?
 SPARQL: select distinct ?answer where { wd:Q214232 wdt:P3080 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Final Fantasy VII', 'p': 'game artist', 'o': '?x0'}

 Q: What are the list of characters and the characters of Buffy the Vampire Slayer?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q183513 wdt:P1881 ?ans_1 . wd:Q183513 wdt:P674 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Buffy the Vampire Slayer', 'p': 'list of characters', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Buffy the Vampire Slayer', 'p': 'characters', 'o': '?x1'}]

 Q: Did the brother of Matilda of Habsburg have kids?
 SPARQL: SELECT ?answer WHERE { wd:Q2635513 wdt:P3373 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kid', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matilda of Habsburg', 'p': 'bro', 'o': '$y0'}}

 Q: Which is the SecondHandSongs artist ID of George Harrison?
 SPARQL: select distinct ?answer where { wd:Q2643 wdt:P2909 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Harrison', 'p': 'SecondHandSongs artist ID', 'o': '?x0'}

 Q: What are the epic poem which start with the letter tambuka
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37484 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tambuka')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'epic poem'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tambuka'}}

 Q: What is the {sovereign state} for {contains administrative territorial entity} of {Oslo}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q585 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Oslo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who died in the writers of Philosophical Investigations?
 SPARQL: SELECT ?answer WHERE { wd:Q772496 wdt:P50 ?X . ?X wdt:P20 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'died in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philosophical Investigations', 'p': 'writer', 'o': '$y0'}}

 Q: For what One Direction was in nominated for in the year of 2013?
 SPARQL: SELECT ?obj WHERE { wd:Q146027 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'One Direction', 'p': 'nominated for', 'o': '?x0', 't': '2013'}

 Q: Are the beats per minute of Dance of Deception less than 0.0?
 SPARQL: ASK WHERE { wd:Q54913427 wdt:P1725 ?obj filter(?obj < 0.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Dance of Deception', 'p': 'beats per minute', 'o': '?x0', '?x0': '0.0'}

 Q: Who is Paulo Coelho's favorite player that has a career as a lyricist?
 SPARQL: SELECT ?answer WHERE { wd:Q12881 wdt:P737 ?answer . ?answer wdt:P106 wd:Q822146}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paulo Coelho', 'p': 'favorite player', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'lyricist'}}

 Q: Which is Open Library subject ID for Halley's Comet?
 SPARQL: select distinct ?answer where { wd:Q23054 wdt:P3847 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Halley's Comet", 'p': 'Open Library subject ID', 'o': '?x0'}

 Q: what is the {start time} for {Agra} has {located in the administrative territorial entity} as {Agra district} ?
 SPARQL: SELECT ?value WHERE { wd:Q42941 p:P131 ?s . ?s ps:P131 wd:Q606343 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Agra', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Agra district'}}}

 Q: What is {academic major} and {academic degree} of {{Christiane Amanpour} has {educated at} as {University of Rhode Island}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q236939 p:P69 ?s . ?s ps:P69 wd:Q1641788 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christiane Amanpour', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Rhode Island'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christiane Amanpour', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Rhode Island'}}}]

 Q: What is {time zone} of {died in} of {Bettie Page} ?
 SPARQL: SELECT ?answer WHERE { wd:Q61898 wdt:P20 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bettie Page', 'p': 'died in', 'o': '$y0'}}

 Q: What is the {human} for {relative} of {Faisal of Saudi Arabia}
 SPARQL:  select distinct ?obj where { wd:Q217167 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Faisal of Saudi Arabia', 'p': 'relative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {superhero} for {present in work} of {Sonic the Hedgehog}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q1046812 . ?sbj wdt:P31 wd:Q188784 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Sonic the Hedgehog', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'superhero'}}

 Q: What is {daughter of} of {wives} of {Hans Rehmann} ?
 SPARQL: SELECT ?answer WHERE { wd:Q118740 wdt:P26 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hans Rehmann', 'p': 'wives', 'o': '$y0'}}

 Q: What is {born at} of {Anne Enright}, that has {twin town} is {Bratislava} ?
 SPARQL: SELECT ?answer WHERE { wd:Q73176 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1780}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anne Enright', 'p': 'born at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin town', 'o': 'Bratislava'}}

