 Q: What is <Elite Prospects player ID> of <Ray Bourque> ?
 SPARQL: select distinct ?answer where { wd:Q715566 wdt:P2481 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ray Bourque', 'p': 'Elite Prospects player ID', 'o': '?x0'}

 Q: What is <British Olympic Association athlete ID> of <Alistair Brownlee> ?
 SPARQL: select distinct ?answer where { wd:Q716308 wdt:P4490 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alistair Brownlee', 'p': 'British Olympic Association athlete ID', 'o': '?x0'}

 Q: Which is the parent astronomical body for Beta Pictoris?
 SPARQL: select distinct ?answer where { ?answer wdt:P397 wd:Q582547}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Beta Pictoris'}

 Q: What is {discoverer or inventor of} of {NGC 6302}, that has {specialism} is {astronomy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q497739 wdt:P61 ?answer . ?answer wdt:P101 wd:Q333}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'NGC 6302', 'p': 'discoverer or inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'specialism', 'o': 'astronomy'}}

 Q: What is {subsidiary company} of {shareholder} of {Economist Intelligence Unit} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1063288 wdt:P127 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subsidiary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Economist Intelligence Unit', 'p': 'shareholder', 'o': '$y0'}}

 Q: What are the abnormally low values that start with letter U
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q54928607 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abnormally low value'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: Which is the LRB contributor ID for Chimamanda Ngozi Adichie?
 SPARQL: select distinct ?answer where { wd:Q230141 wdt:P5502 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Chimamanda Ngozi Adichie', 'p': 'LRB contributor ID', 'o': '?x0'}

 Q: What is {feedstock} of {pressure vessel}, that has {Mercosur code} is {7109.00.00} ?
 SPARQL: SELECT ?answer WHERE { wd:Q740460 wdt:P186 ?answer . ?answer wdt:P1987 ?x FILTER(contains(?x,'7109.00.00'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pressure vessel', 'p': 'feedstock', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Mercosur code', 'o': '7109.00.00'}}

 Q: Who gave the{academic discipline} of {mentor} of {Hermann Lotze} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57684 wdt:P1066 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hermann Lotze', 'p': 'mentor', 'o': '$y0'}}

 Q: What is <physically interacts with> of <electromagnetic waveguide> ?
 SPARQL: select distinct ?answer where { wd:Q354724 wdt:P129 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'electromagnetic waveguide', 'p': 'physically interacts with', 'o': '?x0'}

 Q: Is the refractive index of water equal 1.33298?
 SPARQL: ASK WHERE { wd:Q283 wdt:P1109 ?obj filter(?obj = 1.33298) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'water', 'p': 'refractive index', 'o': '?x0', '?x0': '1.33298'}

 Q: Is the fiscal/tax revenue of Del Carmen greater than 55486688.456?
 SPARQL: ASK WHERE { wd:Q28735 wdt:P3087 ?obj filter(?obj > 55486688.456) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Del Carmen', 'p': 'fiscal/tax revenue', 'o': '?x0', '?x0': '55486688.456'}

 Q: In the languages of expression of Cormac McCarthy which cases are known as the genitive case?
 SPARQL: SELECT ?answer WHERE { wd:Q272610 wdt:P1412 ?answer . ?answer wdt:P2989 wd:Q146233}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cormac McCarthy', 'p': 'languages of expression', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'cases', 'o': 'genitive case'}}

 Q: Was Cristiano Ronaldo participant of División de Honor Juvenil de Fútbol?
 SPARQL: ASK WHERE { wd:Q11571 wdt:P1344 wd:Q2023337 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Cristiano Ronaldo', 'p': 'participant of', 'o': '?x0', '?x0': 'División de Honor Juvenil de Fútbol'}]

 Q: Who gave the   {human population} of {continent} of {ghetto in Nazi-occupied Europe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2583015 wdt:P30 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ghetto in Nazi-occupied Europe', 'p': 'continent', 'o': '$y0'}}

 Q: What song is Andrew Lloyd Webber the composer of?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q180975 . ?sbj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composer', 'o': 'Andrew Lloyd Webber', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: Which taxon has the largest basic reproduction number?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3492 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'basic reproduction number', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is <Inventari del Patrimoni Arquitectònic de Catalunya code> of <Sagrada Família> ?
 SPARQL: select distinct ?answer where { wd:Q48435 wdt:P1600 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sagrada Familia', 'p': 'Inventari del Patrimoni Arquitectònic de Catalunya code', 'o': '?x0'}

 Q: Which is the possible medical findings of hypertension?
 SPARQL: select distinct ?answer where { wd:Q41861 wdt:P5131 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hypertension', 'p': 'possible medical findings', 'o': '?x0'}

 Q: What is the {anatomical structure} for {connects with} of {esophagus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2789 wd:Q173710 . ?sbj wdt:P31 wd:Q4936952 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'connects with', 'o': 'esophagus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anatomical structure'}}

 Q: Who is {is in the village of} of {borders} of {Terni} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8621 wdt:P47 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is in the village of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Terni', 'p': 'border', 'o': '$y0'}}

 Q: What is said to be the same as ethnic cleaning has to be distinguished from massacre?
 SPARQL: SELECT ?answer WHERE { wd:Q154278 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q3199915}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'ethnic cleaning', 'p': 'said to be the same as', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'distinguished from', 'o': 'massacre'}}

 Q: What is {featured in work} of {loyalty} of {Cú Chulainn} ?
 SPARQL: SELECT ?answer WHERE { wd:Q211955 wdt:P945 ?X . ?X wdt:P1441 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'featured in work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cu Chulainn', 'p': 'loyalty', 'o': '$y0'}}

 Q: How many {instruction set} are to/by {x86} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1068 wd:Q182933 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'instruction set', 'o': 'x86'}

 Q: what is the {start time} for {Annibale Carracci} has {student} as {Antonio Marziale Carracci} ?
 SPARQL: SELECT ?value WHERE { wd:Q7824 p:P802 ?s . ?s ps:P802 wd:Q2624075 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Annibale Carracci', 'p': 'student', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'student', 'o': 'Antonio Marziale Carracci'}}}

 Q: What is {died in} of {François Villon}, that has {diplomatic relation} is {Germany} ?
 SPARQL: SELECT ?answer WHERE { wd:Q849 wdt:P20 ?answer . ?answer wdt:P530 wd:Q183}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'François Villon', 'p': 'died in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Germany'}}

 Q: WHat is the fossil taxon of type OH 7 that contains the word habilis"" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23038290 . ?sbj wdt:P427 wd:Q7072569 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'habilis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fossil taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'OH 7'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'habilis'}}

 Q: Was Grace Kelly born in Philadelphia?
 SPARQL: ASK WHERE { wd:Q3925 wdt:P19 wd:Q1345 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Grace Kelly', 'p': 'born in', 'o': '?x0', '?x0': 'Philadelphia'}]

 Q: What is {elected in} and {end cause} of {{Stanley Baldwin} has {position held} as {Member of the 34th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 wd:Q41582587 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanley Baldwin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 34th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanley Baldwin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 34th Parliament of the United Kingdom'}}}]

 Q: What is the {position} for {military rank} of {Salman of Saudi Arabia}
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P410 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'military rank', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is the {human} for {country of citizenship} of {Maurya Empire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P27 wd:Q62943 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'Maurya Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {point in time} for {Wayne Gretzky} has {award received} as {Hockey Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q209518 p:P166 ?s . ?s ps:P166 wd:Q1136687 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Wayne Gretzky', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Hockey Hall of Fame'}, 't': '?x0'}

 Q: What was Anthony Quinn nominated for, in the beginning of January 1957?
 SPARQL: SELECT ?obj WHERE { wd:Q83484 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anthony Quinn', 'p': 'nominated for', 'o': '?x0', 't': '1957'}

 Q: Which is the enterprise of the headquarters location in Cleveland?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Cleveland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: What depicts a sauna?
 SPARQL: select distinct ?answer where { ?answer wdt:P180 wd:Q57036}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'sauna'}

 Q: What award did Ed Begley receive in the year 1956?
 SPARQL: SELECT ?obj WHERE { wd:Q318312 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ed Begley', 'p': 'award', 'o': '?x0', 't': '1956'}

 Q: Did {Mesopotamia} {direction relative to location} {Postclassical Era} and {east} ?
 SPARQL: ASK WHERE { wd:Q11767 wdt:P654 wd:Q7234117 . wd:Q11767 wdt:P654 wd:Q684 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mesopotamia', 'p': 'direction relative to location', 'o': '?x0', '?x0': 'Postclassical Era'}, {'h': 'IS', 'v': '?x1', 's': 'Mesopotamia', 'p': 'direction relative to location', 'o': '?x1', '?x1': 'east'}]

 Q: What is  award received  from Henrik Pontoppidan that is  together with is  Karl Adolph Gjellerup ?
 SPARQL: SELECT ?obj WHERE { wd:Q225554 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131487 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henrik Pontoppidan', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'together with', 'o': 'Karl Adolph Gjellerup'}}}

 Q: Tell me Class II combustible liquid whose name has the word toluene in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21009057 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toluene')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class II combustible liquid'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'toluene'}}

 Q: Does Alloy 718's Poisson's ratio equal to .32?
 SPARQL: ASK WHERE { wd:Q55843475 wdt:P5593 ?obj filter(?obj = 0.32) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Alloy 718', 'p': "Poisson's ratio", 'o': '?x0', '?x0': '0.32'}

 Q: What is the landscape of Water Lilies having vernacular name of
 SPARQL: SELECT ?answer WHERE { wd:Q1189907 wdt:P180 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'اپسرا'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Water Lilies', 'p': 'landscape of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': 'اپسرا'}}

 Q: What is {has villages} of {Xingtai}, that has {inhabitants} is {300029} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58576 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'300029'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Xingtai', 'p': 'has villages', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '300029'}}

 Q: Which is the place of work of August Sander that has executive power headed by Ernst Schwering?
 SPARQL: SELECT ?answer WHERE { wd:Q61530 wdt:P937 ?answer . ?answer wdt:P6 wd:Q1360182}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'August Sander', 'p': 'place of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'executive power headed by', 'o': 'Ernst Schwering'}}

 Q: Tell me revolution which contains the word o revolution in their own name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10931 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'revolution')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'revolution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'revolution'}}

 Q: What is the FAA airport code for Los Angeles International Airport?
 SPARQL: select distinct ?answer where { wd:Q8731 wdt:P240 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Los Angeles International Airport', 'p': 'FAA airport code', 'o': '?x0'}

 Q: What is the {chemical compound} for {significant drug interaction} of {erythromycin}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P769 wd:Q213511 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant drug interaction', 'o': 'erythromycin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Which is the legal doctrine which starts with the letter p?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1192543 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'legal doctrine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: Give me {hill} that {continent} {Asia} and which contains the word {ridges} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q54050 . ?sbj wdt:P30 wd:Q48 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ridges')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hill', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Asia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ridges'}}

 Q: Who is the family and father of Rollo?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q273773 wdt:P53 ?ans_1 . wd:Q273773 wdt:P22 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Rollo', 'p': 'family', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Rollo', 'p': 'father', 'o': '?x1'}]

 Q: What is {writer} of {Nineteen Eighty-Four}, that has {known for} is {Politics and the English Language} ?
 SPARQL: SELECT ?answer WHERE { wd:Q208460 wdt:P50 ?answer . ?answer wdt:P800 wd:Q2273966}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '1984', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'known for', 'o': 'Politics and the English Language'}}

 Q: What is the diplomatic relation of the land of Ujjain?
 SPARQL: SELECT ?answer WHERE { wd:Q200119 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ujjain', 'p': 'land', 'o': '$y0'}}

 Q: Which is the Danish urban area code for Odense?
 SPARQL: select distinct ?answer where { wd:Q25331 wdt:P1894 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Odense', 'p': 'Danish urban area code', 'o': '?x0'}

 Q: Which is calculated from the probability?
 SPARQL: select distinct ?answer where { ?answer wdt:P4934 wd:Q9492}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'calculated from', 'o': 'probability'}

 Q: What award was presented to Walter Payton in 1993?
 SPARQL: SELECT ?obj WHERE { wd:Q963117 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Walter Payton', 'p': 'award', 'o': '?x0', 't': '1993'}

 Q: Are Berliner Volksbank's net profits equal to 19,700,000?
 SPARQL: ASK WHERE { wd:Q821855 wdt:P2295 ?obj filter(?obj = 19700000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Berliner Volksbank', 'p': 'net profit', 'o': '?x0', '?x0': '19700000'}

 Q: Which is the Commonwealth realm for the anthem of God Save the Queen?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P85 wd:Q40807 . ?sbj wdt:P31 wd:Q202686 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'God Save the Queen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Commonwealth realm'}}

 Q: What is the {village} with the {MAX(area)} whose {located in the administrative territorial entity} is {Munchingi Puttu}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q532 . ?ent wdt:P2046 ?obj . ?ent wdt:P131 wd:Q11107378 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'area', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'village', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Munchingi Puttu'}}}

 Q: what is branch of biology that starts with z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28598684 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of biology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Who is the chairperson of the U.S. Department of State?
 SPARQL: select distinct ?answer where { wd:Q789915 wdt:P488 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'U.S. Department of State', 'p': 'chairperson', 'o': '?x0'}

 Q: Which is the gene for the genetic association of schizophrenia?
 SPARQL:  select distinct ?obj where { wd:Q41112 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'schizophrenia', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: On 1-1-1958 which award was received by Martin Buber?
 SPARQL: SELECT ?obj WHERE { wd:Q84423 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1958')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Martin Buber', 'p': 'award', 'o': '?x0', 't': '1958'}

 Q: what is the {end time} for {Ma Long} has {ranking} as {1.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q459114 p:P1352 ?s . ?s ps:P1352 ?x filter(contains(?x,'1.0')) . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ma Long', 'p': 'ranking', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ranking', 'o': '1.0'}}}

 Q: Tell me vocal group whose name has the word willows in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120544 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'willows')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vocal group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'willows'}}

 Q: What is {educated at} of {Sylvia Plath} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q133054 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvia Plath', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvia Plath', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {hereditary title} for {officeholder} of {Salman of Saudi Arabia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q5737899 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Salman of Saudi Arabia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hereditary title'}}

 Q: What is the {house} for {place of death} of {James Watt}
 SPARQL:  select distinct ?obj where { wd:Q9041 wdt:P20 ?obj . ?obj wdt:P31 wd:Q3947 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Watt', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'house'}}

 Q: What is {lives in} of {holds position} of {Lech Kaczyński} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2757 wdt:P39 ?X . ?X wdt:P263 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'lives in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lech Kaczyński', 'p': 'holds position', 'o': '$y0'}}

 Q: what is the {statement is subject of} for {Maggie Cheung} has {nominated for} as {César Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q234778 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maggie Cheung', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'César Award for Best Actress'}}}

 Q: What is the {railroad} with the {MAX(daily patronage)} whose {part of} is {Massachusetts Bay Transportation Authority}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22667 . ?ent wdt:P1373 ?obj . ?ent wdt:P361 wd:Q171985 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'daily patronage', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railroad', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'part of', 'o': 'Massachusetts Bay Transportation Authority'}}}

 Q: What is the {vegetable} for {this taxon is source of} of {eggplant}
 SPARQL:  select distinct ?obj where { wd:Q7540 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q11004 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'eggplant', 'p': 'this taxon is source of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vegetable'}}

 Q: What is {gender expression} of {Faust}, that has {confused with} is {man} ?
 SPARQL: SELECT ?answer WHERE { wd:Q332885 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Faust', 'p': 'gender expression', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'confused with', 'o': 'man'}}

 Q: Is it true that the points awarded of 3-2 sets are greater than 2.4?
 SPARQL: ASK WHERE { wd:Q27210429 wdt:P3260 ?obj filter(?obj > 2.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '3-2 sets', 'p': 'points awarded', 'o': '?x0', '?x0': '2.4'}

 Q: What is {film starring} of {series} of {Plane Daffy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7201002 wdt:P179 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'starring', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Plane Daffy', 'p': 'series', 'o': '$y0'}}

 Q: Who is the author and publisher of Grand Theft Auto V?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q17452 wdt:P50 ?ans_1 . wd:Q17452 wdt:P123 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Grand Theft Auto V', 'p': 'author', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Grand Theft Auto V', 'p': 'publisher', 'o': '?x1'}]

 Q: Did {Machu_Picchu} {culture} {Inca Empire}?
 SPARQL: ASK WHERE { wd:Q676203 wdt:P2596 wd:Q28573 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Machu Picchu', 'p': 'culture', 'o': '?x0', '?x0': 'Inca Empire'}]

 Q: What is <SBN author ID> of <Beniamino Gigli> ?
 SPARQL: select distinct ?answer where { wd:Q159473 wdt:P396 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Beniamino Gigli', 'p': 'SBN author ID', 'o': '?x0'}

 Q: What is the salinity of the Baltic Sea?
 SPARQL: select distinct ?answer where { wd:Q545 wdt:P4350 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Baltic Sea', 'p': 'salinity', 'o': '?x0'}

 Q: What is {venue} of {production method} of {biscuit} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13270 wdt:P2079 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'biscuit', 'p': 'production method', 'o': '$y0'}}

 Q: What is <IOC country code> of <Gabon> ?
 SPARQL: select distinct ?answer where { wd:Q1000 wdt:P984 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gabon', 'p': 'IOC country code', 'o': '?x0'}

 Q: What is {led to} of {field of action} of {mafia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18550 wdt:P452 ?X . ?X wdt:P1542 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'led to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mafia', 'p': 'field of action', 'o': '$y0'}}

 Q: what is the {replaces} for {Humayun} has {position held} as {Mughal emperor} ?
 SPARQL: SELECT ?value WHERE { wd:Q486188 p:P39 ?s . ?s ps:P39 wd:Q15390704 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Humayun', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Mughal emperor'}}}

 Q: Which tank locomotive has the highest number of cylinders with a 0-4-OT wheel arrangement?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q785745 . ?ent wdt:P1100 ?obj . ?ent wdt:P2978 wd:Q26234727 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of cylinders', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tank locomotive', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wheel arrangement', 'o': '0-4-0T'}}}

 Q: How many {head of government} are for {Moldova} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q217 wdt:P6 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Moldova', 'p': 'head of government', 'o': '?x0'}

 Q: What is the {taxon} for {this taxon is source of} of {opium}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1672 wd:Q46452 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'this taxon is source of', 'o': 'opium', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is the {plenary session} for {founded by} of {UNICEF}
 SPARQL:  select distinct ?obj where { wd:Q740308 wdt:P112 ?obj . ?obj wdt:P31 wd:Q18287076 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'UNICEF', 'p': 'founded by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'plenary session'}}

 Q: Are the total points in Mikko Lehtonen's career equal to 0?
 SPARQL: ASK WHERE { wd:Q59951 wdt:P6544 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Mikko Lehtonen', 'p': 'total points in career', 'o': '?x0', '?x0': '0'}

 Q: what is the {issued by} for {nipple} has {native label} as {papilla mammaria} ?
 SPARQL: SELECT ?value WHERE { wd:Q188641 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'papilla mammaria')) . ?s pq:P2378 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'issued by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'nipple', 'p': 'native label', 'o': '$y0'}}

 Q: Which is the National Natural Landmarks site ID of Fort Worth?
 SPARQL: select distinct ?answer where { wd:Q16558 wdt:P4182 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Fort Worth', 'p': 'National Natural Landmarks site ID', 'o': '?x0'}

 Q: How many times has Bob Hawke been a candidate
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P726 wd:Q269372 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'candidate', 'o': 'Bob Hawke'}

 Q: Which {sister has} {kids} of {John Spencer, 8th Earl Spencer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q593671 wdt:P40 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Spencer, 8th Earl Spencer', 'p': 'kid', 'o': '$y0'}}

 Q: what is the {sourcing circumstances} for {Irene of Athens} has {date of birth} as {752-1-1} ?
 SPARQL: SELECT ?value WHERE { wd:Q206737 p:P569 ?s . ?s ps:P569 ?x filter(contains(?x,'752-1-1')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Irene of Athens', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'date of birth', 'o': '752-1-1'}}}

 Q: Which chemical compound has the highest standard enthalpy of formation?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P3078 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'standard enthalpy of formation', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Which is the metalanguage which HTML5 is based on?
 SPARQL:  select distinct ?obj where { wd:Q2053 wdt:P144 ?obj . ?obj wdt:P31 wd:Q193983 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'HTML5', 'p': 'based on', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metalanguage'}}

