 Q: How many {medical condition treated} are to/by {cough} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2175 wd:Q35805 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'medical condition treated', 'o': 'cough'}

 Q: What is the EGROKN ID of the Russian Museum?
 SPARQL: select distinct ?answer where { wd:Q211043 wdt:P5381 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russian Museum', 'p': 'EGROKN ID', 'o': '?x0'}

 Q: who is executive producer of Bicycle Thieves ?
 SPARQL: select distinct ?answer where { wd:Q172837 wdt:P1431 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bicycle Thieves', 'p': 'executive producer', 'o': '?x0'}

 Q: What is the geotope with the lowest topographic isolation whose country is Germany ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q372363 . ?ent wdt:P2659 ?obj . ?ent wdt:P17 wd:Q183} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'topographic isolation', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geotope', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Germany'}}}

 Q: Which is the ICAA film catalogue ID of Brokeback Mountain?
 SPARQL: select distinct ?answer where { wd:Q160618 wdt:P5128 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brokeback Mountain', 'p': 'ICAA film catalogue ID', 'o': '?x0'}

 Q: Which archipelagic state has the highest inflation rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q13107770 . ?ent wdt:P1279 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'inflation rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archipelagic state'}}

 Q: What was the amount of population in New South Wales in 2014-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q3224 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New South Wales', 'p': 'population', 'o': '?x0', 't': '2014'}

 Q: What is {position held} of {Benito Mussolini} that is {replaced by} is {Luigi Federzoni} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23559 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q1379609 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benito Mussolini', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Luigi Federzoni'}}}

 Q: What is the son of the sister of Asim ibn Umar ?
 SPARQL: SELECT ?answer WHERE { wd:Q4806987 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asim ibn Umar', 'p': 'sister', 'o': '$y0'}}

 Q: What is the {human} for {head of government} of {Rotterdam}
 SPARQL:  select distinct ?obj where { wd:Q34370 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rotterdam', 'p': 'head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: How many filming locations are located in Oxfordshire?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P915 wd:Q23169 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'filming location', 'o': 'Oxfordshire'}

 Q: It is true that Harley Quinn's partner was Hal Jordan?
 SPARQL: ASK WHERE { wd:Q849477 wdt:P451 wd:Q2345627 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Harley Quinn', 'p': 'partner', 'o': '?x0', '?x0': 'Hal Jordan'}]

 Q: What is the genetic association for multiple sclerosis?
 SPARQL: select distinct ?answer where { ?answer wdt:P2293 wd:Q8277}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'multiple sclerosis'}

 Q: Who is the{dynasty} for {family} of {Rollo}
 SPARQL:  select distinct ?obj where { wd:Q273773 wdt:P53 ?obj . ?obj wdt:P31 wd:Q164950 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rollo', 'p': 'family', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dynasty'}}

 Q: What is the {position} for {office held by head of state} of {Achaemenid Empire}
 SPARQL:  select distinct ?obj where { wd:Q389688 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Achaemenid Empire', 'p': 'office held by head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is <affiliation> of <Dutch East India Company> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1416 wd:Q159766}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliation', 'o': 'Dutch East India Company'}

 Q: What is the {literary work} for {series} of {Harry Potter}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q8337 . ?sbj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Harry Potter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: What is the sister city of the Badminton World Federation in garrison?
 SPARQL: SELECT ?answer WHERE { wd:Q126638 wdt:P159 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Badminton World Federation', 'p': 'garrison', 'o': '$y0'}}

 Q: Give me {commune of France} that contains the word {éguilly} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484170 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'éguilly')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'éguilly'}}

 Q: Which is the Prabook ID for Czesław Miłosz?
 SPARQL: select distinct ?answer where { wd:Q45970 wdt:P3368 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Czesław Miłosz', 'p': 'Prabook ID', 'o': '?x0'}

 Q: Is it true that Warner Bros. Records was George Harrison's record label?
 SPARQL: ASK WHERE { wd:Q2643 wdt:P264 wd:Q843402 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'George Harrison', 'p': 'record label', 'o': '?x0', '?x0': 'Warner Bros. Records'}]

 Q: What is the location of the headquarters of "Deutsches Institut für Normung" which has coordinates at  52.505515 13.344447
 SPARQL: SELECT ?obj WHERE { wd:Q152746 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter(contains(?x,'52.505515 13.344447')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Deutsches Institut für Normung', 'p': 'headquarters', 'o': '?x0'}

 Q: What is the {metropolitan area} for {capital of} of {Calgary}
 SPARQL:  select distinct ?obj where { wd:Q36312 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q1907114 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Calgary', 'p': 'capital of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolitan area'}}

 Q: What is <regulated by> of <television in France> ?
 SPARQL: select distinct ?answer where { wd:Q3546742 wdt:P3719 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'television in France', 'p': 'regulated by', 'o': '?x0'}

 Q: Who is the publisher for Julius Streicher?
 SPARQL: select distinct ?answer where { ?answer wdt:P123 wd:Q76984}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'publisher', 'o': 'Julius Streicher'}

 Q: What is the {dominion of the British Empire} for {history of topic} of {history of India}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2184 wd:Q133136 . ?sbj wdt:P31 wd:Q223832 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'history of topic', 'o': 'history of India', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dominion of the British Empire'}}

 Q: What is {employer} of {Gavin McInnes} that is {position held} is {contributor} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5528217 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q20204892 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gavin McInnes', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'contributor'}}}

 Q: Where are the headquarters of World Trade Organization located?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q7825 wdt:P159 ?ans_1 . wd:Q7825 wdt:P276 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'World Trade Organization', 'p': 'headquarters', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'World Trade Organization', 'p': 'location', 'o': '?x1'}]

 Q: Which is the sexual preference of the studies of psychotherapy?
 SPARQL:  select distinct ?obj where { wd:Q183257 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q2275640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'psychotherapy', 'p': 'studies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sexual preference'}}

 Q: What series ordinal was given to Antonio Aguilar, given name José Pascual?
 SPARQL: SELECT ?value WHERE { wd:Q1958523 p:P735 ?s . ?s ps:P735 wd:Q53871939 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antonio Aguilar', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'José Pascual'}}}

 Q: Tell me logarithmic unit whose name has the word trit in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17342348 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'trit')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'logarithmic unit'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'trit'}}

 Q: what is the {statement disputed by} for {Judea and Samaria Area} has {country} as {Israel} ?
 SPARQL: SELECT ?value WHERE { wd:Q513200 p:P17 ?s . ?s ps:P17 wd:Q801 . ?s pq:P1310 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement disputed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Judea and Samaria Area', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Israel'}}}

 Q: which conglomerate has the highest net profit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q778575 . ?ent wdt:P2295 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'net profit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conglomerate'}}

 Q: What is <position held> of <Argonauts> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P39 wd:Q165510}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'position held', 'o': 'Argonauts'}

 Q: what is the {criterion used} for {Moravian-Silesian Region} has {population} as {1209879} ?
 SPARQL: SELECT ?value WHERE { wd:Q190550 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1209879')) . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moravian-Silesian Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1209879'}}}

 Q: What has a capital next to Francia?
 SPARQL: SELECT ?answer WHERE { wd:Q146246 wdt:P36 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'next to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francia', 'p': 'capital', 'o': '$y0'}}

 Q: What is {headquarters location} of {Costco} that is {coordinate location} is {47.5501 -122.051} ?
 SPARQL: SELECT ?obj WHERE { wd:Q715583 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter(contains(?x,'47.5501 -122.051')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Costco', 'p': 'headquarters location', 'o': '?x0'}

 Q: Which is the Fibonacci number in the translated edition of Lexicon Forestale that contains the number 1 in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47577 . ?sbj wdt:P629 wd:Q62469935 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), '1')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Fibonacci number', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'edition of', 'o': 'Lexicon Forestale'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': '1'}}

 Q: What is the wing configuration of a fixed-wing aircraft?
 SPARQL: select distinct ?answer where { ?answer wdt:P1654 wd:Q2875704}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'wing configuration', 'o': 'fixed-wing aircraft'}

 Q: Which is Who's Who in France biography ID for Michel Piccoli?
 SPARQL: select distinct ?answer where { wd:Q295257 wdt:P4124 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Michel Piccoli', 'p': "Who's Who in France biography ID", 'o': '?x0'}

 Q: Did {David_Cassidy} {occupation} {actor} and {singer-songwriter} ?
 SPARQL: ASK WHERE { wd:Q457306 wdt:P106 wd:Q33999 . wd:Q457306 wdt:P106 wd:Q488205 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'David Cassidy', 'p': 'occupation', 'o': '?x0', '?x0': 'actor'}, {'h': 'IS', 'v': '?x1', 's': 'David Cassidy', 'p': 'occupation', 'o': '?x1', '?x1': 'singer-songwriter'}]

 Q: What is {academic major} and {academic degree} of {{Peggy Whitson} has {educated at} as {Iowa Wesleyan College}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q235523 p:P69 ?s . ?s ps:P69 wd:Q14689086 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peggy Whitson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Iowa Wesleyan College'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peggy Whitson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Iowa Wesleyan College'}}}]

 Q: What sport is played for present at Harri Koskela ?
 SPARQL: SELECT ?answer WHERE { wd:Q1385703 wdt:P1344 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sport', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harri Koskela', 'p': 'present at', 'o': '$y0'}}

 Q: What is the geography of topic for human geography?
 SPARQL: select distinct ?answer where { ?answer wdt:P2633 wd:Q12831143}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'geography of topic', 'o': 'human geography'}

 Q: What is the award that Daniel McFadden got with James Heckman?
 SPARQL: SELECT ?obj WHERE { wd:Q312560 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q312561 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Daniel McFadden', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'with', 'o': 'James Heckman'}}}

 Q: What is the {human} for {chairperson} of {Indian National Congress}
 SPARQL:  select distinct ?obj where { wd:Q10225 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Indian National Congress', 'p': 'leader', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What years did Bernard Leach have a student named Peter Stichbury?
 SPARQL: SELECT ?value WHERE { wd:Q2898210 p:P802 ?s . ?s ps:P802 wd:Q16089985 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Bernard Leach', 'p': 'student', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'student', 'o': 'Peter Stichbury'}, 't': '?x0'}

 Q: Which is the LAWA waterbody ID for Danube?
 SPARQL: select distinct ?answer where { wd:Q1653 wdt:P3866 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Danube', 'p': 'LAWA waterbody ID', 'o': '?x0'}

 Q: What is {anatomical location} of {treats medical condition} of {dicloxacillin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2313471 wdt:P2175 ?X . ?X wdt:P927 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'anatomical location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'dicloxacillin', 'p': 'treats', 'o': '$y0'}}

 Q: What is {instance of} of {sodium chloride} that is {of} is {chloride ion} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2314 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q108200 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sodium chloride', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'chloride'}}}

 Q: What is the BWFbadminton.com player ID for Lin Dan?
 SPARQL: select distinct ?answer where { wd:Q1390341 wdt:P3620 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lin Dan', 'p': 'BWFbadminton.com player ID', 'o': '?x0'}

 Q: What is {sports league} of {part of team} of {Romain Inez} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3440678 wdt:P54 ?X . ?X wdt:P118 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'league', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Romain Inez', 'p': 'team', 'o': '$y0'}}

 Q: What is {sister town} of {Minsk}, that has {county seat for} is {Urban okrug Bryansk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2280 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q27532884}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Minsk', 'p': 'sister town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat for', 'o': 'Bryansk'}}

 Q: what is the {for work} for {Jack Palance} has {nominated for} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q193653 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jack Palance', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: Which country was Eldar Ryazanov born in as he was born in Samara?
 SPARQL: SELECT ?value WHERE { wd:Q381944 p:P19 ?s . ?s ps:P19 wd:Q894 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eldar Ryazanov', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'born in', 'o': 'Samara'}}}

 Q: what is geometric concept contains the word space in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21550639 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'space')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geometric concept'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'space'}}

 Q: What is the continent for the Eurovision Song Contest with a timezone of Europe/Athens?
 SPARQL: SELECT ?answer WHERE { wd:Q276 wdt:P30 ?answer . ?answer wdt:P421 wd:Q5412093}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Eurovision Song Contest', 'p': 'continent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timezone', 'o': 'Europe/Athens'}}

 Q: What is the {country of origin} and the {language of work or name} of {The_Adventures_of_Tintin} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q744536 wdt:P495 ?ans_1 . wd:Q744536 wdt:P407 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Adventures of Tintin', 'p': 'country of origin', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Adventures of Tintin', 'p': 'language', 'o': '?x1'}]

 Q: Which award did Aaron T. Beck receive in the year 1999?
 SPARQL: SELECT ?obj WHERE { wd:Q302849 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aaron T. Beck', 'p': 'award', 'o': '?x0', 't': '1999'}

 Q: How many sports are related to inline speed skating?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P641 wd:Q618786 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'inline speed skating'}

 Q: What is the {animation studio} for {owner of} of {Walt Disney Parks and Resorts}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q1431781 . ?sbj wdt:P31 wd:Q1107679 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'Disney Parks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animation studio'}}

 Q: Which is the biological database for the location of Yale University?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q4117139 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Yale University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biological database'}}

 Q: What is the {written work} for {edition or translation of} of {King James Version}
 SPARQL:  select distinct ?obj where { wd:Q623398 wdt:P629 ?obj . ?obj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'King James Version', 'p': 'edition or translation of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is PASE Domesday person ID for Edward the Confessor ?
 SPARQL: select distinct ?answer where { wd:Q130005 wdt:P3971 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Edward the Confessor', 'p': 'PASE Domesday person ID', 'o': '?x0'}

 Q: How many writing systems are by hiragana?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P282 wd:Q48332 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'hiragana'}

 Q: what is the {end time} for {Charlize Theron} has {partner} as {Stuart Townsend} ?
 SPARQL: SELECT ?value WHERE { wd:Q80046 p:P451 ?s . ?s ps:P451 wd:Q363525 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlize Theron', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Stuart Townsend'}}}

 Q: What what is city/town permanent duplicated item Königsberg and also which starts with letter k
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7930989 . ?sbj wdt:P2959 wd:Q4120832 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'k')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city/town', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'permanent duplicated item', 'o': 'Königsberg'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'k'}}

 Q: What is {position held} of {Frank Bainimarama} where {start time} is {2006-12-5} ?
 SPARQL: SELECT ?obj WHERE { wd:Q57830 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2006')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frank Bainimarama', 'p': 'position held', 'o': '?x0', 't': '2006'}

 Q: What is {nominated for} of {Robert Pattinson} that is {for work} is {The Twilight Saga: New Moon} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36767 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q116928 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Pattinson', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Twilight Saga: New Moon'}}}

 Q: What is {MASL} of {location of death} of {Ibn Taymiyyah} ?
 SPARQL: SELECT ?answer WHERE { wd:Q491558 wdt:P20 ?X . ?X wdt:P2044 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'MASL', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ibn Taymiyyah', 'p': 'location of death', 'o': '$y0'}}

 Q: what is the {language of work or name} for {Diary of Anne Frank} has {has edition} as {Diario} ?
 SPARQL: SELECT ?value WHERE { wd:Q6911 p:P747 ?s . ?s ps:P747 wd:Q14624888 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diary of Anne Frank', 'p': 'edition', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'edition', 'o': 'Diario'}}}

 Q: What is {county seat for} of {location of work} of {Heinrich Schütz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q153643 wdt:P937 ?X . ?X wdt:P1376 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'county seat for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Heinrich Schütz', 'p': 'location of work', 'o': '$y0'}}

 Q: What is <uses> of <seismic wave> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2283 wd:Q186167}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'seismic wave'}

 Q: What is {capital of} of {Nanjing} that is {end time} is {936-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q16666 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter(contains(?x,'936-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nanjing', 'p': 'capital of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end time', 'o': '936-0-0'}}}

 Q: which sports season has the highest points awarded whose participating teams is adelaide football club?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q27020041 . ?ent wdt:P3260 ?obj . ?ent wdt:P1923 wd:Q948900 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'points awarded', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sports season', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'participating team', 'o': 'Adelaide Football Club'}}}

 Q: Which is the Roller Coaster Database ID for Universal Parks & Resorts?
 SPARQL: select distinct ?answer where { wd:Q1186857 wdt:P2751 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Universal Parks & Resorts', 'p': 'Roller Coaster Database ID', 'o': '?x0'}

 Q: what is the {number of matches played} for {Cafu} has {member of sports team} as {Real Zaragoza} ?
 SPARQL: SELECT ?value WHERE { wd:Q178683 p:P54 ?s . ?s ps:P54 wd:Q10308 . ?s pq:P1350 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cafu', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Real Zaragoza'}}}

 Q: Name a relativistic wave equation that contains the word " equation" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7310838 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'equation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'relativistic wave equation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'equation'}}

 Q: Is the suicide rate Akita Prefecture less than 25.488?
 SPARQL: ASK WHERE { wd:Q81863 wdt:P3864 ?obj filter(?obj < 25.488) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Akita Prefecture', 'p': 'suicide rate', 'o': '?x0', '?x0': '25.488'}

 Q: Which talent agency represented Ronald Reagan?
 SPARQL:  select distinct ?obj where { wd:Q9960 wdt:P1875 ?obj . ?obj wdt:P31 wd:Q5354754 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ronald Reagan', 'p': 'rep', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'talent agency'}}

 Q: What is the capital of Helsinki that is located in the administrative territorial entity of the Russian Empire?
 SPARQL: SELECT ?obj WHERE { wd:Q1757 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P131 wd:Q34266 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Helsinki', 'p': 'capital of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Russian Empire'}}}

 Q: Give the name of galaxy with less apparent magnitude and was discovered by William Herschel?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1215 ?obj . ?ent wdt:P61 wd:Q14277} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'apparent magnitude', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'galaxy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discovered by', 'o': 'William Herschel'}}}

 Q: Is the torque of the NEMA 17 Stepper motor Model LDO-42STH47-1684A equal to 40.0?
 SPARQL: ASK WHERE { wd:Q25859948 wdt:P2230 ?obj filter(?obj = 40.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'NEMA 17 Stepper motor Model LDO-42STH47-1684A', 'p': 'torque', 'o': '?x0', '?x0': '40.0'}

 Q: When is {end time} and {start time} of {{Guglielmo Marconi} whose {spouse} as {Beatrice O'Brien}}?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q36488 p:P26 ?s . ?s ps:P26 wd:Q22230905 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guglielmo Marconi', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': "Beatrice O'Brien"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guglielmo Marconi', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': "Beatrice O'Brien"}}}]

 Q: What person who's a citizen of Romania has the highest EGF rating?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4105 ?obj . ?ent wdt:P27 wd:Q218 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'EGF rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'citizen of', 'o': 'Romania'}}}

 Q: How many {total produced} are for {Fuji} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q504893 wdt:P1092 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Fuji', 'p': 'total produced', 'o': '?x0'}

 Q: What is the {mainland territory of Australia} for {replaced by} of {Northern Territory}
 SPARQL:  select distinct ?obj where { wd:Q3235 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q14192234 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Northern Territory', 'p': 'replaced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mainland territory of Australia'}}

 Q: Vladimir Lenin is a member of which political party?
 SPARQL:  select distinct ?obj where { wd:Q1394 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Lenin', 'p': 'party', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: What is {head of government} of {Tocantins} that is {end time} is {2018-3-22} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43695 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tocantins', 'p': 'head of government', 'o': '?x0', 't': '2018'}

 Q: Which online dictionary has the highest number of records?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3327521 . ?ent wdt:P4876 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of records', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'online dictionary'}}

 Q: How many {consecrator} are to/by {John XXIII} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1598 wd:Q23873 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'consecrator', 'o': 'John XXIII'}

