 Q: Tell me the location of  the administrative territorial entity for Harry Harlow has place of death as Tucson?
 SPARQL: SELECT ?value WHERE { wd:Q1356498 p:P20 ?s . ?s ps:P20 wd:Q18575 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harry Harlow', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Tucson'}}}

 Q: What spouse of Max Ernst has a birthdate of 1-1-1946?
 SPARQL: SELECT ?obj WHERE { wd:Q154842 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Max Ernst', 'p': 'spouse', 'o': '?x0', 't': '1946'}

 Q: Who was Hugh Hefner`s partner who died in 1976 ?
 SPARQL: SELECT ?obj WHERE { wd:Q194280 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1976')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hugh Hefner', 'p': 'partner', 'o': '?x0', 't': '1976'}

 Q: what is the {series ordinal} for {Lola Flores} has {child} as {Rosario Flores} ?
 SPARQL: SELECT ?value WHERE { wd:Q242084 p:P40 ?s . ?s ps:P40 wd:Q251210 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lola Flores', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Rosario Flores'}}}

 Q: Is the maximum frequency of audible sound of the Varanus komodoensis equal 2400.0?
 SPARQL: ASK WHERE { wd:Q4504 wdt:P3465 ?obj filter(?obj = 2400.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Varanus komodoensis', 'p': 'maximum frequency of audible sound', 'o': '?x0', '?x0': '2400.0'}

 Q: What is the place of interment of Albert Anastasia, that has a foundation date of 1838-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q706235 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1838'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Albert Anastasia', 'p': 'interment', 'o': '?x0', 't': '1838'}

 Q: What are innervates of liver?
 SPARQL: select distinct ?answer where { ?answer wdt:P3190 wd:Q9368}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'innervates', 'o': 'liver'}

 Q: Tell me which industry contains the word winemaking in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8148 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winemaking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'industry'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'winemaking'}}

 Q: What is the orbital eccentricity of Planet Nine?
 SPARQL: select distinct ?answer where { wd:Q22133699 wdt:P1096 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Planet Nine', 'p': 'orbital eccentricity', 'o': '?x0'}

 Q: Alexander Scriabin is a tutor of which musical instrument?
 SPARQL: SELECT ?answer WHERE { wd:Q185647 wdt:P1066 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Scriabin', 'p': 'tutor', 'o': '$y0'}}

 Q: What is date of death for Charles Le Brun ?
 SPARQL: select distinct ?answer where { wd:Q271676 wdt:P570 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Le Brun', 'p': 'date of death', 'o': '?x0'}

 Q: What is the diplomatic relation of Slovenia whose acronym is ЗША?
 SPARQL: SELECT ?answer WHERE { wd:Q215 wdt:P530 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'ЗША'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Slovenia', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'acronym', 'o': 'зша'}}

 Q: How many religions are by animism?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P140 wd:Q43004 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'religion', 'o': 'animism'}

 Q: who is user of fleet of Qantas ?
 SPARQL: SELECT ?answer WHERE { wd:Q32491 wdt:P121 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'user', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Qantas', 'p': 'fleet', 'o': '$y0'}}

 Q: What variety is influenced by English?
 SPARQL:  select distinct ?obj where { wd:Q1860 wdt:P737 ?obj . ?obj wdt:P31 wd:Q3329375 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'English', 'p': 'influenced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'variety'}}

 Q: What is {won by} of {award} of {Fleetwood Mac} ?
 SPARQL: SELECT ?answer WHERE { wd:Q106648 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'won by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fleetwood Mac', 'p': 'award', 'o': '$y0'}}

 Q: What are the modern languages which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'modern language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {spouse} of {Henry IV of France} that is {end cause} is {divorce} ?
 SPARQL: SELECT ?obj WHERE { wd:Q936976 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1534 wd:Q93190 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'spouse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry IV of France', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end cause', 'o': 'divorce'}}}

 Q: What is the {British Academy Film Awards} for {nominated for} of {Javier Bardem}
 SPARQL:  select distinct ?obj where { wd:Q134895 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q732997 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Javier Bardem', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'British Academy Film Awards'}}

 Q: IS THE MINIMALL INCUBATION PERIOD IN HUMANS OF BOTULISM LESS THAN 7.2
 SPARQL: ASK WHERE { wd:Q154865 wdt:P3488 ?obj filter(?obj < 7.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'botulism', 'p': 'minimal incubation period in humans', 'o': '?x0', '?x0': '7.2'}

 Q: What is {honors} of {W. H. Auden}, that has {prizewinner} is {Joan Didion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q178698 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q267691}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'W. H. Auden', 'p': 'honors', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Joan Didion'}}

 Q: What are the children's game  which start with the letter zapp
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1509934 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zapp')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': "children's game"}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zapp'}}

 Q: What is <width> of <Lake District> ?
 SPARQL: select distinct ?answer where { wd:Q211778 wdt:P2049 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake District', 'p': 'width', 'o': '?x0'}

 Q: Which is the enterprise that is a subsidiary of CBS?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P355 wd:Q43380 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'CBS', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: Which aircraft family has highest time to altitude?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15056993 . ?ent wdt:P2362 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'time to altitude', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: Are there no households in Vidvathkumaryachasamudram?
 SPARQL: ASK WHERE { wd:Q16346016 wdt:P1538 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Vidvathkumaryachasamudram', 'p': 'households', 'o': '?x0', '?x0': '0'}

 Q: What is {inception} of {Islamic State of Iraq and the Levant} that is {identity of subject in context} is {Islamic State of Iraq} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2429253 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P4649 wd:Q18206631 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inception', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Islamic State of Iraq and the Levant', 'p': 'inception', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'identity of subject in context', 'o': 'Islamic State of Iraq'}}}

 Q: How many {World Health Organisation International Nonproprietary Name} are for {amphetamine} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q179452 wdt:P2275 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'amphetamine', 'p': 'World Health Organisation International Nonproprietary Name', 'o': '?x0'}

 Q: Which is language of platforms of Army of Darkness: Defense ?
 SPARQL: SELECT ?answer WHERE { wd:Q4794301 wdt:P400 ?X . ?X wdt:P277 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Army of Darkness: Defense', 'p': 'platform', 'o': '$y0'}}

 Q: Which is the TERYT municipality code of Wrocław?
 SPARQL: select distinct ?answer where { wd:Q1799 wdt:P1653 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wrocław', 'p': 'TERYT municipality code', 'o': '?x0'}

 Q: What is {antonym of} of {streak color} of {emerald} ?
 SPARQL: SELECT ?answer WHERE { wd:Q43513 wdt:P534 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'antonym', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'emerald', 'p': 'streak color', 'o': '$y0'}}

 Q: What principality replaced the Ottoman Empire?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q208500 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced', 'o': 'Ottoman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'principality'}}

 Q: Who gave the {painters} of {series} of {Bash} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16243529 wdt:P179 ?X . ?X wdt:P170 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'painter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bash', 'p': 'series', 'o': '$y0'}}

 Q: When did Thomas Young receive the award for Bakerian Lecture?
 SPARQL: SELECT ?value WHERE { wd:Q25820 p:P166 ?s . ?s ps:P166 wd:Q1107771 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Thomas Young', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Bakerian Lecture'}, 't': '?x0'}

 Q: What was the instance of the so called "Black Death" on 1347?
 SPARQL: SELECT ?value WHERE { wd:Q42005 p:P585 ?s . ?s ps:P585 ?x filter(contains(YEAR(?x),'1347')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': '?x0'}

 Q: What is {co-founded by} of {employed by} of {Gerhard Gentzen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q60502 wdt:P108 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerhard Gentzen', 'p': 'employed by', 'o': '$y0'}}

 Q: How many {illustrator} are to/by {E. H. Shepard} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P110 wd:Q382031 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'illustrator', 'o': 'E. H. Shepard'}

 Q: What is {academic major} and {academic degree} of {{Donald Trump} has {educated at} as {The Wharton School}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q22686 p:P69 ?s . ?s ps:P69 wd:Q1329269 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Trump', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'The Wharton School'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Trump', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'The Wharton School'}}}]

 Q: What is <health specialty> of <infection> ?
 SPARQL: select distinct ?answer where { wd:Q166231 wdt:P1995 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'infection', 'p': 'health specialty', 'o': '?x0'}

 Q: What is {head of government} of {Atlanta} that is {start time} is {2002-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23556 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Atlanta', 'p': 'head of government', 'o': '?x0', 't': '2002'}

 Q: what is the {burial plot reference} for {Alwin Nikolais} has {place of burial} as {Crématorium-columbarium du Père-Lachaise} ?
 SPARQL: SELECT ?value WHERE { wd:Q449880 p:P119 ?s . ?s ps:P119 wd:Q3006253 . ?s pq:P965 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'burial plot reference', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alwin Nikolais', 'p': 'place of burial', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of burial', 'o': 'Crématorium-columbarium du Père-Lachaise'}}}

 Q: who is the child of Zeus whose mother is Leda?
 SPARQL: SELECT ?obj WHERE { wd:Q34201 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q182019 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zeus', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'mother', 'o': 'Leda'}}}

 Q: What is the {country} for {replaced by} of {Czechoslovakia}
 SPARQL:  select distinct ?obj where { wd:Q33946 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Czechoslovakia', 'p': 'replaced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Did Edward VIII hold the military rank of field marshal?
 SPARQL: ASK WHERE { wd:Q590227 wdt:P410 wd:Q2703373 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Edward VIII', 'p': 'military rank', 'o': '?x0', '?x0': 'field marshal'}]

 Q: What is  thealphabet  language official of Tokugawa shogunate ?
 SPARQL: SELECT ?answer WHERE { wd:Q205662 wdt:P37 ?X . ?X wdt:P282 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'alphabet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tokugawa shogunate', 'p': 'language official', 'o': '$y0'}}

 Q: Who is the president and CEO of BP?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q152057 wdt:P488 ?ans_1 . wd:Q152057 wdt:P169 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'BP', 'p': 'president', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'BP', 'p': 'CEO', 'o': '?x1'}]

 Q: What is {physical quantity} of {cubic inch}, that has {observable dimension} is {L^3} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2140397 wdt:P111 ?answer . ?answer wdt:P4020 ?x FILTER(contains(?x,'L^3'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cubic inch', 'p': 'quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'observable dimension', 'o': 'l^3'}}

 Q: What is the death date of Peter, Count of Perche and Alençon, the son of Louis IX of France?
 SPARQL: SELECT ?value WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q739327 . ?s pq:P570 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis IX of France', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Peter, Count of Perche and Alençon'}}}

 Q: Tell me the sect that contains the word valentinianism in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19097 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'valentinianism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sect'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'valentinianism'}}

 Q: Wich means{is a list of} at {lawsuit} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P360 wd:Q697327}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is a list of', 'o': 'lawsuit'}

 Q: What is {titleholder} of {honours} of {Kelly Miller} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1032247 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'titleholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kelly Miller', 'p': 'honours', 'o': '$y0'}}

 Q: Which is the weather history for New York City?
 SPARQL: select distinct ?answer where { wd:Q60 wdt:P4150 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'New York City', 'p': 'weather history', 'o': '?x0'}

 Q: What sovereign states have a diplomatic relationship with the Russian Empire?
 SPARQL:  select distinct ?obj where { wd:Q34266 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russian Empire', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Which is the subreddit for Srinagar?
 SPARQL: select distinct ?answer where { wd:Q170115 wdt:P3984 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Srinagar', 'p': 'subreddit', 'o': '?x0'}

 Q: Is 16 the age of consent in Spain?
 SPARQL: ASK WHERE { wd:Q29 wdt:P2999 ?obj filter(?obj = 16) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Spain', 'p': 'age of consent', 'o': '?x0', '?x0': '16'}

 Q: What is the {filmography} for {performer} of {Cecil B. DeMille}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P175 wd:Q72267 . ?sbj wdt:P31 wd:Q1371849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Cecil B. DeMille', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'filmography'}}

 Q: In what country does Mother's Day take place on March 8th?
 SPARQL: SELECT ?value WHERE { wd:Q47502 p:P837 ?s . ?s ps:P837 wd:Q2395 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Mother's Day", 'p': 'take place on', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'take place on', 'o': 'March 8'}}}

 Q: What military branch of the air force did Yuri Gagarin work for?
 SPARQL:  select distinct ?obj where { wd:Q7327 wdt:P241 ?obj . ?obj wdt:P31 wd:Q61883 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yuri Gagarin', 'p': 'military branch', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'air force'}}

 Q: Who is the{road bridge} for {structure replaced by} of {London Bridge}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P167 wd:Q130206 . ?sbj wdt:P31 wd:Q537127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'structure replaced by', 'o': 'London Bridge', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road bridge'}}

 Q: What is the ammonia conjugate acid monocation?
 SPARQL:  select distinct ?obj where { wd:Q4087 wdt:P4147 ?obj . ?obj wdt:P31 wd:Q55523831 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ammonia', 'p': 'conjugate acid', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monocation'}}

 Q: Which is the track gauge for Trans-Australian Railway?
 SPARQL: select distinct ?answer where { wd:Q1361233 wdt:P1064 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Trans-Australian Railway', 'p': 'track gauge', 'o': '?x0'}

 Q: What is the {residence} and the {occupation} of {Benjamin_Millepied} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q583186 wdt:P551 ?ans_1 . wd:Q583186 wdt:P106 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Benjamin Millepied', 'p': 'residence', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Benjamin Millepied', 'p': 'occupation', 'o': '?x1'}]

 Q: what is the {point in time} for {Herta Müller} has {award received} as {Ehrengabe der Heinrich-Heine-Gesellschaft} ?
 SPARQL: SELECT ?value WHERE { wd:Q38049 p:P166 ?s . ?s ps:P166 wd:Q15096434 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Herta Müller', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Ehrengabe der Heinrich-Heine-Gesellschaft'}, 't': '?x0'}

 Q: What is Moscow State University's elibrary.ru organisation ID?
 SPARQL: select distinct ?answer where { wd:Q13164 wdt:P2463 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Moscow State University', 'p': 'elibrary.ru organisation ID', 'o': '?x0'}

 Q: what is the {end time} for {Serge Gainsbourg} has {spouse} as {Caroline von Paulus} ?
 SPARQL: SELECT ?value WHERE { wd:Q1698 p:P26 ?s . ?s ps:P26 wd:Q581225 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Serge Gainsbourg', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Caroline von Paulus'}}}

 Q: What is the {non-metropolitan district} for {contains administrative territorial entity} of {Norfolk}
 SPARQL:  select distinct ?obj where { wd:Q23109 wdt:P150 ?obj . ?obj wdt:P31 wd:Q1187580 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Norfolk', 'p': 'contains administrative territorial entity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'non-metropolitan district'}}

 Q: When did Santa Cruz de Tenerife have the population of 206593.0?
 SPARQL: SELECT ?value WHERE { wd:Q14328 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'206593.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Santa Cruz de Tenerife', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '206593.0'}, 't': '?x0'}

 Q: What are the designed by and the programming paradigm of SQL?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q47607 wdt:P287 ?ans_1 . wd:Q47607 wdt:P3966 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'SQL', 'p': 'designed by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'SQL', 'p': 'programming paradigm', 'o': '?x1'}]

 Q: When was Robert Frank awarded the Hasselblad Award?
 SPARQL: SELECT ?value WHERE { wd:Q467574 p:P166 ?s . ?s ps:P166 wd:Q1324112 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert Frank', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Hasselblad Award'}, 't': '?x0'}

 Q: What was Liège's twin city in 1955?
 SPARQL: SELECT ?obj WHERE { wd:Q3992 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1955')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Liège', 'p': 'twin city', 'o': '?x0', 't': '1955'}

 Q: what is the {publication date} for {Alexandre Dumas} has {notable work} as {The Count of Monte Cristo} ?
 SPARQL: SELECT ?value WHERE { wd:Q38337 p:P800 ?s . ?s ps:P800 wd:Q191838 . ?s pq:P577 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexandre Dumas', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'The Count of Monte Cristo'}}}

 Q: What is the profession of Guillermo Lasso that is different from a bank teller
 SPARQL: SELECT ?answer WHERE { wd:Q4414537 wdt:P106 ?answer . ?answer wdt:P1889 wd:Q806805}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guillermo Lasso', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'different from', 'o': 'bank teller'}}

 Q: Give me a female idol group that starts with the letter z.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11446438 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'female idol group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What pizza comes from the head of government?
 SPARQL: SELECT ?answer WHERE { wd:Q177 wdt:P495 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'head of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pizza', 'p': 'comes from', 'o': '$y0'}}

 Q: What is the {type of quantum particle} for {antiparticle} of {neutron}
 SPARQL:  select distinct ?obj where { wd:Q2348 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'neutron', 'p': 'antiparticle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: Which {play} {participated in} {Micronesia at the 2011 World Aquatics Championships} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1177107 wdt:P1344 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'play', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Micronesia at the 2011 World Aquatics Championships', 'p': 'participated in', 'o': '$y0'}}

 Q: Which is the language of work or name for Old Church Slavonic?
 SPARQL: select distinct ?answer where { ?answer wdt:P407 wd:Q35499}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Old Church Slavonic'}

 Q: Is the par of the Royal St George's Golf Club equal to 56.0?
 SPARQL: ASK WHERE { wd:Q1586134 wdt:P3530 ?obj filter(?obj = 56.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "Royal St George's Golf Club", 'p': 'par', 'o': '?x0', '?x0': '56.0'}

 Q: What is the {periodical literature} for {mouthpiece} of {Air Canada}
 SPARQL:  select distinct ?obj where { wd:Q185339 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Air Canada', 'p': 'mouthpiece', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'periodical'}}

 Q: Which is the valid in period of Easter?
 SPARQL: select distinct ?answer where { ?answer wdt:P1264 wd:Q21196}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'valid in period', 'o': 'Easter'}

 Q: What is {coordinate location} of {Dnieper River} that is {applies to part} is {river source} ?
 SPARQL: SELECT ?obj WHERE { wd:Q40855 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dnieper River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river source'}}}

 Q: When was did Bursa cease being the capital of the Ottoman Empire?
 SPARQL: SELECT ?value WHERE { wd:Q12560 p:P36 ?s . ?s ps:P36 wd:Q40738 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ottoman Empire', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Bursa'}}}

 Q: Is the conversion to SI unit of the base pair equal 4.08e-10?
 SPARQL: ASK WHERE { wd:Q145911 wdt:P2370 ?obj filter(?obj = 4.08e-10) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'base pair', 'p': 'conversion to SI unit', 'o': '?x0', '?x0': '4.08e-10'}

 Q: what is the {point in time} for {Georgia} has {population} as {2.60912e+06} ?
 SPARQL: SELECT ?value WHERE { wd:Q1428 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'2.60912e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Georgia', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '2.60912e+06'}, 't': '?x0'}

 Q: Give me {area of mathematics} that {practiced by} {algebraist} and which that starts with {'a'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1936384 . ?sbj wdt:P3095 wd:Q23900107 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'area of mathematics', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'practiced by', 'o': 'algebraist'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: What is {density} of {brass} that is {phase of matter} is {solid} ?
 SPARQL: SELECT ?obj WHERE { wd:Q39782 p:P2054 ?s . ?s ps:P2054 ?obj . ?s pq:P515 wd:Q11438 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'density', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'brass', 'p': 'density', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase of matter', 'o': 'solid'}}}

 Q: Which is the item used in the plays of Graham Thorpe?
 SPARQL: SELECT ?answer WHERE { wd:Q3527096 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'item used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Graham Thorpe', 'p': 'play', 'o': '$y0'}}

 Q: During the conflict of the Mexican-American War, which branch was Nate Dogg in?
 SPARQL: SELECT ?answer WHERE { wd:Q47159 wdt:P241 ?answer . ?answer wdt:P607 wd:Q6683}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nate Dogg', 'p': 'branch', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'Mexican-American War'}}

 Q: what is the {replaces} for {Teodoro Obiang Nguema Mbasogo} has {position held} as {Chairperson of the African Union} ?
 SPARQL: SELECT ?value WHERE { wd:Q57385 p:P39 ?s . ?s ps:P39 wd:Q946339 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Obiang Nguema Mbasogo', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chairperson of the African Union'}}}

 Q: "Which is {facet of a polytope} of {pyramid}, whose {next is} is {quadrilateral} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q3358290 wdt:P1312 ?answer . ?answer wdt:P156 wd:Q36810}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pyramid', 'p': 'facet of a polytope', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'next is', 'o': 'quadrilateral'}}

 Q: How many {tracklist} are for {The Wall} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q151114 wdt:P658 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'The Wall', 'p': 'tracklist', 'o': '?x0'}

 Q: Was Aphrodite the child of Phobos and Dictys?
 SPARQL: ASK WHERE { wd:Q35500 wdt:P40 wd:Q105019 . wd:Q35500 wdt:P40 wd:Q26618397 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Aphrodite', 'p': 'child', 'o': '?x0', '?x0': 'Phobos'}, {'h': 'IS', 'v': '?x1', 's': 'Aphrodite', 'p': 'child', 'o': '?x1', '?x1': 'Dictys'}]

 Q: Give me {international sport governing body} that contains the word {world} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international sport governing body'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'world'}}

 Q: What is the {free or open-source video game} with the {MAX(maximum number of players)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21125433 . ?ent wdt:P1873 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum number of players', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'free or open-source video game'}}

