 Q: How many {endemic to} are to/by {South Australia} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P183 wd:Q35715 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'endemic to', 'o': 'South Australia'}

 Q: Which was the cost of Titanic?
 SPARQL: select distinct ?answer where { wd:Q44578 wdt:P2130 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Titanic', 'p': 'cost', 'o': '?x0'}

 Q: Give me {municipal corporation in India} that starts with {'n'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6936225 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal corporation in India'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: what is the {start time} for {Tenzin Gyatso} has {country of citizenship} as {People's Republic of China} ?
 SPARQL: SELECT ?value WHERE { wd:Q17293 p:P27 ?s . ?s ps:P27 wd:Q148 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tenzin Gyatso', 'p': 'citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'citizenship', 'o': "People's Republic of China"}}}

 Q: What is {toponym} of {Lorentz transformation}, that has {male} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q217255 wdt:P138 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lorentz transformation', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'male'}}

 Q: What is <power consumed> of <Cassini−Huygens> ?
 SPARQL: select distinct ?answer where { wd:Q165585 wdt:P2791 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cassini-Huygens', 'p': 'power consumed', 'o': '?x0'}

 Q: What is ZooBank author ID of Albert Günther?
 SPARQL: select distinct ?answer where { wd:Q57514 wdt:P2006 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albert Günther', 'p': 'ZooBank author ID', 'o': '?x0'}

 Q: When did member of sports team of Rabah Madjer and number of points/goals/set scored?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q431343 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rabah Madjer', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rabah Madjer', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Who is the {written work} for {based on} of {Forrest Gump}
 SPARQL:  select distinct ?obj where { wd:Q134773 wdt:P144 ?obj . ?obj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Forrest Gump', 'p': 'based on', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: Give me {electrical connector system} that {publisher} {USB Implementers Forum} and which that starts with {'u'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58184783 . ?sbj wdt:P123 wd:Q3847420 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'electrical connector system', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'publisher', 'o': 'USB Implementers Forum'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is the {pharmaceutical product} for {active ingredient in} of {caffeine}
 SPARQL:  select distinct ?obj where { wd:Q60235 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'caffeine', 'p': 'active ingredient in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: Which is the Find A Grave cemetery ID for Valley of the Kings?
 SPARQL: select distinct ?answer where { wd:Q133423 wdt:P2025 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Valley of the Kings', 'p': 'Find A Grave cemetery ID', 'o': '?x0'}

 Q: What was the religion of Stefan Nemanja during 1143?
 SPARQL: SELECT ?obj WHERE { wd:Q298612 p:P140 ?s . ?s ps:P140 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1143')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Stefan Nemanja', 'p': 'religion', 'o': '?x0', 't': '1143'}

 Q: Tell me schism whose name has the word schism in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41521 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'schism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'schism'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'schism'}}

 Q: Who is the secretary general for Christian Democratic Union?
 SPARQL: select distinct ?answer where { wd:Q49762 wdt:P3975 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Christian Democratic Union', 'p': 'secretary general', 'o': '?x0'}

 Q: What periodization contains the word "wilhelmine" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q816829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wilhelmine')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'periodization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wilhelmine'}}

 Q: Tell me flux whose name has the word flux in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6485344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'flux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flux'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'flux'}}

 Q: what is the {language of work or name} for {flour} has {pronunciation audio} as {Sv-mjöl.ogg} ?
 SPARQL: SELECT ?value WHERE { wd:Q36465 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Sv-mjöl.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'flour', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'sv-mjöl.ogg'}}}

 Q: What is {participant of} of {Mark Spitz} that is {award received} is {Olympic bronze medal} ?
 SPARQL: SELECT ?obj WHERE { wd:Q180748 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P166 wd:Q15889643 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'participant of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mark Spitz', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Olympic bronze medal'}}}

 Q: Which is a Debian stable package of Perl?
 SPARQL: select distinct ?answer where { wd:Q42478 wdt:P3442 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Perl', 'p': 'Debian stable package', 'o': '?x0'}

 Q: What is {population} of {Los Lagos Region} where {determination method} is {census} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2178 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Los Lagos Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: When did urban municipality of Germany for twinned administrative body of Leeds?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q39121 . ?sbj wdt:P31 wd:Q42744322 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Leeds', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'urban municipality of Germany'}}

 Q: what is the {replaces} for {Louis XII of France} has {position held} as {King of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q58514 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis XII of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of France'}}}

 Q: How many points/goals were scored by Zinedine Zidane?
 SPARQL: select distinct ?answer where { ?answer wdt:P1363 wd:Q1835}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'scored by', 'o': 'Zinedine Zidane'}

 Q: What is the AS.com athlete ID for Maria Sharapoval?
 SPARQL: select distinct ?answer where { wd:Q11666 wdt:P3427 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maria Sharapova', 'p': 'AS.com athlete ID', 'o': '?x0'}

 Q: what is the {determination method} for {Qalyubia Governorate} has {population} as {2.51424e+06} ?
 SPARQL: SELECT ?value WHERE { wd:Q31075 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'2.51424e+06')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Qalyubia Governorate', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '2.51424e+06'}}}

 Q: Who gave the{pronunciation audio} of {this taxon is a source of} of {Cucumis sativus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23425 wdt:P1672 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cucumis sativus', 'p': 'this taxon is a source of', 'o': '$y0'}}

 Q: What is the {cannon} with the {MAX(caliber)} whose {designed by} is {Schneider et Cie}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q81103 . ?ent wdt:P4403 ?obj . ?ent wdt:P287 wd:Q7431877 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'caliber', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cannon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Schneider et Cie'}}}

 Q: which  professorship of Isaac Newton ?
 SPARQL: select distinct ?answer where { wd:Q935 wdt:P803 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Isaac Newton', 'p': 'professorship', 'o': '?x0'}

 Q: Who gave the {diplomatic relation} of {citizenship} of {Henri de la Tour d'Auvergne, Vicomte de Turenne} ?
 SPARQL: SELECT ?answer WHERE { wd:Q303216 wdt:P27 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Henri de la Tour d'Auvergne, Vicomte de Turenne", 'p': 'citizenship', 'o': '$y0'}}

 Q: What is the life stance of Margaret Thatcher, whose headquarters is Church House, Westminster?
 SPARQL: SELECT ?answer WHERE { wd:Q7416 wdt:P140 ?answer . ?answer wdt:P159 wd:Q2967665}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Margaret Thatcher', 'p': 'life stance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'headquarters', 'o': 'Church House, Westminster'}}

 Q: How many {owner of} are for {Royal Dutch Shell} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q154950 wdt:P1830 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Royal Dutch Shell', 'p': 'owner of', 'o': '?x0'}

 Q: Which is the Transfermarkt player ID of Andriy Shevchenko?
 SPARQL: select distinct ?answer where { wd:Q41244 wdt:P2446 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andriy Shevchenko', 'p': 'Transfermarkt player ID', 'o': '?x0'}

 Q: What is the {federal state} for {country of origin} of {American English}
 SPARQL:  select distinct ?obj where { wd:Q7976 wdt:P495 ?obj . ?obj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American English', 'p': 'country of origin', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: What is {workplace} of {Kollegah}, that has {first minister} is {Wilhelm von Becker} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58785 wdt:P937 ?answer . ?answer wdt:P6 wd:Q1338290}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kollegah', 'p': 'workplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first minister', 'o': 'Wilhelm von Becker'}}

 Q: Was Shiva the child of Kartikeya?
 SPARQL: ASK WHERE { wd:Q11378 wdt:P40 wd:Q380817 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Shiva', 'p': 'child', 'o': '?x0', '?x0': 'Kartikeya'}]

 Q: Which  is original network for ARD?
 SPARQL: select distinct ?answer where { ?answer wdt:P449 wd:Q49653}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'network', 'o': 'ARD'}

 Q: What is the {song} for {lyrics by} of {Billie Holiday}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P676 wd:Q104358 . ?sbj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'lyrics by', 'o': 'Billie Holiday', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: What is the title of the TV movie based on The Count of Monte Cristo?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P144 wd:Q191838 . ?sbj wdt:P31 wd:Q506240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'The Count of Monte Cristo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV movie'}}

 Q: What is the (birthplace) of (Alexander Suvorov), with a  (human population) of (335800.0)?
 SPARQL: SELECT ?answer WHERE { wd:Q154232 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'335800.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alexander Suvorov', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '335800.0'}}

 Q: Is the number of houses of the Heroutice equal to 0?
 SPARQL: ASK WHERE { wd:Q24817397 wdt:P4080 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Heroutice', 'p': 'number of houses', 'o': '?x0', '?x0': '0'}

 Q: what is the {applies to part} for {Godavari River} has {coordinate location} as {19.93} ?
 SPARQL: SELECT ?value WHERE { wd:Q191314 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'19.93')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Godavari River', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'coordinate location', 'o': '19.93'}}}

 Q: what is the {start time} for {Spanish East Indies} has {capital} as {Iloilo City} ?
 SPARQL: SELECT ?value WHERE { wd:Q910648 p:P36 ?s . ?s ps:P36 wd:Q459787 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Spanish East Indies', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Iloilo City'}}}

 Q: What is the {category of associated people} and the {geography of topic} of {Houston} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q16555 wdt:P1792 ?ans_1 . wd:Q16555 wdt:P2633 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Houston', 'p': 'category of associated people', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Houston', 'p': 'geography of topic', 'o': '?x1'}]

 Q: What is the {dead language} for {languages spoken, written or signed} of {Hildegard of Bingen}
 SPARQL:  select distinct ?obj where { wd:Q70991 wdt:P1412 ?obj . ?obj wdt:P31 wd:Q45762 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hildegard of Bingen', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dead language'}}

 Q: What was the population of Tuvalu in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q672 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tuvalu', 'p': 'population', 'o': '?x0', 't': '1996'}

 Q: Tell me the national sports team whose name contains the word team?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national sports team'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'team'}}

 Q: What is {given name} of {Peggy Lee} that is {series ordinal} is {2} ?
 SPARQL: SELECT ?obj WHERE { wd:Q229139 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'2')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'middle name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peggy Lee', 'p': 'middle name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '2'}}}

 Q: what is the {start time} for {Calgary} has {located in the administrative territorial entity} as {Alberta} ?
 SPARQL: SELECT ?value WHERE { wd:Q36312 p:P131 ?s . ?s ps:P131 wd:Q1951 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Calgary', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Alberta'}}}

 Q: How many {start point} are to/by {Seville} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1427 wd:Q8717 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'Seville'}

 Q: IS THE G FACTOR OF PROTON EQUALS 5.585694713
 SPARQL: ASK WHERE { wd:Q2294 wdt:P1097 ?obj filter(?obj = 5.585694713) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'proton', 'p': 'g-factor', 'o': '?x0', '?x0': '5.585694713'}

 Q: What is the {human} for {architect} of {Taipei 101}
 SPARQL:  select distinct ?obj where { wd:Q83101 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Taipei 101', 'p': 'architect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Roscoe Arbuckle} has {spouse} as {Addie McPhail} ?
 SPARQL: SELECT ?value WHERE { wd:Q315202 p:P26 ?s . ?s ps:P26 wd:Q3605092 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roscoe Arbuckle', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Addie McPhail'}}}

 Q: What is <Thailand central administrative unit code> of <Bangkok> ?
 SPARQL: select distinct ?answer where { wd:Q1861 wdt:P1067 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bangkok', 'p': 'Thailand central administrative unit code', 'o': '?x0'}

 Q: what is the {image} for {Tulipa} has {has fruit type} as {capsule} ?
 SPARQL: SELECT ?value WHERE { wd:Q93201 p:P4000 ?s . ?s ps:P4000 wd:Q147768 . ?s pq:P18 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'image', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tulipa', 'p': 'has fruit type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'has fruit type', 'o': 'capsule'}}}

 Q: what is the {end time} for {Mecklenburg-Vorpommern} has {contains administrative territorial entity} as {Gadebusch Rural District} ?
 SPARQL: SELECT ?value WHERE { wd:Q1196 p:P150 ?s . ?s ps:P150 wd:Q872862 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mecklenburg-Vorpommern', 'p': 'contains administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'contains administrative territorial entity', 'o': 'Gadebusch Rural District'}}}

 Q: What is the denomination of the accused of Yemeni Civil War ?
 SPARQL: SELECT ?answer WHERE { wd:Q19686631 wdt:P710 ?X . ?X wdt:P140 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'denomination', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yemeni Civil War', 'p': 'accused', 'o': '$y0'}}

 Q: What is Kumasi seal description?
 SPARQL: select distinct ?answer where { wd:Q182059 wdt:P418 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kumasi', 'p': 'seal description', 'o': '?x0'}

 Q: What award did Charles Antony Richard Hoare receive in 1990?
 SPARQL: SELECT ?obj WHERE { wd:Q92602 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charles Antony Richard Hoare', 'p': 'award', 'o': '?x0', 't': '1990'}

 Q: What Academy Awards has Quentin Tarantino been nominated for?
 SPARQL:  select distinct ?obj where { wd:Q3772 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Quentin Tarantino', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Academy Awards'}}

 Q: what is the {language of work or name} for {Thursday} has {named after} as {Thor} ?
 SPARQL: SELECT ?value WHERE { wd:Q129 p:P138 ?s . ?s ps:P138 wd:Q42952 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thursday', 'p': 'named after', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'named after', 'o': 'Thor'}}}

 Q: What is the Spotify broadcasting language which has a regulatory body in the Institute of the Czech Language?
 SPARQL: SELECT ?answer WHERE { wd:Q689141 wdt:P407 ?answer . ?answer wdt:P1018 wd:Q1661875}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spotify', 'p': 'broadcasting language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'regulatory body', 'o': 'Institute of the Czech Language'}}

 Q: What is the {elizate} for {shares border with} of {Bilbao}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q8692 . ?sbj wdt:P31 wd:Q2731185 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'shares border with', 'o': 'Bilbao', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'elizate'}}

 Q: Who was the head of government in Brunswick until 2001-10-31?
 SPARQL: SELECT ?obj WHERE { wd:Q2773 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Brunswick', 'p': 'head of government', 'o': '?x0', 't': '2001'}

 Q: What is Miocene's FOIH periods ID?
 SPARQL: select distinct ?answer where { wd:Q76267 wdt:P4306 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miocene', 'p': 'FOIH periods ID', 'o': '?x0'}

 Q: What is <MusicBrainz series ID> of <The Adventures of Tintin> ?
 SPARQL: select distinct ?answer where { wd:Q744536 wdt:P1407 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Adventures of Tintin', 'p': 'MusicBrainz series ID', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Hope Solo} has {member of sports team} as {Atlanta Beat}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q229619 p:P54 ?s . ?s ps:P54 wd:Q756144 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hope Solo', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Atlanta Beat'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hope Solo', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Atlanta Beat'}}}]

 Q: What is the {human} for {sports discipline competed in} of {marathon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2416 wd:Q40244 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports discipline competed in', 'o': 'marathon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'people'}}

 Q: What academic major is a facet of the history of mathematics?
 SPARQL:  select distinct ?obj where { wd:Q185264 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q4671286 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'history of mathematics', 'p': 'facet of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic major'}}

 Q: What is {deathplace} of {Hans Asperger}, that has {has municipalities} is {Simmering} ?
 SPARQL: SELECT ?answer WHERE { wd:Q78512 wdt:P20 ?answer . ?answer wdt:P150 wd:Q279028}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hans Asperger', 'p': 'deathplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has municipalities', 'o': 'Simmering'}}

 Q: What is <United States Olympic Committee athlete ID> of <Martina Navratilova> ?
 SPARQL: select distinct ?answer where { wd:Q54545 wdt:P4063 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Martina Navratilova', 'p': 'United States Olympic Committee athlete ID', 'o': '?x0'}

 Q: What is <end cause> of <Philippine–American War> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1534 wd:Q214456}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'end cause', 'o': 'Philippine-American War'}

 Q: What is the {film} for {film editor} of {Hayao Miyazaki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1040 wd:Q55400 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'film editor', 'o': 'Hayao Miyazaki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: what is the {replaces} for {Charles I of England} has {position held} as {monarch of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q81506 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles I', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of England'}}}

 Q: What is the inflation rate of the consumer price index for a citizen of Dynamo?
 SPARQL: SELECT ?answer WHERE { wd:Q394077 wdt:P27 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dynamo', 'p': 'citizen of', 'o': '$y0'}}

 Q: what is the {place of publication} for {King Kong} has {publication date} as {1933-9-8} ?
 SPARQL: SELECT ?value WHERE { wd:Q309048 p:P577 ?s . ?s ps:P577 ?x filter(contains(YEAR(?x),'1933')) . ?s pq:P291 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of publication', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'King Kong', 'p': 'published', 'o': '$y0'}}

 Q: What is the {human} for {student of} of {Maurice Ravel}
 SPARQL:  select distinct ?obj where { wd:Q1178 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maurice Ravel', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {member of} of {musical score by} of {No Quarter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2727272 wdt:P86 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'No Quarter', 'p': 'musical score by', 'o': '$y0'}}

 Q: What is {date of death} of {Lech Kaczyński} that is {statement is subject of} is {2010 Polish Air Force Tu-154 crash} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2757 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P805 wd:Q131311 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lech Kaczyński', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '2010 Polish Air Force Tu-154 crash'}}}

 Q: What is the {major religious group} for {facet of} of {history of Islam}
 SPARQL:  select distinct ?obj where { wd:Q642379 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q6957341 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'history of Islam', 'p': 'facet of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'major religious group'}}

 Q: What was Adventure Time nominated for in 2010?
 SPARQL: SELECT ?obj WHERE { wd:Q53093 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Adventure Time', 'p': 'nominated for', 'o': '?x0', 't': '2010'}

 Q: Give me {artistic type} that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16767597 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'artistic type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: what is the silent short film with the highest duration?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q20667187 . ?ent wdt:P2047 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'duration', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'silent short film'}}

 Q: What is {written by} of {The Interpretation of Dreams}, that has {male} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q726382 wdt:P50 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Interpretation of Dreams', 'p': 'written by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'male', 'o': 'male'}}

 Q: What is <ADK member ID> of <Engelbert Humperdinck> ?
 SPARQL: select distinct ?answer where { wd:Q55010 wdt:P4114 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Engelbert Humperdinck', 'p': 'ADK member ID', 'o': '?x0'}

 Q: Which is the {constitutional republic} with the {MAX(Gini coefficient)} whom {diplomatic relation} is {Russia} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1520223 . ?ent wdt:P1125 ?obj . ?ent wdt:P530 wd:Q159 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Gini coefficient', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitutional republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Russia'}}}

 Q: What is {plays} of {operated} of {bicycle motocross} ?
 SPARQL: SELECT ?answer WHERE { wd:Q215184 wdt:P121 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'play', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'BMX', 'p': 'operates', 'o': '$y0'}}

 Q: What is {mother} and {date of birth} of {{Joseph Stalin} has {child} as {Yakov Dzhugashvili}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q163816 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Yakov Dzhugashvili'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Yakov Dzhugashvili'}}}]

 Q: Who is the municipal council for legislative body of Paris?
 SPARQL:  select distinct ?obj where { wd:Q90 wdt:P194 ?obj . ?obj wdt:P31 wd:Q2647159 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paris', 'p': 'legislative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal council'}}

