 Q: How many anthems are for Bulgaria?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q219 wdt:P85 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Bulgaria', 'p': 'anthem', 'o': '?x0'}

 Q: What is <National Portrait Gallery (London) person ID> of <Monica Vitti> ?
 SPARQL: select distinct ?answer where { wd:Q106881 wdt:P1816 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Monica Vitti', 'p': 'National Portrait Gallery (London) person ID', 'o': '?x0'}

 Q: What award did Jonas Salk receive in 1962?
 SPARQL: SELECT ?obj WHERE { wd:Q200101 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1962')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jonas Salk', 'p': 'award', 'o': '?x0', 't': '1962'}

 Q: What is {elected in} and {end cause} of {{James Callaghan} has {position held} as {Member of the 49th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q9576 p:P39 ?s . ?s ps:P39 wd:Q41582621 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Callaghan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 49th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Callaghan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 49th Parliament of the United Kingdom'}}}]

 Q: What is {museum collection} of {famous books} of {Paul Klee} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44007 wdt:P800 ?X . ?X wdt:P195 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'collection', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Klee', 'p': 'work', 'o': '$y0'}}

 Q: What time zone is the continent of Levant?
 SPARQL: SELECT ?answer WHERE { wd:Q81483 wdt:P30 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Levant', 'p': 'continent', 'o': '$y0'}}

 Q: What is the {chemical compound} for {medical condition treated} of {inflammation}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'treats', 'o': 'inflammation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: what is the {end time} for {Odessa} has {head of government} as {Eduard Gurwits} ?
 SPARQL: SELECT ?value WHERE { wd:Q1874 p:P6 ?s . ?s ps:P6 wd:Q609435 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Odessa', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Eduard Gurwits'}}}

 Q: What is the {taxon} for {taxonomic type} of {Lactobacillus}
 SPARQL:  select distinct ?obj where { wd:Q1061596 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lactobacillus', 'p': 'taxonomic type', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is notation of Earth ?
 SPARQL: select distinct ?answer where { wd:Q2 wdt:P913 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Earth', 'p': 'notation', 'o': '?x0'}

 Q: Which is the radio telescope operator of California Institute of Technology?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P137 wd:Q161562 . ?sbj wdt:P31 wd:Q184356 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'California Institute of Technology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'radio telescope'}}

 Q: When did Richard Wright cease to be a member of the Communist Party USA?
 SPARQL: SELECT ?value WHERE { wd:Q319820 p:P102 ?s . ?s ps:P102 wd:Q308714 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richard Wright', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Communist Party USA'}}}

 Q: Where is the death location of Giuseppe Arcimboldo with the telephone code 02?
 SPARQL: SELECT ?answer WHERE { wd:Q7751 wdt:P20 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'02'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Giuseppe Arcimboldo', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'telephone code', 'o': '02'}}

 Q: What is the {declaration of independence} for {signatory} of {David Ben-Gurion}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1891 wd:Q37610 . ?sbj wdt:P31 wd:Q1464916 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'signatory', 'o': 'David Ben-Gurion', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'declaration of independence'}}

 Q: Give me {concept} that {significant person} {Niklas Luhmann} and which contains the word {society} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj wdt:P3342 wd:Q57238 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'society')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'concept', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Niklas Luhmann'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'society'}}

 Q: What is the {taxon} for {this taxon is source of} of {milk}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1672 wd:Q8495 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'this taxon is source of', 'o': 'milk', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: When did Faye Dunaway die who was married to Terry O'Neill?
 SPARQL: SELECT ?value WHERE { wd:Q168721 p:P26 ?s . ?s ps:P26 wd:Q2405734 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faye Dunaway', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married to', 'o': "Terry O'Neill"}}}

 Q: What is {played by} of {fabrication process} of {Planta do Foro de Quiteria Maria Amaral Occupado Por Francisco Antonio Mariano Situado no Lageado - Freguezia da Penha Municipio da Capital São Paulo (Alekhine, Nicolau)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55213518 wdt:P2079 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Planta do Foro de Quiteria Maria Amaral Occupado Por Francisco Antonio Mariano Situado no Lageado - Freguezia da Penha Municipio da Capital São Paulo (Alekhine, Nicolau)', 'p': 'fabrication process', 'o': '$y0'}}

 Q: what is the {point in time} for {Max Müller} has {award received} as {Bavarian Maximilian Order for Science and Art} ?
 SPARQL: SELECT ?value WHERE { wd:Q55068911 p:P166 ?s . ?s ps:P166 wd:Q565030 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Max Müller', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Bavarian Maximilian Order for Science and Art'}, 't': '?x0'}

 Q: What is the {municipal archive} for {archives at} of {Bonn}
 SPARQL:  select distinct ?obj where { wd:Q586 wdt:P485 ?obj . ?obj wdt:P31 wd:Q604177 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bonn', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal archive'}}

 Q: Which is located in or next to body of water of Saipan?
 SPARQL: select distinct ?answer where { wd:Q51679 wdt:P206 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Saipan', 'p': 'located in or next to body of water', 'o': '?x0'}

 Q: What is {coordinate location} of {atomic bombings of Hiroshima and Nagasaki} that is {location} is {Nagasaki} ?
 SPARQL: SELECT ?obj WHERE { wd:Q488 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P276 wd:Q38234 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'longitude', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'atomic bombings of Hiroshima and Nagasaki', 'p': 'longitude', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'location', 'o': 'Nagasaki'}}}

 Q: What is {operated by} of {SIMBAD}, that has {is in the Indian reservation of} is {Strasbourg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q654724 wdt:P137 ?answer . ?answer wdt:P131 wd:Q6602}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'SIMBAD', 'p': 'operated by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Strasbourg'}}

 Q: What is the {film trilogy} for {series} of {Once Upon a Time in the West}
 SPARQL:  select distinct ?obj where { wd:Q168154 wdt:P179 ?obj . ?obj wdt:P31 wd:Q13593818 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Once Upon a Time in the West', 'p': 'series', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film trilogy'}}

 Q: What is the municipal council in Finland with the lowest number of seats whose applies to jurisdiction is Lappajärvi ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q191893 . ?ent wdt:P1342 ?obj . ?ent wdt:P1001 wd:Q6020} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of seats', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipal council in Finland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'Lappajärvi'}}}

 Q: What kind of horse is an example of Equus caballus?
 SPARQL: SELECT ?obj WHERE { wd:Q726 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q10758650 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'horse', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'Equus caballus'}}}

 Q: What is {taxon parent} of {made from} of {cinnamon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28165 wdt:P1582 ?X . ?X wdt:P171 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'taxon parent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cinnamon', 'p': 'made from', 'o': '$y0'}}

 Q: What is unit symbol of kelvin ?
 SPARQL: select distinct ?answer where { wd:Q11579 wdt:P5061 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'kelvin', 'p': 'unit symbol', 'o': '?x0'}

 Q: What is the {human} for {production company} of {The Birth of a Nation}
 SPARQL:  select distinct ?obj where { wd:Q220394 wdt:P272 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Birth of a Nation', 'p': 'production company', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which {applies to territorial jurisdiction} of {holds position} of {Septimius Severus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1442 wdt:P39 ?X . ?X wdt:P1001 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'jurisdiction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Septimius Severus', 'p': 'holds position', 'o': '$y0'}}

 Q: What is {geography of topic} of {event participant} of {Reconstruction Era} ?
 SPARQL: SELECT ?answer WHERE { wd:Q623429 wdt:P710 ?X . ?X wdt:P2633 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'geography of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reconstruction Era', 'p': 'participant', 'o': '$y0'}}

 Q: What is the {legislature} with the {MAX(number of constituencies)} whose {applies to jurisdiction} is {County Wexford}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11204 . ?ent wdt:P4253 ?obj . ?ent wdt:P1001 wd:Q184599 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of constituencies', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'legislature', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'applies to jurisdiction', 'o': 'County Wexford'}}}

 Q: How many {place of death} are to/by {Terceira Island} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P20 wd:Q215074 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Terceira Island'}

 Q: What is the {enterprise} for {manufacturer} of {Commodore 64}
 SPARQL:  select distinct ?obj where { wd:Q99775 wdt:P176 ?obj . ?obj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Commodore 64', 'p': 'manufacturer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'company'}}

 Q: Is it true that the students count of the Protestant College of Tabor is less than 69.6?
 SPARQL: ASK WHERE { wd:Q1380215 wdt:P2196 ?obj filter(?obj < 69.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Protestant College of Tabor', 'p': 'students count', 'o': '?x0', '?x0': '69.6'}

 Q: Which is the connecting line of Stockholm metro?
 SPARQL: select distinct ?answer where { ?answer wdt:P81 wd:Q272926}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'connecting line', 'o': 'Stockholm metro'}

 Q: Who is the Norse deity killed by Baldur?
 SPARQL:  select distinct ?obj where { wd:Q131658 wdt:P157 ?obj . ?obj wdt:P31 wd:Q16513881 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Baldur', 'p': 'killed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Norse deity'}}

 Q: What is the Sea of Galilee's bathymetry image?
 SPARQL: select distinct ?answer where { wd:Q126982 wdt:P207 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sea of Galilee', 'p': 'bathymetry image', 'o': '?x0'}

 Q: Is the parallax of DX Cancri less than 220.64?
 SPARQL: ASK WHERE { wd:Q289634 wdt:P2214 ?obj filter(?obj < 220.64) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'DX Cancri', 'p': 'parallax', 'o': '?x0', '?x0': '220.64'}

 Q: Which is Flanders Music Centre person ID for Stromae?
 SPARQL: select distinct ?answer where { wd:Q313453 wdt:P5410 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stromae', 'p': 'Flanders Music Centre person ID', 'o': '?x0'}

 Q: Is the observing time of the Leviathan of Parsonstown equal to 60?
 SPARQL: ASK WHERE { wd:Q459970 wdt:P3891 ?obj filter(?obj = 60) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Leviathan of Parsonstown', 'p': 'observing time available', 'o': '?x0', '?x0': '60'}

 Q: What is {state} of {languages spoken} of {Marcel Carné} ?
 SPARQL: SELECT ?answer WHERE { wd:Q52409 wdt:P1412 ?X . ?X wdt:P17 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'state', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marcel Carné', 'p': 'language', 'o': '$y0'}}

 Q: What is the {book of the Bible} for {present in work} of {David}
 SPARQL:  select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q29154430 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book of the Bible'}}

 Q: What is the {constitutional court} for {highest judicial authority} of {Hamburg}
 SPARQL:  select distinct ?obj where { wd:Q1055 wdt:P209 ?obj . ?obj wdt:P31 wd:Q32766 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hamburg', 'p': 'highest judicial authority', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitutional court'}}

 Q: Which is a picture of Ryōtarō Shiba?
 SPARQL: select distinct ?answer where { wd:Q1087887 wdt:P18 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryōtarō Shiba', 'p': 'picture', 'o': '?x0'}

 Q: Is Mario Puzo the screenwriter of The Godfather?
 SPARQL: ASK WHERE { wd:Q47703 wdt:P58 wd:Q182870 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Godfather', 'p': 'screenwriter', 'o': '?x0', '?x0': 'Mario Puzo'}]

 Q: What is the diplomatic relations of Saint Kitts and Nevis, that has an inflation rate of consumer price index is 2.7?
 SPARQL: SELECT ?answer WHERE { wd:Q763 wdt:P530 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'2.7'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saint Kitts and Nevis', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '2.7'}}

 Q: What is {educated at} of {Janet Yellen} and {academic degree}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q263725 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Janet Yellen', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Janet Yellen', 'p': 'educated at', 'o': '$y0'}}]

 Q: Name the lowest Alexa ranked magazine?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q41298 . ?ent wdt:P1661 ?obj . ?ent wdt:P31 wd:Q41298} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'Alexa rank', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine'}}

 Q: Which is the Wikimedia category for the category of associated people of Oslo?
 SPARQL:  select distinct ?obj where { wd:Q585 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oslo', 'p': 'category of associated people', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia category'}}

 Q: What is the {ethnic group} and the {sex or gender} of {Alex_Trebek} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q929985 wdt:P172 ?ans_1 . wd:Q929985 wdt:P21 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Alex Trebek', 'p': 'ethnic group', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Alex Trebek', 'p': 'gender', 'o': '?x1'}]

 Q: Is the male population of Capital Hill equal to 0?
 SPARQL: ASK WHERE { wd:Q994840 wdt:P1540 ?obj filter(?obj = 0.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Capital Hill', 'p': 'male population', 'o': '?x0', '?x0': '0.0'}

 Q: What is <Human Phenotype Ontology ID> of <borderline personality disorder> ?
 SPARQL: select distinct ?answer where { wd:Q208166 wdt:P3841 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'borderline personality disorder', 'p': 'Human Phenotype Ontology ID', 'o': '?x0'}

 Q: What is {governing document} of {denomination} of {Navajo people} ?
 SPARQL: SELECT ?answer WHERE { wd:Q108266 wdt:P140 ?X . ?X wdt:P92 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'governing document', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Navajo', 'p': 'denomination', 'o': '$y0'}}

 Q: What is {GDP per capita based on purchasing power parity} of {setting location} of {Siddhartha} ?
 SPARQL: SELECT ?answer WHERE { wd:Q457289 wdt:P840 ?X . ?X wdt:P2299 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'GDP per capita based on purchasing power parity', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Siddhartha', 'p': 'setting location', 'o': '$y0'}}

 Q: What is the {film} for {cast member} of {Bruce Willis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P161 wd:Q2680 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Bruce Willis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: what is the royal or noble rank contains the word in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q355567 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yabghu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble rank'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yabghu'}}

 Q: what is the {point in time} for {Robert Baden-Powell, 1st Baron Baden-Powell} has {nominated for} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q12665 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert Baden-Powell, 1st Baron Baden-Powell', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: What is the number of protons of the decays to of potassium-40?
 SPARQL: SELECT ?answer WHERE { wd:Q2251076 wdt:P816 ?X . ?X wdt:P1086 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of protons', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'potassium-40', 'p': 'decays to', 'o': '$y0'}}

 Q: What platform and software engine does Dota 2 use?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q771541 wdt:P400 ?ans_1 . wd:Q771541 wdt:P408 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Dota 2', 'p': 'platform', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Dota 2', 'p': 'software engine', 'o': '?x1'}]

 Q: what is the {for work} for {Robert Frost} has {award received} as {Pulitzer Prize for Poetry} ?
 SPARQL: SELECT ?value WHERE { wd:Q168728 p:P166 ?s . ?s ps:P166 wd:Q2117891 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Frost', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Pulitzer Prize for Poetry'}}}

 Q: Vladimir Lenin was the head of government of which historical country.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Vladimir Lenin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: What award did Mairead Maguire receive, and how much was the prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q157655 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mairead Maguire', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mairead Maguire', 'p': 'award', 'o': '$y0'}}]

 Q: Give me {mass media} that {readable file format} {3GPP file format} and which that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj wdt:P1072 wd:Q27863097 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mass media', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'readable file format', 'o': '3GPP file format'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: Which is the cruise speed of Airbus A340?
 SPARQL: select distinct ?answer where { wd:Q6481 wdt:P2217 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Airbus A340', 'p': 'cruise speed', 'o': '?x0'}

 Q: What is the {Wikidata property for items about people} for {subject item of this property} of {citizenship}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1629 wd:Q42138 . ?sbj wdt:P31 wd:Q18608871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'item', 'o': 'citizenship', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikidata property for items about people'}}

 Q: What is {award received} of {Maurice Wilkes} that is {for work} is {Electronic Delay Storage Automatic Calculator} ?
 SPARQL: SELECT ?obj WHERE { wd:Q62857 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q863565 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maurice Wilkes', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Electronic Delay Storage Automatic Calculator'}}}

 Q: Which is the Filmportal ID for Arsène Wenger?
 SPARQL: select distinct ?answer where { wd:Q47576 wdt:P2639 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arsène Wenger', 'p': 'Filmportal ID', 'o': '?x0'}

 Q: What is the {alliance} for {capital} of {Tenochtitlan}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P36 wd:Q13695 . ?sbj wdt:P31 wd:Q878249 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Tenochtitlan', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alliance'}}

 Q: Give me {sport} that {sports discipline competed in} {beach handball} and which that starts with {'h'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q349 . ?sbj wdt:P2416 wd:Q535116 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sport', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sports discipline', 'o': 'beach handball'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What death place is divided into by Philaret Drozdov?
 SPARQL: SELECT ?answer WHERE { wd:Q129641 wdt:P20 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divided into', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Philaret Drozdov', 'p': 'death place', 'o': '$y0'}}

 Q: Tell me  Jewish denomination whose name has the word judaism  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3001185 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'judaism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Jewish denomination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'judaism'}}

 Q: Tell me theatrical genre whose name has the word zauberstück in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15850590 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zauberstück')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theatrical genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zauberstück'}}

 Q: Tell me probability distribution whose name has the word distribution in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200726 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distribution')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'probability distribution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'distribution'}}

 Q: Did {Earthquake} {has effect} {Soil liquefaction}?
 SPARQL: ASK WHERE { wd:Q7944 wdt:P1542 wd:Q827291 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'quake', 'p': 'effect', 'o': '?x0', '?x0': 'Soil liquefaction'}]

 Q: Give me a name of coachwork type, that starts with an alphabet 'v'.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'coachwork type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Which is the military designation of C-130 Hercules?
 SPARQL: select distinct ?answer where { wd:Q182027 wdt:P798 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hercules', 'p': 'military designation', 'o': '?x0'}

 Q: What is regulated by sports  Union of North African Football Federations ?
 SPARQL: SELECT ?answer WHERE { wd:Q427061 wdt:P641 ?X . ?X wdt:P3719 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'regulated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Union of North African Football Federations', 'p': 'sport', 'o': '$y0'}}

 Q: what is the {point in time} for {Michel Serrault} has {award received} as {César Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q318088 p:P166 ?s . ?s ps:P166 wd:Q900494 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Michel Serrault', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Cesar Award for Best Actor'}, 't': '?x0'}

 Q: What is {follows} and {followed by} of {{Louis II of Italy} has {noble title} as {emperor of Occident}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q215204 p:P97 ?s . ?s ps:P97 wd:Q23906200 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis II of Italy', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'emperor of Occident'}}}]

 Q: List the opposite of played by of copying.
 SPARQL: SELECT ?answer WHERE { wd:Q1156791 wdt:P1535 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'copying', 'p': 'played by', 'o': '$y0'}}

 Q: What is the phone number of the United States Postal Service?
 SPARQL: select distinct ?answer where { wd:Q668687 wdt:P1329 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'United States Postal Service', 'p': 'phone number', 'o': '?x0'}

 Q: Is it true that the main voltage of Finland is greater than 184.0?
 SPARQL: ASK WHERE { wd:Q33 wdt:P2884 ?obj filter(?obj > 184.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Finland', 'p': 'mains voltage', 'o': '?x0', '?x0': '184.0'}

 Q: Did {General_Dynamics_F-16_Fighting_Falcon} {manufacturer} {Turkish Aerospace Industries} and {Caproni} ?
 SPARQL: ASK WHERE { wd:Q100026 wdt:P176 wd:Q2002470 . wd:Q100026 wdt:P176 wd:Q2264354 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'F-16', 'p': 'manufacturer', 'o': '?x0', '?x0': 'Turkish Aerospace Industries'}, {'h': 'IS', 'v': '?x1', 's': 'F-16', 'p': 'manufacturer', 'o': '?x1', '?x1': 'Caproni'}]

 Q: Who are the members of sports team of Ricky Ponting since the year 2004?
 SPARQL: SELECT ?obj WHERE { wd:Q472649 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ricky Ponting', 'p': 'team', 'o': '?x0', 't': '2004'}

 Q: What is {population} of {City of London} that is {point in time} is {1971-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23311 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1971')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'City of London', 'p': 'population', 'o': '?x0', 't': '1971'}

 Q: Which is the autonomous system number of Amazon?
 SPARQL: select distinct ?answer where { wd:Q3884 wdt:P3797 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amazon', 'p': 'autonomous system number', 'o': '?x0'}

 Q: Which Class IC flammable liquid has the highest standard molar entropy?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P3071 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'standard molar entropy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IC flammable liquid'}}

