 Q: What is <Les Enfoirés participant ID> of <Celine Dion> ?
 SPARQL: select distinct ?answer where { wd:Q5105 wdt:P5261 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Celine Dion', 'p': 'Les Enfoirés participant ID', 'o': '?x0'}

 Q: What is {tributary} of {river mouth} of {Uruguay River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18278 wdt:P403 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Uruguay River', 'p': 'river mouth', 'o': '$y0'}}

 Q: When was Mitsubishi UFJ Financial Group owned by The Vanguard Group?
 SPARQL: SELECT ?value WHERE { wd:Q1542175 p:P127 ?s . ?s ps:P127 wd:Q849363 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Mitsubishi UFJ Financial Group', 'p': 'owned by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'owned by', 'o': 'The Vanguard Group'}, 't': '?x0'}

 Q: What is {height} of {CN Tower} that is {criterion used} is {height to occupied floor} ?
 SPARQL: SELECT ?obj WHERE { wd:Q134883 p:P2048 ?s . ?s ps:P2048 ?obj . ?s pq:P1013 wd:Q31271474 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'height', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'CN Tower', 'p': 'height', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'criterion used', 'o': 'height to occupied floor'}}}

 Q: What is the {human} for {significant person} of {Rumi}
 SPARQL:  select distinct ?obj where { wd:Q43347 wdt:P3342 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rumi', 'p': 'significant person', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {symbol} of {manifestation of} of {equation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11345 wdt:P1557 ?X . ?X wdt:P913 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'equation', 'p': 'manifestation of', 'o': '$y0'}}

 Q: What is {year commenced} of {burial place} of {John Hunyadi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q242688 wdt:P119 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'year commenced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Hunyadi', 'p': 'burial place', 'o': '$y0'}}

 Q: What is the {material used} and the {has effect} of {Gravitational_wave} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q190035 wdt:P186 ?ans_1 . wd:Q190035 wdt:P1542 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'gravitational wave', 'p': 'material used', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'gravitational wave', 'p': 'effect', 'o': '?x1'}]

 Q: What is {inception} of {Korea under Japanese rule} that is {statement is subject of} is {Japan–Korea Treaty of 1910} ?
 SPARQL: SELECT ?obj WHERE { wd:Q503585 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P805 wd:Q495558 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inception', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Korea under Japanese rule', 'p': 'inception', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Japan–Korea Treaty of 1910'}}}

 Q: Is the angular resolution of the Karl G. Jansky Very Large Array equal to 0.2?
 SPARQL: ASK WHERE { wd:Q461382 wdt:P3439 ?obj filter(?obj = 0.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Karl G. Jansky Very Large Array', 'p': 'angular resolution', 'o': '?x0', '?x0': '0.2'}

 Q: Tell me archipelago  whose name has the word lies in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33837 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'îles')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archipelago'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'îles'}}

 Q: What is the seal image for Medan?
 SPARQL: select distinct ?answer where { wd:Q5972 wdt:P158 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Medan', 'p': 'seal image', 'o': '?x0'}

 Q: Who produces and is the builder of the John Deere Model 4020?
 SPARQL: SELECT ?answer WHERE { wd:Q6229075 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'produces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Deere Model 4020', 'p': 'builder', 'o': '$y0'}}

 Q: what is the {replaces} for {James Stanhope, 1st Earl Stanhope} has {position held} as {Chancellor of the Exchequer} ?
 SPARQL: SELECT ?value WHERE { wd:Q332603 p:P39 ?s . ?s ps:P39 wd:Q531471 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Stanhope, 1st Earl Stanhope', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chancellor of the Exchequer'}}}

 Q: What is {position held} of {Clement Attlee} that is {replaced by} is {Robert Gascoyne-Cecil, 5th Marquess of Salisbury} ?
 SPARQL: SELECT ?obj WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q333205 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clement Attlee', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Robert Gascoyne-Cecil, 5th Marquess of Salisbury'}}}

 Q: Which is the OpenDOAR ID for Library and Archives Canada?
 SPARQL: select distinct ?answer where { wd:Q913250 wdt:P5332 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Library and Archives Canada', 'p': 'OpenDOAR ID', 'o': '?x0'}

 Q: Is it true that Maddie Ziegler's first name Nicole?
 SPARQL: ASK WHERE { wd:Q16240603 wdt:P735 wd:Q14753732 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Maddie Ziegler', 'p': 'first name', 'o': '?x0', '?x0': 'Nicole'}]

 Q: what is the {academic degree} for {Georges Méliès} has {educated at} as {Lycée Louis-le-Grand} ?
 SPARQL: SELECT ?value WHERE { wd:Q152272 p:P69 ?s . ?s ps:P69 wd:Q1059546 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georges Méliès', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Lycée Louis-le-Grand'}}}

 Q: Is the clock speed of the Uzebox less than 34.32?
 SPARQL: ASK WHERE { wd:Q579739 wdt:P2149 ?obj filter(?obj < 34.32) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Uzebox', 'p': 'clock speed', 'o': '?x0', '?x0': '34.32'}

 Q: What is formed at  graduated from of Christopher Marlowe ?
 SPARQL: SELECT ?answer WHERE { wd:Q28975 wdt:P69 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formed at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Marlowe', 'p': 'graduated from', 'o': '$y0'}}

 Q: Which is the Manitoba Sports Hall of Fame athlete ID for Bobby Hull?
 SPARQL: select distinct ?answer where { wd:Q456688 wdt:P4413 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bobby Hull', 'p': 'Manitoba Sports Hall of Fame athlete ID', 'o': '?x0'}

 Q: Is the number of players in region of rugby union in Kenya equal to 42904?
 SPARQL: ASK WHERE { wd:Q3452891 wdt:P4909 ?obj filter(?obj = 42904) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'rugby union in Kenya', 'p': 'number of players in region', 'o': '?x0', '?x0': '42904'}

 Q: What is pronunciation audio made from pork ?
 SPARQL: SELECT ?answer WHERE { wd:Q191768 wdt:P1582 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pork', 'p': 'made from', 'o': '$y0'}}

 Q: What is {position held} of {Louis VII of France} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q134259 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis VII of France', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis VII of France', 'p': 'position held', 'o': '$y0'}}]

 Q: Is Nicolas Cage's family name Coppola?
 SPARQL: ASK WHERE { wd:Q42869 wdt:P734 wd:Q7704509 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Nicolas Cage', 'p': 'family name', 'o': '?x0', '?x0': 'Coppola'}]

 Q: Name the person behind the renowned work of Nineteen Eighty-Four
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P800 wd:Q208460 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work', 'o': 'Nineteen Eighty-Four', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{David Icke} has {member of sports team} as {Hereford United F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q333118 p:P54 ?s . ?s ps:P54 wd:Q18516 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Icke', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Hereford United FC'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'points scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Icke', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Hereford United FC'}}}]

 Q: Give me {single-family detached home} that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single-family detached home'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Is the tensile modulus of elasticity of the UNS S32205 / EN 1.4462 duplex stainless steel greater than 223200.0?
 SPARQL: ASK WHERE { wd:Q7388539 wdt:P5480 ?obj filter(?obj > 223200.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '1.4462', 'p': 'tensile modulus of elasticity', 'o': '?x0', '?x0': '223200.0'}

 Q: What is the {radio station} for {language used} of {Norwegian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q14350 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Norwegian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'radio station'}}

 Q: What was the sports team for Guus Hiddink in 1978-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q484534 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1978')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guus Hiddink', 'p': 'team', 'o': '?x0', 't': '1978'}

 Q: Which is the free and open-source software that is named after Linux?
 SPARQL:  select distinct ?obj where { wd:Q388 wdt:P138 ?obj . ?obj wdt:P31 wd:Q506883 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Linux', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'free and open-source software'}}

 Q: What is the {railroad} with the {MAX(maximum gradient)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22667 . ?ent wdt:P2595 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum gradient', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railroad'}}

 Q: What is geomorphological unit of East European Plain ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4688 wd:Q191862}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'geomorphological unit', 'o': 'East European Plain'}

 Q: What is {resting place} of {Hayreddin Barbarossa}, that has {sister town} is {Lagos} ?
 SPARQL: SELECT ?answer WHERE { wd:Q200582 wdt:P119 ?answer . ?answer wdt:P190 wd:Q8673}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hayreddin Barbarossa', 'p': 'resting place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister town', 'o': 'Lagos'}}

 Q: What is the {television character} for {performer} of {Ben Affleck}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P175 wd:Q483118 . ?sbj wdt:P31 wd:Q15773317 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Ben Affleck', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'TV character'}}

 Q: What is the {encyclopedia} for {genre} of {encyclopedia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P136 wd:Q5292 . ?sbj wdt:P31 wd:Q5292 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genre', 'o': 'encyclopedia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'encyclopedia'}}

 Q: Who is Warren Beatty's wife or partner?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q95030 wdt:P451 ?ans_1 . wd:Q95030 wdt:P26 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Warren Beatty', 'p': 'partner', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Warren Beatty', 'p': 'wife', 'o': '?x1'}]

 Q: What is motto  successor of Province of New York ?
 SPARQL: SELECT ?answer WHERE { wd:Q769668 wdt:P1366 ?X . ?X wdt:P1451 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'motto', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Province of New York', 'p': 'successor', 'o': '$y0'}}

 Q: What is <dam> of <Three Gorges Dam> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4792 wd:Q12514}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dam', 'o': 'Three Gorges Dam'}

 Q: What is {relative} of {Joseph Conrad} that is {type of kinship} is {maternal uncle} ?
 SPARQL: SELECT ?obj WHERE { wd:Q82925 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q4120409 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'relative', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Conrad', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': "mother's brother"}}}

 Q: When were American Samoa named ethnic group as Samoans?
 SPARQL: SELECT ?value WHERE { wd:Q16641 p:P172 ?s . ?s ps:P172 wd:Q1135531 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'American Samoa', 'p': 'ethnic group', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ethnic group', 'o': 'Samoans'}, 't': '?x0'}

 Q: Isambard Kingdom Brunel was the structural engineer of what railway bridge?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P631 wd:Q207380 . ?sbj wdt:P31 wd:Q1210334 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'structural engineer', 'o': 'Isambard Kingdom Brunel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway bridge'}}

 Q: When did the Kindgom of Prussia begin in 1701?
 SPARQL: SELECT ?obj WHERE { wd:Q27306 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1701')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Prussia', 'p': 'type', 'o': '?x0', 't': '1701'}

 Q: What is {together with} and {prize money} of {{Henry Dunant} has {award received} as {Nobel Peace Prize}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q12091 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P1706 ?value1 . ?s pq:P2121 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Dunant', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Peace Prize'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'prize money', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Dunant', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Peace Prize'}}}]

 Q: Tell me lunisolar calendar  whose name has the word calendars in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194235 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'calendars')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lunisolar calendar'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'calendars'}}

 Q: What is Anatoly Karpov's work location where official language if Russian?
 SPARQL: SELECT ?answer WHERE { wd:Q131674 wdt:P937 ?answer . ?answer wdt:P37 wd:Q7737}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anatoly Karpov', 'p': 'work location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Russian'}}

 Q: What is the {medical specialty} for {studied by} of {diabetes mellitus}
 SPARQL:  select distinct ?obj where { wd:Q12206 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q930752 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'diabetes mellitus', 'p': 'studied by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical specialty'}}

 Q: What is <National Baseball Hall of Fame and Museum ID> of <Willie Mays> ?
 SPARQL: select distinct ?answer where { wd:Q561852 wdt:P4164 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Willie Mays', 'p': 'National Baseball Hall of Fame and Museum ID', 'o': '?x0'}

 Q: What is the {international organization} for {subsidiary} of {United Nations General Assembly}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P355 wd:Q47423 . ?sbj wdt:P31 wd:Q484652 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'General Assembly', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international organization'}}

 Q: what is the {start time} for {James K. Polk} has {position held} as {Governor of Tennessee} ?
 SPARQL: SELECT ?value WHERE { wd:Q11891 p:P39 ?s . ?s ps:P39 wd:Q5589724 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James K. Polk', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Governor of Tennessee'}}}

 Q: Which asteroid has got the most orbital inclination?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2045 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'orbital inclination', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'asteroid'}}

 Q: What is the Heidelberg Academy for Sciences and Humanities member ID for Martin Heidegger?
 SPARQL: select distinct ?answer where { wd:Q48301 wdt:P2273 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Martin Heidegger', 'p': 'Heidelberg Academy for Sciences and Humanities member ID', 'o': '?x0'}

 Q: DOES THE TOTAL DEBT OF CARREFOUR GROUP IS EQUAL TO 4531000000
 SPARQL: ASK WHERE { wd:Q3117359 wdt:P2133 ?obj filter(?obj = 4531000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Carrefour', 'p': 'total debt', 'o': '?x0', '?x0': '4531000000'}

 Q: What is the charger for the rebellion?
 SPARQL: select distinct ?answer where { ?answer wdt:P1595 wd:Q124734}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'charge', 'o': 'rebellion'}

 Q: What is the {academic major} for {studied by} of {history of the world}
 SPARQL:  select distinct ?obj where { wd:Q200325 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q4671286 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'history', 'p': 'studied by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic major'}}

 Q: which mountain has a tallest elevation above sea level?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q8502 . ?ent wdt:P2044 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'elevation above sea level', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mountain'}}

 Q: Which is the MLB ID for Willie Mays?
 SPARQL: select distinct ?answer where { wd:Q561852 wdt:P3541 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Willie Mays', 'p': 'MLB ID', 'o': '?x0'}

 Q: What is the 3DMet ID  for ethanol?
 SPARQL: select distinct ?answer where { wd:Q153 wdt:P2796 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethanol', 'p': '3DMet ID', 'o': '?x0'}

 Q: Is the highest no-effect level of chlorobenzene 27.25?
 SPARQL: ASK WHERE { wd:Q407768 wdt:P2717 ?obj filter(?obj = 27.25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'chlorobenzene', 'p': 'no-observed-adverse-effect level', 'o': '?x0', '?x0': '27.25'}

 Q: What is the {central bank} for {central bank} of {Korea under Japanese rule}
 SPARQL:  select distinct ?obj where { wd:Q503585 wdt:P1304 ?obj . ?obj wdt:P31 wd:Q66344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Korea under Japanese rule', 'p': 'central bank', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'central bank'}}

 Q: Who is chairwoman party membership of Jack Horner ?
 SPARQL: SELECT ?answer WHERE { wd:Q1677064 wdt:P102 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chairwoman', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jack Horner', 'p': 'party', 'o': '$y0'}}

 Q: Which is the triumphal arch that Jean Chalgrin was the architect and contains the word arc in it's name!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q143912 . ?sbj wdt:P84 wd:Q525487 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'arc')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'triumphal arch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Jean Chalgrin'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'arc'}}

 Q: Who {has sons} of {daddy} {Noel Tata} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12779926 wdt:P22 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Noel Tata', 'p': 'dad', 'o': '$y0'}}

 Q: What is {place of birth} of {Anna Magnani} that is {country} is {Kingdom of Italy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q56011 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q172579 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthplace', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Magnani', 'p': 'birthplace', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Kingdom of Italy'}}}

 Q: What is <standards body> of <International Organization for Standardization> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1462 wd:Q15028}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'standards body', 'o': 'International Organization for Standardization'}

 Q: What is {stockholders} of {represents} of {Vista aérea da cidade de São Paulo/SP} ?
 SPARQL: SELECT ?answer WHERE { wd:Q53302993 wdt:P180 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stockholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vista aérea da cidade de São Paulo/SP', 'p': 'represents', 'o': '$y0'}}

 Q: Was Carl_Sagan spouse Carl Woese and Linda Salzman Sagan ?
 SPARQL: ASK WHERE { wd:Q410 wdt:P26 wd:Q310067 . wd:Q410 wdt:P26 wd:Q4526447 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Sagan', 'p': 'spouse', 'o': '?x0', '?x0': 'Carl Woese'}, {'h': 'IS', 'v': '?x1', 's': 'Sagan', 'p': 'spouse', 'o': '?x1', '?x1': 'Linda Salzman Sagan'}]

 Q: What is the {human} for {author} of {Othello}
 SPARQL:  select distinct ?obj where { wd:Q26833 wdt:P50 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Othello', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Are the maximum sustained winds of the Tropical Storm Debby 54.0?
 SPARQL: ASK WHERE { wd:Q2400201 wdt:P2895 ?obj filter(?obj = 54.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tropical Storm Debby', 'p': 'maximum sustained winds', 'o': '?x0', '?x0': '54.0'}

 Q: What is available in The Forsyte Saga which has a script of the English alphabet?
 SPARQL: SELECT ?answer WHERE { wd:Q735319 wdt:P407 ?answer . ?answer wdt:P282 wd:Q754673}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Forsyte Saga', 'p': 'available in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alphabet', 'o': 'English alphabet'}}

 Q: What is {position held} of {Gianni Agnelli} and {end cause}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q356351 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianni Agnelli', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gianni Agnelli', 'p': 'position held', 'o': '$y0'}}]

 Q: How many {language used} are for {Australia} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q408 wdt:P2936 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Australia', 'p': 'language used', 'o': '?x0'}

 Q: What is {implies} of {pyridine}, that has {route of administration} is {ingestion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q210385 wdt:P1542 ?answer . ?answer wdt:P636 wd:Q1663054}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pyridine', 'p': 'implies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'route of administration', 'o': 'ingestion'}}

 Q: Which English film has the longest average shot length?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2208 ?obj . ?ent wdt:P364 wd:Q1860 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'average shot length', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'original language', 'o': 'English'}}}

 Q: Give me {criterion of similarity} that starts with {'n'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7250271 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'criterion of similarity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is the field of action of the parent company of Claro?
 SPARQL: SELECT ?answer WHERE { wd:Q1770208 wdt:P355 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of action', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Claro', 'p': 'parent company of', 'o': '$y0'}}

 Q: What is the {stadium} for {located in the administrative territorial entity} of {Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q220 . ?sbj wdt:P31 wd:Q483110 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Roma', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stadium'}}

 Q: What are the trigonometric function which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q93344 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'trigonometric function'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {position held} of {Bertil Ohlin} that is {replaced by} is {Gísli Jónsson} ?
 SPARQL: SELECT ?obj WHERE { wd:Q179493 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q16405049 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bertil Ohlin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Gísli Jónsson'}}}

 Q: When did stadium for operator of University of Toronto?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P137 wd:Q180865 . ?sbj wdt:P31 wd:Q483110 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'University of Toronto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stadium'}}

 Q: What is the {painting} for {inspired by} of {Catholic Church}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P941 wd:Q9592 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'inspired by', 'o': 'Catholic Church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: Where was the Russian Revolution co-founded by Peter the Great?
 SPARQL: SELECT ?answer WHERE { wd:Q8729 wdt:P276 ?answer . ?answer wdt:P112 wd:Q8479}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Russian Revolution', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Peter the Great'}}

 Q: What is { award received } from { Goodfellas } that is the subject of { 63rd Academy Awards }?
 SPARQL: SELECT ?obj WHERE { wd:Q42047 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q910856 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Goodfellas', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subject of', 'o': '63rd Academy Awards'}}}

 Q: What is <EU VAT number> of <Ferrovie dello Stato Italiane> ?
 SPARQL: select distinct ?answer where { wd:Q83823 wdt:P3608 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ferrovie dello Stato Italiane', 'p': 'EU VAT number', 'o': '?x0'}

 Q: What is {aspect of} of {history of Iran}, that has {ethnicity} is {Iranian Azerbaijanis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q28926 wdt:P1269 ?answer . ?answer wdt:P172 wd:Q2426677}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Iran', 'p': 'aspect of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'ethnicity', 'o': 'Iranian Azerbaijanis'}}

 Q: Did {Britney_Spears} {languages spoken, written or signed} {Old English}?
 SPARQL: ASK WHERE { wd:Q11975 wdt:P1412 wd:Q42365 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Britney Spears', 'p': 'languages spoken, written or signed', 'o': '?x0', '?x0': 'Old English'}]

 Q: What is {position held} of {Richard Nixon} that is {replaced by} is {Gerald Ford} ?
 SPARQL: SELECT ?obj WHERE { wd:Q9588 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q9582 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Richard Nixon', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Gerald Ford'}}}

 Q: Give me {republic} that {capital} {Venice} and which contains the word {republic} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj wdt:P36 wd:Q641 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'republic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Venice'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'republic'}}

 Q: What is {participated in conflict} of {Central Powers}, that has {preceeds} is {World War II} ?
 SPARQL: SELECT ?answer WHERE { wd:Q152283 wdt:P607 ?answer . ?answer wdt:P156 wd:Q362}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Central Powers', 'p': 'conflict', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'preceeds', 'o': 'World War II'}}

