 Q: Which is the number of episodes for the Bewitched?
 SPARQL: select distinct ?answer where { wd:Q1044635 wdt:P1113 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bewitched', 'p': 'number of episodes', 'o': '?x0'}

 Q: Did {John_Quincy_Adams} {position held} {United States Ambassador to Germany} and {United States Ambassador to the Netherlands} ?
 SPARQL: ASK WHERE { wd:Q11816 wdt:P39 wd:Q326552 . wd:Q11816 wdt:P39 wd:Q7889414 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Quincy Adams', 'p': 'position held', 'o': '?x0', '?x0': 'United States Ambassador to Germany'}, {'h': 'IS', 'v': '?x1', 's': 'John Quincy Adams', 'p': 'position held', 'o': '?x1', '?x1': 'United States Ambassador to the Netherlands'}]

 Q: Is the frequency of the Sky Polarization Observatory equal to 25.6?
 SPARQL: ASK WHERE { wd:Q511405 wdt:P2144 ?obj filter(?obj = 25.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sky Polarization Observatory', 'p': 'frequency', 'o': '?x0', '?x0': '25.6'}

 Q: What is {member of sports team} of {Roberto Carlos} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q429039 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberto Carlos', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberto Carlos', 'p': 'team', 'o': '$y0'}}]

 Q: "What is the {different than} of {waltz}, with the {movie director} of {Norbert ter Hall}?"
 SPARQL: SELECT ?answer WHERE { wd:Q193434 wdt:P1889 ?answer . ?answer wdt:P57 wd:Q2110132}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'waltz', 'p': 'different than', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Norbert ter Hall'}}

 Q: Which is the language that is influenced by English?
 SPARQL:  select distinct ?obj where { wd:Q1860 wdt:P737 ?obj . ?obj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'English', 'p': 'influenced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Has Federico Fellini participated in Documenta?
 SPARQL:  select distinct ?obj where { wd:Q7371 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q72823 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Federico Fellini', 'p': 'participated in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Documenta'}}

 Q: what is the {end time} for {Jean-Bertrand Aristide} has {position held} as {President of Haiti} ?
 SPARQL: SELECT ?value WHERE { wd:Q209617 p:P39 ?s . ?s ps:P39 wd:Q3290543 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jean-Bertrand Aristide', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Haiti'}}}

 Q: Is Toni Braxton's record label Elektra Records or Arista Records?
 SPARQL: ASK WHERE { wd:Q155412 wdt:P264 wd:Q726251 . wd:Q155412 wdt:P264 wd:Q664167 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Toni Braxton', 'p': 'record label', 'o': '?x0', '?x0': 'Elektra'}, {'h': 'IS', 'v': '?x1', 's': 'Toni Braxton', 'p': 'record label', 'o': '?x1', '?x1': 'Arista'}]

 Q: What is {date of birth} of {Eusebius of Caesarea} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q142999 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eusebius of Caesarea', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'circa'}}}

 Q: what is the {start time} for {Sochi} has {head of government} as {Anatoly Pakhomov} ?
 SPARQL: SELECT ?value WHERE { wd:Q39420 p:P6 ?s . ?s ps:P6 wd:Q4265869 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sochi', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Anatoly Pakhomov'}}}

 Q: What is the {human} for {spouse} of {Andre Agassi}
 SPARQL:  select distinct ?obj where { wd:Q7407 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andre Agassi', 'p': 'spouse', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Tell me the point in time that Cayman Islands has the population of 56601.0?
 SPARQL: SELECT ?value WHERE { wd:Q5785 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'56601.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Cayman Islands', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '56601.0'}, 't': '?x0'}

 Q: How many permanent duplicated items does June possess?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2959 wd:Q120 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'permanent duplicated item', 'o': 'June'}

 Q: Did {The_Beach_Boys} {record label} {Sire Records}?
 SPARQL: ASK WHERE { wd:Q183048 wdt:P264 wd:Q165711 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Beach Boys', 'p': 'record label', 'o': '?x0', '?x0': 'Sire'}]

 Q: What is {material produced} of {made by} of {Glenfiddich Distillery} ?
 SPARQL: SELECT ?answer WHERE { wd:Q911587 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'material produced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Glenfiddich Distillery', 'p': 'made by', 'o': '$y0'}}

 Q: Give me {modern language} that {has grammatical person} {second-person plural} and which contains the word {russian} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj wdt:P5110 wd:Q51929403 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'russian')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'modern language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical person', 'o': 'second-person plural'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'russian'}}

 Q: What is the {language regulator} for {language regulatory body} of {Indonesian}
 SPARQL:  select distinct ?obj where { wd:Q9240 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q2093358 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Indonesian', 'p': 'language regulatory body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language regulator'}}

 Q: What is {in conflict} of {in narrative} of {The Hall of Presidents} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3126038 wdt:P1441 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Hall of Presidents', 'p': 'in narrative', 'o': '$y0'}}

 Q: Is the number of penalty minutes in Nick Petrecki's career less than 0?
 SPARQL: ASK WHERE { wd:Q1985501 wdt:P6546 ?obj filter(?obj < 0.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Nick Petrecki', 'p': 'penalty minutes in career', 'o': '?x0', '?x0': '0.0'}

 Q: What is United States Armed Forces service number for John J. Pershing?
 SPARQL: select distinct ?answer where { wd:Q272383 wdt:P2028 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John J. Pershing', 'p': 'United States Armed Forces service number', 'o': '?x0'}

 Q: What are the temple which start with the letter ġgantija
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44539 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ġgantija')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'temple'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ġgantija'}}

 Q: What is {sainthood status} of {made for} of {Hagia Sophia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12506 wdt:P88 ?X . ?X wdt:P411 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sainthood status', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hagia Sophia', 'p': 'made for', 'o': '$y0'}}

 Q: What is <Environment Ontology ID> of <oceanic trench> ?
 SPARQL: select distinct ?answer where { wd:Q119253 wdt:P3859 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'oceanic trench', 'p': 'Environment Ontology ID', 'o': '?x0'}

 Q: What is {developed by} of {ARM architecture}, that has {end date} is {2000-11-1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16980 wdt:P178 ?answer . ?answer wdt:P576 ?x FILTER(contains(YEAR(?x),'2000'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'ARM architecture', 'p': 'developed by', 'o': '?x0', 't': '2000'}

 Q: Is Eric Eric Assanges given name?
 SPARQL: ASK WHERE { wd:Q360 wdt:P735 wd:Q12788459 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Assange', 'p': 'given name', 'o': '?x0', '?x0': 'Eric'}]

 Q: What comes before the anti-particle of antideuterium?
 SPARQL: SELECT ?answer WHERE { wd:Q11905736 wdt:P2152 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'comes before', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'antideuterium', 'p': 'anti-particle', 'o': '$y0'}}

 Q: What is {inflation rate} of {Guyana} where {point in time} is {1983-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q734 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guyana', 'p': 'inflation rate', 'o': '?x0', 't': '1983'}

 Q: What is {diplomatic relation} of {set in location} of {Histories} ?
 SPARQL: SELECT ?answer WHERE { wd:Q746583 wdt:P840 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Histories', 'p': 'set in location', 'o': '$y0'}}

 Q: What is {this taxon is a source of} of {found in species} of {DA03117} ?
 SPARQL: SELECT ?answer WHERE { wd:Q54822528 wdt:P703 ?X . ?X wdt:P1672 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'this taxon is a source of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'DA03117', 'p': 'found in species', 'o': '$y0'}}

 Q: What is the streak color of quartz that has hexcode FFFFFF?
 SPARQL: SELECT ?answer WHERE { wd:Q43010 wdt:P534 ?answer . ?answer wdt:P465 ?x FILTER(contains(?x,'FFFFFF'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'quartz', 'p': 'streak color', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'hexcode', 'o': 'ffffff'}}

 Q: Give me {unit of time} that contains the word {zettasecond} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790144 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zettasecond')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of time'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zettasecond'}}

 Q: What award did Jane Addams receive in 1973?
 SPARQL: SELECT ?obj WHERE { wd:Q180989 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1973')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jane Addams', 'p': 'award', 'o': '?x0', 't': '1973'}

 Q: what is the {start time} for {Kuomintang} has {chairperson} as {Wu Den-yih} ?
 SPARQL: SELECT ?value WHERE { wd:Q31113 p:P488 ?s . ?s ps:P488 wd:Q57838 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kuomintang', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Wu Den-yih'}}}

 Q: What is the {recurring sporting event} for {participant of} of {Lance Armstrong}
 SPARQL:  select distinct ?obj where { wd:Q2172 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q18608583 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lance Armstrong', 'p': 'participant of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring sporting event'}}

 Q: What is the {human} for {voice actor} of {Star Wars Episode V: The Empire Strikes Back}
 SPARQL:  select distinct ?obj where { wd:Q181795 wdt:P725 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'voice actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {postcode} of {death place} of {Piero della Francesca} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5822 wdt:P20 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'postcode', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piero della Francesca', 'p': 'death place', 'o': '$y0'}}

 Q: What is {discipline} of {advisor} of {Joseph Malègue} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3042797 wdt:P184 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Malègue', 'p': 'advisor', 'o': '$y0'}}

 Q: What is the {campaign for the 2016 United States presidential election} for {employer} of {Steve Bannon}
 SPARQL:  select distinct ?obj where { wd:Q16146870 wdt:P108 ?obj . ?obj wdt:P31 wd:Q20639925 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Steve Bannon', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'campaign for the 2016 United States presidential election'}}

 Q: Tell me the name of a noble family that starts with the letter ü.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ü')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble family'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ü'}}

 Q: What was Hillary Clinton a student of and what is her academic degree?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q6294 wdt:P512 ?ans_1 . wd:Q6294 wdt:P1066 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hillary Clinton', 'p': 'academic degree', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hillary Clinton', 'p': 'student of', 'o': '?x1'}]

 Q: When was Aldous Huxley received James Tait Black Memorial Prize award?
 SPARQL: SELECT ?value WHERE { wd:Q81447 p:P166 ?s . ?s ps:P166 wd:Q392586 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Aldous Huxley', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'James Tait Black Memorial Prize'}, 't': '?x0'}

 Q: What is {safety classification and labelling} of {hydrogen chloride} that is {NFPA Special} is {ACID} ?
 SPARQL: SELECT ?obj WHERE { wd:Q211086 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P877 ?x filter(contains(?x,'ACID')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'safety classification and labelling', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hydrogen chloride', 'p': 'safety classification and labelling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'NFPA Special', 'o': 'acid'}}}

 Q: What is located in the state of Idaho that has diplomatic relations with Dominica?
 SPARQL: SELECT ?answer WHERE { wd:Q1221 wdt:P131 ?answer . ?answer wdt:P530 wd:Q784}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Idaho', 'p': 'is located in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Dominica'}}

 Q: Who is the {human} for {influenced by} of {J. Robert Oppenheimer}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P737 wd:Q132537 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'influenced by', 'o': 'Robert Oppenheimer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {manner of death} and the {position played on team / speciality} of {Bobby_Moore} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q191492 wdt:P1196 ?ans_1 . wd:Q191492 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Bobby Moore', 'p': 'manner of death', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Bobby Moore', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: Whats the filming location of Thane?
 SPARQL: select distinct ?answer where { ?answer wdt:P915 wd:Q207749}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'filming location', 'o': 'Thane'}

 Q: Lagos is located in what time zone and had what category of films shot at this location?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8673 wdt:P1740 ?ans_1 . wd:Q8673 wdt:P421 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Lagos', 'p': 'category of films shot at this location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Lagos', 'p': 'time zone', 'o': '?x1'}]

 Q: What is {languages spoken} of {Georges Cziffra}, that has {has grammatical gender} is {masculine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q254333 wdt:P1412 ?answer . ?answer wdt:P5109 wd:Q499327}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Georges Cziffra', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical gender', 'o': 'm'}}

 Q: What are the deductive language which start with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5249852 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'deductive language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: what is the {for work} for {Rosalind Russell} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q233854 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rosalind Russell', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Which is people or cargo transported of people?
 SPARQL: select distinct ?answer where { ?answer wdt:P3437 wd:Q2472587}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'people or cargo transported', 'o': 'people'}

 Q: what is Romania LMI code for Trajan's Bridge?
 SPARQL: select distinct ?answer where { wd:Q849786 wdt:P1770 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Trajan's Bridge", 'p': 'Romania LMI code', 'o': '?x0'}

 Q: What is {chef-lieu} of {subitem of} of {history of West Virginia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11288505 wdt:P1269 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chef-lieu', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of West Virginia', 'p': 'subitem of', 'o': '$y0'}}

 Q: what was the inflation rate in Bosnia and Herzegovina as at 2005-01-01?
 SPARQL: SELECT ?obj WHERE { wd:Q225 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bosnia and Herzegovina', 'p': 'inflation rate', 'o': '?x0', 't': '2005'}

 Q: Glenn Greenwald works for what magazine?
 SPARQL:  select distinct ?obj where { wd:Q5568842 wdt:P108 ?obj . ?obj wdt:P31 wd:Q41298 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Glenn Greenwald', 'p': 'works for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine'}}

 Q: Which member of Colin Meads started in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q642380 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Colin Meads', 'p': 'member of', 'o': '?x0', 't': '2014'}

 Q: Is Aluminium-26's binding energy 211893.89?
 SPARQL: ASK WHERE { wd:Q1985521 wdt:P2154 ?obj filter(?obj = 211893.89) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'aluminium-26', 'p': 'binding energy', 'o': '?x0', '?x0': '211893.89'}

 Q: What is <position held> of <Francisco de Mirandad> ?
 SPARQL: select distinct ?answer where { wd:Q311447 wdt:P39 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Francisco de Miranda', 'p': 'position held', 'o': '?x0'}

 Q: What was the population of Harbin in 2016?
 SPARQL: SELECT ?obj WHERE { wd:Q42956 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Harbin', 'p': 'population', 'o': '?x0', 't': '2016'}

 Q: what is the {date of birth} for {Frederick William I of Prussia} has {child} as {Wilhelmine of Prussia, Margravine of Brandenburg-Bayreuth} ?
 SPARQL: SELECT ?value WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q237740 . ?s pq:P569 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Wilhelmine'}}}

 Q: What is {number of out of school children} of {sovereign state} of {Borobudur} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42798 wdt:P17 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Borobudur', 'p': 'country', 'o': '$y0'}}

 Q: What is the {human} for {father} of {Clark Gable}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P22 wd:Q71243 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'father', 'o': 'Clark Gable', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Who married Brooke Astor in 1953?
 SPARQL: SELECT ?obj WHERE { wd:Q437088 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Brooke Astor', 'p': 'married', 'o': '?x0', 't': '1953'}

 Q: Which is the Poetry Foundation ID of Samuel Beckett?
 SPARQL: select distinct ?answer where { wd:Q37327 wdt:P5341 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Samuel Beckett', 'p': 'Poetry Foundation ID', 'o': '?x0'}

 Q: What is the {human} for {country of citizenship} of {Czechoslovakia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P27 wd:Q33946 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'citizenship', 'o': 'Czechoslovakia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {end time} for {David Trimble} has {position held} as {First Minister of Northern Ireland} ?
 SPARQL: SELECT ?value WHERE { wd:Q192556 p:P39 ?s . ?s ps:P39 wd:Q22979263 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Trimble', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'First Minister of Northern Ireland'}}}

 Q: "Which is {language read} of {Inigo Jones}, that has {role model} is {French} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q295929 wdt:P1412 ?answer . ?answer wdt:P737 wd:Q150}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Inigo Jones', 'p': 'language read', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'role model', 'o': 'French'}}

 Q: Is the units sold of the Roti Island snake-necked turtle more than 16.0?
 SPARQL: ASK WHERE { wd:Q304547 wdt:P2664 ?obj filter(?obj > 16.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Roti Island snake-necked turtle', 'p': 'units sold', 'o': '?x0', '?x0': '16.0'}

 Q: Is it true that the discharge of the Calnegia equals to 1.39?
 SPARQL: ASK WHERE { wd:Q1027378 wdt:P2225 ?obj filter(?obj = 1.39) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Calnegia', 'p': 'discharge', 'o': '?x0', '?x0': '1.39'}

 Q: what is the {coordinate location} for {Ötzi} has {place of death} as {Ötztal Alps} ?
 SPARQL: SELECT ?value WHERE { wd:Q171291 p:P20 ?s . ?s ps:P20 wd:Q307518 . ?s pq:P625 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ötzi', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Ötztal Alps'}}}

 Q: What is the {impact crater} with the {MAX(diameter)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q55818 . ?ent wdt:P2386 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'diameter', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'impact crater'}}

 Q: What is {educated at} of {Vladimir Putin} and {academic degree}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7747 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'educated at', 'o': '$y0'}}]

 Q: Did {Jim_Carrey} {occupation} {film producer}?
 SPARQL: ASK WHERE { wd:Q40504 wdt:P106 wd:Q3282637 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jim Carrey', 'p': 'occupation', 'o': '?x0', '?x0': 'film producer'}]

 Q: What noble title did Berengar I of Italy hold and who was his successor?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'successor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Berengar I of Italy', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Berengar I of Italy', 'p': 'noble title', 'o': '$y0'}}]

 Q: Give me {solstice} that {month of the year} {December} and which that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123524 . ?sbj wdt:P2922 wd:Q126 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'solstice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'month of the year', 'o': 'December'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the reason of failure of the big event in Handley Page Transport?
 SPARQL: SELECT ?answer WHERE { wd:Q5647512 wdt:P793 ?X . ?X wdt:P770 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'reason of failure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Handley Page Transport', 'p': 'big event', 'o': '$y0'}}

 Q: What is <members have occupation> of <Coen brothers> ?
 SPARQL: select distinct ?answer where { wd:Q56095 wdt:P3989 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Coen brothers', 'p': 'members have occupation', 'o': '?x0'}

 Q: Which is the Australian Classification for Team Fortress 2?
 SPARQL: select distinct ?answer where { wd:Q382108 wdt:P3156 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Team Fortress 2', 'p': 'Australian Classification', 'o': '?x0'}

 Q: What is the position held by Hammurabi who replaces Sin-Muballit?
 SPARQL: SELECT ?obj WHERE { wd:Q36359 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q374546 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hammurabi', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Sin-Muballit'}}}

 Q: Tell me civilization whose name has the word vandals in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8432 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vandals')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'civilization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vandals'}}

 Q: What is the {steel bridge} for {next crossing upstream} of {London Bridge}
 SPARQL:  select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q12042110 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'London Bridge', 'p': 'next crossing upstream', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steel bridge'}}

 Q: Which is the military operation in the location of Soviet Union?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q15180 . ?sbj wdt:P31 wd:Q645883 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military operation'}}

 Q: What is the {municipality of Sweden} with the {MAX(total liabilities)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q127448 . ?ent wdt:P2138 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'liabilities', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Sweden'}}

 Q: What is {child} of {Isabella I of Castile} and {date of death}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P570 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella I of Castile', 'p': 'child', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'child', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella I of Castile', 'p': 'child', 'o': '$y0'}}]

 Q: What is {role model} of {pupil} of {Octavian Angheluță} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18543692 wdt:P802 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role model', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Octavian Angheluță', 'p': 'student', 'o': '$y0'}}

 Q: what is the {end time} for {Tiraspol} has {country} as {Soviet Union} ?
 SPARQL: SELECT ?value WHERE { wd:Q132572 p:P17 ?s . ?s ps:P17 wd:Q15180 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tiraspol', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Soviet Union'}}}

 Q: what are studio album starts with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208569 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'studio album'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What are the lifestyles of students of Lanfranc?
 SPARQL: SELECT ?answer WHERE { wd:Q317098 wdt:P802 ?X . ?X wdt:P1576 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'lifestyle', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lanfranc', 'p': 'student', 'o': '$y0'}}

 Q: What is {cat films shot} of {birth city} of {Stanisława Przybyszewska} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3067991 wdt:P19 ?X . ?X wdt:P1740 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cat films shot', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanisława Przybyszewska', 'p': 'birth city', 'o': '$y0'}}

