 Q: Give me {şəhər} that {category for films shot at this location} {Category:Films shot in Baku} and which contains the word {baku} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56557664 . ?sbj wdt:P1740 wd:Q10047453 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'baku')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'şəhər', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'category for films shot at this location', 'o': 'Category:Films shot in Baku'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'baku'}}

 Q: Which  is torch lit by of Li Ning ?
 SPARQL: select distinct ?answer where { ?answer wdt:P545 wd:Q314032}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'torch lit by', 'o': 'Li Ning'}

 Q: What is {economic branch} of {licensor} of {macOS} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14116 wdt:P3931 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'branch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'macOS', 'p': 'licensor', 'o': '$y0'}}

 Q: What is {work location} of {Konrad Zacharias Lorenz} that is {start time} is {1940-8-31} ?
 SPARQL: SELECT ?obj WHERE { wd:Q78496 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1940')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Konrad Zacharias Lorenz', 'p': 'work location', 'o': '?x0', 't': '1940'}

 Q: what is the {instance of} for {Cesare Borgia} has {date of birth} as {1475-0-0} ?
 SPARQL: SELECT ?value WHERE { wd:Q187998 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1475')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cesare Borgia', 'p': 'date of birth', 'o': '$y0'}}

 Q: what is the {language of work or name} for {sugar} has {pronunciation audio} as {Ru-сахар.ogg} ?
 SPARQL: SELECT ?value WHERE { wd:Q11002 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Ru-сахар.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language of work or name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sugar', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'ru-сахар.ogg'}}}

 Q: What award did Maureen O'Hara receive in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q229276 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Maureen O'Hara", 'p': 'award', 'o': '?x0', 't': '2014'}

 Q: What is <takes place in fictional universe> of <The Walking Dead> ?
 SPARQL: select distinct ?answer where { wd:Q232737 wdt:P1434 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Walking Dead', 'p': 'takes place in fictional universe', 'o': '?x0'}

 Q: what is the {start time} for {Brazil} has {currency} as {cruzeiro} ?
 SPARQL: SELECT ?value WHERE { wd:Q155 p:P38 ?s . ?s ps:P38 wd:Q8351983 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Brazil', 'p': 'currency', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'currency', 'o': 'cruzeiro'}}}

 Q: What is {preceeds} of {Watership Down}, that has {date released} is {1996-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q936801 wdt:P156 ?answer . ?answer wdt:P577 ?x FILTER(contains(YEAR(?x),'1996'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Watership Down', 'p': 'preceeds', 'o': '?x0', 't': '1996'}

 Q: What is {genetic association} of {attention deficit hyperactivity disorder} that is {determination method} is {TAS} ?
 SPARQL: SELECT ?obj WHERE { wd:Q181923 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'attention deficit hyperactivity disorder', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'TAS'}}}

 Q: What is {place of death} of {Anton Chekhov} that is {country} is {German Empire} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5685 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q43287 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'place of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anton Chekhov', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'German Empire'}}}

 Q: Name a video game that starts with the letter Z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is <Football Federation of Ukraine player ID> of <Andriy Shevchenko> ?
 SPARQL: select distinct ?answer where { wd:Q41244 wdt:P3662 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Andriy Shevchenko', 'p': 'Football Federation of Ukraine player ID', 'o': '?x0'}

 Q: What is {nominated for} of {Orson Welles} that is {for work} is {Citizen Kane} ?
 SPARQL: SELECT ?obj WHERE { wd:Q24829 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q24815 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Orson Welles', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Citizen Kane'}}}

 Q: What is {operates} of {profession} of {Eduard Hitzberger} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1288748 wdt:P106 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eduard Hitzberger', 'p': 'profession', 'o': '$y0'}}

 Q: What is the area of provinces that border the Entre Rios Province?
 SPARQL: SELECT ?answer WHERE { wd:Q44762 wdt:P47 ?X . ?X wdt:P2046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Entre Rios Province', 'p': 'border', 'o': '$y0'}}

 Q: What is ideology of member  party of Lars Krarup ?
 SPARQL: SELECT ?answer WHERE { wd:Q12323862 wdt:P102 ?X . ?X wdt:P1142 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ideology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lars Krarup', 'p': 'party', 'o': '$y0'}}

 Q: Which is the painting that depicts the Richard III of England?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P180 wd:Q133028 . ?sbj wdt:P31 wd:Q3305213 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'Richard III of England', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'painting'}}

 Q: What is {publication date} of {Mulholland Drive} that is {place of publication} is {Germany} ?
 SPARQL: SELECT ?obj WHERE { wd:Q272608 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P291 wd:Q183 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mulholland Drive', 'p': 'published', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of publication', 'o': 'Germany'}}}

 Q: What is {base} of {dual to} of {decagonal antiprism} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2717560 wdt:P1322 ?X . ?X wdt:P3263 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'base', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'decagonal antiprism', 'p': 'dual to', 'o': '$y0'}}

 Q: What is the {human} for {doctoral advisor} of {Ted Kaczynski}
 SPARQL:  select distinct ?obj where { wd:Q222134 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ted Kaczynski', 'p': 'doctoral advisor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Æthelred the Unready} has {position held} as {monarch of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q183499 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Æthelred the Unready', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch of England'}}}

 Q: what is the {replaces} for {Bhumibol Adulyadej} has {position held} as {King of Thailand} ?
 SPARQL: SELECT ?value WHERE { wd:Q855252 p:P39 ?s . ?s ps:P39 wd:Q27330121 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bhumibol Adulyadej', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of Thailand'}}}

 Q: What is {position held} of {Frederick Douglass} that is {start time} is {1881-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q215562 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1881')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frederick Douglass', 'p': 'position held', 'o': '?x0', 't': '1881'}

 Q: Who was Dino De Laurentiis' spouse when their marriage ended in 1988?
 SPARQL: SELECT ?obj WHERE { wd:Q296796 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dino De Laurentiis', 'p': 'spouse', 'o': '?x0', 't': '1988'}

 Q: What is <depends on software> of <Hypertext Transfer Protocol> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1547 wd:Q8777}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depends on software', 'o': 'Hypertext Transfer Protocol'}

 Q: What is {given name} of {Prince} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q7542 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'given name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Prince', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: what is the {sourcing circumstances} for {Roger Williams} has {date of birth} as {1603-0-0} ?
 SPARQL: SELECT ?value WHERE { wd:Q391591 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1603')) . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roger Williams', 'p': 'date of birth', 'o': '$y0'}}

 Q: What is the {human} for {website account on} of {YouTube}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P553 wd:Q866 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'website account on', 'o': 'Youtube', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: Which is the GNIS ID of Bridgeport?
 SPARQL: select distinct ?answer where { wd:Q49174 wdt:P590 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bridgeport', 'p': 'GNIS ID', 'o': '?x0'}

 Q: Which is Berlin cultural heritage ID for  Pergamon Museum?
 SPARQL: select distinct ?answer where { wd:Q157298 wdt:P2424 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pergamon Museum', 'p': 'Berlin cultural heritage ID', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Landon Donovan} has {member of sports team} as {United States men's national under-23 soccer team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q202237 p:P54 ?s . ?s ps:P54 wd:Q3590572 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Landon Donovan', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': "United States men's national under-23 soccer team"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Landon Donovan', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': "United States men's national under-23 soccer team"}}}]

 Q: What is  the timezone of the civilisation of Chinese mythology ?
 SPARQL: SELECT ?answer WHERE { wd:Q210677 wdt:P2596 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'timezone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chinese mythology', 'p': 'civilisation', 'o': '$y0'}}

 Q: What is {award received} of {Kurt Gödel} that is {point in time} is {1974-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41390 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kurt Gödel', 'p': 'award', 'o': '?x0', 't': '1974'}

 Q: What is {spouse} of {Alexander Hamilton} and {end cause}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q178903 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1534 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Hamilton', 'p': 'wife', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'wife', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Hamilton', 'p': 'wife', 'o': '$y0'}}]

 Q: What is the opposite genre for fiction ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P461 wd:Q8253 . ?sbj wdt:P31 wd:Q483394 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'opposite', 'o': 'fiction', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'genre'}}

 Q: What is {position held} of {Fernando Álvarez de Toledo, 3rd Duke of Alba} that is {start time} is {1581-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q80847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1581')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fernando Álvarez de Toledo, 3rd Duke of Alba', 'p': 'position held', 'o': '?x0', 't': '1581'}

 Q: What is the {taxon} for {parent taxon} of {goldfish}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P171 wd:Q123141 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent taxon', 'o': 'goldfish', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: Which human Go player, has the minimum EGF rating?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4105 ?obj . ?ent wdt:P106 wd:Q12039558} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'EGF rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'occupation', 'o': 'Go player'}}}

 Q: What is the {record company} for {record label} of {David Foster}
 SPARQL:  select distinct ?obj where { wd:Q77112 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2442401 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'David Foster', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record company'}}

 Q: What is <Isidore ID> of <Horace Silver> ?
 SPARQL: select distinct ?answer where { wd:Q365560 wdt:P4491 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Horace Silver', 'p': 'Isidore ID', 'o': '?x0'}

 Q: How many brands does Coca-Cola have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1716 wd:Q2813 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'brand', 'o': 'Coca-Cola'}

 Q: Which is {cases} of {language used} in {Ismail Kadare} ?
 SPARQL: SELECT ?answer WHERE { wd:Q179695 wdt:P1412 ?X . ?X wdt:P2989 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cases', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ismail Kadare', 'p': 'language used', 'o': '$y0'}}

 Q: What is {Charles Baudelaire}'s {Poets.org poet ID}?
 SPARQL: select distinct ?answer where { wd:Q501 wdt:P5343 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Baudelaire', 'p': 'Poets.org poet ID', 'o': '?x0'}

 Q: What is {nominated for} of {Good Will Hunting} that is {statement is subject of} is {70th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193835 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q536749 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Good Will Hunting', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '70th Academy Awards'}}}

 Q: What is {formation} of {accused} of {Nivelle Offensive} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2005867 wdt:P710 ?X . ?X wdt:P241 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nivelle Offensive', 'p': 'accused', 'o': '$y0'}}

 Q: What is {death location} of {Sergei Prokudin-Gorskii}, that has {has counties} is {7th arrondissement of Paris} ?
 SPARQL: SELECT ?answer WHERE { wd:Q101516 wdt:P20 ?answer . ?answer wdt:P150 wd:Q259463}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sergei Prokudin-Gorskii', 'p': 'died in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has counties', 'o': '7th arrondissement of Paris'}}

 Q: what is the {start time} for {Paul Erdős} has {residence} as {Manchester} ?
 SPARQL: SELECT ?value WHERE { wd:Q173746 p:P551 ?s . ?s ps:P551 wd:Q18125 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Erdős', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Manchester'}}}

 Q: What was the population of the Central African Republic in 1987?
 SPARQL: SELECT ?obj WHERE { wd:Q929 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1987')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Central African Republic', 'p': 'population', 'o': '?x0', 't': '1987'}

 Q: What is the {cable-stayed bridge} with the {MAX(number of spans)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q158555 . ?ent wdt:P1314 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of spans', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cable-stayed bridge'}}

 Q: What is <location map> of <Kherson Oblast> ?
 SPARQL: select distinct ?answer where { wd:Q163271 wdt:P1943 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kherson Oblast', 'p': 'location map', 'o': '?x0'}

 Q: What are the national economy which start with the letter e
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6456916 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'e')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national economy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'e'}}

 Q: give me the name of Theophile Gautier that has series ordinal is 3?
 SPARQL: SELECT ?obj WHERE { wd:Q183713 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Theophile Gautier', 'p': 'name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '3'}}}

 Q: Which award did Jaroslav Seifert receive in the year 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q102483 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jaroslav Seifert', 'p': 'award', 'o': '?x0', 't': '1984'}

 Q: What is <National Cancer Institute ID> of <melanoma> ?
 SPARQL: select distinct ?answer where { wd:Q180614 wdt:P1395 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'melanoma', 'p': 'National Cancer Institute ID', 'o': '?x0'}

 Q: What is the {agent} for {used by} of {communication}
 SPARQL:  select distinct ?obj where { wd:Q11024 wdt:P1535 ?obj . ?obj wdt:P31 wd:Q24229398 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'communication', 'p': 'used by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'agent'}}

 Q: Give me {film} that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is located on linear feature of the London Underground?
 SPARQL: select distinct ?answer where { ?answer wdt:P795 wd:Q20075}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'located on linear feature', 'o': 'London Underground'}

 Q: What is the {powerplant} and the {manufacturer} of {McDonnell_Douglas_F-15_Eagle} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q29251 wdt:P516 ?ans_1 . wd:Q29251 wdt:P176 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Eagle', 'p': 'powerplant', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Eagle', 'p': 'manufacturer', 'o': '?x1'}]

 Q: Is it true Facebook founded by Andrew McCollum?
 SPARQL: ASK WHERE { wd:Q355 wdt:P112 wd:Q4757939 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Facebook', 'p': 'founded by', 'o': '?x0', '?x0': 'Andrew McCollum'}]

 Q: What is the {place of burial} and the {place of death} of {Stonewall_Jackson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q216124 wdt:P119 ?ans_1 . wd:Q216124 wdt:P20 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Stonewall Jackson', 'p': 'place of burial', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Stonewall Jackson', 'p': 'place of death', 'o': '?x1'}]

 Q: Were Grendel's mother and Hygelac characters in Beowulf?
 SPARQL: ASK WHERE { wd:Q48328 wdt:P674 wd:Q2361245 . wd:Q48328 wdt:P674 wd:Q889694 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Beowulf', 'p': 'characters', 'o': '?x0', '?x0': "Grendel's mother"}, {'h': 'IS', 'v': '?x1', 's': 'Beowulf', 'p': 'characters', 'o': '?x1', '?x1': 'Hygelac'}]

 Q: What is the {cenotaph} for {occupant} of {Jean-Jacques Rousseau}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P466 wd:Q6527 . ?sbj wdt:P31 wd:Q321053 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'occupant', 'o': 'Jean-Jacques Rousseau', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cenotaph'}}

 Q: What is the INDUCKS story ID of Toy Story?
 SPARQL: select distinct ?answer where { wd:Q171048 wdt:P4483 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Toy Story', 'p': 'INDUCKS story ID', 'o': '?x0'}

 Q: What is {significant event} of {Gisele Bündchen} that is {point in time} is {2012-12-5} ?
 SPARQL: SELECT ?obj WHERE { wd:Q152208 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gisele Bundchen', 'p': 'significant event', 'o': '?x0', 't': '2012'}

 Q: What are the  legal status of medicine   whose name has the word UK IN IT
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26715005 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uk')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'legal status of medicine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'uk'}}

 Q: What is {name in native language} of {Theodosius I} that is {start time} is {347-1-11} ?
 SPARQL: SELECT ?obj WHERE { wd:Q46696 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P580 ?x filter(contains(?x,'347-1-11')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name in native language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Theodosius I', 'p': 'name in native language', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'start time', 'o': '347-1-11'}}}

 Q: tell me about language family starts with the letter q
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'q')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language family'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'q'}}

 Q: What is the {ecclesiastical title} for {office held by head of the organisation} of {Coptic Orthodox Church of Alexandria}
 SPARQL:  select distinct ?obj where { wd:Q198998 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q11773926 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Coptic Orthodox Church of Alexandria', 'p': 'office held by head of the organisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ecclesiastical title'}}

 Q: What is {employment} of {Michelangelo}, that has {shortened name} is {inż.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5592 wdt:P106 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'inż.'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michelangelo', 'p': 'job', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shortened name', 'o': 'inż.'}}

 Q: What is {administrative territorial entity} of {works at} of {Georg Rudinger} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1505786 wdt:P108 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georg Rudinger', 'p': 'works at', 'o': '$y0'}}

 Q: Did {Apple} {color} {red} and {blue} ?
 SPARQL: ASK WHERE { wd:Q89 wdt:P462 wd:Q3142 . wd:Q89 wdt:P462 wd:Q1088 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'apple', 'p': 'color', 'o': '?x0', '?x0': 'red'}, {'h': 'IS', 'v': '?x1', 's': 'apple', 'p': 'color', 'o': '?x1', '?x1': 'blue'}]

 Q: Which is {detection method} for {child body} of {Ross 128} ?
 SPARQL: SELECT ?answer WHERE { wd:Q926610 wdt:P398 ?X . ?X wdt:P1046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'detection method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ross 128', 'p': 'child body', 'o': '$y0'}}

 Q: What is {location of birth} of {Muhammad al-Idrisi}, that has {is in the settlement of} is {Spain} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173441 wdt:P19 ?answer . ?answer wdt:P131 wd:Q29}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Muhammad al-Idrisi', 'p': 'location of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Spain'}}

 Q: What is the {human} for {sport} of {biathlon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P641 wd:Q166788 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sport', 'o': 'biathlon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {chairperson} of {United States Department of State} that is {end time} is {2013-2-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q789915 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'United States Department of State', 'p': 'chairperson', 'o': '?x0', 't': '2013'}

 Q: Give me {creation myth} that contains the word {dreamtime} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215304 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dreamtime')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'creation myth'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dreamtime'}}

 Q: What genre of music is part of the series of Bomberman II?
 SPARQL: SELECT ?answer WHERE { wd:Q2002828 wdt:P179 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bomberman II', 'p': 'part of the series', 'o': '$y0'}}

 Q: What is {co-founded by} of {order} of {Antonin Eymieu} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2857113 wdt:P611 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antonin Eymieu', 'p': 'order', 'o': '$y0'}}

 Q: Which is practiced by fencing?
 SPARQL: select distinct ?answer where { wd:Q12100 wdt:P3095 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fencing', 'p': 'practiced by', 'o': '?x0'}

 Q: Give me {academic writing} that {author} {Charles Darwin} and which that starts with {'o'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4119870 . ?sbj wdt:P50 wd:Q1035 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic writing', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Charles Darwin'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: What is {translation of} of {comes after} of {17th Scripps National Spelling Bee} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16155303 wdt:P155 ?X . ?X wdt:P629 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'translation of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '17th Scripps National Spelling Bee', 'p': 'comes after', 'o': '$y0'}}

 Q: Did {Lemmy} used {instrument} as {harmonica}?
 SPARQL: ASK WHERE { wd:Q309926 wdt:P1303 wd:Q51290 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Lemmy', 'p': 'instrument', 'o': '?x0', '?x0': 'harmonica'}]

 Q: What is {chronology of topic} of {continent} of {Western Asia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27293 wdt:P30 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chronology of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Western Asia', 'p': 'continent', 'o': '$y0'}}

 Q: Did {Sarah_Michelle_Gellar} {sport} {taekwondo}?
 SPARQL: ASK WHERE { wd:Q180665 wdt:P641 wd:Q36389 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Sarah Michelle Gellar', 'p': 'sport', 'o': '?x0', '?x0': 'taekwondo'}]

 Q: Is it true that the Hurricane Ike number of missing is less than 192?
 SPARQL: ASK WHERE { wd:Q392603 wdt:P1446 ?obj filter(?obj < 19.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Hurricane Ike', 'p': 'number of missing', 'o': '?x0', '?x0': '19.2'}

 Q: what is the {type of kinship} for {Carl Maria von Weber} has {relative} as {Constanze Mozart} ?
 SPARQL: SELECT ?value WHERE { wd:Q154812 p:P1038 ?s . ?s ps:P1038 wd:Q84464 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Maria von Weber', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Constanze Mozart'}}}

 Q: Which financial center is a twinned administrative body of Mumbai?
 SPARQL:  select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1066984 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mumbai', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'financial center'}}

 Q: Tom Hanks played as voice actor in which short animated film?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q2263 . ?sbj wdt:P31 wd:Q17517379 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Tom Hanks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'short animated film'}}

