 Q: Which commemorative coin with the lowest face value is made of gold?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q855973 . ?ent wdt:P3934 ?obj . ?ent wdt:P186 wd:Q897} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'face value', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commemorative coin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'made of', 'o': 'gold'}}}

 Q: What is the {departmental council} for {legislative body} of {Paris}
 SPARQL:  select distinct ?obj where { wd:Q90 wdt:P194 ?obj . ?obj wdt:P31 wd:Q19758733 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paris', 'p': 'legislative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'departmental council'}}

 Q: Who did Anna of Russia marry on 1710-11-11?
 SPARQL: SELECT ?obj WHERE { wd:Q160165 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1710')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anna of Russia', 'p': 'marry', 'o': '?x0', 't': '1710'}

 Q: Is the IPA number order of the voiced bilabial nasal less than 136.8?
 SPARQL: ASK WHERE { wd:Q201817 wdt:P3917 ?obj filter(?obj < 136.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'voiced bilabial nasal', 'p': 'IPA number order', 'o': '?x0', '?x0': '136.8'}

 Q: What publisher has population  as 122728  for Monza ?
 SPARQL: SELECT ?value WHERE { wd:Q6252 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'122728')) . ?s pq:P123 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Monza', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '122728'}}}

 Q: What is <PSA World Tour ID> of <Nicol David> ?
 SPARQL: select distinct ?answer where { wd:Q867189 wdt:P3476 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nicol David', 'p': 'PSA World Tour ID', 'o': '?x0'}

 Q: what is the {start time} for {Dennis Lillee} has {member of sports team} as {Tasmania cricket team} ?
 SPARQL: SELECT ?value WHERE { wd:Q1189313 p:P54 ?s . ?s ps:P54 wd:Q1133545 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dennis Lillee', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Tasmania cricket team'}}}

 Q: What is the exhibition history of Pomona College?
 SPARQL: select distinct ?answer where { ?answer wdt:P608 wd:Q7227384}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'exhibition history', 'o': 'Pomona College'}

 Q: What are the rock band which start with the letter yellowcard
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5741069 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yellowcard')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rock band'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yellowcard'}}

 Q: What is the {music award} for {winner} of {Loretta Lynn}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1346 wd:Q272931 . ?sbj wdt:P31 wd:Q1364556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Loretta Lynn', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'music award'}}

 Q: What is the {human} for {partner} of {Johann Wolfgang von Goethe}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P451 wd:Q5879 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Johann Wolfgang von Goethe', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the death location of Saul on the continent of Asia?
 SPARQL: SELECT ?answer WHERE { wd:Q28730 wdt:P20 ?answer . ?answer wdt:P30 wd:Q48}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saul', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Asia'}}

 Q: What is {advisor} of {inventor of} of {Titan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2565 wdt:P61 ?X . ?X wdt:P184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Titan', 'p': 'inventor', 'o': '$y0'}}

 Q: What is {champion} of {awarded} of {Jan Tinbergen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q183181 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'champion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jan Tinbergen', 'p': 'award', 'o': '$y0'}}

 Q: What is the {monocation} for {conjugate base} of {ammonia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4149 wd:Q4087 . ?sbj wdt:P31 wd:Q55523831 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate base', 'o': 'ammonia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monocation'}}

 Q: What is <Freebase ID> of <Niall Ferguson> ?
 SPARQL: select distinct ?answer where { wd:Q377638 wdt:P646 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Niall Ferguson', 'p': 'Freebase ID', 'o': '?x0'}

 Q: What is the {position} for {country} of {Kingdom of Wessex}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q105313 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Kingdom of Wessex', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: what is the {series ordinal} for {Ernesto Samper} has {position held} as {Secretary General of the Non-Aligned Movement} ?
 SPARQL: SELECT ?value WHERE { wd:Q365427 p:P39 ?s . ?s ps:P39 wd:Q15647601 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ernesto Samper', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary General of the Non-Aligned Movement'}}}

 Q: What is {date of birth} and {father} of {{Joseph Stalin} has {child} as {Artem Sergeev}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q4416801 . ?s pq:P569 ?value1 . ?s pq:P22 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Artem Sergeev'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'father', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Artem Sergeev'}}}]

 Q: What is the {non-positive integer} for {opposite of} of {0}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P461 wd:Q204 . ?sbj wdt:P31 wd:Q47371099 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'opposite of', 'o': 'o', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'non-positive integer'}}

 Q: Which is the World Series of Poker ID of Phil Hellmuth?
 SPARQL: select distinct ?answer where { wd:Q375966 wdt:P3554 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phil Hellmuth', 'p': 'World Series of Poker ID', 'o': '?x0'}

 Q: who aircraft family for item operated of Air India?
 SPARQL:  select distinct ?obj where { wd:Q69906 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056993 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Air India', 'p': 'item operated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aircraft family'}}

 Q: What is the {G-type main-sequence star} for {child astronomical body} of {Jupiter}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q319 . ?sbj wdt:P31 wd:Q5864 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Jupiter', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: What is the {monoanion} for {conjugate acid} of {phenol}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q130336 . ?sbj wdt:P31 wd:Q55523986 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'phenol', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monoanion'}}

 Q: What is {treatment} of {hepatitis C}, that has {SMILES} is {C1=NC(=NN1C2C(C(C(O2)CO)O)O)C(=O)N} ?
 SPARQL: SELECT ?answer WHERE { wd:Q154869 wdt:P2176 ?answer . ?answer wdt:P233 ?x FILTER(contains(?x,'C1=NC(=NN1C2C(C(C(O2)CO)O)O)C(=O)N'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'hepatitis C', 'p': 'treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'SMILES', 'o': 'c1=nc(=nn1c2c(c(c(o2)co)o)o)c(=o)n'}}

 Q: What is the {human} for {film editor} of {The Birth of a Nation}
 SPARQL:  select distinct ?obj where { wd:Q220394 wdt:P1040 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Birth of a Nation', 'p': 'film editor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What are the civil code which start with the letter code
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1923776 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'code')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'civil code'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'code'}}

 Q: Is it true that the total reserves of Denmark equal 75391898443?
 SPARQL: ASK WHERE { wd:Q35 wdt:P2134 ?obj filter(?obj = 75391898443) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Denmark', 'p': 'total reserves', 'o': '?x0', '?x0': '75391898443'}

 Q: Name a song composed by Pete Townshend.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q26933 . ?sbj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composed by', 'o': 'Pete Townshend', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: Claude Monet belonged to which art movement?
 SPARQL:  select distinct ?obj where { wd:Q296 wdt:P135 ?obj . ?obj wdt:P31 wd:Q968159 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Claude Monet', 'p': 'movement', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'art movement'}}

 Q: What Ghost in the Shell character was voiced by actor Kōichi Yamadera?
 SPARQL: SELECT ?value WHERE { wd:Q1066948 p:P725 ?s . ?s ps:P725 wd:Q333194 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ghost in the Shell', 'p': 'voiced by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'voiced by', 'o': 'Kōichi Yamadera'}}}

 Q: Who is the {tilting train} for {item operated} of {Amtrak}
 SPARQL:  select distinct ?obj where { wd:Q23239 wdt:P121 ?obj . ?obj wdt:P31 wd:Q671188 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amtrak', 'p': 'item operated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tilting train'}}

 Q: What is {work location} of {Yayoi Kusama} that is {end time} is {2015-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q231121 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yayoi Kusama', 'p': 'work location', 'o': '?x0', 't': '2015'}

 Q: Who was Galileo Galilei's employer in 1592?
 SPARQL: SELECT ?obj WHERE { wd:Q307 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1592')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Galileo Galilei', 'p': 'employer', 'o': '?x0', 't': '1592'}

 Q: what is the {for work} for {Joss Whedon} has {nominated for} as {Nebula Award for Best Script} ?
 SPARQL: SELECT ?value WHERE { wd:Q298025 p:P1411 ?s . ?s ps:P1411 wd:Q644077 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joss Whedon', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nebula Award for Best Script'}}}

 Q: What is the {aspect of history} that {follows} {apartheid}?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P155 wd:Q11409 . ?sbj wdt:P31 wd:Q17524420 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'follows', 'o': 'apartheid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of history'}}

 Q: What is the {transcontinental country} for {cause of destruction} of {October Revolution}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P770 wd:Q42976 . ?sbj wdt:P31 wd:Q1323642 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause of destruction', 'o': 'October Revolution', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'transcontinental country'}}

 Q: the {inception} of {Uffizi} that is {end time} is {1580-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51252 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1580')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Uffizi', 'p': 'inception', 'o': '?x0', 't': '1580'}

 Q: What is {followed by} and {follows} of {{The Godfather Part II} has {series} as {Godfather trilogy}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q184768 p:P179 ?s . ?s ps:P179 wd:Q3225260 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'next', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Godfather Part II', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Godfather trilogy'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Godfather Part II', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Godfather trilogy'}}}]

 Q: Tell me the end time for Federal Republic of Central America has capital as Sonsonate ?
 SPARQL: SELECT ?value WHERE { wd:Q190025 p:P36 ?s . ?s ps:P36 wd:Q1014248 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Federal Republic of Central America', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Sonsonate'}}}

 Q: What is the {film} for {screenwriter} of {Mike Myers}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P58 wd:Q185724 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'screenwriter', 'o': 'Mike Myers', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: Which is the Elle.fr person ID of Miranda Kerr?
 SPARQL: select distinct ?answer where { wd:Q127454 wdt:P3812 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Miranda Kerr', 'p': 'Elle.fr person ID', 'o': '?x0'}

 Q: Which is the PCP reference number of Kunsthaus Zürich?
 SPARQL: select distinct ?answer where { wd:Q685038 wdt:P381 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kunsthaus Zürich', 'p': 'PCP reference number', 'o': '?x0'}

 Q: What is {artistic genre} of {part of series} of {The Bachelor, season 18} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15706907 wdt:P179 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Bachelor, season 18', 'p': 'part of the series', 'o': '$y0'}}

 Q: Does Tarek Amouri has 63 national team caps?
 SPARQL: ASK WHERE { wd:Q16020996 wdt:P1129 ?obj filter(?obj = 63) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tarek Amouri', 'p': 'national team caps', 'o': '?x0', '?x0': '63'}

 Q: What is {spouses} of {painter} of {Glorious victory} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21512830 wdt:P170 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'spouse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Glorious victory', 'p': 'painter', 'o': '$y0'}}

 Q: Who is the leader of party membership for Martin Dinha?
 SPARQL: SELECT ?answer WHERE { wd:Q6775305 wdt:P102 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'leader', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Dinha', 'p': 'party', 'o': '$y0'}}

 Q: What is {number of out of school children} of {based in} of {South Island} ?
 SPARQL: SELECT ?answer WHERE { wd:Q120755 wdt:P131 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'South Island', 'p': 'in', 'o': '$y0'}}

 Q: What award did Maggie Smith win on 4/9/1979?
 SPARQL: SELECT ?obj WHERE { wd:Q172653 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1979')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maggie Smith', 'p': 'award', 'o': '?x0', 't': '1979'}

 Q: What is Julian Assange's occupant's embassy?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P466 wd:Q360 . ?sbj wdt:P31 wd:Q3917681 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'occupant', 'o': 'Julian Assange', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'embassy'}}

 Q: What is the {station located underground} with the {MAX(number of platform tracks)} whose {country} is {Finland}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22808403 . ?ent wdt:P1103 ?obj . ?ent wdt:P17 wd:Q33 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of platform tracks', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'station located underground', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'land', 'o': 'Finland'}}}

 Q: What is the {brand} for {manufacturer} of {The Coca-Cola Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P176 wd:Q3295867 . ?sbj wdt:P31 wd:Q431289 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'Coca-Cola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'brand'}}

 Q: What borders the Hamadan Province that has acreage totalling 29127.0?
 SPARQL: SELECT ?answer WHERE { wd:Q187373 wdt:P47 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'29137.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hamadan Province', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'acreage', 'o': '29137.0'}}

 Q: What is {pressure} and {phase of matter} of {{water} has {phase point} as {triple point}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P515 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'water', 'p': 'phase point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase point', 'o': 'triple point'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'phase of matter', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'water', 'p': 'phase point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase point', 'o': 'triple point'}}}]

 Q: Is the distance from earth to the Messier 107 20,550?
 SPARQL: ASK WHERE { wd:Q4755 wdt:P2583 ?obj filter(?obj = 20550) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Messier 107', 'p': 'distance from Earth', 'o': '?x0', '?x0': '20550'}

 Q: Is the bore Mitsubishi Kinsei equal to 140?
 SPARQL: ASK WHERE { wd:Q2723523 wdt:P2556 ?obj filter(?obj = 140) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Kinsei', 'p': 'bore', 'o': '?x0', '?x0': '140'}

 Q: Did {Prague} {twinned administrative body} {Hamburg} and {Miami-Dade County} ?
 SPARQL: ASK WHERE { wd:Q1085 wdt:P190 wd:Q1055 . wd:Q1085 wdt:P190 wd:Q468557 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Prague', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Hamburg'}, {'h': 'IS', 'v': '?x1', 's': 'Prague', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Miami-Dade County'}]

 Q: What series of silicate minerals is named after Ernest H. Nickel?
 SPARQL: SELECT ?answer WHERE { wd:Q178977 wdt:P179 ?answer . ?answer wdt:P138 wd:Q1356348}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'silicate mineral', 'p': 'series', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Ernest H. Nickel'}}

 Q: What is the {league} and the {position played on team / speciality} of {Michael_Owen} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q128829 wdt:P118 ?ans_1 . wd:Q128829 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Michael Owen', 'p': 'league', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Michael Owen', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: Tell me about occupation of Bettie Page and followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q61898 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bettie Page', 'p': 'occupation', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'occupation', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bettie Page', 'p': 'occupation', 'o': '$y0'}}]

 Q: What is the {archaeological site} for {capital} of {Achaemenid Empire}
 SPARQL:  select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q839954 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Achaemenid Empire', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archaeological site'}}

 Q: what is the {point in time} for {Tim Hunt} has {award received} as {Croonian Lecture} ?
 SPARQL: SELECT ?value WHERE { wd:Q309977 p:P166 ?s . ?s ps:P166 wd:Q1192912 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tim Hunt', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Croonian Lecture'}, 't': '?x0'}

 Q: Which is legislative body of Cook Islands?
 SPARQL: select distinct ?answer where { wd:Q26988 wdt:P194 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cook Islands', 'p': 'legislative body', 'o': '?x0'}

 Q: What mechanical property of materials starts with the letter "y"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5725005 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mechanical property of materials'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: Which 3D film was Sarah Silverman a voice actor for?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q229013 . ?sbj wdt:P31 wd:Q229390 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Sarah Silverman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': '3D film'}}

 Q: Give me {republic} that {official religion} {Catholicism} and which that starts with {'r'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj wdt:P3075 wd:Q1841 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official religion', 'o': 'Catholicism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: Name a Roman province located in the Roman Empire.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q2277 . ?sbj wdt:P31 wd:Q182547 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Roman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Roman province'}}

 Q: What is {working on what?} of {Galactic astronomy}, that has {child body} is {Boötes II} ?
 SPARQL: SELECT ?answer WHERE { wd:Q58908 wdt:P2578 ?answer . ?answer wdt:P398 wd:Q2483957}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'galactic astronomy', 'p': 'working on what?', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child body', 'o': 'Boötes II'}}

 Q: Which {streak color} is {solid solution series with} of {fayalite} ?
 SPARQL: SELECT ?answer WHERE { wd:Q411130 wdt:P2155 ?X . ?X wdt:P534 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'streak color', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'fayalite', 'p': 'solid solution series with', 'o': '$y0'}}

 Q: What is {date of birth} and {date of death} of {{Pedro I} has {child} as {Princess Maria Amélia of Brazil}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q235815 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Maria Amélia of Brazil'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Maria Amélia of Brazil'}}}]

 Q: When did Newfoundland and Labrador have a population of 519716 people?
 SPARQL: SELECT ?value WHERE { wd:Q2003 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'519716.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Newfoundland and Labrador', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '519716.0'}, 't': '?x0'}

 Q: What is {capable of inhibiting or preventing pathological process} of {prescribed drug} of {inflammation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q101991 wdt:P2176 ?X . ?X wdt:P2175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capable of inhibiting or preventing pathological process', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'inflammation', 'p': 'prescribed drug', 'o': '$y0'}}

 Q: what is the {point in time} for {The Band} has {award received} as {Canadian Music Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q600344 p:P166 ?s . ?s ps:P166 wd:Q3362499 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'The Band', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Canadian Music Hall of Fame'}, 't': '?x0'}

 Q: Which is the Phasmida Species File ID for Phasmatodea?
 SPARQL: select distinct ?answer where { wd:Q188029 wdt:P4855 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phasmatodea', 'p': 'Phasmida Species File ID', 'o': '?x0'}

 Q: What is {symbol} of {measure of} of {ångström} ?
 SPARQL: SELECT ?answer WHERE { wd:Q81454 wdt:P111 ?X . ?X wdt:P416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'angstrom', 'p': 'measure of', 'o': '$y0'}}

 Q: What was Davor Šuker's team in 1996?
 SPARQL: SELECT ?obj WHERE { wd:Q189217 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Davor Šuker', 'p': 'team', 'o': '?x0', 't': '1996'}

 Q: Who is the person that was student of Gottfried Wilhelm Leibniz?
 SPARQL:  select distinct ?obj where { wd:Q9047 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gottfried Wilhelm Leibniz', 'p': 'student of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is the {taxon} for {natural product of taxon} of {opium}
 SPARQL:  select distinct ?obj where { wd:Q46452 wdt:P1582 ?obj . ?obj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'opium', 'p': 'natural product of taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: What is {taxon parent} of {has causes} of {wound botulism} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18553251 wdt:P828 ?X . ?X wdt:P171 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'taxon parent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'wound botulism', 'p': 'cause', 'o': '$y0'}}

 Q: Which is Louisiana Sports Hall of Fame ID for Terry Bradshaw?
 SPARQL: select distinct ?answer where { wd:Q633263 wdt:P4367 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Terry Bradshaw', 'p': 'Louisiana Sports Hall of Fame ID', 'o': '?x0'}

 Q: What is from Dungeons & Dragons' fictional universe?
 SPARQL: select distinct ?answer where { ?answer wdt:P1080 wd:Q1375}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'universe', 'o': 'Dungeons & Dragons'}

 Q: Tell me a {character encoding} whinch includes the word {yuscii} in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q184759 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yuscii')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'character encoding'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yuscii'}}

 Q: What is {prime minister} of {comes from} of {Barefoot Gen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4347 wdt:P495 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prime minister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Barefoot Gen', 'p': 'comes from', 'o': '$y0'}}

 Q: What is {subitem of} of {history of Barbados}, that has {diplomatic relation} is {Nigeria} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2206741 wdt:P1269 ?answer . ?answer wdt:P530 wd:Q1033}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Barbados', 'p': 'subitem of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Nigeria'}}

 Q: What is long  lives in  John Keats ?
 SPARQL: SELECT ?answer WHERE { wd:Q82083 wdt:P551 ?X . ?X wdt:P2043 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'long', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Keats', 'p': 'lives in', 'o': '$y0'}}

 Q: What is {desired outcome} of {remake of} of {Half Moon replica} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42173625 wdt:P144 ?X . ?X wdt:P3712 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'desired outcome', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Half Moon replica', 'p': 'remake of', 'o': '$y0'}}

 Q: What are the form factor which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24574728 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'form factor'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What writer, born in Hamburg, wrote Curious George?
 SPARQL: SELECT ?answer WHERE { wd:Q5194776 wdt:P50 ?answer . ?answer wdt:P19 wd:Q1055}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Curious George', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Hamburg'}}

 Q: What is {year created} of {published by} of {The Funnies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1645141 wdt:P123 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'created', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Funnies', 'p': 'published by', 'o': '$y0'}}

 Q: Is the enthalpy of vaporization of nitric acid 46.92?
 SPARQL: ASK WHERE { wd:Q83320 wdt:P2116 ?obj filter(?obj = 46.92) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'nitric acid', 'p': 'enthalpy of vaporization', 'o': '?x0', '?x0': '46.92'}

