 Q: What is the {human} for {affiliation} of {Harvard University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1416 wd:Q13371 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'affiliated with', 'o': 'Harvard University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is original film format for Ultra-high-definition television ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3803 wd:Q841163}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'original film format', 'o': 'Ultra-high-definition television'}

 Q: What is the {Summer Olympic Games} for {participant of} of {Lance Armstrong}
 SPARQL:  select distinct ?obj where { wd:Q2172 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q159821 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lance Armstrong', 'p': 'participated in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Summer Olympic Games'}}

 Q: Which is the flood that the rain has effect in?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1542 wd:Q7925 . ?sbj wdt:P31 wd:Q8068 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has effect', 'o': 'rain', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flood'}}

 Q: When did David Beckham receive the PFA Team of the Year award?
 SPARQL: SELECT ?value WHERE { wd:Q10520 p:P166 ?s . ?s ps:P166 wd:Q2044044 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'David Beckham', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'PFA Team of the Year'}, 't': '?x0'}

 Q: In 1969-0-0 what is Greenland's population?
 SPARQL: SELECT ?obj WHERE { wd:Q223 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Greenland', 'p': 'population', 'o': '?x0', 't': '1969'}

 Q: Which is {in action} {passed by} {Residence Act} ?
 SPARQL: SELECT ?answer WHERE { wd:Q918175 wdt:P467 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in action', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Residence Act', 'p': 'passed by', 'o': '$y0'}}

 Q: What is {educated at} of {Nancy Pelosi} that is {academic major} is {political science} ?
 SPARQL: SELECT ?obj WHERE { wd:Q170581 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q36442 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nancy Pelosi', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'major', 'o': 'political science'}}}

 Q: Name a MediaWiki website located in Amsterdam that contains the word "wikipedia" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15633582 . ?sbj wdt:P276 wd:Q727 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wikipedia')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'MediaWiki website', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Amsterdam'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wikipedia'}}

 Q: What is {run time} of {cause of} of {human fertilization} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2666904 wdt:P1542 ?X . ?X wdt:P2047 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'length', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'human fertilization', 'p': 'cause of', 'o': '$y0'}}

 Q: What is the catalog for "A Love Supreme?"
 SPARQL: select distinct ?answer where { wd:Q5106 wdt:P972 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'A Love Supreme', 'p': 'catalog', 'o': '?x0'}

 Q: What are the newspaper which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ş')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newspaper'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ş'}}

 Q: What software version of Scala was published on June 23, 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q460584 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Scala', 'p': 'version', 'o': '?x0', 't': '2015'}

 Q: What is the {replaced by} and the {culture} of {Old_English} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q42365 wdt:P1366 ?ans_1 . wd:Q42365 wdt:P2596 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Old English', 'p': 'replaced by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Old English', 'p': 'culture', 'o': '?x1'}]

 Q: what is the {start time} for {Michael Schumacher} has {country for sport} as {Luxembourg} ?
 SPARQL: SELECT ?value WHERE { wd:Q9671 p:P1532 ?s . ?s ps:P1532 wd:Q32 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Schumacher', 'p': 'country for sport', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country for sport', 'o': 'Luxembourg'}}}

 Q: What is {birth location} of {Jerry O'Connell}, that has {mayor} is {John Lindsay} ?
 SPARQL: SELECT ?answer WHERE { wd:Q378672 wdt:P19 ?answer . ?answer wdt:P6 wd:Q666931}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Jerry O'Connell", 'p': 'birth location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mayor', 'o': 'John Lindsay'}}

 Q: Which is the SELIBR ID for Max Linder?
 SPARQL: select distinct ?answer where { wd:Q152764 wdt:P906 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Max Linder', 'p': 'SELIBR ID', 'o': '?x0'}

 Q: What is {academic major} and {academic degree} of {{Robert McNamara} has {educated at} as {University of California, Berkeley}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q191999 p:P69 ?s . ?s ps:P69 wd:Q168756 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert McNamara', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of California, Berkeley'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert McNamara', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of California, Berkeley'}}}]

 Q: What is {number of out of school children} of {neighborhood} of {Arab Spring} ?
 SPARQL: SELECT ?answer WHERE { wd:Q33761 wdt:P276 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arab Spring', 'p': 'location', 'o': '$y0'}}

 Q: what is the {start time} for {Benito Juárez} has {position held} as {President of Mexico} ?
 SPARQL: SELECT ?value WHERE { wd:Q182276 p:P39 ?s . ?s ps:P39 wd:Q628004 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benito Juárez', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Mexico'}}}

 Q: What is the {Christian denomination} for {religion} of {Eastern Orthodox Church}
 SPARQL:  select distinct ?obj where { wd:Q35032 wdt:P140 ?obj . ?obj wdt:P31 wd:Q879146 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eastern Orthodox Church', 'p': 'religion', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Christian denomination'}}

 Q: What is <solved by> of <Grigori Perelman> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1136 wd:Q117346}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'solved by', 'o': 'Grigori Perelman'}

 Q: Which applies to part of mitochondrial DNA?
 SPARQL: select distinct ?answer where { wd:Q27075 wdt:P518 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mitochondrial DNA', 'p': 'applies to part', 'o': '?x0'}

 Q: What is the {personal bibliography} for {list of works} of {Donald Trump}
 SPARQL:  select distinct ?obj where { wd:Q22686 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q26876682 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Donald Trump', 'p': 'list of works', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'personal bibliography'}}

 Q: what is the {point in time} for {Marcel Proust} has {significant event} as {funeral} ?
 SPARQL: SELECT ?value WHERE { wd:Q7199 p:P793 ?s . ?s ps:P793 wd:Q201676 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Proust', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'significant event', 'o': 'funeral'}, 't': '?x0'}

 Q: What is {participant of} of {Usain Bolt} that is {race time} is {37.36} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1189 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P2781 ?x filter(contains(?x,'37.36')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'participant of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Usain Bolt', 'p': 'participant of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'race time', 'o': '37.36'}}}

 Q: What is the {rare book library} for {archives at} of {James Joyce}
 SPARQL:  select distinct ?obj where { wd:Q6882 wdt:P485 ?obj . ?obj wdt:P31 wd:Q44234152 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Joyce', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rare book library'}}

 Q: is it true that the flux of the leo cluster is greater than 6.512e-11
 SPARQL: ASK WHERE { wd:Q2636046 wdt:P2221 ?obj filter(?obj > 6.512e-11) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Leo Cluster', 'p': 'flux', 'o': '?x0', '?x0': '6.512e-11'}

 Q: What is the {fictional empire} for {present in work} of {Star Wars Episode V: The Empire Strikes Back}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q181795 . ?sbj wdt:P31 wd:Q19595246 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Star Wars Episode V: The Empire Strikes Back', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional empire'}}

 Q: What is {written by} of {Taipei People}, that has {parent} is {Bai Chongxi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7676307 wdt:P50 ?answer . ?answer wdt:P22 wd:Q706491}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Taipei People', 'p': 'written by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'parent', 'o': 'Bai Chongxi'}}

 Q: When did member of sports team of Just Fontaine and number of points/goals/set scored?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Just Fontaine', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Just Fontaine', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: Which is the Wikimedia username for John Cena?
 SPARQL: select distinct ?answer where { wd:Q44437 wdt:P4174 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Cena', 'p': 'Wikimedia username', 'o': '?x0'}

 Q: what is the {start time} for {Lombardy} has {country} as {Kingdom of Italy} ?
 SPARQL: SELECT ?value WHERE { wd:Q1210 p:P17 ?s . ?s ps:P17 wd:Q172579 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lombardy', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Kingdom of Italy'}}}

 Q: What is {general manager} of {employed by} of {Karen Czarnecki} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6369578 wdt:P108 ?X . ?X wdt:P1037 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manager', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karen Czarnecki', 'p': 'works for', 'o': '$y0'}}

 Q: Tell me noble family whose name has the word usenberger in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'üsenberger')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble family'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'üsenberger'}}

 Q: What was Serena Williams nominated for in the time period of 2000-2009?
 SPARQL: SELECT ?obj WHERE { wd:Q11459 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Serena Williams', 'p': 'nominated for', 'o': '?x0', 't': '2009'}

 Q: When did Toots Thielemans receive the award octave d'honneur?
 SPARQL: SELECT ?value WHERE { wd:Q365567 p:P166 ?s . ?s ps:P166 wd:Q26481897 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Toots Thielemans', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': "octave d'honneur"}, 't': '?x0'}

 Q: What is {developer} of {has outcome} of {protoplanetary disk} ?
 SPARQL: SELECT ?answer WHERE { wd:Q505781 wdt:P1542 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'developer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'protoplanetary disk', 'p': 'has outcome', 'o': '$y0'}}

 Q: What is an archaeological site located in Bodrum with the word "mausoleum" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj wdt:P131 wd:Q172267 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mausoleum')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archaeological site', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Bodrum'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'mausoleum'}}

 Q: What is the field of study and architectural style of Ramos de Azevedo?
 SPARQL: SELECT ?answer WHERE { wd:Q9300159 wdt:P149 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of study', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramos de Azevedo', 'p': 'architectural style', 'o': '$y0'}}

 Q: How many {illustrator} are to/by {Hirohiko Araki} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P110 wd:Q719354 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'illustrator', 'o': 'Hirohiko Araki'}

 Q: What's the programming paradigm of the MXE language?
 SPARQL: SELECT ?answer WHERE { wd:Q28671337 wdt:P277 ?X . ?X wdt:P3966 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'programming paradigm', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'MXE', 'p': 'language', 'o': '$y0'}}

 Q: What is the {clan} for {family} of {Genghis Khan}
 SPARQL:  select distinct ?obj where { wd:Q720 wdt:P53 ?obj . ?obj wdt:P31 wd:Q211503 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genghis Khan', 'p': 'family', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'clan'}}

 Q: By what method was it determined that Cordoba has a population of 322867?
 SPARQL: SELECT ?value WHERE { wd:Q5818 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'322867.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cordoba', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '322867.0'}}}

 Q: When did Plzeň receive the European Capital of Culture award?
 SPARQL: SELECT ?value WHERE { wd:Q43453 p:P166 ?s . ?s ps:P166 wd:Q129372 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Plzeň', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'European Capital of Culture'}, 't': '?x0'}

 Q: Is Janet Jackson, the performer, single?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P175 wd:Q131324 . ?sbj wdt:P31 wd:Q134556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Janet Jackson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single'}}

 Q: What city in New York was Martin Balsam born in?
 SPARQL: SELECT ?obj WHERE { wd:Q312107 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Balsam', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'New York'}}}

 Q: What is {shareholder} of {CRRC}, that has {exchange} is {New York Stock Exchange} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19840026 wdt:P127 ?answer . ?answer wdt:P414 wd:Q13677}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'CRRC', 'p': 'shareholder', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'exchange', 'o': 'New York Stock Exchange'}}

 Q: Is Kurt Cobain a member of Nirvana?
 SPARQL: ASK WHERE { wd:Q8446 wdt:P463 wd:Q11649 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kurt Cobain', 'p': 'member of', 'o': '?x0', '?x0': 'Nirvana'}]

 Q: What is next to Missouri and divides into Calloway County?
 SPARQL: SELECT ?answer WHERE { wd:Q1581 wdt:P47 ?answer . ?answer wdt:P150 wd:Q491927}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Missouri', 'p': 'next to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divides into', 'o': 'Calloway County'}}

 Q: Tell me fungal part whose name has the word stroma in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56883667 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'stroma')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fungal part'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'stroma'}}

 Q: What is {work} of {writers} of {The Blue Lotus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76210 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Blue Lotus', 'p': 'writer', 'o': '$y0'}}

 Q: What is the scalar physical quantity measured in joules?
 SPARQL:  select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q181175 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'joule', 'p': 'quantity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scalar'}}

 Q: Give me {music genre} that {permanent duplicated item} {black doom} and which contains the word {black} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj wdt:P2959 wd:Q1868278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'black')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'music genre', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'permanent duplicated item', 'o': 'black doom'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'black'}}

 Q: Which is the image of grave of Jean-Pierre Melville?
 SPARQL: select distinct ?answer where { wd:Q168693 wdt:P1442 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean-Pierre Melville', 'p': 'image of grave', 'o': '?x0'}

 Q: The Indianapolis 500 is held at which race track?
 SPARQL:  select distinct ?obj where { wd:Q8032 wdt:P276 ?obj . ?obj wdt:P31 wd:Q1777138 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Indianapolis 500', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'race track'}}

 Q: Is the cash back of Amazon.de VISA Card equal to 0.4?
 SPARQL: ASK WHERE { wd:Q56510643 wdt:P4448 ?obj filter(?obj = 0.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Amazon.de VISA Card', 'p': 'cash back', 'o': '?x0', '?x0': '0.4'}

 Q: What is {career} of {architecture firm} of {Victoria Bridge} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2890014 wdt:P84 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'career', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victoria Bridge', 'p': 'architect', 'o': '$y0'}}

 Q: what is the {start time} for {Nauru} has {member of} as {Asian Development Bank} ?
 SPARQL: SELECT ?value WHERE { wd:Q697 p:P463 ?s . ?s ps:P463 wd:Q188822 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nauru', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Asian Development Bank'}}}

 Q: What is {member of sports team} of {Rinus Michels} that is {number of matches played} is {5.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter(contains(?x,'5.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rinus Michels', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'matches played', 'o': '5.0'}}}

 Q: Which sports team did Inzamam-ul-Haq start on in 1992?
 SPARQL: SELECT ?obj WHERE { wd:Q1393201 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Inzamam-ul-Haq', 'p': 'team', 'o': '?x0', 't': '1992'}

 Q: What is the name of this isolated human group that contain the word "wenrohronon" in their name ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3117863 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wenrohronon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isolated human group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wenrohronon'}}

 Q: What is the {colony} for {official language} of {Dutch}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q7411 . ?sbj wdt:P31 wd:Q133156 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Dutch', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'colony'}}

 Q: What is {nominated for} of {Alexandre Desplat} that is {for work} is {Argo} ?
 SPARQL: SELECT ?obj WHERE { wd:Q313362 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q59653 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexandre Desplat', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Argo'}}}

 Q: Name an instruction set architecture designed by Intel and that contains the word "x86" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj wdt:P287 wd:Q248 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'x86')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'instruction set architecture', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Intel'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'x86'}}

 Q: What is {resident in} of {Mirza Ghalib}, that has {continent} is {Asia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q107000 wdt:P551 ?answer . ?answer wdt:P30 wd:Q48}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mirza Ghalib', 'p': 'resident in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'Asia'}}

 Q: Who is the winner for High Noon who was awarded as Academy Award for Best Film Editing?
 SPARQL: SELECT ?value WHERE { wd:Q245208 p:P166 ?s . ?s ps:P166 wd:Q281939 . ?s pq:P1346 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'winner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'High Noon', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Academy Award for Best Film Editing'}}}

 Q: Which is the school of Mahendra Singh Dhoni?
 SPARQL: select distinct ?answer where { wd:Q470774 wdt:P1780 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mahendra Singh Dhoni', 'p': 'school of', 'o': '?x0'}

 Q: What award did Simone de Beauvoir receive in 1975?
 SPARQL: SELECT ?obj WHERE { wd:Q7197 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Simone de Beauvoir', 'p': 'award', 'o': '?x0', 't': '1975'}

 Q: What is the capital of the Achaemenid Empire?
 SPARQL:  select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Achaemenid Empire', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: What democratic republic country had the Watergate scandal?
 SPARQL:  select distinct ?obj where { wd:Q42761 wdt:P17 ?obj . ?obj wdt:P31 wd:Q5255892 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Watergate scandal', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'democratic republic'}}

 Q: What is {public domain date} of {Metropolis} that is {applies to jurisdiction} is {United States of America} ?
 SPARQL: SELECT ?obj WHERE { wd:Q151599 p:P3893 ?s . ?s ps:P3893 ?obj . ?s pq:P1001 wd:Q30 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'public domain date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Metropolis', 'p': 'public domain date', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to jurisdiction', 'o': 'the United States'}}}

 Q: What is {academic major} and {academic degree} of {{Franz Kafka} has {educated at} as {Karl-Ferdinands-Universität}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q905 p:P69 ?s . ?s ps:P69 wd:Q1729754 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Kafka', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Karl-Ferdinands-Universität'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Kafka', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Karl-Ferdinands-Universität'}}}]

 Q: Which is the Sratim ID for Breakfast at Tiffany's?
 SPARQL: select distinct ?answer where { wd:Q193066 wdt:P3145 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Breakfast at Tiffany's", 'p': 'Sratim ID', 'o': '?x0'}

 Q: what is the {point in time} for {Eduardo Chillida} has {award received} as {Princess of Asturias Award for the Arts} ?
 SPARQL: SELECT ?value WHERE { wd:Q156736 p:P166 ?s . ?s ps:P166 wd:Q3319305 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Eduardo Chillida', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Princess of Asturias Award for the Arts'}, 't': '?x0'}

 Q: what is the {start time} for {Antioch on the Orontes} has {located in the administrative territorial entity} as {Antakya} ?
 SPARQL: SELECT ?value WHERE { wd:Q200441 p:P131 ?s . ?s ps:P131 wd:Q80561 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antioch on the Orontes', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Antakya'}}}

 Q: What is {pronunciation audio} of {culinary mustard} that is {language of work or name} is {Dutch} ?
 SPARQL: SELECT ?obj WHERE { wd:Q131748 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7411 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mustard', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'Dutch'}}}

 Q: Which is the colonial power of the country of pound sterling?
 SPARQL:  select distinct ?obj where { wd:Q25224 wdt:P17 ?obj . ?obj wdt:P31 wd:Q20181813 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pound sterling', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'colonial power'}}

 Q: When did Dijon have a population of 155114?
 SPARQL: SELECT ?value WHERE { wd:Q7003 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'155114')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dijon', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '155114'}, 't': '?x0'}

 Q: Was David Attenborough given name Frederick?
 SPARQL: ASK WHERE { wd:Q183337 wdt:P735 wd:Q3273004 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'David Attenborough', 'p': 'given name', 'o': '?x0', '?x0': 'Frederick'}]

 Q: What significant event happened when Anna Wintour was experiencing childbirth?
 SPARQL: SELECT ?value WHERE { wd:Q230744 p:P793 ?s . ?s ps:P793 wd:Q34581 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Anna Wintour', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'significant event', 'o': 'childbirth'}, 't': '?x0'}

 Q: What was named for Herschel Space Observatory that has a birthday of 3-16-1750?
 SPARQL: SELECT ?answer WHERE { wd:Q209630 wdt:P138 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1750'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Herschel Space Observatory', 'p': 'named for', 'o': '?x0', 't': '1750'}

 Q: What is the {human} for {replaced by} of {Ayman al-Zawahiri}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1366 wd:Q186316 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Ayman al-Zawahiri', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the heavy equipment that starts with t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q874311 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'heavy equipment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {country of citizenship} of {Thomas Paine} that is {end time} is {1792-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q126462 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1792')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thomas Paine', 'p': 'country of citizenship', 'o': '?x0', 't': '1792'}

 Q: What is {position held} of {Jacqueline Kennedy Onassis} that is {replaces} is {Mamie Eisenhower} ?
 SPARQL: SELECT ?obj WHERE { wd:Q165421 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q233686 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacqueline Kennedy Onassis', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Mamie Eisenhower'}}}

