 Q: What is the sister city of Ivan Turgenev's hometown?
 SPARQL: SELECT ?answer WHERE { wd:Q42831 wdt:P551 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ivan Turgenev', 'p': 'hometown', 'o': '$y0'}}

 Q: Is a black hole the opposite of a stellar atmosphere?
 SPARQL: ASK WHERE { wd:Q589 wdt:P461 wd:Q6311 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'black hole', 'p': 'opposite of', 'o': '?x0', '?x0': 'stellar atmosphere'}]

 Q: Did Francis Ford Coppola have notable works of The Godfather and The Godfather Part III?
 SPARQL: ASK WHERE { wd:Q56094 wdt:P800 wd:Q47703 . wd:Q56094 wdt:P800 wd:Q202326 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Francis Ford Coppola', 'p': 'notable work', 'o': '?x0', '?x0': 'The Godfather'}, {'h': 'IS', 'v': '?x1', 's': 'Francis Ford Coppola', 'p': 'notable work', 'o': '?x1', '?x1': 'The Godfather Part III'}]

 Q: tell me audio and video interfaces and connectors are name has the word ypbpr in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ypbpr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'audio and video interfaces and connectors'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ypbpr'}}

 Q: What is the official language of lives in Pasi Siltakorpi?
 SPARQL: SELECT ?answer WHERE { wd:Q28786447 wdt:P551 ?X . ?X wdt:P37 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pasi Siltakorpi', 'p': 'lives in', 'o': '$y0'}}

 Q: How many colors are next to brown
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P462 wd:Q47071 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'color', 'o': 'brown'}

 Q: What is the {pharmaceutical product} for {active ingredient in} of {erythromycin}
 SPARQL:  select distinct ?obj where { wd:Q213511 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'erythromycin', 'p': 'active ingredient in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pharmaceutical product'}}

 Q: Is the PPP GDP per capita of Lithuania less than 22148.8
 SPARQL: ASK WHERE { wd:Q37 wdt:P2299 ?obj filter(?obj < 22148.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Lithuania', 'p': 'PPP GDP per capita', 'o': '?x0', '?x0': '22148.8'}

 Q: Is the topographic prominence of the Franzosenkopf less than 4.0?
 SPARQL: ASK WHERE { wd:Q1450459 wdt:P2660 ?obj filter(?obj < 4.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Franzosenkopf', 'p': 'topographic prominence', 'o': '?x0', '?x0': '4.0'}

 Q: What is the {Chinese dynasty} for {replaced by} of {Yuan dynasty}
 SPARQL:  select distinct ?obj where { wd:Q7313 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q12857432 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yuan', 'p': 'replaced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Chinese dynasty'}}

 Q: What is {pronunciation audio} of {constructed out of} of {meat pie} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5367573 wdt:P186 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'meat pie', 'p': 'constructed out of', 'o': '$y0'}}

 Q: Where is the human place of birth in Thessaloniki?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P19 wd:Q17151 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of birth', 'o': 'Thessaloniki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is Anthony Vivaldi's CPDL ID?
 SPARQL: select distinct ?answer where { wd:Q1340 wdt:P2000 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vivaldi', 'p': 'CPDL ID', 'o': '?x0'}

 Q: what is the {academic degree} for {John Grisham} has {educated at} as {University of Mississippi School of Law} ?
 SPARQL: SELECT ?value WHERE { wd:Q106465 p:P69 ?s . ?s ps:P69 wd:Q14693404 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Grisham', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Mississippi School of Law'}}}

 Q: Who else participated in Deep Blue with top dog Cray Blitz?
 SPARQL: SELECT ?answer WHERE { wd:Q187899 wdt:P1344 ?answer . ?answer wdt:P1346 wd:Q937297}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Deep Blue', 'p': 'participated in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'top dog', 'o': 'Cray Blitz'}}

 Q: What is GACS ID for West Africa?
 SPARQL: select distinct ?answer where { wd:Q4412 wdt:P4427 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'West Africa', 'p': 'GACS ID', 'o': '?x0'}

 Q: How many armament does the aircraft has?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P520 wd:Q11436 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'armament', 'o': 'aircraft'}

 Q: What is {educated at} of {Katherine Dunham} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katherine Dunham', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katherine Dunham', 'p': 'educated at', 'o': '$y0'}}]

 Q: How many input methods are on a computer keyboard?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P479 wd:Q250 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'input method', 'o': 'computer keyboard'}

 Q: Give me {cryptocurrency} that {stock exchange} {Bitfinex} and which contains the word {neo} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P414 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'crypto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'stock exchange', 'o': 'Bitfinex'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'neo'}}

 Q: What is the {opposite of} and the {named after} of {Jews} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q7325 wdt:P461 ?ans_1 . wd:Q7325 wdt:P138 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Jews', 'p': 'opposite of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Jews', 'p': 'named after', 'o': '?x1'}]

 Q: What is the {chemical compound} with the {MAX(explosive velocity)} whose {subject has role} is {explosive material}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj . ?ent wdt:P2868 wd:Q12870 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'explosive velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'as', 'o': 'explosive'}}}

 Q: Is the human genome size more than 3881796000?
 SPARQL: ASK WHERE { wd:Q720988 wdt:P2143 ?obj filter(?obj > 3881796000.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'human genome', 'p': 'genome size', 'o': '?x0', '?x0': '3881796000.0'}

 Q: Where is the drainage basin of the Brazos River?
 SPARQL: select distinct ?answer where { wd:Q903306 wdt:P4614 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Brazos River', 'p': 'drainage basin', 'o': '?x0'}

 Q: What is the {human} for {doctoral advisor} of {C. V. Raman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P184 wd:Q60429 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'doctoral advisor', 'o': 'C. V. Raman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {viceroy} for {office held by head of state} of {Tasmania}
 SPARQL:  select distinct ?obj where { wd:Q34366 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q244741 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tasmania', 'p': 'office held by head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'viceroy'}}

 Q: what is the {applies to part} for {Kolyma River} has {coordinate location} as {161.364} ?
 SPARQL: SELECT ?value WHERE { wd:Q78879 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'161.364')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kolyma', 'p': 'coordinates', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'coordinates', 'o': '161.364'}}}

 Q: What is the court and application of jurisdiction of Roe v. Wade?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P4884 ?ans_1 . wd:Q300950 wdt:P1001 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Roe v. Wade', 'p': 'court', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Roe v. Wade', 'p': 'of jurisdiction', 'o': '?x1'}]

 Q: What are the phantom island which start with the letter T
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phantom island'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {urban municipality of Germany} for {twinned administrative body} of {Cardiff}
 SPARQL:  select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q42744322 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardiff', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'urban municipality of Germany'}}

 Q: What is {position held} of {David Lloyd George} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q134982 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Lloyd George', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Lloyd George', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {portrait of} of {pendant to} of {Woman Drinking Wine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q32995247 wdt:P1639 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'portrait of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Woman Drinking Wine', 'p': 'pendant to', 'o': '$y0'}}

 Q: What is the {taxon} for {has effect} of {cholera}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1542 wd:Q12090 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has effect', 'o': 'cholera', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: Did {Schutzstaffel} {subsidiary} {Reich Main Security Office} and {21st Waffen Mountain Division of the SS Skanderbeg} ?
 SPARQL: ASK WHERE { wd:Q44687 wdt:P355 wd:Q152698 . wd:Q44687 wdt:P355 wd:Q160776 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Schutzstaffel', 'p': 'subsidiary', 'o': '?x0', '?x0': 'Reich Main Security Office'}, {'h': 'IS', 'v': '?x1', 's': 'Schutzstaffel', 'p': 'subsidiary', 'o': '?x1', '?x1': '21st Waffen Mountain Division of the SS Skanderbeg'}]

 Q: When did Supernatural win the Favorite Pop/Rock Album award?
 SPARQL: SELECT ?value WHERE { wd:Q819127 p:P166 ?s . ?s ps:P166 wd:Q19858080 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Supernatural', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Favorite Pop/Rock Album'}, 't': '?x0'}

 Q: What is the {international organization} for {subsidiary} of {World Bank}
 SPARQL:  select distinct ?obj where { wd:Q7164 wdt:P355 ?obj . ?obj wdt:P31 wd:Q484652 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'World Bank', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international organization'}}

 Q: What was the population of Aysén Region from 1992-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q2181 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aysén Region', 'p': 'population', 'o': '?x0', 't': '1992'}

 Q: Give me {historical process} that starts with {'g'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16622264 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical process'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: What is {position held} of {John Major} and {end cause}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9559 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Major', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Major', 'p': 'position held', 'o': '$y0'}}]

 Q: Matthias Sindelar who has number of points/goals/set scored as 26.0 is a member of which sports team ?
 SPARQL: SELECT ?obj WHERE { wd:Q312865 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter(contains(?x,'26.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Matthias Sindelar', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '26.0'}}}

 Q: Give me {traditional fairy tale} that contains the word {snow} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42402646 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'snow')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'traditional fairy tale'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'snow'}}

 Q: Which award did One Piece receive in 2009?
 SPARQL: SELECT ?obj WHERE { wd:Q673 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'One Piece', 'p': 'award', 'o': '?x0', 't': '2009'}

 Q: What is the number of original networks owned by the Discovery Channel?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P449 wd:Q43404 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'network', 'o': 'Discovery Channel'}

 Q: What is {parent of} of {is son of} of {Francesco I Sforza} ?
 SPARQL: SELECT ?answer WHERE { wd:Q310536 wdt:P25 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francesco I Sforza', 'p': 'parent', 'o': '$y0'}}

 Q: what is the {applies to part} for {Po} has {coordinate location} as {12.5469} ?
 SPARQL: SELECT ?value WHERE { wd:Q643 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'12.5469')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Po', 'p': 'location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'location', 'o': '12.5469'}}}

 Q: What are the fictional detective which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional detective'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: "Who is {nomination received} of {George Marshall}, which has {champion} is {Mikhail Gorbachev} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q151414 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q30487}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Marshall', 'p': 'nomination received', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'champion', 'o': 'Mikhail Gorbachev'}}

 Q: Who is the showrunner of The Apprentice, who also has a sister called Robert Trump?
 SPARQL: SELECT ?answer WHERE { wd:Q863122 wdt:P1431 ?answer . ?answer wdt:P3373 wd:Q28748031}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Apprentice', 'p': 'showrunner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister', 'o': 'Robert Trump'}}

 Q: Were Dutch and Hungarian the official languages of the Holy Roman Empire?
 SPARQL: ASK WHERE { wd:Q12548 wdt:P37 wd:Q7411 . wd:Q12548 wdt:P37 wd:Q9067 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Holy Roman Empire', 'p': 'official language', 'o': '?x0', '?x0': 'Dutch'}, {'h': 'IS', 'v': '?x1', 's': 'Holy Roman Empire', 'p': 'official language', 'o': '?x1', '?x1': 'Hungarian'}]

 Q: What type of clothing do the characters in The Silent Stars Go By wear?
 SPARQL: SELECT ?answer WHERE { wd:Q7764234 wdt:P674 ?X . ?X wdt:P3828 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'clothing', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Silent Stars Go By', 'p': 'characters', 'o': '$y0'}}

 Q: What is {pronunciation audio} of {coffee} that is {language of work or name} is {Georgian} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8486 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q8108 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'coffee', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language', 'o': 'Georgian'}}}

 Q: tell me demigod of Greek mythology wears hide  starts with h
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015925 . ?sbj wdt:P3828 wd:Q3291230 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'demigod of Greek mythology', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wears', 'o': 'hide'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What is {cardinality of this set} of {input set} of {complex logarithm} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2520206 wdt:P1851 ?X . ?X wdt:P2820 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cardinality of this set', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'complex logarithm', 'p': 'input set', 'o': '$y0'}}

 Q: Tell me the famine which starts with the letter t?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'famine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {directs} of {political office held} of {Eduardo López-Dóriga} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55547556 wdt:P39 ?X . ?X wdt:P2389 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'directs', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eduardo López-Dóriga', 'p': 'political office held', 'o': '$y0'}}

 Q: What is {position held} of {Ramsay MacDonald} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ramsay MacDonald', 'p': 'position held', 'o': '$y0'}}]

 Q: tell me about thoracic disease that contains the word syndrome in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syndrome')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'thoracic disease'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'syndrome'}}

 Q: What is <World Heritage Tentative List ID> of <University of Tehran> ?
 SPARQL: select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Tehran', 'p': 'World Heritage Tentative List ID', 'o': '?x0'}

 Q: what is the {language of work or name} for {Os Lusíadas} has {translator} as {Juan González de la Pezuela y Ceballos} ?
 SPARQL: SELECT ?value WHERE { wd:Q781898 p:P655 ?s . ?s ps:P655 wd:Q1710495 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Os Lusíadas', 'p': 'translator', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'translator', 'o': 'Juan González de la Pezuela y Ceballos'}}}

 Q: "Who is {tenant} of {Windsor Castle}, that has {employment} as {postage stamp designer} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q42646 wdt:P466 ?answer . ?answer wdt:P106 wd:Q2000124}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Windsor Castle', 'p': 'tenant', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'employment', 'o': 'postage stamp designer'}}

 Q: what is the {end time} for {Veronica Lake} has {spouse} as {André de Toth} ?
 SPARQL: SELECT ?value WHERE { wd:Q84232 p:P26 ?s . ?s ps:P26 wd:Q518244 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Veronica Lake', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'André de Toth'}}}

 Q: which was the series ordinal  for ether which has  ionization energy as 9.53?
 SPARQL: SELECT ?value WHERE { wd:Q202218 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'9.53')) . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ether', 'p': 'ionization energy', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'ionization energy', 'o': '9.53'}}}

 Q: Is normal distribution named after Bernhard Riemann?
 SPARQL: ASK WHERE { wd:Q133871 wdt:P138 wd:Q42299 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'normal distribution', 'p': 'named after', 'o': '?x0', '?x0': 'Bernhard Riemann'}]

 Q: Is the apoapsis of the Aotearoa 3400 equal to 2.126?
 SPARQL: ASK WHERE { wd:Q151503 wdt:P2243 ?obj filter(?obj = 2.126) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Aotearoa', 'p': 'apoapsis', 'o': '?x0', '?x0': '2.126'}

 Q: What is the {Bourbon whiskey} with the {MIN(alcohol by volume)} whose {country of origin} is {United States of America}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q543127 . ?ent wdt:P2665 ?obj . ?ent wdt:P495 wd:Q30} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'alcohol by volume', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Bourbon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of origin', 'o': 'United States of America'}}}

 Q: What is the genetic association of major depressive disorder with the determination method TAS?
 SPARQL: SELECT ?obj WHERE { wd:Q42844 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'major depressive disorder', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'TAS'}}}

 Q: what is the {end time} for {Korea} has {country} as {Later Three Kingdoms} ?
 SPARQL: SELECT ?value WHERE { wd:Q18097 p:P17 ?s . ?s ps:P17 wd:Q698268 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Korea', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Later Three Kingdoms'}}}

 Q: What book series did the author Dante Alighieri write?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q277759 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Dante Alighieri', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book series'}}

 Q: Tell me biogeochemical cycle whose name has the word cycle in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cycle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biogeochemical cycle'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cycle'}}

 Q: What business, product, or material does Facebook offer?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'product', 'o': 'Facebook', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: Give me {association football club} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'association football club'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Into how many editions has Othello been translated?
 SPARQL:  select distinct ?obj where { wd:Q26833 wdt:P747 ?obj . ?obj wdt:P31 wd:Q39811647 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Othello', 'p': 'editions', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'translated'}}

 Q: What is {result} of {found in species} of {hypothetical protein lpg2828} ?
 SPARQL: SELECT ?answer WHERE { wd:Q22333459 wdt:P703 ?X . ?X wdt:P1542 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'result', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hypothetical protein', 'p': 'found in species', 'o': '$y0'}}

 Q: What is {educated at} and {field of work} of {{Dimitri Mendeleyev} has {academic degree} as {professor}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q9106 p:P512 ?s . ?s ps:P512 wd:Q121594 . ?s pq:P69 ?value1 . ?s pq:P101 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dimitri Mendeleyev', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'professor'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'field of work', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dimitri Mendeleyev', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'professor'}}}]

 Q: What team did Peter Schmeichel start playing for in 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Peter Schmeichel', 'p': 'team', 'o': '?x0', 't': '1984'}

 Q: Where is the name of the continent of the mountain belt in Mount Caywood?
 SPARQL: SELECT ?answer WHERE { wd:Q6920087 wdt:P4552 ?X . ?X wdt:P30 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mount Caywood', 'p': 'mountain belt', 'o': '$y0'}}

 Q: Did {Mexico_City} {contains administrative territorial entity} {Azcapotzalco}?
 SPARQL: ASK WHERE { wd:Q1489 wdt:P150 wd:Q994867 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mexico City', 'p': 'contains administrative territorial entity', 'o': '?x0', '?x0': 'Azcapotzalco'}]

 Q: Which are the grants academic degrees for Master of Business Administration?
 SPARQL: select distinct ?answer where { ?answer wdt:P5460 wd:Q191701}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'grants', 'o': 'Master of Business Administration'}

 Q: what was the country of Tyumen in 1991-12-27
 SPARQL: SELECT ?obj WHERE { wd:Q5815 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tyumen', 'p': 'country', 'o': '?x0', 't': '1991'}

 Q: What is {genetic association} of {regulates (molecular biology)} of {hsa-miR-5006-3p} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27593301 wdt:P128 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'hsa-miR-5006-3p', 'p': 'regulates (molecular biology)', 'o': '$y0'}}

 Q: Is the toughness of Grivory GM-4H less than 7.2?
 SPARQL: ASK WHERE { wd:Q57051271 wdt:P5520 ?obj filter(?obj < 7.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Grivory GM-4H', 'p': 'toughness', 'o': '?x0', '?x0': '7.2'}

 Q: Give me {scale of temperature} that {measured physical quantity} {temperature} and which that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2394680 . ?sbj wdt:P111 wd:Q11466 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scale of temperature', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured physical quantity', 'o': 'temperature'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is the temperature of toxaphene that has a density of 1.65?
 SPARQL: SELECT ?value WHERE { wd:Q417157 p:P2054 ?s . ?s ps:P2054 ?x filter(contains(?x,'1.65')) . ?s pq:P2076 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'temperature', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'toxaphene', 'p': 'density', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'density', 'o': '1.65'}}}

 Q: "What is name of John Foster Dulles Latin script that has alphabet?"
 SPARQL: SELECT ?answer WHERE { wd:Q223677 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Foster Dulles', 'p': 'name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alphabet', 'o': 'Latin script'}}

 Q: Is Ridley Scott the child of Luke Scott and Jordan Scott?
 SPARQL: ASK WHERE { wd:Q56005 wdt:P40 wd:Q21066699 . wd:Q56005 wdt:P40 wd:Q452925 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Ridley Scott', 'p': 'child', 'o': '?x0', '?x0': 'Luke Scott'}, {'h': 'IS', 'v': '?x1', 's': 'Ridley Scott', 'p': 'child', 'o': '?x1', '?x1': 'Jordan Scott'}]

