 Q: How many {participant of} are for {Steffi Graf} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q11662 wdt:P1344 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Steffi Graf', 'p': 'participant of', 'o': '?x0'}

 Q: What is MobyGames group ID for The Sims ?
 SPARQL: select distinct ?answer where { wd:Q4897444 wdt:P5360 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Sims', 'p': 'MobyGames group ID', 'o': '?x0'}

 Q: Is the event distance of the diaulos equal to 0.8?
 SPARQL: ASK WHERE { wd:Q631917 wdt:P3157 ?obj filter(?obj = 0.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'diaulos', 'p': 'event distance', 'o': '?x0', '?x0': '0.8'}

 Q: Was Website software engine Microsoft?
 SPARQL: ASK WHERE { wd:Q35127 wdt:P408 wd:Q2283 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'site', 'p': 'software engine', 'o': '?x0', '?x0': 'Microsoft'}]

 Q: What are the integer which start with the letter i
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12503 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '1')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'integer'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': '1'}}

 Q: What is {has cities} of {county seat of} of {Catania} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1903 wdt:P1376 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has cities', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Catania', 'p': 'county seat of', 'o': '$y0'}}

 Q: Where is the location born of Mischa Maisky, which is adjacent to the Mārupe Municipality?
 SPARQL: SELECT ?answer WHERE { wd:Q381759 wdt:P19 ?answer . ?answer wdt:P47 wd:Q2232018}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mischa Maisky', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'adjacent to', 'o': 'Mārupe Municipality'}}

 Q: What is {opposite} of {manifestation of} of {figure of the Earth} ?
 SPARQL: SELECT ?answer WHERE { wd:Q437882 wdt:P1557 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'figure of the Earth', 'p': 'manifestation of', 'o': '$y0'}}

 Q: How many {owner of} are for {Nissan} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q20165 wdt:P1830 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Nissan', 'p': 'owner of', 'o': '?x0'}

 Q: What is {county seat of} of {Hamilton}, that has {inhabitants} is {51000.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q30985 wdt:P1376 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'51000.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hamilton', 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '51000.0'}}

 Q: What is {location} and {height} of {{pole vault} has {record held} as {Eliza McCartney}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q18011042 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Eliza McCartney'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'height', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pole vault', 'p': 'record held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'record held', 'o': 'Eliza McCartney'}}}]

 Q: What file format is used by the programming language SQL?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P277 wd:Q47607 . ?sbj wdt:P31 wd:Q235557 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'programming language', 'o': 'SQL', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'file format'}}

 Q: Which is measured by  quantity of erg ?
 SPARQL: SELECT ?answer WHERE { wd:Q185153 wdt:P111 ?X . ?X wdt:P1880 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'measured by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'erg', 'p': 'quantity', 'o': '$y0'}}

 Q: What is the {human} for {relative} of {Kate Spade}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1038 wd:Q275094 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'relative', 'o': 'Kate Spade', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the political party that Hillary Clinton is a member of?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q6294 wdt:P463 ?ans_1 . wd:Q6294 wdt:P102 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hillary Clinton', 'p': 'member of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hillary Clinton', 'p': 'party', 'o': '?x1'}]

 Q: What is the {organization} for {member of} of {Alexander Pushkin}
 SPARQL:  select distinct ?obj where { wd:Q7200 wdt:P463 ?obj . ?obj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexander Pushkin', 'p': 'member of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: What game platform of Pac-Man has the latest release version of 4.2.6?
 SPARQL: SELECT ?answer WHERE { wd:Q173626 wdt:P400 ?answer . ?answer wdt:P348 ?x FILTER(contains(?x,'4.2.6'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pac-Man', 'p': 'platform', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'version', 'o': '4.2.6'}}

 Q: Which is a by-product of offal?
 SPARQL: select distinct ?answer where { wd:Q157484 wdt:P2822 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'offal', 'p': 'by-product of', 'o': '?x0'}

 Q: what is the {official name} for {Taos Pueblo} has {heritage designation} as {World Heritage Site} ?
 SPARQL: SELECT ?value WHERE { wd:Q252814 p:P1435 ?s . ?s ps:P1435 wd:Q9259 . ?s pq:P1448 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taos Pueblo', 'p': 'heritage designation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'heritage designation', 'o': 'World Heritage Site'}}}

 Q: what is the {applies to part} for {Jordan River} has {coordinate location} as {35.5583} ?
 SPARQL: SELECT ?value WHERE { wd:Q40059 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'35.5583')) . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jordan River', 'p': 'coordinates', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'coordinates', 'o': '35.5583'}}}

 Q: What is {distinguished from} of {necktie}, that has {height} is {607.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44416 wdt:P1889 ?answer . ?answer wdt:P2044 ?x FILTER(contains(?x,'607.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'tie', 'p': 'distinguished from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'height', 'o': '607.0'}}

 Q: Which color appears in Rocketeer?
 SPARQL: SELECT ?answer WHERE { wd:Q13476036 wdt:P1441 ?X . ?X wdt:P462 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'color', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rocketeer', 'p': 'appears in', 'o': '$y0'}}

 Q: How many leagues are in the National Hockey League?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P118 wd:Q1215892 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'league', 'o': 'National Hockey League'}

 Q: what is the {start time} for {Clive Palmer} has {member of political party} as {Liberal National Party of Queensland} ?
 SPARQL: SELECT ?value WHERE { wd:Q550879 p:P102 ?s . ?s ps:P102 wd:Q1822905 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Clive Palmer', 'p': 'member of political party', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of political party', 'o': 'Liberal National Party of Queensland'}}}

 Q: What political border does the Congress of Vienna have cause to be interested in?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q1292279 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause', 'o': 'Congress of Vienna', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political border'}}

 Q: How many {sports discipline competed in} are to/by {foil} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2416 wd:Q471447 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sports discipline competed in', 'o': 'foil'}

 Q: What is capital of Ōtsu ?
 SPARQL: select distinct ?answer where { wd:Q202907 wdt:P1376 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ōtsu', 'p': 'capital of', 'o': '?x0'}

 Q: What is the namesake of the Riemann zeta function, which has the Cauchy–Euler equation in its significant works?
 SPARQL: SELECT ?answer WHERE { wd:Q187235 wdt:P138 ?answer . ?answer wdt:P800 wd:Q1196465}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Riemann zeta function', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'work', 'o': 'Cauchy–Euler equation'}}

 Q: What is the INEGI municipality ID of Tlalnepantla de Baz?
 SPARQL: select distinct ?answer where { wd:Q845307 wdt:P3801 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tlalnepantla de Baz', 'p': 'INEGI municipality ID', 'o': '?x0'}

 Q: what is the {start time} for {Roscosmos State Corporation} has {manager/director} as {Yuri Koptev} ?
 SPARQL: SELECT ?value WHERE { wd:Q190795 p:P1037 ?s . ?s ps:P1037 wd:Q2895091 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roscosmos State Corporation', 'p': 'manager', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'manager', 'o': 'Yuri Koptev'}}}

 Q: Did {Dublin} {located in or next to body of water} {Liffey} and {Royal Canal} ?
 SPARQL: ASK WHERE { wd:Q1761 wdt:P206 wd:Q208009 . wd:Q1761 wdt:P206 wd:Q1542268 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Dublin', 'p': 'located in or next to body of water', 'o': '?x0', '?x0': 'Liffey'}, {'h': 'IS', 'v': '?x1', 's': 'Dublin', 'p': 'located in or next to body of water', 'o': '?x1', '?x1': 'Royal Canal'}]

 Q: Tell me the United States federal executive department that contains the word department in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q910252 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'department')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'United States federal executive department'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'department'}}

 Q: Where is the co-founder of The Evening of Ashura from?
 SPARQL: SELECT ?answer WHERE { wd:Q5945717 wdt:P276 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'co-founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Evening of Ashura', 'p': 'location', 'o': '$y0'}}

 Q: What is the {capital} for {twinned administrative body} of {Chicago}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q1297 . ?sbj wdt:P31 wd:Q5119 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Chicago', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capital'}}

 Q: What is {prime minister} of {active in} of {Theo van Doesburg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q160422 wdt:P937 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prime minister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Theo van Doesburg', 'p': 'active in', 'o': '$y0'}}

 Q: What is {coordinate location} of {Narmada} that is {applies to part} is {river source} ?
 SPARQL: SELECT ?obj WHERE { wd:Q234004 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinate location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Narmada', 'p': 'coordinate location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river source'}}}

 Q: Which is the Hederich encyclopedia article ID of Hades?
 SPARQL: select distinct ?answer where { wd:Q41410 wdt:P2272 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hades', 'p': 'Hederich encyclopedia article ID', 'o': '?x0'}

 Q: what is the {represents} for {North Atlantic Treaty} that has {signatory} as {Dean Acheson} ?
 SPARQL: SELECT ?value WHERE { wd:Q877399 p:P1891 ?s . ?s ps:P1891 wd:Q214758 . ?s pq:P1268 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'represents', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North Atlantic Treaty', 'p': 'signatory', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'signatory', 'o': 'Dean Acheson'}}}

 Q: IS THE BITE FORCE QUOTIENT OF THE DHOLE EQUALS 132
 SPARQL: ASK WHERE { wd:Q132585 wdt:P3485 ?obj filter(?obj = 132) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Dhole', 'p': 'bite force quotient', 'o': '?x0', '?x0': '132'}

 Q: What is {position held} of {Colin Renfrew} that is {end time} is {2004-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q335189 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Colin Renfrew', 'p': 'position held', 'o': '?x0', 't': '2004'}

 Q: Who gave the{takes places during} of {previous is} of {New Year} ?
 SPARQL: SELECT ?answer WHERE { wd:Q34812 wdt:P155 ?X . ?X wdt:P837 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'takes places during', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'New Year', 'p': 'previous is', 'o': '$y0'}}

 Q: What is {number of out of school children} of {place of origin} of {We Wish You a Merry Christmas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q252123 wdt:P495 ?X . ?X wdt:P2573 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of out of school children', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'We Wish You a Merry Christmas', 'p': 'place of origin', 'o': '$y0'}}

 Q: What is {has influence} of {Anna Akhmatova}, that has {birth year} is {1799-5-26} ?
 SPARQL: SELECT ?answer WHERE { wd:Q80440 wdt:P737 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1799'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anna Akhmatova', 'p': 'has influence', 'o': '?x0', 't': '1799'}

 Q: What is <CiNii article ID> of <Belvedere> ?
 SPARQL: select distinct ?answer where { wd:Q211818 wdt:P2409 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Belvedere', 'p': 'CiNii article ID', 'o': '?x0'}

 Q: Tell me the scientific model that starts with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q193946 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scientific model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {human} for {conflict} of {Battle of Austerlitz}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P607 wd:Q134114 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conflict', 'o': 'Battle of Austerlitz', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Of the 2015 Baga massacre, does the number of those missing equal 2000?
 SPARQL: ASK WHERE { wd:Q18732673 wdt:P1446 ?obj filter(?obj = 2000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '2015 Baga massacre', 'p': 'missing', 'o': '?x0', '?x0': '2000'}

 Q: Is there a Thanksgiving in Panama?
 SPARQL: ASK WHERE { wd:Q13959 wdt:P276 wd:Q804 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Thanksgiving', 'p': 'location', 'o': '?x0', '?x0': 'Panama'}]

 Q: What is the posthumous name of Emperor Taizong of Tang in the writing system of traditional Chinese characters?
 SPARQL: SELECT ?obj WHERE { wd:Q9701 p:P1786 ?s . ?s ps:P1786 ?obj . ?s pq:P282 wd:Q178528 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'posthumous name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emperor Taizong of Tang', 'p': 'posthumous name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'writing system', 'o': 'traditional Chinese characters'}}}

 Q: What is {language of work} of {Shahada}, that has {Women in Red banner} is {Arabic WV banner.jpg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41831 wdt:P407 ?answer . ?answer wdt:P948 ?x FILTER(contains(?x,'Arabic WV banner.jpg'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Shahada', 'p': 'language of work', 'o': '?x0'}

 Q: What is {health condition} of {developed by} of {Hughes H-4 Hercules} ?
 SPARQL: SELECT ?answer WHERE { wd:Q667443 wdt:P178 ?X . ?X wdt:P1050 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'health condition', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hughes H-4 Hercules', 'p': 'developed by', 'o': '$y0'}}

 Q: what is the {end time} for {Wes Craven} has {spouse} as {Bonnie Broecker} ?
 SPARQL: SELECT ?value WHERE { wd:Q223992 p:P26 ?s . ?s ps:P26 wd:Q20894422 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wes Craven', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Bonnie Broecker'}}}

 Q: Which is the nonprofit organization if the formation location of Paris?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P740 wd:Q90 . ?sbj wdt:P31 wd:Q163740 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'formation location', 'o': 'Paris', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonprofit organization'}}

 Q: What is {comes before} of {comes after} of {Estonian Soviet Socialist Republic} ?
 SPARQL: SELECT ?answer WHERE { wd:Q130280 wdt:P155 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'comes before', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Estonian Soviet Socialist Republic', 'p': 'comes after', 'o': '$y0'}}

 Q: what is the {instance of} for {Fernando Pessoa} has {said to be the same as} as {Jean Seul de Méluret} ?
 SPARQL: SELECT ?value WHERE { wd:Q173481 p:P460 ?s . ?s ps:P460 wd:Q21028930 . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fernando Pessoa', 'p': 'said to be the same as', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'said to be the same as', 'o': 'Jean Seul de Méluret'}}}

 Q: What is {nominated for} of {Peter Sellers} that is {statement is subject of} is {37th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q177984 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917138 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Sellers', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '37th Academy Awards'}}}

 Q: Tell me phantom island  whose name has the word tuanaki in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tuanaki')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phantom island'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tuanaki'}}

 Q: What is {to be distinguished from} of {Carthage}, that has {first issue} is {-814-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6343 wdt:P1889 ?answer . ?answer wdt:P571 ?x FILTER(contains(?x,'-814-0-0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Carthage', 'p': 'distinguished from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'first issue', 'o': '-814-0-0'}}

 Q: What is the {Chinese dynasty} for {replaces} of {Yuan dynasty}
 SPARQL:  select distinct ?obj where { wd:Q7313 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q12857432 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yuan', 'p': 'replaces', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Chinese dynasty'}}

 Q: What is the {alphabetic script} for {uses} of {Arabic alphabet}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2283 wd:Q8196 . ?sbj wdt:P31 wd:Q11077643 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'Arabic alphabet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alphabetic script'}}

 Q: Is it true that the publication interval of the Cuore is less than 1.2?
 SPARQL: ASK WHERE { wd:Q2756124 wdt:P2896 ?obj filter(?obj < 1.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Cuore', 'p': 'publication interval', 'o': '?x0', '?x0': '1.2'}

 Q: What was the significant event that happened to Jean Gabin in 1976?
 SPARQL: SELECT ?obj WHERE { wd:Q23842 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jean Gabin', 'p': 'significant event', 'o': '?x0', 't': '1976'}

 Q: What was the inflation rate of Portugal during 1993-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q45 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Portugal', 'p': 'inflation rate', 'o': '?x0', 't': '1993'}

 Q: What is {commanded by} of {Warsaw Pact} that is {start time} is {1967-4-12} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41644 p:P4791 ?s . ?s ps:P4791 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Warsaw Pact', 'p': 'commanded by', 'o': '?x0', 't': '1967'}

 Q: How many siblings does Fú Jiān have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3373 wd:Q967998 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Fú Jiān'}

 Q: What is the series ordinal for chairperson Kaoru Kamata at Waseda University?
 SPARQL: SELECT ?value WHERE { wd:Q274486 p:P488 ?s . ?s ps:P488 wd:Q10854980 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Waseda University', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Kaoru Kamata'}}}

 Q: what is the {start time} for {La Plata} has {named after} as {Eva Perón} ?
 SPARQL: SELECT ?value WHERE { wd:Q44059 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'La Plata', 'p': 'named after', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'named after', 'o': 'Eva Perón'}}}

 Q: What is <has fruit type> of <nut> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4000 wd:Q11009}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has fruit type', 'o': 'nut'}

 Q: What relative or kinship is the first cousin once removed descending of Salvador Allende?
 SPARQL: SELECT ?obj WHERE { wd:Q440 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q19901611 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'relative', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Salvador Allende', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'first cousin once removed descending'}}}

 Q: What is the quality of old age?
 SPARQL: select distinct ?answer where { ?answer wdt:P1552 wd:Q191089}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'quality', 'o': 'old age'}

 Q: Which musician is successor of Sleeping Beauty.
 SPARQL: SELECT ?answer WHERE { wd:Q7539845 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musician', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sleeping Beauty', 'p': 'successor', 'o': '$y0'}}

 Q: What is {brother} of {1st place medalist} of {Screen Actors Guild Life Achievement Award} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1631998 wdt:P1346 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bro', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Screen Actors Guild Life Achievement Award', 'p': '1st place medalist', 'o': '$y0'}}

 Q: What are the contents of the puzzle?
 SPARQL: select distinct ?answer where { ?answer wdt:P4330 wd:Q13698}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contents', 'o': 'puzzle'}

 Q: What award did Subrahmanyan Chandrasekhar receive in 1974?
 SPARQL: SELECT ?obj WHERE { wd:Q148109 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Subrahmanyan Chandrasekhar', 'p': 'award', 'o': '?x0', 't': '1974'}

 Q: What is Project Gutenberg ID for Oliver Twist ?
 SPARQL: select distinct ?answer where { wd:Q164974 wdt:P2034 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oliver Twist', 'p': 'Gutenberg ID', 'o': '?x0'}

 Q: what is the {end time} for {Stuart Broad} has {member of sports team} as {Leicestershire County Cricket Club} ?
 SPARQL: SELECT ?value WHERE { wd:Q3140358 p:P54 ?s . ?s ps:P54 wd:Q3229147 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stuart Broad', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Leicestershire County Cricket Club'}}}

 Q: What is PACE member ID for James Callaghan ?
 SPARQL: select distinct ?answer where { wd:Q9576 wdt:P1331 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Callaghan', 'p': 'PACE member ID', 'o': '?x0'}

 Q: What is the twinned administrative body of Strasbourg, which started in 1 Jan 1962?
 SPARQL: SELECT ?obj WHERE { wd:Q6602 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Strasbourg', 'p': 'twinned administrative body', 'o': '?x0', 't': '1962'}

 Q: Mention the horse used by Robert E. Lee during mounting.
 SPARQL:  select distinct ?obj where { wd:Q165557 wdt:P3091 ?obj . ?obj wdt:P31 wd:Q726 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert E. Lee', 'p': 'mount', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'horse'}}

 Q: Did Reinhard Heydrich die of cholangitis and/or ballistic trauma?
 SPARQL: ASK WHERE { wd:Q60039 wdt:P509 wd:Q603644 . wd:Q60039 wdt:P509 wd:Q2140674 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Reinhard Heydrich', 'p': 'die of', 'o': '?x0', '?x0': 'cholangitis'}, {'h': 'IS', 'v': '?x1', 's': 'Reinhard Heydrich', 'p': 'die of', 'o': '?x1', '?x1': 'ballistic trauma'}]

 Q: Was the lowest atmospheric pressure recorded during the 1935 Labor Day Hurricane higher than 1070.4?
 SPARQL: ASK WHERE { wd:Q206825 wdt:P2532 ?obj filter(?obj > 1070.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '1935 Labor Day hurricane', 'p': 'lowest atmospheric pressure', 'o': '?x0', '?x0': '1070.4'}

 Q: Which is the KOATUU identifier for Cherkasy Oblast?
 SPARQL: select distinct ?answer where { wd:Q161808 wdt:P1077 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cherkasy Oblast', 'p': 'KOATUU identifier', 'o': '?x0'}

 Q: What was the maker of the art of sculpture a proponent of?
 SPARQL: SELECT ?answer WHERE { wd:Q11634 wdt:P3095 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'maker of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'art of sculpture', 'p': 'proponent', 'o': '$y0'}}

 Q: What is {nominated for} of {The Treasure of the Sierra Madre} that is {nominee} is {Walter Huston} ?
 SPARQL: SELECT ?obj WHERE { wd:Q251559 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q162621 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Treasure of the Sierra Madre', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'Walter Huston'}}}

 Q: What is  designer of ship armament  in2015 San Bernardino shooting ?
 SPARQL: SELECT ?answer WHERE { wd:Q21613643 wdt:P520 ?X . ?X wdt:P287 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'designer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2015 San Bernardino shooting', 'p': 'armament', 'o': '$y0'}}

 Q: Is it true that the memory capacity of the diskette equals to 1152?
 SPARQL: ASK WHERE { wd:Q5293 wdt:P2928 ?obj filter(?obj = 1152.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'disk', 'p': 'memory capacity', 'o': '?x0', '?x0': '1152.0'}

 Q: What is {end time} and {academic degree} of {{Venus Williams} has {educated at} as {The Art Institute of Fort Lauderdale}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 wd:Q7714375 . ?s pq:P582 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venus Williams', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'The Art Institute of Fort Lauderdale'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venus Williams', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'The Art Institute of Fort Lauderdale'}}}]

 Q: Is the rural population of North Sikkim district 31252?
 SPARQL: ASK WHERE { wd:Q1784149 wdt:P6344 ?obj filter(?obj = 31252.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'North Sikkim district', 'p': 'rural population', 'o': '?x0', '?x0': '31252.0'}

 Q: What is bordered by Netherlands Antilles and is located in the administrative unit of Amiens?
 SPARQL: SELECT ?answer WHERE { wd:Q41604 wdt:P131 ?answer . ?answer wdt:P47 wd:Q25227}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Amiens', 'p': 'located in the administrative unit', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'bordered by', 'o': 'Netherlands Antilles'}}

 Q: Which is the INEGI locality ID for Torreón?
 SPARQL: select distinct ?answer where { wd:Q386991 wdt:P1976 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Torreón', 'p': 'INEGI locality ID', 'o': '?x0'}

 Q: What honors have coined the compact disc?
 SPARQL: SELECT ?answer WHERE { wd:Q34467 wdt:P61 ?X . ?X wdt:P166 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'honors', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'compact disc', 'p': 'coined', 'o': '$y0'}}

 Q: Which is the UNESCO Atlas of the World's Languages in Danger ID of Coptic?
 SPARQL: select distinct ?answer where { wd:Q36155 wdt:P2355 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Coptic', 'p': "UNESCO Atlas of the World's Languages in Danger ID", 'o': '?x0'}

 Q: Which is FAO risk status for Arabian horse?
 SPARQL: select distinct ?answer where { wd:Q184138 wdt:P2371 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arabian horse', 'p': 'FAO risk status', 'o': '?x0'}

 Q: Tell me a civil parish that begins with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1115575 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'civil parish'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

