 Q: what is the {start time} for {Toshiba} has {chief executive officer} as {Nobuaki Kurumatani} ?
 SPARQL: SELECT ?value WHERE { wd:Q49125 p:P169 ?s . ?s ps:P169 wd:Q11637325 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Toshiba', 'p': 'chief executive officer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chief executive officer', 'o': 'Nobuaki Kurumatani'}}}

 Q: What is studies of coined for periodic table ?
 SPARQL: SELECT ?answer WHERE { wd:Q10693 wdt:P61 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'studies', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'periodic table', 'p': 'coined', 'o': '$y0'}}

 Q: 1984 is the manifestation of what audio drama?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q208460 . ?sbj wdt:P31 wd:Q2635894 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': '1984', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'audio drama'}}

 Q: What is the {human} for {commissioned by} of {Taj Mahal}
 SPARQL:  select distinct ?obj where { wd:Q9141 wdt:P88 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Taj Mahal', 'p': 'commissioned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What award did Aleksandr Solzhenitsyn receive and how much was the prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q34474 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Aleksandr Solzhenitsyn', 'p': 'award', 'o': '$y0'}}]

 Q: What is <space launch vehicle> of <Pioneer 11> ?
 SPARQL: select distinct ?answer where { wd:Q59113 wdt:P375 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pioneer 11', 'p': 'space launch vehicle', 'o': '?x0'}

 Q: what is the {academic degree} for {Walter Benjamin} has {educated at} as {University of Bern} ?
 SPARQL: SELECT ?value WHERE { wd:Q61078 p:P69 ?s . ?s ps:P69 wd:Q659080 . ?s pq:P512 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Walter Benjamin', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Bern'}}}

 Q: What is the IWRP athlete ID for Hossein Rezazadeh?
 SPARQL: select distinct ?answer where { wd:Q374353 wdt:P4504 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hossein Rezazadeh', 'p': 'IWRP athlete ID', 'o': '?x0'}

 Q: Give me {book} that {published in} {Journal des débats} and which contains the word {count} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q571 . ?sbj wdt:P1433 wd:Q2565164 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'count')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'published in', 'o': 'Journal des débats'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'count'}}

 Q: What is {area} of {supervisor} of {Valerian Agafonoff} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4056733 wdt:P184 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valerian Agafonoff', 'p': 'supervisor', 'o': '$y0'}}

 Q: IS THE CALIBER OF THE M1939 GREATER THAN 44.4
 SPARQL: ASK WHERE { wd:Q701703 wdt:P4403 ?obj filter(?obj > 44.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'M1939', 'p': 'caliber', 'o': '?x0', '?x0': '44.4'}

 Q: What was the population of Bacolod on May 5, 2010?
 SPARQL: SELECT ?obj WHERE { wd:Q5217 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bacolod', 'p': 'population', 'o': '?x0', 't': '2010'}

 Q: Which was the award received by Shoji Hamada on 1-1-1968?
 SPARQL: SELECT ?obj WHERE { wd:Q3090171 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1968')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Shoji Hamada', 'p': 'award received', 'o': '?x0', 't': '1968'}

 Q: What is the name of the office held by Chiang Kai-shek that was Introduced around 1928?
 SPARQL: SELECT ?answer WHERE { wd:Q16574 wdt:P39 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1928'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chiang Kai-shek', 'p': 'office held', 'o': '?x0', 't': '1928'}

 Q: When was Ernesto Zedillo awarded the Wilbur Cross Medal?
 SPARQL: SELECT ?value WHERE { wd:Q298149 p:P166 ?s . ?s ps:P166 wd:Q8000166 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ernesto Zedillo', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Wilbur Cross Medal'}, 't': '?x0'}

 Q: What is {short name} of {Communist Party of the Soviet Union} that is {end time} is {1925-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q79854 p:P1813 ?s . ?s ps:P1813 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1925')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Communist Party of the Soviet Union', 'p': 'short name', 'o': '?x0', 't': '1925'}

 Q: What are the {province of China which starts with letters z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'province of China'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is  the higher taxon of resident animal species of Hellabrunn Zoo ?
 SPARQL: SELECT ?answer WHERE { wd:Q264691 wdt:P1990 ?X . ?X wdt:P171 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'higher taxon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hellabrunn Zoo', 'p': 'resident animal species', 'o': '$y0'}}

 Q: Which is the archive for the architectural style of Bauhaus?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q166118 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'Bauhaus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archive'}}

 Q: What is {residence} of {Vladimir Nabokov} that is {start time} is {1899-4-22} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36591 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1899')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vladimir Nabokov', 'p': 'residence', 'o': '?x0', 't': '1899'}

 Q: When was the peseta replaced by the euro?
 SPARQL: SELECT ?value WHERE { wd:Q4916 p:P1365 ?s . ?s ps:P1365 wd:Q189097 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'euro', 'p': 'replaced', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced', 'o': 'peseta'}, 't': '?x0'}

 Q: What is the {sovereign state} for {head of state} of {Mobutu Sese Seko}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q164535 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Mobutu Sese Seko', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: what is the {for work} for {Julie Christie} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q181413 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julie Christie', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: Which is the film genre of the series of Unmasked?
 SPARQL: SELECT ?answer WHERE { wd:Q16746470 wdt:P179 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Unmasked', 'p': 'series', 'o': '$y0'}}

 Q: What is the Salzburg airport named after?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q34713 . ?sbj wdt:P31 wd:Q1248784 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Salzburg', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airport'}}

 Q: Were The Beatles influenced by Timothy Leary?
 SPARQL: ASK WHERE { wd:Q1299 wdt:P737 wd:Q211731 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'The Beatles', 'p': 'influenced by', 'o': '?x0', '?x0': 'Timothy Leary'}]

 Q: What is {external data available at} of {Wakayama Prefecture} that is {of} is {open data} ?
 SPARQL: SELECT ?obj WHERE { wd:Q131314 p:P1325 ?s . ?s ps:P1325 ?obj . ?s pq:P642 wd:Q309901 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'data', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wakayama Prefecture', 'p': 'data', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'open data'}}}

 Q: what is the {point in time} for {Leonard Cohen} has {award received} as {Grammy Lifetime Achievement Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q1276 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Leonard Cohen', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Lifetime Achievement Award'}, 't': '?x0'}

 Q: Which is the name of Ruth Benedict?
 SPARQL: select distinct ?answer where { wd:Q228822 wdt:P2561 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ruth Benedict', 'p': 'name', 'o': '?x0'}

 Q: What is the place of death of Endre Ady, which is the twin city of Daejeon?
 SPARQL: SELECT ?answer WHERE { wd:Q211392 wdt:P20 ?answer . ?answer wdt:P190 wd:Q20921}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Endre Ady', 'p': 'place of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin city', 'o': 'Daejeon'}}

 Q: Is the nominal GDP of Belize less than 1470400000?
 SPARQL: ASK WHERE { wd:Q242 wdt:P2131 ?obj filter(?obj < 1470400000.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Belize', 'p': 'nominal GDP', 'o': '?x0', '?x0': '1470400000.0'}

 Q: What is the {language} for {dialect of} of {Ancient Greek}
 SPARQL:  select distinct ?obj where { wd:Q35497 wdt:P4913 ?obj . ?obj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ancient Greek', 'p': 'dialect of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Which museum tugboat has the most net tonnage ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q191826 . ?ent wdt:P2790 ?obj . ?ent wdt:P366 wd:Q575727 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'net tonnage', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tug', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'use', 'o': 'museum ship'}}}

 Q: Where is {border} of {birth location} of {Asia Argento} ?
 SPARQL: SELECT ?answer WHERE { wd:Q232052 wdt:P19 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asia Argento', 'p': 'birth location', 'o': '$y0'}}

 Q: what is the {valid in period} for {Trentino-South Tyrol} has {located in time zone} as {UTC+01:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q1237 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Trentino-South Tyrol', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+01:00'}}}

 Q: Which is the charge of Joan of Arc?
 SPARQL: select distinct ?answer where { wd:Q7226 wdt:P1595 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joan of Arc', 'p': 'charge', 'o': '?x0'}

 Q: Tell me the media player with a license of proprietary license and starts with the letter w?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210337 . ?sbj wdt:P275 wd:Q3238057 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'media player', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'license', 'o': 'proprietary license'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is <L'Équipe football player ID> of <George Weah> ?
 SPARQL: select distinct ?answer where { wd:Q173139 wdt:P3665 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'George Weah', 'p': "L'Équipe football player ID", 'o': '?x0'}

 Q: What is {birthplace} of {Reba McEntire}, that has {has towns} is {Woodward County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q229430 wdt:P19 ?answer . ?answer wdt:P150 wd:Q489447}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Reba McEntire', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has towns', 'o': 'Woodward County'}}

 Q: What is <Online Books Page publication ID> of <Action Comics> ?
 SPARQL: select distinct ?answer where { wd:Q343615 wdt:P5396 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Action Comics', 'p': 'Online Books Page publication ID', 'o': '?x0'}

 Q: Which is the deepest point for Mekong River?
 SPARQL: select distinct ?answer where { ?answer wdt:P1589 wd:Q41179}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'deepest point', 'o': 'Mekong River'}

 Q: What is not the same as the globe, whose time zone is Mountain Time Zone?
 SPARQL: SELECT ?answer WHERE { wd:Q133792 wdt:P1889 ?answer . ?answer wdt:P421 wd:Q3134980}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'globe', 'p': 'is not', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'time zone', 'o': 'Mountain Time Zone'}}

 Q: What is {twin town} of {subtopic of} of {history of Istanbul} ?
 SPARQL: SELECT ?answer WHERE { wd:Q32357 wdt:P1269 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'twin city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Istanbul', 'p': 'topic of', 'o': '$y0'}}

 Q: what is the antonym of father that has series is Ahnentafel?
 SPARQL: SELECT ?answer WHERE { wd:Q7565 wdt:P461 ?answer . ?answer wdt:P179 wd:Q267388}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'father', 'p': 'antonym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Ahnentafel'}}

 Q: Which animated character has got more number of children?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15711870 . ?ent wdt:P1971 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of children', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated character'}}

 Q: What is {music genre} of {artist} of {Best Ballads} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1758314 wdt:P175 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Best Ballads', 'p': 'artist', 'o': '$y0'}}

 Q: what is the {point in time} for {Shaquille O'Neal} has {award received} as {All-NBA Team} ?
 SPARQL: SELECT ?value WHERE { wd:Q169452 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Shaq', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'All-NBA Team'}, 't': '?x0'}

 Q: What is the {human} for {professional or sports partner} of {Kate Bush}
 SPARQL:  select distinct ?obj where { wd:Q636 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kate Bush', 'p': 'sports partner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which country does Roberto Rossellini, who died in Rome, belong to?
 SPARQL: SELECT ?value WHERE { wd:Q53003 p:P20 ?s . ?s ps:P20 wd:Q220 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roberto Rossellini', 'p': 'died in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'died in', 'o': 'Rome'}}}

 Q: What is {area} of {published in journal} of {Research on middle age: an assessment.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40468747 wdt:P1433 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'specialty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Research on middle age: an assessment.', 'p': 'published in', 'o': '$y0'}}

 Q: Who did Malcolm Fraser get married to in 1956?
 SPARQL: SELECT ?obj WHERE { wd:Q315979 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Malcolm Fraser', 'p': 'married to', 'o': '?x0', 't': '1956'}

 Q: Who is the sponsor of Anne, Princess Royal?
 SPARQL: select distinct ?answer where { ?answer wdt:P859 wd:Q151754}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sponsor', 'o': 'Anne, Princess Royal'}

 Q: What are the recurring events which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring event'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which is the maximum capacity for Wright Flyer?
 SPARQL: select distinct ?answer where { wd:Q688605 wdt:P1083 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wright Flyer', 'p': 'maximum capacity', 'o': '?x0'}

 Q: does the age events of the totoro equivelant to 3000?
 SPARQL: ASK WHERE { wd:Q1939137 wdt:P3629 ?obj filter(?obj = 3000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Totoro', 'p': 'age at event', 'o': '?x0', '?x0': '3000'}

 Q: How many operators are by Texas A&M University?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P137 wd:Q49212 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Texas A&M University'}

 Q: What is {head quarters} of {member of} of {Charles Nirmalanathan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20855546 wdt:P102 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'head quarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Nirmalanathan', 'p': 'member of', 'o': '$y0'}}

 Q: Which is the river that is different from the mass?
 SPARQL:  select distinct ?obj where { wd:Q11423 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q4022 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'mass', 'p': 'different from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: Which is the HTML entity for diamond?
 SPARQL: select distinct ?answer where { wd:Q5283 wdt:P4575 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'diamond', 'p': 'HTML entity', 'o': '?x0'}

 Q: What is {locomotion} of {secreted by} of {child} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7569 wdt:P2849 ?X . ?X wdt:P3512 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'locomotion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'child', 'p': 'secreted by', 'o': '$y0'}}

 Q: What is {date of birth} of {Antipater} that is {instance of} is {statement with Gregorian date earlier than 1584} ?
 SPARQL: SELECT ?obj WHERE { wd:Q204760 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antipater', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'statement with Gregorian date earlier than 1584'}}}

 Q: Which is the continental area and surrounding islands for the continent of the Middle East?
 SPARQL:  select distinct ?obj where { wd:Q7204 wdt:P30 ?obj . ?obj wdt:P31 wd:Q2418896 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Middle East', 'p': 'continent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'continental area and surrounding islands'}}

 Q: How many languages are based on the {Latin script} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P144 wd:Q8229 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'based on', 'o': 'Latin script'}

 Q: How many {work location} are for {Jan Brueghel the Elder} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q209050 wdt:P937 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Jan Brueghel the Elder', 'p': 'work location', 'o': '?x0'}

 Q: What is an electrical connector system that is published by USB Implementers Forum with the word "usb" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58184783 . ?sbj wdt:P123 wd:Q3847420 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'usb')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'electrical connector system', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'published by', 'o': 'USB Implementers Forum'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'usb'}}

 Q: What is {end time} and {start time} of {{Jessica Lange} has {partner} as {Sam Shepard}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q173585 p:P451 ?s . ?s ps:P451 wd:Q294583 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jessica Lange', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Sam Shepard'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jessica Lange', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Sam Shepard'}}}]

 Q: What is {parent company of} of {alumna of} of {Thomas Hobbes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37621 wdt:P69 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent company of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Hobbes', 'p': 'alumna of', 'o': '$y0'}}

 Q: Tell me craft  whose name has the word woodworker in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2207288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'woodworker')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'craft'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'woodworker'}}

 Q: Which {makes use of} {sports} of {football boots} ?
 SPARQL: SELECT ?answer WHERE { wd:Q512804 wdt:P641 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'makes use of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'football boots', 'p': 'sport', 'o': '$y0'}}

 Q: Name a traditional fairy tale that starts with letter S
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42402646 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'traditional fairy tale'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is the capital of the is in the city  of Jauca?
 SPARQL: SELECT ?answer WHERE { wd:Q13736489 wdt:P131 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jauca', 'p': 'in', 'o': '$y0'}}

 Q: what is the {point in time} for {Illinois} has {population} as {1.14265e+07} ?
 SPARQL: SELECT ?value WHERE { wd:Q1204 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.14265e+07')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Illinois', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.14265e+07'}, 't': '?x0'}

 Q: Does the surface tension of the undecane equal 17.45?
 SPARQL: ASK WHERE { wd:Q150731 wdt:P3013 ?obj filter(?obj = 17.45) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'undecane', 'p': 'surface tension', 'o': '?x0', '?x0': '17.45'}

 Q: Lawrence Summers was educated at which university and gained which degree?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q317953 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lawrence Summers', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lawrence Summers', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is <has facility> of <Hartsfield–Jackson Atlanta International Airport> ?
 SPARQL: select distinct ?answer where { wd:Q214861 wdt:P912 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hartsfield-Jackson', 'p': 'has facility', 'o': '?x0'}

 Q: What is <contributor(s) to the creative work> of <Brian Wilson> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P767 wd:Q313013}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contributor', 'o': 'Brian Wilson'}

 Q: which poem contains the word prymskvioa in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5185279 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'þrymskviða')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'poem'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'þrymskviða'}}

 Q: Competitive snowboarding has how many sports discipline's?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2416 wd:Q178131 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'sports discipline', 'o': 'snowboarding'}

 Q: Which is the newspaper owned by the Australian Football League?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q50783 . ?sbj wdt:P31 wd:Q11032 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'Australian Football League', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newspaper'}}

 Q: At what time did Ulaanbaatar have a population of 1.372e+06?
 SPARQL: SELECT ?value WHERE { wd:Q23430 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.372e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ulaanbaatar', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.372e+06'}, 't': '?x0'}

 Q: Give me {W3C Recommendation} that {standards body} {World Wide Web Consortium} and which that starts with {'x'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj wdt:P1462 wd:Q37033 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'W3C Recommendation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'standards body', 'o': 'W3C'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'x'}}

 Q: what is the {start time} for {Zakopane} has {located in the administrative territorial entity} as {Kingdom of Galicia and Lodomeria} ?
 SPARQL: SELECT ?value WHERE { wd:Q144786 p:P131 ?s . ?s ps:P131 wd:Q2396442 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zakopane', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Kingdom of Galicia and Lodomeria'}}}

 Q: In which country is Syracuse that is the birth place of Megyn Kelly?
 SPARQL: SELECT ?value WHERE { wd:Q293260 p:P19 ?s . ?s ps:P19 wd:Q128069 . ?s pq:P17 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'country', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Megyn Kelly', 'p': 'birth place', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'birth place', 'o': 'Syracuse'}}}

 Q: what is the {start time} for {Russian Empire} has {basic form of government} as {absolute monarchy} ?
 SPARQL: SELECT ?value WHERE { wd:Q34266 p:P122 ?s . ?s ps:P122 wd:Q184558 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'beginning', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Russian Empire', 'p': 'basic form of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'basic form of government', 'o': 'absolute monarchy'}}}

 Q: What is {award received} of {Eddie Redmayne} that is {for work} is {The Theory of Everything} ?
 SPARQL: SELECT ?obj WHERE { wd:Q28288 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q15079318 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eddie Redmayne', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Theory of Everything'}}}

 Q: What Denmark hotel has the least angle from vertical?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q27686 . ?ent wdt:P4183 ?obj . ?ent wdt:P17 wd:Q35} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'angle from vertical', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hotel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Denmark'}}}

 Q: Who is the performer and the present in work of Satan?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q35230 wdt:P175 ?ans_1 . wd:Q35230 wdt:P1441 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Satan', 'p': 'performer', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Satan', 'p': 'present in work', 'o': '?x1'}]

 Q: What is {head quarters} of {working place} of {Jörg-Dietrich Hoppe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1715188 wdt:P108 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'HQ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jörg-Dietrich Hoppe', 'p': 'working place', 'o': '$y0'}}

 Q: what is the {start time} for {Sun Wen} has {member of sports team} as {Atlanta Beat} ?
 SPARQL: SELECT ?value WHERE { wd:Q253223 p:P54 ?s . ?s ps:P54 wd:Q4816008 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sun Wen', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Atlanta Beat'}}}

 Q: What is <has evaluation> of <pulse> ?
 SPARQL: select distinct ?answer where { wd:Q191733 wdt:P5133 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pulse', 'p': 'has evaluation', 'o': '?x0'}

 Q: What is {architecture firm} of {Jewish Museum}, that has {honors} is {Buber-Rosenzweig-Medal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q157003 wdt:P84 ?answer . ?answer wdt:P166 wd:Q278778}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jewish Museum in Berlin', 'p': 'architect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'honors', 'o': 'Buber-Rosenzweig-Medal'}}

