 Q: What is the {dialect} for {dialect of} of {Tagalog}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4913 wd:Q34057 . ?sbj wdt:P31 wd:Q33384 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dialect of', 'o': 'Tagalog', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect'}}

 Q: What is {scholarly field for} of {scholarly field for} of {Leonhard Euler} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7604 wdt:P101 ?X . ?X wdt:P2578 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'scholarly field for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leonhard Euler', 'p': 'fields', 'o': '$y0'}}

 Q: What is <INE municipality code> of <Zaragoza> ?
 SPARQL: select distinct ?answer where { wd:Q10305 wdt:P772 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zaragoza', 'p': 'INE municipality code', 'o': '?x0'}

 Q: What is the diplomatic relation of the basin countries of the Black Sea?
 SPARQL: SELECT ?answer WHERE { wd:Q166 wdt:P205 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Black Sea', 'p': 'basin countries', 'o': '$y0'}}

 Q: What significant event is proportionate to 0.001 Russian ruble?
 SPARQL: SELECT ?obj WHERE { wd:Q41044 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P1107 ?x filter(contains(?x,'0.001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'significant event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Russian ruble', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'proportion', 'o': '0.001'}}}

 Q: What is <point group> of <quartz> ?
 SPARQL: select distinct ?answer where { wd:Q43010 wdt:P589 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'quartz', 'p': 'point group', 'o': '?x0'}

 Q: What is position held of Constans II that is replaces of Heraklonas ?
 SPARQL: SELECT ?obj WHERE { wd:Q41613 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q31513 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Constans II', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Heraklonas'}}}

 Q: Is the date of birth for Christoper Columbus 1451-10-31?
 SPARQL: SELECT ?obj WHERE { wd:Q7322 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1326 ?x filter(contains(YEAR(?x),'1451')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Columbus', 'p': 'date of birth', 'o': '?x0', 't': '1451'}

 Q: what is the {point in time} for {Maurice Sendak} has {award received} as {Astrid Lindgren Memorial Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q314771 p:P166 ?s . ?s ps:P166 wd:Q430035 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Maurice Sendak', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Astrid Lindgren Memorial Award'}, 't': '?x0'}

 Q: What is {member of sports team} of {Jock Stein} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q355378 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jock Stein', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jock Stein', 'p': 'team', 'o': '$y0'}}]

 Q: Which is the YSO ID for Lesotho?
 SPARQL: select distinct ?answer where { wd:Q1013 wdt:P2347 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lesotho', 'p': 'YSO ID', 'o': '?x0'}

 Q: What is the {fictional human} for {performer} of {Ben Affleck}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P175 wd:Q483118 . ?sbj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Ben Affleck', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional human'}}

 Q: What is {educated at} of {John Paul Stevens} that is {end time} is {1947-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11109 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1947')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Paul Stevens', 'p': 'educated at', 'o': '?x0', 't': '1947'}

 Q: What is the {Population I star} for {parent astronomical body} of {Jupiter}
 SPARQL:  select distinct ?obj where { wd:Q319 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3592493 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jupiter', 'p': 'star', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Population I star'}}

 Q: Which automobile marque has the highest assets?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q17412622 . ?ent wdt:P2403 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'assets', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'automobile marque'}}

 Q: What is the {mainland territory of Australia} for {replaces} of {Northern Territory}
 SPARQL:  select distinct ?obj where { wd:Q3235 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q14192234 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Northern Territory', 'p': 'replaces', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mainland territory of Australia'}}

 Q: What is the {stadium} for {operator} of {Indianapolis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P137 wd:Q6346 . ?sbj wdt:P31 wd:Q483110 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'operator', 'o': 'Indianapolis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stadium'}}

 Q: What is {position held} of {Charles V of France} that is {start time} is {1364-4-8} ?
 SPARQL: SELECT ?obj WHERE { wd:Q167782 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1364')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charles V of France', 'p': 'position held', 'o': '?x0', 't': '1364'}

 Q: What are the universal library which start with the letter I
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2495568 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'universal library'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Tell me what human migration starts with the letter u.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177626 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human migration'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is {input} of {in work} of {Captain Hook} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55728689 wdt:P1441 ?X . ?X wdt:P479 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'input', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Captain Hook', 'p': 'in work', 'o': '$y0'}}

 Q: Which  is alcohol by volume of absinthe} ?
 SPARQL: select distinct ?answer where { wd:Q170210 wdt:P2665 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'absinthe', 'p': 'alcohol by volume', 'o': '?x0'}

 Q: What is {inventor} of {Hamiltonian mechanics}, that has {member of} is {National Academy of Sciences} ?
 SPARQL: SELECT ?answer WHERE { wd:Q477921 wdt:P61 ?answer . ?answer wdt:P463 wd:Q270794}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hamiltonian mechanics', 'p': 'invented', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'National Academy of Sciences'}}

 Q: What is {languages spoken} of {Miriam Makeba}, that has {has influence} is {French} ?
 SPARQL: SELECT ?answer WHERE { wd:Q146256 wdt:P1412 ?answer . ?answer wdt:P737 wd:Q150}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Miriam Makeba', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has influence', 'o': 'French'}}

 Q: What is <Filmweb.pl film ID> of <Mr. Smith Goes to Washington> ?
 SPARQL: select distinct ?answer where { wd:Q866120 wdt:P5032 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mr. Smith Goes to Washington', 'p': 'Filmweb.pl film ID', 'o': '?x0'}

 Q: What is fabrication method of The Ren & Stimpy Show?
 SPARQL: select distinct ?answer where { wd:Q1361124 wdt:P2079 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Ren & Stimpy Show', 'p': 'fabrication method', 'o': '?x0'}

 Q: What is {number of speakers} of {Esperanto} that is {point in time} is {2015-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q143 p:P1098 ?s . ?s ps:P1098 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Esperanto', 'p': 'number of speakers', 'o': '?x0', 't': '2015'}

 Q: What is the kinematic viscosity of sulfuric acid (H2SO4)?
 SPARQL: select distinct ?answer where { wd:Q4118 wdt:P2118 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'sulfuric acid', 'p': 'kinematic viscosity', 'o': '?x0'}

 Q: What is the name of a data structure that starts with the letter t.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q175263 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'data structure'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: In the denomination of Sikhism, What is Martha's sainthood status?
 SPARQL: SELECT ?answer WHERE { wd:Q232453 wdt:P411 ?answer . ?answer wdt:P140 wd:Q9316}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Martha', 'p': 'sainthood status', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'denomination', 'o': 'Sikhism'}}

 Q: What is <original combination> of <Carcharocles megalodon> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1403 wd:Q163873}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'original combination', 'o': 'megalodon'}

 Q: Which is the birthplace of Alexander Nevsky, that has STD code 48535 ?
 SPARQL: SELECT ?answer WHERE { wd:Q174044 wdt:P19 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'48535'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alexander Nevsky', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'STD code', 'o': '48535'}}

 Q: which apple cultivar with highest shelf life?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15731356 . ?ent wdt:P4218 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'shelf life', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'apple cultivar'}}

 Q: what is the {mother} for {Herod the Great} has {child} as {Herod Antipas} ?
 SPARQL: SELECT ?value WHERE { wd:Q51672 p:P40 ?s . ?s ps:P40 wd:Q192950 . ?s pq:P25 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Herod the Great', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Herod Antipas'}}}

 Q: Is the electric dipole moment of acetic acid equal to 1.74?
 SPARQL: ASK WHERE { wd:Q47512 wdt:P2201 ?obj filter(?obj = 1.74) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'acetic acid', 'p': 'electric dipole moment', 'o': '?x0', '?x0': '1.74'}

 Q: Which book publishing company is owned by the University of Oxford?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q1320047 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owned by', 'o': 'University of Oxford', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book publishing company'}}

 Q: Which {artist} {precedes} by {Die, Die My Darling} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2337653 wdt:P156 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'artist', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Die, Die My Darling', 'p': 'precedes', 'o': '$y0'}}

 Q: Which is {award received} of {Kailash Satyarthi} where {statement is subject of} is {2014 Nobel Peace Prize} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3442375 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q18204229 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kailash Satyarthi', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '2014 Nobel Peace Prize'}}}

 Q: What is in the borough of Berlin U-Bahn whose inhabitants are 6000.0?
 SPARQL: SELECT ?answer WHERE { wd:Q68646 wdt:P131 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'6000.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Berlin U-Bahn', 'p': 'is in the borough of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '6000.0'}}

 Q: What was the daily newspaper for political alignment of Communist Party of the Soviet Union?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1387 wd:Q79854 . ?sbj wdt:P31 wd:Q1110794 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'political alignment', 'o': 'Communist Party of the Soviet Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'daily newspaper'}}

 Q: What is the {Wikimedia list article} for {is a list of} of {The Thinker}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P360 wd:Q18003128 . ?sbj wdt:P31 wd:Q13406463 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is a list of', 'o': 'The Thinker', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'list'}}

 Q: What is {heart pulse} of {found in species} of {glycerol} ?
 SPARQL: SELECT ?answer WHERE { wd:Q132501 wdt:P703 ?X . ?X wdt:P3395 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'heart pulse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'glycerol', 'p': 'found in species', 'o': '$y0'}}

 Q: What is Art UK collection ID for National Gallery?
 SPARQL: select distinct ?answer where { wd:Q180788 wdt:P1751 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'National Gallery', 'p': 'Art UK collection ID', 'o': '?x0'}

 Q: How many {office held by head of government} are to/by {president} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1313 wd:Q30461 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'office held by head of government', 'o': 'president'}

 Q: What is {type of film} of {musical artist} of {Jubileum Volume I} ?
 SPARQL: SELECT ?answer WHERE { wd:Q221404 wdt:P175 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of film', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jubileum Volume I', 'p': 'artist', 'o': '$y0'}}

 Q: Who is the spouse of Anggun in 2010-6-0?
 SPARQL: SELECT ?obj WHERE { wd:Q221310 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anggun', 'p': 'spouse', 'o': '?x0', 't': '2010'}

 Q: What is the {suspension bridge} with the {MIN(longest span)} whose {country} is {People's Republic of China}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12570 . ?ent wdt:P2787 ?obj . ?ent wdt:P17 wd:Q148} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'longest span', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'suspension bridge', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': "People's Republic of China"}}}

 Q: who daughters of is daughter of Charles IV of Spain ?
 SPARQL: SELECT ?answer WHERE { wd:Q183226 wdt:P25 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'daughter', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles IV', 'p': 'is daughter of', 'o': '$y0'}}

 Q: What is the {sovereign state} for {participant of} of {Korean War}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1344 wd:Q8663 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant of', 'o': 'Korean War', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Which is the fruit which contains the word pomelo in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3314483 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pomelo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fruit'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pomelo'}}

 Q: Which is the MedlinePlus ID for anorexia nervosa?
 SPARQL: select distinct ?answer where { wd:Q131749 wdt:P604 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'anorexia nervosa', 'p': 'MedlinePlus ID', 'o': '?x0'}

 Q: When did Hugh Grant received the Volpi Cup for Best Actor award?
 SPARQL: SELECT ?value WHERE { wd:Q163286 p:P166 ?s . ?s ps:P166 wd:Q2089923 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Hugh Grant', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Volpi Cup for Best Actor'}, 't': '?x0'}

 Q: Thomas Aquinas holds which position relating to his occupation?
 SPARQL:  select distinct ?obj where { wd:Q9438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Thomas Aquinas', 'p': 'occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is {continues from} of {worked at} of {Edward Snowden} ?
 SPARQL: SELECT ?answer WHERE { wd:Q13424289 wdt:P108 ?X . ?X wdt:P1365 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'continues from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edward Snowden', 'p': 'worked at', 'o': '$y0'}}

 Q: What works did the sculptor Ebenezer Scrooge do?
 SPARQL: SELECT ?answer WHERE { wd:Q626756 wdt:P170 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ebenezer Scrooge', 'p': 'sculptor', 'o': '$y0'}}

 Q: What is {in work} of {wives} of {Basil Fawlty} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1766187 wdt:P26 ?X . ?X wdt:P1441 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Basil Fawlty', 'p': 'wife', 'o': '$y0'}}

 Q: Which is the color for white?
 SPARQL: select distinct ?answer where { ?answer wdt:P462 wd:Q23444}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'color', 'o': 'white'}

 Q: Is the quantity of the borkumer Kleinbah Melitta equal to 1?
 SPARQL: ASK WHERE { wd:Q893876 wdt:P1114 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Borkumer Kleinbahn Melitta', 'p': 'quantity', 'o': '?x0', '?x0': '1'}

 Q: What is the {human} for {work location} of {Bern}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P937 wd:Q70 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'work location', 'o': 'Bern', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {educated at} of {Anne Hathaway} that is {end time} is {1993-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q36301 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anne Hathaway', 'p': 'educated at', 'o': '?x0', 't': '1993'}

 Q: What is {used for treatment} of {murder method} of {Henry Clay Frick} ?
 SPARQL: SELECT ?answer WHERE { wd:Q93709 wdt:P509 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used for treatment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Clay Frick', 'p': 'murder method', 'o': '$y0'}}

 Q: What is {top dog} of {nomination received} of {X-Men} ?
 SPARQL: SELECT ?answer WHERE { wd:Q106182 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'top dog', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'X-Men', 'p': 'nomination received', 'o': '$y0'}}

 Q: What astronaut mission of human spaceflight did Christa McAuliffe do?
 SPARQL:  select distinct ?obj where { wd:Q229674 wdt:P450 ?obj . ?obj wdt:P31 wd:Q752783 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Christa McAuliffe', 'p': 'astronaut mission', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human spaceflight'}}

 Q: what is the {point in time} for {Kevin Garnett} has {award received} as {NBA Most Valuable Player Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q189240 p:P166 ?s . ?s ps:P166 wd:Q222047 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kevin Garnett', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'NBA Most Valuable Player Award'}, 't': '?x0'}

 Q: What is {languages of expression} of {Bede}, that has {has grammatical gender} is {masculine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q154938 wdt:P1412 ?answer . ?answer wdt:P5109 wd:Q499327}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bede', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical gender', 'o': 'masculine'}}

 Q: Which  is USNPL ID for Village Voice ?
 SPARQL: select distinct ?answer where { wd:Q876158 wdt:P5454 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Village Voice', 'p': 'USNPL ID', 'o': '?x0'}

 Q: At what point in time did Lois Lowry receive a Newbery Medal award?
 SPARQL: SELECT ?value WHERE { wd:Q238124 p:P166 ?s . ?s ps:P166 wd:Q622813 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lois Lowry', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Newbery Medal'}, 't': '?x0'}

 Q: What is Boléro dedicated to?
 SPARQL: select distinct ?answer where { wd:Q327331 wdt:P825 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Boléro', 'p': 'dedicated to', 'o': '?x0'}

 Q: When Frédéric Mistral was nominated for Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q42596 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Frédéric Mistral', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: How much ammunition is need by a 9x19mm Parabellum?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P739 wd:Q135550 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'ammunition', 'o': '9x19mm'}

 Q: Which is the record label as the record label for Linda Perry?
 SPARQL:  select distinct ?obj where { wd:Q236125 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Linda Perry', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record label'}}

 Q: What is the {taxon} for {taxonomic type} of {Saccharomyces cerevisiae}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P427 wd:Q719725 . ?sbj wdt:P31 wd:Q16521 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'taxonomic type', 'o': 'Saccharomyces cerevisiae', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: is the effective firing range of SPG-82 equal to 220.0?
 SPARQL: ASK WHERE { wd:Q949345 wdt:P4176 ?obj filter(?obj = 220.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'SPG-82', 'p': 'effective firing range', 'o': '?x0', '?x0': '220.0'}

 Q: Is it true that the number of works on the Robert ap Huw Manuscripts is more than 36.0?
 SPARQL: ASK WHERE { wd:Q55774867 wdt:P3740 ?obj filter(?obj > 36.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Robert ap Huw Manuscripts', 'p': 'number of works', 'o': '?x0', '?x0': '36.0'}

 Q: Is Shanghai twinned administrative body Basel and Porto?
 SPARQL: ASK WHERE { wd:Q8686 wdt:P190 wd:Q78 . wd:Q8686 wdt:P190 wd:Q36433 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Shanghai', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Basel'}, {'h': 'IS', 'v': '?x1', 's': 'Shanghai', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Porto'}]

 Q: What is the {show dog} with the {MIN(number of subscribers)} whose {instance of} is {dog}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12008694 . ?ent wdt:P3744 ?obj . ?ent wdt:P31 wd:Q144} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'number of subscribers', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'show dog', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dog'}}}

 Q: What language uses the Phoenician alphabet?
 SPARQL:  select distinct ?obj where { wd:Q26752 wdt:P407 ?obj . ?obj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phoenician', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Which is the genetic association of the murder method of José Ferrer?
 SPARQL: SELECT ?answer WHERE { wd:Q312098 wdt:P509 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'José Ferrer', 'p': 'murder method', 'o': '$y0'}}

 Q: What is the {human} for {chief executive officer} of {ExxonMobil}
 SPARQL:  select distinct ?obj where { wd:Q156238 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ExxonMobil', 'p': 'CEO', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {start time} for {Grenoble} has {head of government} as {Éric Piolle} ?
 SPARQL: SELECT ?value WHERE { wd:Q1289 p:P6 ?s . ?s ps:P6 wd:Q16007948 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grenoble', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Éric Piolle'}}}

 Q: What is the artistic genre of the major works of Joyce Blau?
 SPARQL: SELECT ?answer WHERE { wd:Q3187221 wdt:P800 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joyce Blau', 'p': 'work', 'o': '$y0'}}

 Q: What is NSW Heritage database ID of Sydney Opera House?
 SPARQL: select distinct ?answer where { wd:Q45178 wdt:P3449 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sydney Opera House', 'p': 'NSW Heritage database ID', 'o': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Radamel Falcao García} has {member of sports team} as {Manchester United F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q138172 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'games played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Radamel Falcao', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Manchester United F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Radamel Falcao', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Manchester United F.C.'}}}]

 Q: What is {Human Development Index} of {Bulgaria} that is {point in time} in {1980-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q219 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bulgaria', 'p': 'Human Development Index', 'o': '?x0', 't': '1980'}

 Q: What is award received of Robert Fisk that is point in time is 2000-0-0 ?
 SPARQL: SELECT ?obj WHERE { wd:Q310900 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Robert Fisk', 'p': 'award received', 'o': '?x0', 't': '2000'}

 Q: What is {deathplace} of {Bjørnstjerne Bjørnson}, that has {has local government areas} is {11th arrondissement of Paris} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46405 wdt:P20 ?answer . ?answer wdt:P150 wd:Q169293}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bjørnstjerne Bjørnson', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has local government areas', 'o': '11th arrondissement of Paris'}}

 Q: When did position held of Charles Stewart Parnell and elected in?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q317436 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Stewart Parnell', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Stewart Parnell', 'p': 'position held', 'o': '$y0'}}]

 Q: How many discoverers are there of mathematical induction?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q178377 wdt:P61 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'mathematical induction', 'p': 'discoverer', 'o': '?x0'}

 Q: What is {academic degree} and {academic major} of {{Sylvia Plath} has {educated at} as {Smith College}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q133054 p:P69 ?s . ?s ps:P69 wd:Q49204 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvia Plath', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Smith College'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sylvia Plath', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Smith College'}}}]

 Q: Which part of constellation orbits the Djorgovski 1?
 SPARQL: SELECT ?answer WHERE { wd:Q9207890 wdt:P397 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Djorgovski 1', 'p': 'orbits', 'o': '$y0'}}

 Q: Which is C-SPAN person ID for Slavoj Žižek?
 SPARQL: select distinct ?answer where { wd:Q184750 wdt:P2190 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Slavoj Žižek', 'p': 'C-SPAN person ID', 'o': '?x0'}

 Q: How many are followed by the Kingdom of Georgia?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q154667 wdt:P156 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Kingdom of Georgia', 'p': 'followed by', 'o': '?x0'}

 Q: what is the {proportion} for {Japan} has {ethnic group} as {Japanese people} ?
 SPARQL: SELECT ?value WHERE { wd:Q17 p:P172 ?s . ?s ps:P172 wd:Q161652 . ?s pq:P1107 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'proportion', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Japan', 'p': 'people', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'people', 'o': 'Japanese'}}}

 Q: What is the {chemical compound} for {conjugate acid} of {water}
 SPARQL:  select distinct ?obj where { wd:Q283 wdt:P4147 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'water', 'p': 'conjugate acid', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Who is the male of Owain Glyndŵr, whose abbreviation is 男?
 SPARQL: SELECT ?answer WHERE { wd:Q317279 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'男'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Owain Glyndŵr', 'p': 'male', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'abbreviation', 'o': '男'}}

