 Q: Cairo is located in which country that began on May second in the year 1250?
 SPARQL: SELECT ?obj WHERE { wd:Q85 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1250')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cairo', 'p': 'country', 'o': '?x0', 't': '1250'}

 Q: What is {seat} of {built by} of {Mastermind} ?
 SPARQL: SELECT ?answer WHERE { wd:Q17286 wdt:P176 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'seat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mastermind', 'p': 'built by', 'o': '$y0'}}

 Q: What are notation which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001982 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'notation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: what is the {start time} for {Moscow State University} has {rector} as {Ivan Udaltsov} ?
 SPARQL: SELECT ?value WHERE { wd:Q13164 p:P1075 ?s . ?s ps:P1075 wd:Q4469264 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moscow State University', 'p': 'rector', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'rector', 'o': 'Ivan Udaltsov'}}}

 Q: What is {follows} and {followed by} of {{Gediminas} has {noble title} as {Grand Duke of Lithuania}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q244852 p:P97 ?s . ?s ps:P97 wd:Q2639920 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gediminas', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'Grand Duke of Lithuania'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'followed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gediminas', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'Grand Duke of Lithuania'}}}]

 Q: where is the {point in time} for {bell hooks} who has {educated at} as {Stanford University} ?
 SPARQL: SELECT ?value WHERE { wd:Q259507 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'bell hooks', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Stanford University'}, 't': '?x0'}

 Q: what is the {academic major} for {Rani Mukherjee} has {educated at} as {SNDT Women's University} ?
 SPARQL: SELECT ?value WHERE { wd:Q485557 p:P69 ?s . ?s ps:P69 wd:Q7391831 . ?s pq:P812 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rani Mukherjee', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': "SNDT Women's University"}}}

 Q: What is {musician} of {track list} of {The Fragile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q902850 wdt:P658 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'musician', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Fragile', 'p': 'track list', 'o': '$y0'}}

 Q: Did the 2008 Iwate-Miyagi Nairiku earthquake reach JMA magnitude 5.76?
 SPARQL: ASK WHERE { wd:Q748301 wdt:P5900 ?obj filter(?obj = 5.76) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '2008 Iwate-Miyagi Nairiku earthquake', 'p': 'JMA Magnitude', 'o': '?x0', '?x0': '5.76'}

 Q: What is Mira's type of variable star?
 SPARQL: select distinct ?answer where { wd:Q12965 wdt:P881 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mira', 'p': 'type of variable star', 'o': '?x0'}

 Q: What is the {Wikidata property related to online communities} for {conferred by} of {YouTube}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1027 wd:Q866 . ?sbj wdt:P31 wd:Q30041186 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conferred by', 'o': 'YouTube', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikidata property related to online communities'}}

 Q: Is it true that the mean age of the Karlovy Vary District equal to 43.2?
 SPARQL: ASK WHERE { wd:Q757240 wdt:P4442 ?obj filter(?obj = 43.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Karlovy Vary District', 'p': 'mean age', 'o': '?x0', '?x0': '43.2'}

 Q: What was the inflation rate of Sri Lanka on 1-1-2004?
 SPARQL: SELECT ?obj WHERE { wd:Q854 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sri Lanka', 'p': 'inflation rate', 'o': '?x0', 't': '2004'}

 Q: Which television series has the highest number of episodes?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P3740 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of works', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}}

 Q: What was the namesake for Bohr radius with a recognition title of Copley Medal?
 SPARQL: SELECT ?answer WHERE { wd:Q652571 wdt:P138 ?answer . ?answer wdt:P166 wd:Q28003}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bohr radius', 'p': 'namesake', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'recognition title', 'o': 'Copley Medal'}}

 Q: "Where is {borders} of {Wuxi}, which has {sister city} is {Grenoble} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q42651 wdt:P47 ?answer . ?answer wdt:P190 wd:Q1289}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wuxi', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Grenoble'}}

 Q: How many language regulatory bodys are there for Portuguese?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q5146 wdt:P1018 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Portuguese', 'p': 'language regulatory body', 'o': '?x0'}

 Q: When did educated at of David Cameron and academic degree?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q192 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Cameron', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Cameron', 'p': 'educated at', 'o': '$y0'}}]

 Q: Does the installed capacity of the HMS Terror equals 30?
 SPARQL: ASK WHERE { wd:Q141667 wdt:P2109 ?obj filter(?obj = 30) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'HMS Terror', 'p': 'installed capacity', 'o': '?x0', '?x0': '30'}

 Q: "Who is the {spouse} of {Lauryn Hill}, that has {craft} who is a {Canadian football player} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q214226 wdt:P26 ?answer . ?answer wdt:P106 wd:Q19841381}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lauryn Hill', 'p': 'spouse', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'craft', 'o': 'Canadian football player'}}

 Q: Was Johnny Carson's occupation a military officer and/or journalist?
 SPARQL: ASK WHERE { wd:Q310819 wdt:P106 wd:Q189290 . wd:Q310819 wdt:P106 wd:Q1930187 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Johnny Carson', 'p': 'occupation', 'o': '?x0', '?x0': 'military officer'}, {'h': 'IS', 'v': '?x1', 's': 'Johnny Carson', 'p': 'occupation', 'o': '?x1', '?x1': 'journalist'}]

 Q: What are the series of creative works that starts with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725310 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'series of creative works'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is short name  of Leviticus ?
 SPARQL: select distinct ?answer where { wd:Q41490 wdt:P1813 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leviticus', 'p': 'short name', 'o': '?x0'}

 Q: How many {child astronomical body} are for {Virgo Supercluster} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q175760 wdt:P398 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Virgo Supercluster', 'p': 'child astronomical body', 'o': '?x0'}

 Q: what is the {point in time} for {Luiz Inácio Lula da Silva} has {award received} as {Grand Cross of the Order of the Sun of Peru‎} ?
 SPARQL: SELECT ?value WHERE { wd:Q37181 p:P166 ?s . ?s ps:P166 wd:Q25755314 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lula', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grand Cross of the Order of the Sun of Peru\u200e'}, 't': '?x0'}

 Q: Give me {German nationalism} that starts with {'n'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q370744 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'German nationalism'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is {celebrates} of {Mawlid an-Nabi}, that has {is the opposite of} is {death anniversary} ?
 SPARQL: SELECT ?answer WHERE { wd:Q193027 wdt:P547 ?answer . ?answer wdt:P461 wd:Q1202197}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mawlid', 'p': 'celebrates', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'opposite of', 'o': 'death anniversary'}}

 Q: What is {location of work} of {Joseph Freiherr von Eichendorff}, that has {twin cities} is {Rotterdam} ?
 SPARQL: SELECT ?answer WHERE { wd:Q77204 wdt:P937 ?answer . ?answer wdt:P190 wd:Q34370}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Freiherr von Eichendorff', 'p': 'location of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'twin cities', 'o': 'Rotterdam'}}

 Q: What is garrison in Commonwealth of Nations having category of associated people of Category:People from London?
 SPARQL: SELECT ?answer WHERE { wd:Q7785 wdt:P159 ?answer . ?answer wdt:P1792 wd:Q6356996}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Commonwealth of Nations', 'p': 'garrison', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'category of associated people', 'o': 'Category:People from London'}}

 Q: How many signatories are there for the {U.S. Declaration of Independence} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q127912 wdt:P1891 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Declaration of Independence', 'p': 'signatories', 'o': '?x0'}

 Q: When was the inflation rate of 3.1 in Macedonia ?
 SPARQL: SELECT ?value WHERE { wd:Q221 p:P1279 ?s . ?s ps:P1279 ?x filter(contains(?x,'3.1')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Macedonia', 'p': 'inflation rate', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'inflation rate', 'o': '3.1'}, 't': '?x0'}

 Q: What is the {federal state} for {head of state} of {Jefferson Davis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q162269 . ?sbj wdt:P31 wd:Q43702 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'president', 'o': 'Jefferson Davis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal state'}}

 Q: Give me the country of Hebron that started in 1948
 SPARQL: SELECT ?obj WHERE { wd:Q168225 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1948')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hebron', 'p': 'country', 'o': '?x0', 't': '1948'}

 Q: What is {award received} of {W. D. Hamilton} that is {point in time} is {1991-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q15451 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'W. D. Hamilton', 'p': 'win', 'o': '?x0', 't': '1991'}

 Q: What is {has arrondissements} of {German Democratic Republic}, that has {governor} is {Karl Steinhoff} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16957 wdt:P150 ?answer . ?answer wdt:P6 wd:Q531807}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'German Democratic Republic', 'p': 'has arrondissements', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'governor', 'o': 'Karl Steinhoff'}}

 Q: Who is the employer conservatory of Pyotr llyich Tchaikovsky?
 SPARQL:  select distinct ?obj where { wd:Q7315 wdt:P108 ?obj . ?obj wdt:P31 wd:Q184644 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tchaikovsky', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conservatory'}}

 Q: What award did Enrique Peña Nieto receive in 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q296741 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Enrique Peña Nieto', 'p': 'award', 'o': '?x0', 't': '2015'}

 Q: What is Lyubov Orlova's Zemereshet artist ID?
 SPARQL: select distinct ?answer where { wd:Q236229 wdt:P4071 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lyubov Orlova', 'p': 'Zemereshet artist ID', 'o': '?x0'}

 Q: Which is the parent club of the St. Louis Cardinals?
 SPARQL: select distinct ?answer where { ?answer wdt:P831 wd:Q504309}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent club', 'o': 'St. Louis Cardinals'}

 Q: What are the city with millions of inhabitants which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1637706 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city with millions of inhabitants'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is the religion of Druze ?
 SPARQL:  select distinct ?obj where { wd:Q163943 wdt:P140 ?obj . ?obj wdt:P31 wd:Q9174 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Druze', 'p': 'religion', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religion'}}

 Q: What is the {UCI Trade Team I} for {member of sports team} of {Bradley Wiggins}
 SPARQL:  select distinct ?obj where { wd:Q193876 wdt:P54 ?obj . ?obj wdt:P31 wd:Q20653563 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bradley Wiggins', 'p': 'member of sports team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'UCI Trade Team I'}}

 Q: What is penalty of Aileen Wuornos?
 SPARQL: select distinct ?answer where { wd:Q264849 wdt:P1596 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aileen Wuornos', 'p': 'penalty', 'o': '?x0'}

 Q: Was Orson Welles educated at the School of the Art Institute of Chicago and Cawthra Park Secondary School?
 SPARQL: ASK WHERE { wd:Q24829 wdt:P69 wd:Q7432601 . wd:Q24829 wdt:P69 wd:Q5055242 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Orson Welles', 'p': 'educated at', 'o': '?x0', '?x0': 'School of the Art Institute of Chicago'}, {'h': 'IS', 'v': '?x1', 's': 'Orson Welles', 'p': 'educated at', 'o': '?x1', '?x1': 'Cawthra Park Secondary School'}]

 Q: Tell the name of military museum with the highest number of visitors per year whose location is les invalides?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2772772 . ?ent wdt:P1174 ?obj . ?ent wdt:P276 wd:Q188977 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'visitors per year', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military museum', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Les Invalides'}}}

 Q: Was Achilles the partner of Helen of Troy and Penthesilea?
 SPARQL: ASK WHERE { wd:Q41746 wdt:P451 wd:Q164061 . wd:Q41746 wdt:P451 wd:Q379828 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Achilles', 'p': 'partner', 'o': '?x0', '?x0': 'Helen of Troy'}, {'h': 'IS', 'v': '?x1', 's': 'Achilles', 'p': 'partner', 'o': '?x1', '?x1': 'Penthesilea'}]

 Q: What education does Sergei Diaghilev have that begins at 1890-8-1?
 SPARQL: SELECT ?obj WHERE { wd:Q211513 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1890')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sergei Diaghilev', 'p': 'education', 'o': '?x0', 't': '1890'}

 Q: Who is the candidate Emmanuel Macron?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P726 wd:Q3052772 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'candidate', 'o': 'Emmanuel Macron'}

 Q: What is {electoral district} and {end cause} of {{George Cayley} has {position held} as {Member of the 11th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q319362 p:P39 ?s . ?s ps:P39 wd:Q41582546 . ?s pq:P768 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Cayley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 11th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Cayley', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 11th Parliament of the United Kingdom'}}}]

 Q: What is a dynasty that begins with the letter p?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164950 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dynasty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is the {sovereign state} for {country} of {Madrid}
 SPARQL:  select distinct ?obj where { wd:Q2807 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Madrid', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is the {archipelagic state} for {head of government} of {Joko Widodo}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q3318231 . ?sbj wdt:P31 wd:Q13107770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Joko Widodo', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archipelagic state'}}

 Q: what is a flag image of Nebraska
 SPARQL: select distinct ?answer where { wd:Q1553 wdt:P41 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nebraska', 'p': 'flag image', 'o': '?x0'}

 Q: What is {scientific discipline} of {writer} of {Structural colouration of mammalian skin: convergent evolution of coherently scattering dermal collagen arrays.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q31061242 wdt:P50 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Structural colouration of mammalian skin: convergent evolution of coherently scattering dermal collagen arrays.', 'p': 'author', 'o': '$y0'}}

 Q: What is the {type of quantum particle} for {antiparticle} of {electron}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2152 wd:Q2225 . ?sbj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'antiparticle', 'o': 'electron', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: Who is the discoverer of the Iron Curtain and had political office held as the First Lord of the Admiralty?
 SPARQL: SELECT ?answer WHERE { wd:Q124425 wdt:P61 ?answer . ?answer wdt:P39 wd:Q21561383}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Iron Curtain', 'p': 'discoverer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'political office held', 'o': 'First Lord of the Admiralty'}}

 Q: Which is Conseil constitutionnel ID for Jacques Chirac?
 SPARQL: select distinct ?answer where { wd:Q2105 wdt:P5457 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jacques Chirac', 'p': 'Conseil constitutionnel ID', 'o': '?x0'}

 Q: How many notable work done by the Henrik Ibsen} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q36661 wdt:P800 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Henrik Ibsen', 'p': 'notable work', 'o': '?x0'}

 Q: Give me {cryptocurrency} that {notation} {Bitcoin currency sign} and which that starts with {'b'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P913 wd:Q23055403 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cryptocurrency', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'notation', 'o': 'Bitcoin currency sign'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: what is the {for work} for {Jacques Tati} has {award received} as {Jury Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q51549 p:P166 ?s . ?s ps:P166 wd:Q164200 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jacques Tati', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Jury Prize'}}}

 Q: What is {sector} of {holding company} of {Bombardier Transportation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q688893 wdt:P749 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sector', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bombardier Transportation', 'p': 'parent company', 'o': '$y0'}}

 Q: What is tributary on the shore of Lanzarote?
 SPARQL: SELECT ?answer WHERE { wd:Q182432 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lanzarote', 'p': 'on the shore of', 'o': '$y0'}}

 Q: Did {Alex_Rodriguez} {member of sports team} {Baltimore Orioles} and {Trenton Thunder} ?
 SPARQL: ASK WHERE { wd:Q558664 wdt:P54 wd:Q650816 . wd:Q558664 wdt:P54 wd:Q3526064 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Alex Rodriguez', 'p': 'member of sports team', 'o': '?x0', '?x0': 'Baltimore Orioles'}, {'h': 'IS', 'v': '?x1', 's': 'Alex Rodriguez', 'p': 'member of sports team', 'o': '?x1', '?x1': 'Trenton Thunder'}]

 Q: Tell me ethnoreligious group whose name has the word yazidis in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11197007 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yazidis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnoreligious group'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yazidis'}}

 Q: How many {production statistics} are to/by {cider} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2746 wd:Q167296 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'production statistics', 'o': 'cider'}

 Q: What is {publishing house} of {published in journal} of {Once-daily gentamicin administration for community-associated methicillin resistant Staphylococcus aureus in an in vitro pharmacodynamic model: preliminary reports for the advantages for optimizing pharmacodynamic index.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41877860 wdt:P1433 ?X . ?X wdt:P123 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publishing house', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Once-daily gentamicin administration for community-associated methicillin resistant Staphylococcus aureus in an in vitro pharmacodynamic model: preliminary reports for the advantages for optimizing pharmacodynamic index.', 'p': 'published in', 'o': '$y0'}}

 Q: Which South Australian House of Assembly by-election had the most ballots cast?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q51879476 . ?ent wdt:P1868 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'ballots cast', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'South Australian House of Assembly by-election'}}

 Q: What is {building date} of {battle} of {Muammar al-Gaddafi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19878 wdt:P607 ?X . ?X wdt:P580 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'building date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gaddafi', 'p': 'battle', 'o': '$y0'}}

 Q: Is it true ethanol has a role as a solvent and a GABA reuptake inhibitor?
 SPARQL: ASK WHERE { wd:Q153 wdt:P2868 wd:Q146505 . wd:Q153 wdt:P2868 wd:Q5512768 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'ethanol', 'p': 'role', 'o': '?x0', '?x0': 'solvent'}, {'h': 'IS', 'v': '?x1', 's': 'ethanol', 'p': 'role', 'o': '?x1', '?x1': 'GABA reuptake inhibitor'}]

 Q: What is {founders} of {LaVeyan Satanism}, that has {biological sex} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q256223 wdt:P112 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'LaVeyan Satanism', 'p': 'founders', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'man', 'o': 'man'}}

 Q: Where is the grave that commemorates Ulysses S. Grant?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P547 wd:Q34836 . ?sbj wdt:P31 wd:Q173387 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'commemorates', 'o': 'Ulysses S. Grant', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'grave'}}

 Q: What are Hon Hai Precision Industry's total assets for 12-23-2016?
 SPARQL: SELECT ?obj WHERE { wd:Q463094 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hon Hai', 'p': 'total assets', 'o': '?x0', 't': '2016'}

 Q: Which is the Behind The Voice Actors character ID of Donald Duck?
 SPARQL: select distinct ?answer where { wd:Q6550 wdt:P5107 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Donald Duck', 'p': 'Behind The Voice Actors character ID', 'o': '?x0'}

 Q: What is {discoverer or inventor of} of {Trapezium Cluster}, that has {fields} is {physics} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14031 wdt:P61 ?answer . ?answer wdt:P101 wd:Q413}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Trapezium Cluster', 'p': 'discoverer or inventor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'fields', 'o': 'physics'}}

 Q: What is the {private not-for-profit educational institution} for {archives at} of {Jefferson Davis}
 SPARQL:  select distinct ?obj where { wd:Q162269 wdt:P485 ?obj . ?obj wdt:P31 wd:Q23002054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jefferson Davis', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private not-for-profit educational institution'}}

 Q: What is {award received} of {Yehudi Menuhin} that is {point in time} is {1996-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q156814 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1996')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yehudi Menuhin', 'p': 'award', 'o': '?x0', 't': '1996'}

 Q: What is the {G-type main-sequence star} for {parent astronomical body} of {Pluto}
 SPARQL:  select distinct ?obj where { wd:Q339 wdt:P397 ?obj . ?obj wdt:P31 wd:Q5864 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pluto', 'p': 'star', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: What is the {material used} and the {operator} of {Airbus_A380} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q5830 wdt:P186 ?ans_1 . wd:Q5830 wdt:P137 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Airbus A380', 'p': 'material used', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Airbus A380', 'p': 'operator', 'o': '?x1'}]

 Q: What is {end cause} and {end time} of {{George Canning} has {country of citizenship} as {Kingdom of Great Britain}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q219731 p:P27 ?s . ?s ps:P27 wd:Q161885 . ?s pq:P1534 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Canning', 'p': 'citizen of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'citizen of', 'o': 'Great Britain'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Canning', 'p': 'citizen of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'citizen of', 'o': 'Great Britain'}}}]

 Q: Which is the JMA Seismic Intensity Scale for 2011 Tōhoku earthquake and tsunami?
 SPARQL: select distinct ?answer where { wd:Q36204 wdt:P5386 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '2011 Tōhoku earthquake and tsunami', 'p': 'JMA Seismic Intensity Scale', 'o': '?x0'}

 Q: what is the {instance of} for {Chaitanya Mahaprabhu} has {date of birth} as {1486-1-1} ?
 SPARQL: SELECT ?value WHERE { wd:Q870262 p:P569 ?s . ?s ps:P569 ?x filter(contains(YEAR(?x),'1486')) . ?s pq:P31 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chaitanya Mahaprabhu', 'p': 'date of birth', 'o': '$y0'}}

 Q: Tell me notation whose name has the word symbol  in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001982 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'symbol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'notation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'symbol'}}

 Q: Fernando de Noronha is coextensive with what?
 SPARQL: select distinct ?answer where { ?answer wdt:P3403 wd:Q175057}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'coextensive with', 'o': 'Fernando de Noronha'}

 Q: who was the spouse of Joan Collins back in 1972?
 SPARQL: SELECT ?obj WHERE { wd:Q152843 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1972')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joan Collins', 'p': 'spouse', 'o': '?x0', 't': '1972'}

 Q: When did animated feature film for voice actor of Tom Hanks?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q2263 . ?sbj wdt:P31 wd:Q29168811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Tom Hanks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated feature film'}}

 Q: Which is the excipient which is an active ingredient in Sclerosol and that contains the word talc in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj wdt:P3780 wd:Q47522115 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'talc')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'excipient', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'active ingredient in', 'o': 'Sclerosol'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'talc'}}

 Q: What is the etymology of Bayes' theorem, that contains a death dated on 1761-4-17?
 SPARQL: SELECT ?answer WHERE { wd:Q182505 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1761'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Bayes' theorem", 'p': 'etymology', 'o': '?x0', 't': '1761'}

