 Q: Name the death location of Derek Walcott, which has a human population of 90913.
 SPARQL: SELECT ?answer WHERE { wd:Q132701 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'90913.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Derek Walcott', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '90913.0'}}

 Q: Which is the conflict of Joan of Arc?
 SPARQL:  select distinct ?obj where { wd:Q7226 wdt:P607 ?obj . ?obj wdt:P31 wd:Q180684 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joan of Arc', 'p': 'conflict', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conflict'}}

 Q: What award did Liam Neeson receive on December 31, 1999?
 SPARQL: SELECT ?obj WHERE { wd:Q58444 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1999')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Liam Neeson', 'p': 'award', 'o': '?x0', 't': '1999'}

 Q: Is drinking waters electrical resistivity equal to 20?
 SPARQL: ASK WHERE { wd:Q7892 wdt:P5679 ?obj filter(?obj = 20) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'drinking water', 'p': 'electrical resistivity', 'o': '?x0', '?x0': '20'}

 Q: What is {scholarly field for} of {academic discipline} of {Mieczysław Kobylański} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11779820 wdt:P101 ?X . ?X wdt:P2578 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'scholarly field for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mieczysław Kobylański', 'p': 'discipline', 'o': '$y0'}}

 Q: When did Muhammad stop practicing the Hanif religion?
 SPARQL: SELECT ?value WHERE { wd:Q9458 p:P140 ?s . ?s ps:P140 wd:Q425381 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Muhammad', 'p': 'religion', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'religion', 'o': 'Hanif'}}}

 Q: What is the highest point by Mount Ararat?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P610 wd:Q72303 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'highest point', 'o': 'Mount Ararat'}

 Q: What is the parent organization of the United States Secret Service and where is their headquarters located?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q503224 wdt:P159 ?ans_1 . wd:Q503224 wdt:P749 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'United States Secret Service', 'p': 'headquarters', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'United States Secret Service', 'p': 'parent organization', 'o': '?x1'}]

 Q: what is the {end time} for {Cindy Crawford} has {spouse} as {Richard Gere} ?
 SPARQL: SELECT ?value WHERE { wd:Q199801 p:P26 ?s . ?s ps:P26 wd:Q48410 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cindy Crawford', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Richard Gere'}}}

 Q: What is the national anthem the topic of in the history of Dagestan?
 SPARQL: SELECT ?answer WHERE { wd:Q2024068 wdt:P1269 ?X . ?X wdt:P85 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'anthem', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Dagestan', 'p': 'topic of', 'o': '$y0'}}

 Q: What is the JUFO ID of The New York Review of Books?
 SPARQL: select distinct ?answer where { wd:Q1426223 wdt:P1277 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The New York Review of Books', 'p': 'JUFO ID', 'o': '?x0'}

 Q: Give me {economic indicator} that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1167393 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic indicator'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is Family Guy's country of origin and the language?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q5930 wdt:P495 ?ans_1 . wd:Q5930 wdt:P407 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Family Guy', 'p': 'country of origin', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Family Guy', 'p': 'language', 'o': '?x1'}]

 Q: Where is the list of episodes for "Lassie"?
 SPARQL: select distinct ?answer where { wd:Q289537 wdt:P1811 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lassie', 'p': 'list of episodes', 'o': '?x0'}

 Q: What is <BHL creator ID> of <William Bateson> ?
 SPARQL: select distinct ?answer where { wd:Q297302 wdt:P4081 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'William Bateson', 'p': 'BHL creator ID', 'o': '?x0'}

 Q: What is {academic major} and {end time} of {{Christopher A. Sims} has {educated at} as {Harvard University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q109737 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher A. Sims', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'to', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher A. Sims', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard'}}}]

 Q: 262570000000 is the market capitalization of the Nokia?
 SPARQL: ASK WHERE { wd:Q1418 wdt:P2226 ?obj filter(?obj = 26257000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nokia', 'p': 'market capitalization', 'o': '?x0', '?x0': '26257000000'}

 Q: What is {governing body} of {sports} of {FIFA World Cup} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19317 wdt:P641 ?X . ?X wdt:P797 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'governing body', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'FIFA World Cup', 'p': 'sport', 'o': '$y0'}}

 Q: "What is  Hiroshima Prefecture'S borders, that has Tsugumasa Muraoka   
as head of national government?"
 SPARQL: SELECT ?answer WHERE { wd:Q617375 wdt:P47 ?answer . ?answer wdt:P6 wd:Q15830756}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hiroshima Prefecture', 'p': 'border', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'head of national government', 'o': 'Tsugumasa Muraoka'}}

 Q: How many approved by are by Free Software Foundation?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P790 wd:Q48413 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'approved by', 'o': 'Free Software Foundation'}

 Q: What is the {Austrian legislative election} with the {MAX(age of candidacy)} whose {candidate} is {Die Grünen}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22268901 . ?ent wdt:P2998 ?obj . ?ent wdt:P726 wd:Q193178 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'age of candidacy', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Austrian legislative election', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'candidate', 'o': 'Die Grünen'}}}

 Q: What is art-name of Lin Biao ?
 SPARQL: select distinct ?answer where { wd:Q315475 wdt:P1787 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lin Biao', 'p': 'art-name', 'o': '?x0'}

 Q: When did Jolin Tsai and Jay Chou stop being partners?
 SPARQL: SELECT ?value WHERE { wd:Q51101 p:P451 ?s . ?s ps:P451 wd:Q238819 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jolin Tsai', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Jay Chou'}}}

 Q: What award did Jean Tirole receive in 1998?
 SPARQL: SELECT ?obj WHERE { wd:Q173994 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1998')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jean Tirole', 'p': 'award', 'o': '?x0', 't': '1998'}

 Q: what is the {start time} for {Marcel Dassault} has {position held} as {member of the French National Assembly} ?
 SPARQL: SELECT ?value WHERE { wd:Q160802 p:P39 ?s . ?s ps:P39 wd:Q3044918 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marcel Dassault', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the French National Assembly'}}}

 Q: What is {genre} and {publisher} of {{Christopher Hitchens} has {notable work} as {Hitch-22}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q3138625 . ?s pq:P136 ?value1 . ?s pq:P123 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Hitch-22'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'publisher', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Hitch-22'}}}]

 Q: What is {subitem of} of {history of Quebec}, that has {border} is {Maine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q375513 wdt:P1269 ?answer . ?answer wdt:P47 wd:Q724}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Quebec', 'p': 'subitem of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Maine'}}

 Q: What is the {human} for {head of government} of {Auckland}
 SPARQL:  select distinct ?obj where { wd:Q37100 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Auckland', 'p': 'head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the vapor pressure of fluorine?
 SPARQL: select distinct ?answer where { wd:Q650 wdt:P2119 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fluorine', 'p': 'vapor pressure', 'o': '?x0'}

 Q: What is the {gene} for {genetic association} of {Asperger syndrome}
 SPARQL:  select distinct ?obj where { wd:Q161790 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Asperger syndrome', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: How many creators are with the Pokémon?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q239937 wdt:P170 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Pokémon', 'p': 'creator', 'o': '?x0'}

 Q: How many protocol in the Internet Protocol version 4?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2700 wd:Q11103 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'protocol', 'o': 'Internet Protocol version 4'}

 Q: Is the retirement age of the Netherlands 67?
 SPARQL: ASK WHERE { wd:Q55 wdt:P3001 ?obj filter(?obj = 67) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Netherlands', 'p': 'retirement age', 'o': '?x0', '?x0': '67'}

 Q: Is the points for the Hermann Pernsteiner more than 9.6?
 SPARQL: ASK WHERE { wd:Q25713100 wdt:P1358 ?obj filter(?obj > 9.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Hermann Pernsteiner', 'p': 'points for', 'o': '?x0', '?x0': '9.6'}

 Q: Bohemian Rhapsody's Tab4u song ID?
 SPARQL: select distinct ?answer where { wd:Q187745 wdt:P3838 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bohemian Rhapsody', 'p': 'Tab4u song ID', 'o': '?x0'}

 Q: What is {elected in} and {end cause} of {{Henry Campbell-Bannerman} has {position held} as {Member of the 20th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q106618 p:P39 ?s . ?s ps:P39 wd:Q41582560 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Campbell-Bannerman', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 20th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Campbell-Bannerman', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 20th Parliament of the United Kingdom'}}}]

 Q: Is the flexural strain at break of the beauxite filled epoxy composite less than 4.8?
 SPARQL: ASK WHERE { wd:Q57594719 wdt:P6014 ?obj filter(?obj < 4.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'beauxite filled epoxy composite', 'p': 'flexural strain at break', 'o': '?x0', '?x0': '4.8'}

 Q: Does the GDP (PPP) of North Macedonia equal to 29257308598.29?
 SPARQL: ASK WHERE { wd:Q221 wdt:P4010 ?obj filter(?obj = 29257308598.29) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'North Macedonia', 'p': 'GDP (PPP)', 'o': '?x0', '?x0': '29257308598.29'}

 Q: when is the {start time} for {Wales} thathas {located in the administrative territorial entity} as {Kingdom of England} ?
 SPARQL: SELECT ?value WHERE { wd:Q25 p:P131 ?s . ?s ps:P131 wd:Q179876 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wales', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Kingdom of England'}}}

 Q: What is distinct from the 111.212 carillon of Hornbostel-Sachs?
 SPARQL: SELECT ?answer WHERE { wd:Q505174 wdt:P1889 ?answer . ?answer wdt:P1762 ?x FILTER(contains(?x,'111.212'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'carillon', 'p': 'distinct from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Hornbostel-Sachs', 'o': '111.212'}}

 Q: What is {date of birth} and {date of death} of {{Frederick William I of Prussia} has {child} as {Prince Augustus William of Prussia}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q213658 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Prince Augustus William of Prussia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'son', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'son', 'o': 'Prince Augustus William of Prussia'}}}]

 Q: what is the {start time} for {Ferenc Molnár} has {spouse} as {Lili Darvas} ?
 SPARQL: SELECT ?value WHERE { wd:Q296809 p:P26 ?s . ?s ps:P26 wd:Q762952 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ferenc Molnár', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Lili Darvas'}}}

 Q: Who gave the{birthdate} of {doctoral student} of {Martin Luther} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9554 wdt:P185 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthdate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Luther', 'p': 'doctoral student', 'o': '$y0'}}

 Q: What is <Digital Rights Management system> of <die> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1032 wd:Q45089}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'Digital Rights Management system', 'o': 'die'}

 Q: How many {encoded by} are for {L-Threonine} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q186521 wdt:P702 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'L-Threonine', 'p': 'encoded by', 'o': '?x0'}

 Q: what is the {appointed by} for {John Dryden} has {position held} as {Poet Laureate of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q213355 p:P39 ?s . ?s ps:P39 wd:Q877838 . ?s pq:P748 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'appointed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Dryden', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Poet Laureate of the United Kingdom'}}}

 Q: What's the Carnegie Classification of Institutions of Higher Education that Ben Affleck graduated from?
 SPARQL: SELECT ?answer WHERE { wd:Q483118 wdt:P69 ?X . ?X wdt:P2643 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Carnegie Classification of Institutions of Higher Education', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ben Affleck', 'p': 'graduated from', 'o': '$y0'}}

 Q: What is the {lighthouse} for {country} of {Ancient Egypt}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q11768 . ?sbj wdt:P31 wd:Q39715 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Ancient Egypt', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'lighthouse'}}

 Q: Is the minimum wavelength of sensitivity of the human eye equal to 320.0?
 SPARQL: ASK WHERE { wd:Q430024 wdt:P3738 ?obj filter(?obj = 320.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'human eye', 'p': 'minimum wavelength of sensitivity', 'o': '?x0', '?x0': '320.0'}

 Q: What is the {human} for {student} of {Enrico Fermi}
 SPARQL:  select distinct ?obj where { wd:Q8753 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Enrico Fermi', 'p': 'student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {polyatomic cation} for {conjugate acid} of {ammonia}
 SPARQL:  select distinct ?obj where { wd:Q4087 wdt:P4147 ?obj . ?obj wdt:P31 wd:Q55511472 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ammonia', 'p': 'conjugate acid', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'polyatomic cation'}}

 Q: What is {member of sports team} of {Cha Bum-kun} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q346751 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cha Bum-kun', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cha Bum-kun', 'p': 'team', 'o': '$y0'}}]

 Q: What is the alma mater of Andrew Marvell, which is also the alma mater of director Martin Rees?
 SPARQL: SELECT ?answer WHERE { wd:Q365935 wdt:P69 ?answer . ?answer wdt:P1037 wd:Q335213}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrew Marvell', 'p': 'alma mater', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Martin Rees'}}

 Q: What is {member of sports team} of {Malcolm Allison} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1383862 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Allison', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Allison', 'p': 'team', 'o': '$y0'}}]

 Q: Which  is asteroid family of Haumea ?
 SPARQL: select distinct ?answer where { wd:Q601 wdt:P744 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Haumea', 'p': 'asteroid family', 'o': '?x0'}

 Q: Who are the members of sports team Dixie Dean in the year 1931?
 SPARQL: SELECT ?obj WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'9311')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dixie Dean', 'p': 'team', 'o': '?x0', 't': '9311'}

 Q: What federation has the highest median income?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q43702 . ?ent wdt:P3529 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'median income', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federation'}}

 Q: Which is {award received} of {Michael Ende} where {point in time} is {1986-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76498 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1986')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michael Ende', 'p': 'award received', 'o': '?x0', 't': '1986'}

 Q: What is {nominated for} of {Top Gun} that is {statement is subject of} is {59th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q110138 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917235 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Top Gun', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '59th Academy Awards'}}}

 Q: Tell me contract whose name has the word zeitausgleich in it name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q93288 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeitausgleich')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'contract'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeitausgleich'}}

 Q: Is Jack the Ripper said to be the same as Sir John Williams, 1st Baronet of the City of London?
 SPARQL: ASK WHERE { wd:Q43963 wdt:P460 wd:Q7528143 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Jack the Ripper', 'p': 'said to be the same as', 'o': '?x0', '?x0': 'John Williams'}]

 Q: What is the {website} for {language used} of {Esperanto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q143 . ?sbj wdt:P31 wd:Q35127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Esperanto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'website'}}

 Q: What are the uses and the opposite of linear regression?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q10861030 wdt:P2283 ?ans_1 . wd:Q10861030 wdt:P461 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'linear regression', 'p': 'uses', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'linear regression', 'p': 'opposite of', 'o': '?x1'}]

 Q: what is the {end cause} for {C. P. Scott} has {country of citizenship} as {United Kingdom of Great Britain and Ireland} ?
 SPARQL: SELECT ?value WHERE { wd:Q5006750 p:P27 ?s . ?s ps:P27 wd:Q174193 . ?s pq:P1534 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'C. P. Scott', 'p': 'country of citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country of citizenship', 'o': 'United Kingdom of Great Britain and Ireland'}}}

 Q: What is <demonym> of <Alaska> ?
 SPARQL: select distinct ?answer where { wd:Q797 wdt:P1549 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alaska', 'p': 'demonym', 'o': '?x0'}

 Q: what is the {for work} for {Romy Schneider} has {nominated for} as {César Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q78469 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Romy Schneider', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'César Award for Best Actress'}}}

 Q: What is the common name used for Laozi?
 SPARQL: select distinct ?answer where { wd:Q9333 wdt:P1782 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Laozi', 'p': 'zi', 'o': '?x0'}

 Q: What is the attendee Korean War in southernmost point located at 35.80859081 36.15096331
 SPARQL: SELECT ?answer WHERE { wd:Q8663 wdt:P710 ?answer . ?answer wdt:P1333 ?x FILTER(contains(?x,'35.80859081 36.15096331'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Korean War', 'p': 'attendee', 'o': '?x0'}

 Q: What is the version of the Old Testament that contains the word "septuagint " in its name ?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj wdt:P629 wd:Q19786 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'septuagint')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'version of', 'o': 'Old Testament'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'septuagint'}}

 Q: What is {has shires} of {sports country} of {Tonya Harding} ?
 SPARQL: SELECT ?answer WHERE { wd:Q236278 wdt:P1532 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has shires', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tonya Harding', 'p': 'sports country', 'o': '$y0'}}

 Q: Which is the statement supported by Al-Qaeda?
 SPARQL: select distinct ?answer where { ?answer wdt:P3680 wd:Q34490}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'statement supported by', 'o': 'Al-Qaeda'}

 Q: What is the {author} and the {genre} of {The_Adventures_of_Tintin} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q744536 wdt:P50 ?ans_1 . wd:Q744536 wdt:P136 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Adventures of Tintin', 'p': 'author', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Adventures of Tintin', 'p': 'genre', 'o': '?x1'}]

 Q: When did Goldman Sachs count 34400.0 employees?
 SPARQL: SELECT ?value WHERE { wd:Q193326 p:P1128 ?s . ?s ps:P1128 ?x filter(contains(?x,'34400.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Goldman Sachs', 'p': 'employees', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employees', 'o': '34400.0'}, 't': '?x0'}

 Q: What is the {world day} for {founded by} of {United Nations General Assembly}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P112 wd:Q47423 . ?sbj wdt:P31 wd:Q2558684 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'General Assembly', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'world day'}}

 Q: What are the plays of the organizer of the UMB World Three-cushion Championship?
 SPARQL: SELECT ?answer WHERE { wd:Q1812109 wdt:P664 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'play', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'UMB World Three-cushion Championship', 'p': 'organizer', 'o': '$y0'}}

 Q: tell me king in Greek mythology  name has  the word thestrus in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24434794 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thestrus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'king in Greek mythology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'thestrus'}}

 Q: What is {start time} and {end time} of {{Reg Gasnier} has {member of sports team} as {Australia national rugby league team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3423313 p:P54 ?s . ?s ps:P54 wd:Q3589757 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reg Gasnier', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Australia national rugby league team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reg Gasnier', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Australia national rugby league team'}}}]

 Q: What is the {sport} and the {country for sport} of {Theodore_Roosevelt} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q33866 wdt:P641 ?ans_1 . wd:Q33866 wdt:P1532 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Theodore Roosevelt', 'p': 'sport', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Theodore Roosevelt', 'p': 'country for sport', 'o': '?x1'}]

 Q: What is {position held} of {Nursultan Nazarbayev} that is {end time} is {1989-7-27} ?
 SPARQL: SELECT ?obj WHERE { wd:Q57394 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1989')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nursultan Nazarbayev', 'p': 'position held', 'o': '?x0', 't': '1989'}

 Q: What writer is known for the work titled Montague Summers?
 SPARQL: SELECT ?answer WHERE { wd:Q712220 wdt:P800 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'writer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montague Summers', 'p': 'work', 'o': '$y0'}}

 Q: What is the { start time } for { Chris Gayle } as { Royal Challengers Bangalore } { sports team member }?
 SPARQL: SELECT ?value WHERE { wd:Q2732196 p:P54 ?s . ?s ps:P54 wd:Q1156897 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chris Gayle', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Royal Challengers Bangalore'}}}

 Q: What is the Library of Congress's collection or exhibition size?
 SPARQL: select distinct ?answer where { wd:Q131454 wdt:P1436 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Library of Congress', 'p': 'collection or exhibition size', 'o': '?x0'}

 Q: What is the {Wikimedia disambiguation page} for {official language} of {Parthian Empire}
 SPARQL:  select distinct ?obj where { wd:Q1986139 wdt:P37 ?obj . ?obj wdt:P31 wd:Q4167410 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Parthian Empire', 'p': 'official language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Wikimedia disambiguation page'}}

 Q: What are the cross  which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q40843 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cross'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Where is tributary take place in Polynesia?
 SPARQL: SELECT ?answer WHERE { wd:Q35942 wdt:P706 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Polynesia', 'p': 'location', 'o': '$y0'}}

 Q: What is SPARQL endpoint of Biblioteca Nacional de España?
 SPARQL: select distinct ?answer where { wd:Q750403 wdt:P5305 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Biblioteca Nacional de España', 'p': 'SPARQL endpoint', 'o': '?x0'}

 Q: what is the {end time} for {Eleanor Roosevelt} has {spouse} as {Franklin Delano Roosevelt} ?
 SPARQL: SELECT ?value WHERE { wd:Q83396 p:P26 ?s . ?s ps:P26 wd:Q8007 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divorced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eleanor Roosevelt', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Franklin Delano Roosevelt'}}}

 Q: what is the {start time} for {Ludwig Maximilian University of Munich} has {located in the administrative territorial entity} as {Landshut} ?
 SPARQL: SELECT ?value WHERE { wd:Q55044 p:P131 ?s . ?s ps:P131 wd:Q3974 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ludwig Maximilian University of Munich', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Landshut'}}}

