 Q: Was Kublai Khan married to Chabi and Zhenge Khatan?
 SPARQL: ASK WHERE { wd:Q7523 wdt:P26 wd:Q846131 . wd:Q7523 wdt:P26 wd:Q7079042 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kublai Khan', 'p': 'married to', 'o': '?x0', '?x0': 'Chabi'}, {'h': 'IS', 'v': '?x1', 's': 'Kublai Khan', 'p': 'married to', 'o': '?x1', '?x1': 'Zhenge Khatan'}]

 Q: What is the Kaiserhof ID for Aloysius Gonzaga?
 SPARQL: select distinct ?answer where { wd:Q310307 wdt:P1818 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aloysius Gonzaga', 'p': 'Kaiserhof ID', 'o': '?x0'}

 Q: what is the {valid in period} for {Leipzig} has {located in time zone} as {UTC+02:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q2079 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leipzig', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+02:00'}}}

 Q: Who is the service operator of the item Avianca?
 SPARQL: SELECT ?answer WHERE { wd:Q308911 wdt:P121 ?X . ?X wdt:P137 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operator', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Avianca', 'p': 'operator of', 'o': '$y0'}}

 Q: Give me a mobile operating system, that starts with an alphabet 'w'.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q920890 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mobile operating system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is <Pinakothek artist ID> of <Lucas Cranach the Elder> ?
 SPARQL: select distinct ?answer where { wd:Q191748 wdt:P4025 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lucas Cranach the Elder', 'p': 'Pinakothek artist ID', 'o': '?x0'}

 Q: Which city is the twinned administrative body of Cardiff?
 SPARQL:  select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cardiff', 'p': 'twinned administrative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: Which is the price for Coca-Cola?
 SPARQL: select distinct ?answer where { wd:Q2813 wdt:P2284 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Coca-Cola', 'p': 'price', 'o': '?x0'}

 Q: Who is the spouse of Zhou Xun starting in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q198030 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zhou Xun', 'p': 'spouse', 'o': '?x0', 't': '2014'}

 Q: What is {has boroughs} of {sovereign state} of {Panic of 1907} ?
 SPARQL: SELECT ?answer WHERE { wd:Q844449 wdt:P17 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has boroughs', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Panic of 1907', 'p': 'sovereign state', 'o': '$y0'}}

 Q: What is the {human} for {family} of {Koch family}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P53 wd:Q2896603 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'family', 'o': 'Koch family', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many electrical plug types are for Laos?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q819 wdt:P2853 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Laos', 'p': 'electrical plug type', 'o': '?x0'}

 Q: What is {end time} and {start time} of {{Belgrade} has {country} as {Principality of Serbia}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3711 p:P17 ?s . ?s ps:P17 wd:Q684030 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belgrade', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Principality of Serbia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belgrade', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Principality of Serbia'}}}]

 Q: What method was used to determine that Perm has a population of 850324?
 SPARQL: SELECT ?value WHERE { wd:Q915 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'850324.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Perm', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '850324.0'}}}

 Q: Tell me natural language whose name has the word thai in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thai')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'natural language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'thai'}}

 Q: Which is the business that Roger Waters is owner of?
 SPARQL:  select distinct ?obj where { wd:Q180861 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Roger Waters', 'p': 'owner of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is {buried at} of {Cinematography} of {Bright Eyes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2389107 wdt:P344 ?X . ?X wdt:P119 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'buried at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bright Eyes', 'p': 'Cinematography', 'o': '$y0'}}

 Q: What is the {airline} for {business division} of {Air India}
 SPARQL:  select distinct ?obj where { wd:Q69906 wdt:P199 ?obj . ?obj wdt:P31 wd:Q46970 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Air India', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'airline'}}

 Q: When did Reinhold Messner stop being Sabine Stehle`s partner?
 SPARQL: SELECT ?value WHERE { wd:Q189307 p:P451 ?s . ?s ps:P451 wd:Q28053617 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reinhold Messner', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': 'Sabine Stehle'}}}

 Q: What is the birth location of Barbara Liskov, the partner town is Tehran?
 SPARQL: SELECT ?answer WHERE { wd:Q16080922 wdt:P19 ?answer . ?answer wdt:P190 wd:Q3616}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Barbara Liskov', 'p': 'birth location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Tehran'}}

 Q: What is Marcel Duchamp's French Sculpture Census artist ID?
 SPARQL: select distinct ?answer where { wd:Q5912 wdt:P2380 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marcel Duchamp', 'p': 'French Sculpture Census artist ID', 'o': '?x0'}

 Q: wich means {founding date}in the {editions} at{Microsoft Windows} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1406 wdt:P747 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founding date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Microsoft Windows', 'p': 'editions', 'o': '$y0'}}

 Q: What was Louis the Pious' noble title and who follows?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is {date of birth} of {Ali ibn al-Husayn Zayn al-'Abidin} that is {earliest date} is {658-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q314978 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1319 ?x filter(contains(?x,'658-0-0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ali ibn al-Husayn', 'p': 'date of birth', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'earliest date', 'o': '658-0-0'}}}

 Q: Is 40.5 Australia's central government debt as a percent of GDP?
 SPARQL: ASK WHERE { wd:Q408 wdt:P1689 ?obj filter(?obj = 40.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Australia', 'p': 'central government debt as a percent of GDP', 'o': '?x0', '?x0': '40.5'}

 Q: What is the start time for Liverpool, who also has Cologne as its twinned administrative body?
 SPARQL: SELECT ?value WHERE { wd:Q24826 p:P190 ?s . ?s ps:P190 wd:Q365 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Liverpool', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Cologne'}}}

 Q: What is {toponym} of {pan flute}, that has {is child of} is {Dryope} ?
 SPARQL: SELECT ?answer WHERE { wd:Q218802 wdt:P138 ?answer . ?answer wdt:P25 wd:Q29788463}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pan flute', 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is child of', 'o': 'Dryope'}}

 Q: Which is the position in the time period of Reconquista?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2348 wd:Q79791 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'time period', 'o': 'Reconquista', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is {capital of} of {Ashgabat} that is {end time} is {1924-10-27} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23438 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1924')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ashgabat', 'p': 'capital of', 'o': '?x0', 't': '1924'}

 Q: Does the time in space of Charles Bolder equal 40837?
 SPARQL: ASK WHERE { wd:Q25011 wdt:P2873 ?obj filter(?obj = 40837) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Charles Bolden', 'p': 'time in space', 'o': '?x0', '?x0': '40837'}

 Q: Which is the AlloCiné film ID for Bicycle Thieves?
 SPARQL: select distinct ?answer where { wd:Q172837 wdt:P1265 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bicycle Thieves', 'p': 'AlloCiné film ID', 'o': '?x0'}

 Q: What is {is son of} of {has child} of {María Lorenza Barreneche} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6004142 wdt:P40 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'María Lorenza Barreneche', 'p': 'son', 'o': '$y0'}}

 Q: What is the Badminton World Federation ID that belongs to Gao Ling?
 SPARQL: select distinct ?answer where { wd:Q236336 wdt:P2729 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gao Ling', 'p': 'Badminton World Federation ID', 'o': '?x0'}

 Q: Is the floors above ground of the Italian Hall equal to 2
 SPARQL: ASK WHERE { wd:Q424748 wdt:P1101 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Italian Hall', 'p': 'floors above ground', 'o': '?x0', '?x0': '2'}

 Q: Which is the mtDNA haplogroup for Alexandra Fyodorovna?
 SPARQL: select distinct ?answer where { wd:Q152094 wdt:P4425 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alexandra Fyodorovna', 'p': 'mtDNA haplogroup', 'o': '?x0'}

 Q: What is {nominated for} of {Victor Goldschmidt} that is {point in time} is {1932-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q213668 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1932')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Victor Goldschmidt', 'p': 'nominated for', 'o': '?x0', 't': '1932'}

 Q: What is the {academy of sciences} for {manager/director} of {Gottfried Wilhelm Leibniz}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1037 wd:Q9047 . ?sbj wdt:P31 wd:Q414147 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Gottfried Wilhelm Leibniz', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academy of sciences'}}

 Q: Which is the death place in Hattie Jacques having a sister city of Buenos Aires?
 SPARQL: SELECT ?answer WHERE { wd:Q449020 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1486}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hattie Jacques', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Buenos Aires'}}

 Q: Which is the professorship of theology?
 SPARQL: select distinct ?answer where { ?answer wdt:P803 wd:Q34178}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'professorship', 'o': 'theology'}

 Q: What is Loop ID for Simon Baron-Cohen?
 SPARQL: select distinct ?answer where { wd:Q918343 wdt:P2798 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Simon Baron-Cohen', 'p': 'Loop ID', 'o': '?x0'}

 Q: What is {is daughter of} of {has brother} of {George Jay Gould I} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3101668 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is daughter of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Gould', 'p': 'bro', 'o': '$y0'}}

 Q: Give me {mythical human-animal hybrid} that {worshipped by} {Greek mythology} and which contains the word {minotaur} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj wdt:P1049 wd:Q34726 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'minotaur')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mythical human-animal hybrid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': 'Greek mythology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'minotaur'}}

 Q: Did {Macau} {public holiday} {public holidays in the United States} and {Double Ninth Festival} ?
 SPARQL: ASK WHERE { wd:Q14773 wdt:P832 wd:Q1934708 . wd:Q14773 wdt:P832 wd:Q463754 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Macau', 'p': 'public holiday', 'o': '?x0', '?x0': 'public holidays in the United States'}, {'h': 'IS', 'v': '?x1', 's': 'Macau', 'p': 'public holiday', 'o': '?x1', '?x1': 'Double Ninth Festival'}]

 Q: What is the name of an embankment dam that starts with the letter h.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'embankment dam'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: What is {educated at} of {Alice Walker} that is {academic degree} is {Bachelor of Arts} ?
 SPARQL: SELECT ?obj WHERE { wd:Q215868 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q1765120 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alice Walker', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Bachelor of Arts'}}}

 Q: What is {antonym} of {hypotension}, that has {treated by} is {esmolol} ?
 SPARQL: SELECT ?answer WHERE { wd:Q275419 wdt:P461 ?answer . ?answer wdt:P2176 wd:Q418139}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'hypotension', 'p': 'antonym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'treated by', 'o': 'esmolol'}}

 Q: Who are Ric Flair's son and Ric Flair's mother?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q44546 wdt:P40 ?ans_1 . wd:Q44546 wdt:P25 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Ric Flair', 'p': 'son', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Ric Flair', 'p': 'mother', 'o': '?x1'}]

 Q: What is {member of} of {land} of {Lashkar Gah} ?
 SPARQL: SELECT ?answer WHERE { wd:Q476800 wdt:P17 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lashkar Gah', 'p': 'land', 'o': '$y0'}}

 Q: What chemical compounds cause air pollution?
 SPARQL:  select distinct ?obj where { wd:Q131123 wdt:P828 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'air pollution', 'p': 'cause', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: Tell me first-class city whose name has the word milwaukee in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15221304 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'milwaukee')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'first-class city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'milwaukee'}}

 Q: Name an instruction set architecture that contain the word " x87" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'x87')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'instruction set architecture'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'x87'}}

 Q: Who wrote the notable work Doctor Who?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P800 wd:Q34316 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'notable work', 'o': 'Doctor Who'}

 Q: What is the Brazilian Olympic Committee athlete ID of Ronaldinho?
 SPARQL: select distinct ?answer where { wd:Q39444 wdt:P4060 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ronaldinho', 'p': 'Brazilian Olympic Committee athlete ID', 'o': '?x0'}

 Q: What's the stock exchange for Toshiba?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q49125 wdt:P414 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Toshiba', 'p': 'stock exchange', 'o': '?x0'}

 Q: Who is the {specialized agency of the United Nations} for {subsidiary} of {World Bank}
 SPARQL:  select distinct ?obj where { wd:Q7164 wdt:P355 ?obj . ?obj wdt:P31 wd:Q15925165 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'World Bank', 'p': 'subsidiary', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'specialized agency of the United Nations'}}

 Q: Which is the vegetable for this taxon is source of eggplant?
 SPARQL:  select distinct ?obj where { wd:Q7540 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q1470762 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'eggplant', 'p': 'this taxon is source of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vegetable'}}

 Q: Which ballet was composed by Pyotr Ilyich Tchaikovsky?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P86 wd:Q7315 . ?sbj wdt:P31 wd:Q15079786 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'composed by', 'o': 'Pyotr Ilyich Tchaikovsky', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ballet'}}

 Q: What type of music is developed by Monopoly Star Wars?
 SPARQL: SELECT ?answer WHERE { wd:Q28233097 wdt:P136 ?X . ?X wdt:P178 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'developed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Monopoly Star Wars', 'p': 'type of music', 'o': '$y0'}}

 Q: What was Paul McCartney's estimated net worth in the year 2016?
 SPARQL: SELECT ?obj WHERE { wd:Q2599 p:P2218 ?s . ?s ps:P2218 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paul McCartney', 'p': 'net worth', 'o': '?x0', 't': '2016'}

 Q: What education did Thelma Ritter get in 1922?
 SPARQL: SELECT ?obj WHERE { wd:Q229266 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1922')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thelma Ritter', 'p': 'education', 'o': '?x0', 't': '1922'}

 Q: what is the {replaced by} for {Martin Ryle} has {position held} as {Astronomer Royal} ?
 SPARQL: SELECT ?value WHERE { wd:Q190766 p:P39 ?s . ?s ps:P39 wd:Q369877 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Ryle', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Astronomer Royal'}}}

 Q: Give me {television series} that {presenter} {Jerry Springer} and which contains the word {jerry} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj wdt:P371 wd:Q27214 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'jerry')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'host', 'o': 'Jerry Springer'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'jerry'}}

 Q: What is {has regions} of {born in} of {Norman Bel Geddes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q278247 wdt:P19 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has regions', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Norman Bel Geddes', 'p': 'born in', 'o': '$y0'}}

 Q: What is {position held} of {Pepin of Herstal} that is {replaces} is {Wulfoald} ?
 SPARQL: SELECT ?obj WHERE { wd:Q91392 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q980925 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pepin of Herstal', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced', 'o': 'Wulfoald'}}}

 Q: What is {energy source} of {replaced} of {Hävringe upper light} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40101409 wdt:P1365 ?X . ?X wdt:P618 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'energy source', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hävringe upper light', 'p': 'replaced', 'o': '$y0'}}

 Q: At what point in time was Margaret Mitchell nominated for the Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q173540 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Margaret Mitchell', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: Tell me about country of origin of pasta and publication date?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q178 p:P495 ?s . ?s ps:P495 ?obj . ?s pq:P577 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pasta', 'p': 'country of origin', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'country of origin', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pasta', 'p': 'country of origin', 'o': '$y0'}}]

 Q: Who is the {Vidhan Sabha} for {executive body} of {Himachal Pradesh}
 SPARQL:  select distinct ?obj where { wd:Q1177 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Himachal Pradesh', 'p': 'executive body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Vidhan Sabha'}}

 Q: what is the {end time} for {Bob Paisley} has {member of sports team} as {Bishop Auckland F.C.} ?
 SPARQL: SELECT ?value WHERE { wd:Q314436 p:P54 ?s . ?s ps:P54 wd:Q4917491 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bob Paisley', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Bishop Auckland F.C.'}}}

 Q: Tell me cell whose name has the word synoviocyte in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7868 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'synoviocyte')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cell'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'synoviocyte'}}

 Q: Which means{open period from} on{Monday} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3027 wd:Q105}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'open period from', 'o': 'Monday'}

 Q: Give me {skyscraper} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'skyscraper'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {topic of} of {law of large numbers}, that has {scholarly field for} is {data} ?
 SPARQL: SELECT ?answer WHERE { wd:Q207952 wdt:P1269 ?answer . ?answer wdt:P2578 wd:Q42848}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'law of large numbers', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'scholarly field for', 'o': 'data'}}

 Q: Give me the series ordinal for Chuck Berry has given name as Anderson ?
 SPARQL: SELECT ?value WHERE { wd:Q5921 p:P735 ?s . ?s ps:P735 wd:Q16274894 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chuck Berry', 'p': 'given name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'given name', 'o': 'Anderson'}}}

 Q: What is the {position} for {office held by head of government} of {Barcelona}
 SPARQL:  select distinct ?obj where { wd:Q1492 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Barcelona', 'p': 'office held by head of government', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'office'}}

 Q: Which is the VICNAMES Place ID for Bass Strait?
 SPARQL: select distinct ?answer where { wd:Q171846 wdt:P3472 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bass Strait', 'p': 'VICNAMES Place ID', 'o': '?x0'}

 Q: Is the units sold of Harry Potter and the Philosopher's Stone equal to 400000000.0
 SPARQL: ASK WHERE { wd:Q43361 wdt:P2664 ?obj filter(?obj = 400000000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': "Harry Potter and the Philosopher's Stone", 'p': 'units sold', 'o': '?x0', '?x0': '400000000.0'}

 Q: Which is the medical specialty of the field of work of Sigmund Freud?
 SPARQL:  select distinct ?obj where { wd:Q9215 wdt:P101 ?obj . ?obj wdt:P31 wd:Q930752 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sigmund Freud', 'p': 'field of work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical specialty'}}

 Q: Name a color model that contain the word "hsv " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2294018 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'hsv')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'color model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'hsv'}}

 Q: :What city on the continent of North America is considered the twin town of Kraków?"
 SPARQL: SELECT ?answer WHERE { wd:Q31487 wdt:P190 ?answer . ?answer wdt:P30 wd:Q49}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kraków', 'p': 'twin town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'North America'}}

 Q: What is <Czech NDOP taxon ID> of <Peregrine Falcon> ?
 SPARQL: select distinct ?answer where { wd:Q30535 wdt:P5263 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Peregrine Falcon', 'p': 'Czech NDOP taxon ID', 'o': '?x0'}

 Q: What is the {fruit} for {this taxon is source of} of {Cuminum cyminum}
 SPARQL:  select distinct ?obj where { wd:Q132624 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q1364 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cuminum cyminum', 'p': 'this taxon is source of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fruit'}}

 Q: Johann Schelle is the professor of what literary genre?
 SPARQL: SELECT ?answer WHERE { wd:Q449311 wdt:P1066 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genre', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Johann Schelle', 'p': 'professor', 'o': '$y0'}}

 Q: Who is the team manager of Manan Sharma plays?
 SPARQL: SELECT ?answer WHERE { wd:Q19898331 wdt:P54 ?X . ?X wdt:P286 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manager', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Manan Sharma', 'p': 'team', 'o': '$y0'}}

 Q: what is the {end time} for {Lower Saxony} has {head of government} as {Christian Wulff} ?
 SPARQL: SELECT ?value WHERE { wd:Q1197 p:P6 ?s . ?s ps:P6 wd:Q2540 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lower Saxony', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Christian Wulff'}}}

 Q: Tell me fundamental state of matter whose name has the word solid in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15831576 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'solid')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fundamental state of matter'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'solid'}}

 Q: What is distribution for My Little Pony ?
 SPARQL: select distinct ?answer where { wd:Q1071312 wdt:P437 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'My Little Pony', 'p': 'distribution', 'o': '?x0'}

 Q: which is the {location} for {Joseph Raymond McCarthy} where {educated at} as {primary school} ?
 SPARQL: SELECT ?value WHERE { wd:Q189197 p:P69 ?s . ?s ps:P69 wd:Q9842 . ?s pq:P276 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Raymond McCarthy', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'primary school'}}}

 Q: What is {on chromosome} of {genetic association} of {migraine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q133823 wdt:P2293 ?X . ?X wdt:P1057 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chromosome', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'migraine', 'p': 'genetic association', 'o': '$y0'}}

 Q: What is the {human} with the {MAX(personal best)} whose {country of citizenship} is {Germany}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2415 ?obj . ?ent wdt:P27 wd:Q183 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'personal best', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'Germany'}}}

