 Q: How many {discovery method} are to/by {Radial velocity} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1046 wd:Q240105 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'discovery method', 'o': 'radial velocity'}

 Q: What is {used language} of {Jack Nicklaus}, that has {AWLD status} is {1 safe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9424 wdt:P1412 ?answer . ?answer wdt:P1999 wd:Q20672086}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jack Nicklaus', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'AWLD status', 'o': '1 safe'}}

 Q: Where there 3.2 perpetrators in the Enoch Brown school massacre?
 SPARQL: ASK WHERE { wd:Q1297497 wdt:P3886 ?obj filter(?obj = 3.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Enoch Brown school massacre', 'p': 'perpetrators', 'o': '?x0', '?x0': '3.2'}

 Q: who enterprise for subsidiary of Sears?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P355 wd:Q6499202 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'Sears', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'enterprise'}}

 Q: How much acreage is the death place of Saul Bass?
 SPARQL: SELECT ?answer WHERE { wd:Q536884 wdt:P20 ?X . ?X wdt:P2046 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'acreage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saul Bass', 'p': 'death place', 'o': '$y0'}}

 Q: Which is the CERO rating for The Legend of Zelda?
 SPARQL: select distinct ?answer where { wd:Q12395 wdt:P853 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Legend of Zelda', 'p': 'CERO rating', 'o': '?x0'}

 Q: Who gave the{typology} of {language native} of {Uyghur people} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46118 wdt:P103 ?X . ?X wdt:P4132 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'typology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Uyghur people', 'p': 'language native', 'o': '$y0'}}

 Q: What is the female population of Karlovy Vary Region which has a total population of 150262.0?
 SPARQL: SELECT ?obj WHERE { wd:Q191091 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1539 ?x filter(contains(?x,'150262.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Karlovy Vary Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'female population', 'o': '150262.0'}}}

 Q: What is {open days} of {British Museum} and {open period from}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3027 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'open period from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'open days', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0'}}]

 Q: What is the edition of the game platform of Star Trek Online?
 SPARQL: SELECT ?answer WHERE { wd:Q1143426 wdt:P400 ?X . ?X wdt:P747 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'edition', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Trek Online', 'p': 'platform', 'o': '$y0'}}

 Q: What is {located in} of {major event} of {Alfred Döblin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57389 wdt:P793 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Döblin', 'p': 'major event', 'o': '$y0'}}

 Q: What is Metroid Prime's GameRankings game ID?
 SPARQL: select distinct ?answer where { wd:Q1765733 wdt:P4769 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Metroid Prime', 'p': 'GameRankings game ID', 'o': '?x0'}

 Q: what is the {applies to part} for {North Dakota} has {located in time zone} as {Mountain Time Zone} ?
 SPARQL: SELECT ?value WHERE { wd:Q1207 p:P421 ?s . ?s ps:P421 wd:Q3134980 . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to part', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'North Dakota', 'p': 'located in time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in time zone', 'o': 'Mountain Time Zone'}}}

 Q: When was Niels Bohr nominated for a Nobel Prize in Physics?
 SPARQL: SELECT ?value WHERE { wd:Q7085 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Niels Bohr', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Physics'}, 't': '?x0'}

 Q: What is {wrote language} of {Hiroshi Sugimoto}, that has {typology} is {time–manner–place} ?
 SPARQL: SELECT ?answer WHERE { wd:Q919236 wdt:P1412 ?answer . ?answer wdt:P4132 wd:Q7806656}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hiroshi Sugimoto', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'typology', 'o': 'time–manner–place'}}

 Q: What is {collection or exhibition size} of {Prado National Museum} that is {point in time} is {2012-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q160112 p:P1436 ?s . ?s ps:P1436 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Prado', 'p': 'collection or exhibition size', 'o': '?x0', 't': '2012'}

 Q: What is next to Confederate States of America having diplomatic relation of Ecuador?
 SPARQL: SELECT ?answer WHERE { wd:Q81931 wdt:P47 ?answer . ?answer wdt:P530 wd:Q736}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Confederate States of America', 'p': 'next to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Ecuador'}}

 Q: What's the icebreaker for the US National Archives Identifier?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q14978 wdt:P1225 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'icebreaker', 'p': 'National Archives Identifier', 'o': '?x0'}

 Q: What is the {human} for {designed by} of {Adelaide}
 SPARQL:  select distinct ?obj where { wd:Q5112 wdt:P287 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Adelaide', 'p': 'designed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is it true that the distance from Earth of the Polaris is 518.4?
 SPARQL: ASK WHERE { wd:Q12980 wdt:P2583 ?obj filter(?obj = 518.4) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Polaris', 'p': 'distance from Earth', 'o': '?x0', '?x0': '518.4'}

 Q: Is the position angle of the southwest by west equal 236.25?
 SPARQL: ASK WHERE { wd:Q20968403 wdt:P2211 ?obj filter(?obj = 236.25) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'southwest by west', 'p': 'position angle', 'o': '?x0', '?x0': '236.25'}

 Q: Give me {agricultural revolution} that contains the word {revolution} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6499967 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'revolution')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'agricultural revolution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'revolution'}}

 Q: What is {has anatomical branch} of {artery} of {large intestine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11083 wdt:P2286 ?X . ?X wdt:P3262 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has anatomical branch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'large intestine', 'p': 'artery', 'o': '$y0'}}

 Q: What was the population of the Saitama Prefecture in the year 2005?
 SPARQL: SELECT ?obj WHERE { wd:Q128186 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saitama Prefecture', 'p': 'population', 'o': '?x0', 't': '2005'}

 Q: What is <powerplant> of <steam turbine> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P516 wd:Q189859}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'powerplant', 'o': 'steam turbine'}

 Q: What is the {city} for {public holiday} of {Chinese New Year}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P832 wd:Q131772 . ?sbj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'public holiday', 'o': 'Chinese New Year', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

 Q: What is the Mémoire du cyclisme cyclist ID for Bradley Wiggins?
 SPARQL: select distinct ?answer where { wd:Q193876 wdt:P4516 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bradley Wiggins', 'p': 'Mémoire du cyclisme cyclist ID', 'o': '?x0'}

 Q: In what year was Valery Gergiev awarded the State Prize of the Russian Federation?
 SPARQL: SELECT ?value WHERE { wd:Q165693 p:P166 ?s . ?s ps:P166 wd:Q4146631 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Valery Gergiev', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'State Prize of the Russian Federation'}, 't': '?x0'}

 Q: What is {actor} of {from work} of {Captain Typho} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6135489 wdt:P1441 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Captain Typho', 'p': 'from work', 'o': '$y0'}}

 Q: Does the rate of fire of the VAP submachine gun equals to 1200.0?
 SPARQL: ASK WHERE { wd:Q61235737 wdt:P3792 ?obj filter(?obj = 1200.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'VAP submachine gun', 'p': 'rate of fire', 'o': '?x0', '?x0': '1200.0'}

 Q: What is {population} of {Antofagasta Region} that is {determination method} is {census} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2118 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antofagasta Region', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: What is e-mail of Ilona Staller ?
 SPARQL: select distinct ?answer where { wd:Q49941 wdt:P968 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ilona Staller', 'p': 'mail', 'o': '?x0'}

 Q: Is the nominal GDP per capita of Poland less than 15065.46?
 SPARQL: ASK WHERE { wd:Q36 wdt:P2132 ?obj filter(?obj < 15065.46) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Poland', 'p': 'nominal GDP per capita', 'o': '?x0', '?x0': '15065.46'}

 Q: Which is the Behind The Voice Actors person ID for Julia Roberts?
 SPARQL: select distinct ?answer where { wd:Q40523 wdt:P5007 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Julia Roberts', 'p': 'Behind The Voice Actors person ID', 'o': '?x0'}

 Q: Does the boiling point of the hexadecane equals 286.79?
 SPARQL: ASK WHERE { wd:Q150843 wdt:P2102 ?obj filter(?obj = 286.79) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'hexadecane', 'p': 'boiling point', 'o': '?x0', '?x0': '286.79'}

 Q: What is {maker of} of {board game publisher} of {Score} ?
 SPARQL: SELECT ?answer WHERE { wd:Q47007593 wdt:P123 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'maker of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Score', 'p': 'publisher', 'o': '$y0'}}

 Q: what is the {for work} for {Zooey Deschanel} has {nominated for} as {Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series} ?
 SPARQL: SELECT ?value WHERE { wd:Q191719 p:P1411 ?s . ?s ps:P1411 wd:Q1287335 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zooey Deschanel', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series'}}}

 Q: What is the {fictional organization} for {present in work} of {Nineteen Eighty-Four}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q208460 . ?sbj wdt:P31 wd:Q14623646 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Nineteen Eighty-Four', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional organization'}}

 Q: What is the {G-type main-sequence star} with the {MAX(stellar rotational velocity)} whose {instance of} is {G-type main-sequence star}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5864 . ?ent wdt:P4296 ?obj . ?ent wdt:P31 wd:Q5864 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'stellar rotational velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'G-type main-sequence star'}}

 Q: What is the {profession} for {practiced by} of {rugby}
 SPARQL:  select distinct ?obj where { wd:Q5378 wdt:P3095 ?obj . ?obj wdt:P31 wd:Q28640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'rugby', 'p': 'practiced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'profession'}}

 Q: A person who studies meteorology looks at what geosphere?
 SPARQL:  select distinct ?obj where { wd:Q25261 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q241284 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'meteorology', 'p': 'studies', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geosphere'}}

 Q: What is <intended public> of <young adult> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2360 wd:Q17156455}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'intended public', 'o': 'young adult'}

 Q: Is the numeric value of the Boltzmann constant less than 1.6567788e-23?
 SPARQL: ASK WHERE { wd:Q5962 wdt:P1181 ?obj filter(?obj < 1.6567788e-23) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Boltzmann constant', 'p': 'numeric value', 'o': '?x0', '?x0': '1.6567788e-23'}

 Q: Are there more than 3.6 floors below ground of the Plaza 66.
 SPARQL: ASK WHERE { wd:Q543353 wdt:P1139 ?obj filter(?obj > 3.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Plaza 66', 'p': 'floors below ground', 'o': '?x0', '?x0': '3.6'}

 Q: What is {profession} of {composed by} of {The Carnival of the Animals} ?
 SPARQL: SELECT ?answer WHERE { wd:Q941724 wdt:P86 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Carnival of the Animals', 'p': 'composed by', 'o': '$y0'}}

 Q: How many {member count} are for {Labour Party} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q9630 wdt:P2124 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Labour Party', 'p': 'member count', 'o': '?x0'}

 Q: What is the {position played on team / speciality} and the {place of birth} of {David_Icke} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q333118 wdt:P413 ?ans_1 . wd:Q333118 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'David Icke', 'p': 'position played on team / speciality', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'David Icke', 'p': 'place of birth', 'o': '?x1'}]

 Q: What is the {Giants} for {killed by} of {Heracles}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q191192 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'killed by', 'o': 'Heracles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Giants'}}

 Q: What is venous drainage for hand ?
 SPARQL: select distinct ?answer where { wd:Q33767 wdt:P2289 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hand', 'p': 'venous drainage', 'o': '?x0'}

 Q: Which is the Academia.edu institutional ID for University of Naples Federico II?
 SPARQL: select distinct ?answer where { wd:Q691851 wdt:P4052 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Naples Federico II', 'p': 'Academia.edu institutional ID', 'o': '?x0'}

 Q: What is the {type of magnets} for {uses} of {Large Hadron Collider}
 SPARQL:  select distinct ?obj where { wd:Q40605 wdt:P2283 ?obj . ?obj wdt:P31 wd:Q50002046 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Large Hadron Collider', 'p': 'uses', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of magnets'}}

 Q: How many {health specialty} are for {attention deficit hyperactivity disorder} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q181923 wdt:P1995 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'attention deficit hyperactivity disorder', 'p': 'health specialty', 'o': '?x0'}

 Q: When was William Ramsay nominated for a Nobel Prize in Chemistry?
 SPARQL: SELECT ?value WHERE { wd:Q950726 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'William Ramsay', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Chemistry'}, 't': '?x0'}

 Q: What is the {nuclear weapons test} for {designed by} of {Manhattan Project}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q127050 . ?sbj wdt:P31 wd:Q210112 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Manhattan Project', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nuclear weapons test'}}

 Q: which building has the highest cost?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q41176 . ?ent wdt:P2130 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'cost', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'building'}}

 Q: Who is the  {strip mall} for {architectural style} of {Bauhaus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q7624088 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'Bauhaus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'strip mall'}}

 Q: what is the {end time} for {Alan Greenspan} has {position held} as {Chair of the Federal Reserve} ?
 SPARQL: SELECT ?value WHERE { wd:Q193635 p:P39 ?s . ?s ps:P39 wd:Q2666591 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Greenspan', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Chair of the Federal Reserve'}}}

 Q: What is {civilisation} of {denomination} of {Yazdegerd III} ?
 SPARQL: SELECT ?answer WHERE { wd:Q208463 wdt:P140 ?X . ?X wdt:P2596 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'civilisation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yazdegerd III', 'p': 'denomination', 'o': '$y0'}}

 Q: What is KEPN ID for Wolverhampton ?
 SPARQL: select distinct ?answer where { wd:Q126269 wdt:P3639 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wolverhampton', 'p': 'KEPN ID', 'o': '?x0'}

 Q: What is the Revised Hepburn romanization for Morning Musume with its name in kana モーニングむすめ?
 SPARQL: SELECT ?value WHERE { wd:Q174291 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'モーニングむすめ')) . ?s pq:P2125 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Revised Hepburn romanization', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Morning Musume', 'p': 'name in kana', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'name in kana', 'o': 'モーニングむすめ'}}}

 Q: What is {custodian} of {connected with} of {Roadside station Echizen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20043342 wdt:P2789 ?X . ?X wdt:P126 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'custodian', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roadside station Echizen', 'p': 'connected with', 'o': '$y0'}}

 Q: When did Ireland have a population of 2.85265e+06?
 SPARQL: SELECT ?value WHERE { wd:Q27 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'2.85265e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ireland', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '2.85265e+06'}, 't': '?x0'}

 Q: What city is the capital of Lagdo?
 SPARQL: SELECT ?answer WHERE { wd:Q6471958 wdt:P131 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lagdo', 'p': 'city', 'o': '$y0'}}

 Q: What isEncyclopædia Britannica Online ID for ton ?
 SPARQL: select distinct ?answer where { wd:Q11247037 wdt:P1417 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ton', 'p': 'Encyclopædia Britannica Online ID', 'o': '?x0'}

 Q: Did {Sarah_Silverman} {instrument} {guitar}?
 SPARQL: ASK WHERE { wd:Q229013 wdt:P1303 wd:Q6607 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Sarah Silverman', 'p': 'instrument', 'o': '?x0', '?x0': 'guitar'}]

 Q: What is {inhabitants} of {death location} of {Alexander Fleming} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37064 wdt:P20 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Fleming', 'p': 'death location', 'o': '$y0'}}

 Q: What is the name of a tournament that starts with the letter w.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q500834 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tournament'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: what is the {point in time} for {Léon Jouhaux} has {nominated for} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q155415 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Léon Jouhaux', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: What is {nominated for} of {Edward Albee} that is {statement is subject of} is {19th Tony Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q219420 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q4595828 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edward Albee', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '19th Tony Awards'}}}

 Q: Did {Katrina_Kaif} {filmography} {Katrina Kaif filmography}?
 SPARQL: ASK WHERE { wd:Q9550 wdt:P1283 wd:Q20814599 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Katrina Kaif', 'p': 'filmography', 'o': '?x0', '?x0': 'Katrina Kaif filmography'}]

 Q: Who is the person that was influenced by Hypatia?
 SPARQL:  select distinct ?obj where { wd:Q11903 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hypatia', 'p': 'influenced by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {titleholder} of {nomination received} of {Nebraska} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3337646 wdt:P1411 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'titleholder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nebraska', 'p': 'nomination received', 'o': '$y0'}}

 Q: Did {LL_Cool_J} {genre} {alternative hip hop} and {New school hip hop} ?
 SPARQL: ASK WHERE { wd:Q52440 wdt:P136 wd:Q438503 . wd:Q52440 wdt:P136 wd:Q4045303 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'LL Cool J', 'p': 'genre', 'o': '?x0', '?x0': 'alternative hip hop'}, {'h': 'IS', 'v': '?x1', 's': 'LL Cool J', 'p': 'genre', 'o': '?x1', '?x1': 'New school hip hop'}]

 Q: Is the flattening of Venus zero?
 SPARQL: ASK WHERE { wd:Q313 wdt:P1102 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Venus', 'p': 'flattening', 'o': '?x0', '?x0': '0'}

 Q: Did {Niki_Lauda} {member of sports team} {Scuderia Ferrari} and {Renault F1 Team} ?
 SPARQL: ASK WHERE { wd:Q78489 wdt:P54 wd:Q169898 . wd:Q78489 wdt:P54 wd:Q172722 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Niki Lauda', 'p': 'member of sports team', 'o': '?x0', '?x0': 'Scuderia Ferrari'}, {'h': 'IS', 'v': '?x1', 's': 'Niki Lauda', 'p': 'member of sports team', 'o': '?x1', '?x1': 'Renault F1 Team'}]

 Q: What is {educated at} of {Narendra Modi} and {academic degree}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1058 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Narendra Modi', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Narendra Modi', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the {college library} for {location} of {Yale University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q1622062 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Yale University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'college library'}}

 Q: What is {born in} of {authors} of {Mémoires d'Outre-Tombe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2263221 wdt:P50 ?X . ?X wdt:P19 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Mémoires d'Outre-Tombe", 'p': 'author', 'o': '$y0'}}

 Q: What award did Dirk Nowitzki receive in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q44068 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dirk Nowitzki', 'p': 'award', 'o': '?x0', 't': '2011'}

 Q: Which is the Encyclopaedia Metallum artist ID for Dave Grohl?
 SPARQL: select distinct ?answer where { wd:Q12006 wdt:P1989 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dave Grohl', 'p': 'Encyclopaedia Metallum artist ID', 'o': '?x0'}

 Q: Florentino Perez is a member of what political party whose start time was 1982-0-0
 SPARQL: SELECT ?obj WHERE { wd:Q245207 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1982')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Florentino Perez', 'p': 'party', 'o': '?x0', 't': '1982'}

 Q: What is {member count} of {Democratic Party} that is {based on heuristic} is {party identification} ?
 SPARQL: SELECT ?obj WHERE { wd:Q29552 p:P2124 ?s . ?s ps:P2124 ?obj . ?s pq:P887 wd:Q7141040 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member count', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Democrats', 'p': 'member count', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'based on heuristic', 'o': 'party identification'}}}

 Q: When was Forrest Gump publication date
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q134773 wdt:P577 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Forrest Gump', 'p': 'publication date', 'o': '?x0'}

 Q: Tell me the opera that location of first performance is the Theater auf der Wieden and which that starts with the letter f
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1344 . ?sbj wdt:P4647 wd:Q673479 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'opera', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of first performance', 'o': 'Theater auf der Wieden'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: Which brother of Atahualpa has sons?
 SPARQL: SELECT ?answer WHERE { wd:Q179577 wdt:P3373 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Atahualpa', 'p': 'bro', 'o': '$y0'}}

 Q: Where is incumbent of professorship position of John Budden ?
 SPARQL: SELECT ?answer WHERE { wd:Q6223791 wdt:P803 ?X . ?X wdt:P1308 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'incumbent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Budden', 'p': 'professorship', 'o': '$y0'}}

 Q: Who is profession's field is musician having a timeline of topic of history of music?
 SPARQL: SELECT ?answer WHERE { wd:Q639669 wdt:P425 ?answer . ?answer wdt:P2184 wd:Q846047}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'musician', 'p': "profession's field", 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timeline of topic', 'o': 'history of music'}}

 Q: What is <stereoisomer of> of <L-Phenylalanine> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3364 wd:Q170545}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stereoisomer of', 'o': 'L-Phe'}

 Q: What is {deathplace} of {Gustav Mahler}, that has {has boroughs} is {Neubau} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7304 wdt:P20 ?answer . ?answer wdt:P150 wd:Q664835}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gustav Mahler', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has boroughs', 'o': 'Neubau'}}

 Q: what is the {start time} for {Oliver Sacks} has {residence} as {New York City} ?
 SPARQL: SELECT ?value WHERE { wd:Q258662 p:P551 ?s . ?s ps:P551 wd:Q60 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Oliver Sacks', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'New York City'}}}

 Q: What is {musical instrument} of {lyricist} of {Face to the Sky} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14951082 wdt:P676 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Face to the Sky', 'p': 'lyricist', 'o': '$y0'}}

 Q: What is {took part} of {A. J. Foyt}, that has {event} is {1951 24 Hours of Le Mans} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173228 wdt:P1344 ?answer . ?answer wdt:P793 wd:Q216396}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'A.J. Foyt', 'p': 'took part', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'event', 'o': '1951 24 Hours of Le Mans'}}

 Q: What is {position held} of {Raymond Poincaré} that is {replaced by} is {Jacques Bainville} ?
 SPARQL: SELECT ?obj WHERE { wd:Q191974 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q966894 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Raymond Poincaré', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Jacques Bainville'}}}

 Q: What is the {empire} for {diplomatic relation} of {Ottoman Empire}
 SPARQL:  select distinct ?obj where { wd:Q12560 wdt:P530 ?obj . ?obj wdt:P31 wd:Q48349 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ottoman Empire', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'empire'}}

 Q: What is the founder of the located in of The Parnassus ?
 SPARQL: SELECT ?answer WHERE { wd:Q2715152 wdt:P276 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Parnassus', 'p': 'location', 'o': '$y0'}}

 Q: Who are the writers of Mahabharata with children in Dhritarashtra?
 SPARQL: SELECT ?answer WHERE { wd:Q8276 wdt:P50 ?answer . ?answer wdt:P40 wd:Q926150}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mahabharata', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child', 'o': 'Dhritarashtra'}}

 Q: Who is the inventor of the anatomical location of sinoatrial node disease?
 SPARQL: SELECT ?answer WHERE { wd:Q18553498 wdt:P927 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inventor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sinoatrial node disease', 'p': 'anatomical location', 'o': '$y0'}}

