 Q: How many {cuisine} are to/by {veganism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2012 wd:Q181138 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'cuisine', 'o': 'veganism'}

 Q: What is {publication date} of {Nintendo 3DS} that is {place of publication} is {Australia} ?
 SPARQL: SELECT ?obj WHERE { wd:Q203597 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P291 wd:Q408 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'published', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nintendo 3DS', 'p': 'published', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of publication', 'o': 'Australia'}}}

 Q: When was Dwayne Johnson nominated for the MTV Movie Award for Best Villain?
 SPARQL: SELECT ?value WHERE { wd:Q10738 p:P1411 ?s . ?s ps:P1411 wd:Q1062026 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dwayne Johnson', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'MTV Movie Award for Best Villain'}, 't': '?x0'}

 Q: What is {significant incident} of {marry} of {Anna Berliner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q53834036 wdt:P26 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'significant incident', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Berliner', 'p': 'marry', 'o': '$y0'}}

 Q: What is {exchange} of {distributed by} of {Leaf Trombone: World Stage} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6508851 wdt:P750 ?X . ?X wdt:P414 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'exchange', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leaf Trombone: World Stage', 'p': 'distributed by', 'o': '$y0'}}

 Q: What is the magnetic ordering which starts with the letter p?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15706549 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magnetic ordering'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: Who is the spouse of Ivan Pyryev on 1936-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q552450 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1936')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ivan Pyryev', 'p': 'spouse', 'o': '?x0', 't': '1936'}

 Q: What is the {opera} for {language of work or name} of {Russian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q1344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work or name', 'o': 'Russian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'opera'}}

 Q: What is the {written work} for {edition or translation of} of {Septuagint}
 SPARQL:  select distinct ?obj where { wd:Q29334 wdt:P629 ?obj . ?obj wdt:P31 wd:Q47461344 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Septuagint', 'p': 'version of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'written work'}}

 Q: What is the {academic major} for {studies} of {peat}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2578 wd:Q184624 . ?sbj wdt:P31 wd:Q4671286 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'peat', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'major'}}

 Q: What is Paul Hindemith's GTAA ID?
 SPARQL: select distinct ?answer where { wd:Q57244 wdt:P1741 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paul Hindemith', 'p': 'GTAA ID', 'o': '?x0'}

 Q: What is {partner city} of {born in} of {Phil LaMarr} ?
 SPARQL: SELECT ?answer WHERE { wd:Q356541 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'partner city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Phil LaMarr', 'p': 'born in', 'o': '$y0'}}

 Q: What is the {digital rights management} for {language used} of {Norwegian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q192532 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Norwegian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'DRM'}}

 Q: What is FIDE ID for Anatoly Karpov ?
 SPARQL: select distinct ?answer where { wd:Q131674 wdt:P1440 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Anatoly Karpov', 'p': 'FIDE ID', 'o': '?x0'}

 Q: Who is a team member of the Chicago Cubs?
 SPARQL: select distinct ?answer where { ?answer wdt:P54 wd:Q246782}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'team', 'o': 'Chicago Cubs'}

 Q: When did Tallahassee have a population of 181376?
 SPARQL: SELECT ?value WHERE { wd:Q37043 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'181376')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Tallahassee', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '181376'}, 't': '?x0'}

 Q: What topic of meditation has its originating source in Tripitaka?
 SPARQL: SELECT ?answer WHERE { wd:Q108458 wdt:P1269 ?answer . ?answer wdt:P248 wd:Q1321432}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'meditation', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'originating source', 'o': 'Tripitaka'}}

 Q: Who is the business owner of Barbie the doll maker
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q167447 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'Barbie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What sub-province-level division starts with the letter "x"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q250811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sub-province-level division'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'x'}}

 Q: Who gave the{type of music} of {working place} of {Derek Blasberg} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5261816 wdt:P108 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Derek Blasberg', 'p': 'working place', 'o': '$y0'}}

 Q: What is the {human} for {record label} of {Korn}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P264 wd:Q80304 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'label', 'o': 'Korn', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When did position for officeholder of Mauricio Macri?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q561837 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Mauricio Macri', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is played by a baseball bat that has the field of this profession as baseball?
 SPARQL: SELECT ?answer WHERE { wd:Q809910 wdt:P1535 ?answer . ?answer wdt:P425 wd:Q5369}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'baseball bat', 'p': 'played by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'field of this profession', 'o': 'baseball'}}

 Q: How many captains are there for the Montreal Canadiens?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q188143 wdt:P634 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Montreal Canadiens', 'p': 'captain', 'o': '?x0'}

 Q: Is the electric dipole moment of pyrrole less than 2.1204?
 SPARQL: ASK WHERE { wd:Q242627 wdt:P2201 ?obj filter(?obj < 2.1204) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'pyrrole', 'p': 'electric dipole moment', 'o': '?x0', '?x0': '2.1204'}

 Q: What was the population of Galicia in Jan. 1st, 2018
 SPARQL: SELECT ?obj WHERE { wd:Q3908 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Galicia', 'p': 'population', 'o': '?x0', 't': '2018'}

 Q: Which is the candidacy in election for Felipe González?
 SPARQL: select distinct ?answer where { wd:Q156799 wdt:P3602 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Felipe González', 'p': 'candidacy in election', 'o': '?x0'}

 Q: What is {electoral district} and {elected in} of {{Moon Jae-in} has {position held} as {Member of National Assembly of South Korea}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q21001 p:P39 ?s . ?s ps:P39 wd:Q14850694 . ?s pq:P768 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moon Jae-in', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of National Assembly of South Korea'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Moon Jae-in', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of National Assembly of South Korea'}}}]

 Q: What award did Marvin Minsky receive in the early 1900's ?
 SPARQL: SELECT ?obj WHERE { wd:Q204815 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marvin Minsky', 'p': 'award', 'o': '?x0', 't': '1990'}

 Q: What is {nominated for} of {Martin Landau} that is {for work} is {Tucker: The Man and His Dream} ?
 SPARQL: SELECT ?obj WHERE { wd:Q294641 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1421355 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Landau', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Tucker: The Man and His Dream'}}}

 Q: What is the {human} for {participant of} of {Manhattan Project}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1344 wd:Q127050 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant of', 'o': 'Manhattan Project', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {member of sports team} of {Josef Bican} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q352017 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Bican', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Bican', 'p': 'team', 'o': '$y0'}}]

 Q: Give me a social class name that contains the word 'zeugitae' in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q187588 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeugitae')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social class'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeugitae'}}

 Q: What is {spouse} of {Carl Gustav Jung} and {start time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q41532 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Gustav Jung', 'p': 'spouse', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'spouse', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carl Gustav Jung', 'p': 'spouse', 'o': '$y0'}}]

 Q: What is {mascot} of {sequel of} of {Lord Strathcona's Horse (Royal Canadians)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3259400 wdt:P155 ?X . ?X wdt:P822 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mascot', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Lord Strathcona's Horse (Royal Canadians)", 'p': 'sequel of', 'o': '$y0'}}

 Q: How many {mushroom ecological type} are to/by {parasitism} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P788 wd:Q186517 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'mushroom ecological type', 'o': 'parasitism'}

 Q: Who is the patron saint active in Innocent III?
 SPARQL: SELECT ?answer WHERE { wd:Q128076 wdt:P937 ?X . ?X wdt:P417 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'patron saint', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Innocent III', 'p': 'active in', 'o': '$y0'}}

 Q: Were there 6265 votes received on the Sixth Amendment of the Constitution of Ireland?
 SPARQL: ASK WHERE { wd:Q7533104 wdt:P1111 ?obj filter(?obj = 6265) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Sixth Amendment of the Constitution of Ireland', 'p': 'votes received', 'o': '?x0', '?x0': '6265'}

 Q: What city does Curtis Institute of Music reside in, and has wards in Cameron County?
 SPARQL: SELECT ?answer WHERE { wd:Q60450 wdt:P131 ?answer . ?answer wdt:P150 wd:Q494142}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Curtis Institute of Music', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has wards', 'o': 'Cameron County'}}

 Q: What is {played by} of {subcellular localization} of {EH-domain containing 1} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21498376 wdt:P681 ?X . ?X wdt:P1535 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'played by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'EH-domain containing 1', 'p': 'subcellular localization', 'o': '$y0'}}

 Q: who is rector of Karl Weierstraß ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1075 wd:Q57103}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'rector', 'o': 'Karl Weierstraß'}

 Q: How many diocese are there in the Russian Orthodox Church?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P708 wd:Q60995 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'diocese', 'o': 'Russian Orthodox Church'}

 Q: Who is native to the British English area, that has diplomatic relation to Russia?
 SPARQL: SELECT ?answer WHERE { wd:Q7979 wdt:P2341 ?answer . ?answer wdt:P530 wd:Q159}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'British English', 'p': 'native to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Russia'}}

 Q: What is {academic degree} and {academic major} of {{Bernice Rubens} has {educated at} as {University of Wales}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q449028 p:P69 ?s . ?s ps:P69 wd:Q1072029 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernice Rubens', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Wales'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bernice Rubens', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Wales'}}}]

 Q: Who is the husband of the costume designer from The Fuller Brush Girl?
 SPARQL: SELECT ?answer WHERE { wd:Q3604163 wdt:P2515 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husband', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Fuller Brush Girl', 'p': 'costume designer', 'o': '$y0'}}

 Q: what is the {determination method} for {The Bronx} has {population} as {1.40794e+06} ?
 SPARQL: SELECT ?value WHERE { wd:Q18426 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.40794e+06')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Bronx', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.40794e+06'}}}

 Q: What is {diplomatic relation} of {land} of {Dezful} ?
 SPARQL: SELECT ?answer WHERE { wd:Q605142 wdt:P17 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dezful', 'p': 'land', 'o': '$y0'}}

 Q: What is {subject had role} of {sidekick of} of {Heihei} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27048565 wdt:P2546 ?X . ?X wdt:P2868 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Heihei', 'p': 'sidekick of', 'o': '$y0'}}

 Q: Tell me metropolitan city of South Korea whose name has the word ulsan in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482821 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ulsan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolitan city of South Korea'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ulsan'}}

 Q: What sports team did athlete Marco van Basten leave after Jan. 1st, 1987?
 SPARQL: SELECT ?obj WHERE { wd:Q483629 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1987')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marco van Basten', 'p': 'team', 'o': '?x0', 't': '1987'}

 Q: what is the {end time} for {Robert Byrd} has {position held} as {Member of the West Virginia House of Delegates} ?
 SPARQL: SELECT ?value WHERE { wd:Q276524 p:P39 ?s . ?s ps:P39 wd:Q19772501 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Byrd', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the West Virginia House of Delegates'}}}

 Q: Which is the Thyssen-Bornemisza artist ID of Maurice de Vlaminck?
 SPARQL: select distinct ?answer where { wd:Q241098 wdt:P2431 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Maurice de Vlaminck', 'p': 'Thyssen-Bornemisza artist ID', 'o': '?x0'}

 Q: What award did Frank Herbert receive in 1966?
 SPARQL: SELECT ?obj WHERE { wd:Q7934 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Frank Herbert', 'p': 'award', 'o': '?x0', 't': '1966'}

 Q: Who gave the{ZIP+4} of {resident in} of {James Ellroy} ?
 SPARQL: SELECT ?answer WHERE { wd:Q318487 wdt:P551 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ZIP+4', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Ellroy', 'p': 'resident in', 'o': '$y0'}}

 Q: what is the {named after} for {France Gall} has {pseudonym} as {France Gall} ?
 SPARQL: SELECT ?value WHERE { wd:Q208258 p:P742 ?s . ?s ps:P742 ?x filter(contains(?x,'France Gall')) . ?s pq:P138 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'named after', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'France Gall', 'p': 'pseudonym', 'o': '$y0'}}

 Q: What is the {administrative territorial entity} for {capital} of {England}
 SPARQL:  select distinct ?obj where { wd:Q179876 wdt:P36 ?obj . ?obj wdt:P31 wd:Q56061 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'England', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'administrative territorial entity'}}

 Q: What was the population of Lubeck in 1946?
 SPARQL: SELECT ?obj WHERE { wd:Q2843 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lubeck', 'p': 'population', 'o': '?x0', 't': '1946'}

 Q: Abu Musab al-Zarqawir is chairperson of what organization?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q181049 . ?sbj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Abu Musab al-Zarqawi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: what is the {replaced by} for {Ion Antonescu} has {position held} as {Prime Minister of Romania} ?
 SPARQL: SELECT ?value WHERE { wd:Q152030 p:P39 ?s . ?s ps:P39 wd:Q15304810 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ion Antonescu', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of Romania'}}}

 Q: What is {end time} and {start time} of {{William Michael Rossetti} has {work location} as {London}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q719428 p:P937 ?s . ?s ps:P937 wd:Q84 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Michael Rossetti', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'London'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Michael Rossetti', 'p': 'work location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'work location', 'o': 'London'}}}]

 Q: What is the release version of the Apple Macintosh operating system?
 SPARQL: SELECT ?answer WHERE { wd:Q75687 wdt:P306 ?X . ?X wdt:P348 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'version', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Apple Macintosh', 'p': 'operating system', 'o': '$y0'}}

 Q: what is the {statement is subject of} for {Citizen Kane} has {nominated for} as {Academy Award for Best Art Direction, Black and White} ?
 SPARQL: SELECT ?value WHERE { wd:Q24815 p:P1411 ?s . ?s ps:P1411 wd:Q22253133 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Citizen Kane', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Art Direction, Black and White'}}}

 Q: What city of Isla Grande de Tierra del Fuego has 6801 inhabitants?
 SPARQL: SELECT ?answer WHERE { wd:Q1674067 wdt:P131 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'6801'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isla Grande de Tierra del Fuego', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '6801'}}

 Q: What is {start time} and {elected in} of {{Angela Merkel} has {position held} as {member of the German Bundestag}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 wd:Q1939555 . ?s pq:P580 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angela Merkel', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the German Bundestag'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'election', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Angela Merkel', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the German Bundestag'}}}]

 Q: What award did Barbara Cook receive in 1955?
 SPARQL: SELECT ?obj WHERE { wd:Q2883930 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1955')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Barbara Cook', 'p': 'award', 'o': '?x0', 't': '1955'}

 Q: When did Dwyane Wade win the Sports Illustrated Sportsperson of the Year award?
 SPARQL: SELECT ?value WHERE { wd:Q31683 p:P166 ?s . ?s ps:P166 wd:Q1653207 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dwyane Wade', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Sports Illustrated Sportsperson of the Year'}, 't': '?x0'}

 Q: what is the {start time} for {Humphrey Bogart} has {spouse} as {Mayo Methot} ?
 SPARQL: SELECT ?value WHERE { wd:Q16390 p:P26 ?s . ?s ps:P26 wd:Q529654 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Humphrey Bogart', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': 'Mayo Methot'}}}

 Q: Is the stall speed of the Boing 747 equal to 200.0?
 SPARQL: ASK WHERE { wd:Q179 wdt:P6510 ?obj filter(?obj = 200.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '747', 'p': 'stall speed', 'o': '?x0', '?x0': '200.0'}

 Q: What is {position held} of {Manuel I Komnenos} that is {start time} is {1143-4-8} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41610 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1143')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Manuel I Komnenos', 'p': 'position held', 'o': '?x0', 't': '1143'}

 Q: What technique used in tapestry is not used for upholstery?
 SPARQL: SELECT ?answer WHERE { wd:Q184296 wdt:P2079 ?answer . ?answer wdt:P1889 wd:Q1123578}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'tapestry', 'p': 'technique used', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'is not', 'o': 'upholstery'}}

 Q: What is the opposite of led to when referencing a family?
 SPARQL: SELECT ?answer WHERE { wd:Q8436 wdt:P1542 ?X . ?X wdt:P461 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'family', 'p': 'led to', 'o': '$y0'}}

 Q: IS THE NUMBER OF PAGES OF PERCEPTIONS ABOUT POSTDOCS EQUALS 1
 SPARQL: ASK WHERE { wd:Q22121983 wdt:P1104 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Perceptions about postdocs', 'p': 'number of pages', 'o': '?x0', '?x0': '1'}

 Q: Which {daddy} of {starring} of {Sweet Little Lies} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4189751 wdt:P161 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dad', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sweet Little Lies', 'p': 'starring', 'o': '$y0'}}

 Q: Which is the game mode that contains the word versus in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1971694 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'versus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'game mode'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'versus'}}

 Q: Which was the political party of the chairperson of Josip Broz Tito?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q9161 . ?sbj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Josip Broz Tito', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: What is <SummitPost mountain ID> of <Oregon Coast Range> ?
 SPARQL: select distinct ?answer where { wd:Q2029517 wdt:P3309 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oregon Coast Range', 'p': 'SummitPost mountain ID', 'o': '?x0'}

 Q: What is {date of birth} and {date of death} of {{Frederick William I of Prussia} has {child} as {Princess Friederike Luise of Prussia}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q288925 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Friederike Luise of Prussia'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick William I of Prussia', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Friederike Luise of Prussia'}}}]

 Q: What is {taxon parent} of {Demospongiae}, that has {science, that studies} is {spongiology} ?
 SPARQL: SELECT ?answer WHERE { wd:Q248530 wdt:P171 ?answer . ?answer wdt:P2579 wd:Q18392412}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Demospongiae', 'p': 'taxon parent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'science, that studies', 'o': 'spongiology'}}

 Q: Where is the location of the Samsung headquarters with the postal code of 443-742?
 SPARQL: SELECT ?obj WHERE { wd:Q20716 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'443-742')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Samsung', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'postal code', 'o': '443-742'}}}

 Q: Which is the {video game} of {voice actor} {Sasha Grey}?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P725 wd:Q2709 . ?sbj wdt:P31 wd:Q7889 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'voice actor', 'o': 'Sasha Grey', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game'}}

 Q: Who {is son of} {Eileen O'Casey} {has children} ?
 SPARQL: SELECT ?answer WHERE { wd:Q18559727 wdt:P40 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Eileen O'Casey", 'p': 'child', 'o': '$y0'}}

 Q: What is the {human} with the {MAX(Elo rating)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Elo rating', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is it true that the Tsing Ma Bridge has a clearance that is equal to 62?
 SPARQL: ASK WHERE { wd:Q16396 wdt:P2793 ?obj filter(?obj = 62) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tsing Ma Bridge', 'p': 'clearance', 'o': '?x0', '?x0': '62'}

 Q: What is the {film} for {cast member} of {Amanda Bynes}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P161 wd:Q212002 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cast member', 'o': 'Amanda Bynes', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: Is it true that the volume as quantity of Barragem Canrobert 1 equals to 0.0056?
 SPARQL: ASK WHERE { wd:Q62012350 wdt:P2234 ?obj filter(?obj = 0.0056) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Barragem Canrobert 1', 'p': 'volume as quantity', 'o': '?x0', '?x0': '0.0056'}

 Q: Is the maximum capacity of the Zipflbob less than 1.2?
 SPARQL: ASK WHERE { wd:Q205443 wdt:P1083 ?obj filter(?obj < 1.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Zipflbob', 'p': 'maximum capacity', 'o': '?x0', '?x0': '1.2'}

 Q: What are the video game series which start with the letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7058673 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game series'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Is the number of losses of Zaur Kasumov equal to 2?
 SPARQL: ASK WHERE { wd:Q18510232 wdt:P1356 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Zaur Kasumov', 'p': 'number of losses', 'o': '?x0', '?x0': '2'}

 Q: What is {famous books} of {written by} of {Maurice} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1241741 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'famous books', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Maurice', 'p': 'written by', 'o': '$y0'}}

