 Q: what is the {end time} for {Reinhard Heydrich} has {position held} as {President of Interpol} ?
 SPARQL: SELECT ?value WHERE { wd:Q60039 p:P39 ?s . ?s ps:P39 wd:Q19698214 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Reinhard Heydrich', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'President of Interpol'}}}

 Q: "Which is {portrait of} of {A Sunday Afternoon on the Island of La Grande Jatte}, which has {sound emitted} is {female voice} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q1044742 wdt:P180 ?answer . ?answer wdt:P4733 wd:Q50810224}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'A Sunday Afternoon on the Island of La Grande Jatte', 'p': 'portrait of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sound emitted', 'o': 'female voice'}}

 Q: Mention the qualifying degree and the major specialization course in which Jeff Bezos graduated from the Princeton University
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeff Bezos', 'p': 'graduated from', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'graduated from', 'o': 'Princeton University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeff Bezos', 'p': 'graduated from', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'graduated from', 'o': 'Princeton University'}}}]

 Q: Which is gait for horse?
 SPARQL: select distinct ?answer where { wd:Q726 wdt:P2839 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'horse', 'p': 'gait', 'o': '?x0'}

 Q: Which is the German cattle breed ID of Jersey cattle?
 SPARQL: select distinct ?answer where { wd:Q987965 wdt:P2024 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jersey cattle', 'p': 'German cattle breed ID', 'o': '?x0'}

 Q: What is {guilty of} of {presented by} of {Paris Hilton's My New BFF} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1513736 wdt:P371 ?X . ?X wdt:P1399 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'guilty of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Paris Hilton's My New BFF", 'p': 'presented by', 'o': '$y0'}}

 Q: Which is the date of baptism in early childhood of Diego Velázquez?
 SPARQL: select distinct ?answer where { wd:Q297 wdt:P1636 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Diego Velázquez', 'p': 'date of baptism in early childhood', 'o': '?x0'}

 Q: what is the {for work} for {Seal} has {nominated for} as {Grammy Award for Best Pop Vocal Album} ?
 SPARQL: SELECT ?value WHERE { wd:Q218091 p:P1411 ?s . ?s ps:P1411 wd:Q1027891 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Seal', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Grammy Award for Best Pop Vocal Album'}}}

 Q: Give me {separation process} that {discoverer or inventor} {Zosimos of Panopolis} and which contains the word {distillation} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distillation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'separation process', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discoverer or inventor', 'o': 'Zosimos of Panopolis'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'distillation'}}

 Q: Tell me the association football stadium of the structural engineer Sinclair Knight Merz which starts with the letter s?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1154710 . ?sbj wdt:P631 wd:Q3459673 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'football stadium', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'structural engineer', 'o': 'Sinclair Knight Merz'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {mother} and {date of death} of {{Charlemagne} has {child} as {Charles the Younger}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}]

 Q: What is the {monetary authority} with the {MAX(target interest rate)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q6899005 . ?ent wdt:P2661 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'target interest rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monetary authority'}}

 Q: What was the population of Guinea in 1961?
 SPARQL: SELECT ?obj WHERE { wd:Q1006 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Guinea', 'p': 'population', 'o': '?x0', 't': '1961'}

 Q: What is the {human} for {named after} of {Calvinism}
 SPARQL:  select distinct ?obj where { wd:Q101849 wdt:P138 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Calvinism', 'p': 'named for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Is the periapsis 15817 Lucianotesi less than 1.40172756?
 SPARQL: ASK WHERE { wd:Q141068 wdt:P2244 ?obj filter(?obj < 1.40172756) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': '15817 Lucianotesi', 'p': 'periapsis', 'o': '?x0', '?x0': '1.40172756'}

 Q: When is Naruto Uzumaki's birthday?
 SPARQL: select distinct ?answer where { wd:Q931 wdt:P3150 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Naruto Uzumaki', 'p': 'birthday', 'o': '?x0'}

 Q: What is {position held} of {David Trimble} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q192556 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Trimble', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Trimble', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {spouse} of {Chrissie Hynde} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q239202 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chrissie Hynde', 'p': 'married', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Chrissie Hynde', 'p': 'married', 'o': '$y0'}}]

 Q: What is {bordered by} of {died in} of {William Booth} ?
 SPARQL: SELECT ?answer WHERE { wd:Q309882 wdt:P20 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bordered by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Booth', 'p': 'died in', 'o': '$y0'}}

 Q: Give me {communist party} that contains the word {práce} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'práce')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'communist party'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'práce'}}

 Q: what is the {start time} for {Leslie Lamport} has {employer} as {Microsoft Research} ?
 SPARQL: SELECT ?value WHERE { wd:Q92613 p:P108 ?s . ?s ps:P108 wd:Q1144725 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leslie Lamport', 'p': 'working for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'working for', 'o': 'Microsoft Research'}}}

 Q: What was the significant event happend when Gina Rinehart was came to an end in 1981
 SPARQL: SELECT ?obj WHERE { wd:Q242982 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gina Rinehart', 'p': 'significant event', 'o': '?x0', 't': '1981'}

 Q: What is the {democratic republic} for {indigenous to} of {American English}
 SPARQL:  select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q5255892 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'American English', 'p': 'indigenous to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'democratic republic'}}

 Q: Tell me an arithmetic calendar that has the word calendar in it's name.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q669102 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'calendar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'arithmetic calendar'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'calendar'}}

 Q: What is the {human} for {cast member} of {Game of Thrones}
 SPARQL:  select distinct ?obj where { wd:Q23572 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Game of Thrones', 'p': 'cast member', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the twin city of Basel which has an establishment date of 751-0-0?
 SPARQL: SELECT ?answer WHERE { wd:Q78 wdt:P190 ?answer . ?answer wdt:P571 ?x FILTER(contains(?x,'751-0-0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Basel', 'p': 'twin city', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'establishment date', 'o': '751-0-0'}}

 Q: What film production company owns the American Broadcasting Company?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q169889 . ?sbj wdt:P31 wd:Q1762059 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owns', 'o': 'American Broadcasting Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film production company'}}

 Q: What is formed in burial place of William IV, Prince of Orange ?
 SPARQL: SELECT ?answer WHERE { wd:Q380949 wdt:P119 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'formed in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William IV, Prince of Orange', 'p': 'burial place', 'o': '$y0'}}

 Q: What is the {HTML4 named color} for {color} of {ruby}
 SPARQL:  select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q56053097 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ruby', 'p': 'color', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'HTML4 named color'}}

 Q: what is the {point in time} for {Jonathan Franzen} has {award received} as {National Book Award for Fiction} ?
 SPARQL: SELECT ?value WHERE { wd:Q316607 p:P166 ?s . ?s ps:P166 wd:Q3873144 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jonathan Franzen', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'National Book Award for Fiction'}, 't': '?x0'}

 Q: Which Shumen cave has the lowest temperature?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q35509 . ?ent wdt:P2076 ?obj . ?ent wdt:P131 wd:Q181830} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cave', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Shumen'}}}

 Q: Is Burt Reynolds a citizen of America?
 SPARQL: ASK WHERE { wd:Q202148 wdt:P27 wd:Q30 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Burt Reynolds', 'p': 'citizen of', 'o': '?x0', '?x0': 'America'}]

 Q: What is the {country} and the {continent} of {Bangalore} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1355 wdt:P17 ?ans_1 . wd:Q1355 wdt:P30 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Bangalore', 'p': 'country', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Bangalore', 'p': 'continent', 'o': '?x1'}]

 Q: What is webcam page URL for Metz ?
 SPARQL: select distinct ?answer where { wd:Q22690 wdt:P4238 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Metz', 'p': 'webcam page URL', 'o': '?x0'}

 Q: what is the {point in time} for {Romário} has {award received} as {World Cup Golden Ball} ?
 SPARQL: SELECT ?value WHERE { wd:Q178649 p:P166 ?s . ?s ps:P166 wd:Q17355204 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Romario', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'World Cup Golden Ball'}, 't': '?x0'}

 Q: What is the {human} for {cause of death} of {amyotrophic lateral sclerosis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P509 wd:Q206901 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'cause of death', 'o': 'amyotrophic lateral sclerosis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {partner in sports} of {co-founder} of {E. & H. T. Anthony & Co.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5321681 wdt:P112 ?X . ?X wdt:P1327 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'partner in sports', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anthony', 'p': 'co-founder', 'o': '$y0'}}

 Q: Who is the writer of On Liberty who's birthday is May 20, 1806?
 SPARQL: SELECT ?answer WHERE { wd:Q1055881 wdt:P50 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1806'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'On Liberty', 'p': 'writer', 'o': '?x0', 't': '1806'}

 Q: What are the paradox which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q483372 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'paradox'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is <Africultures person ID> of <Ryszard Kapuściński> ?
 SPARQL: select distinct ?answer where { wd:Q216813 wdt:P4514 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryszard Kapuściński', 'p': 'Africultures person ID', 'o': '?x0'}

 Q: Is William Lawson's first name the same as Gwyllym?
 SPARQL: SELECT ?answer WHERE { wd:Q249724 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19874199}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Lawson', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Gwyllym'}}

 Q: what is the {start time} for {Katharine Graham} has {award received} as {Library of Congress Living Legend} ?
 SPARQL: SELECT ?value WHERE { wd:Q435203 p:P166 ?s . ?s ps:P166 wd:Q6542686 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katharine Graham', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Library of Congress Living Legend'}}}

 Q: Which award was received by Kobe Bryant in 2007?
 SPARQL: SELECT ?obj WHERE { wd:Q25369 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kobe Bryant', 'p': 'award', 'o': '?x0', 't': '2007'}

 Q: What is the {chemical compound} for {significant drug interaction} of {erythromycin}
 SPARQL:  select distinct ?obj where { wd:Q213511 wdt:P769 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'erythromycin', 'p': 'significant drug interaction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: what biblical episode commemorates Palm Sunday?
 SPARQL:  select distinct ?obj where { wd:Q42236 wdt:P547 ?obj . ?obj wdt:P31 wd:Q22704077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Palm Sunday', 'p': 'commemorates', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical episode'}}

 Q: What is <office held by head of government> of <governor> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1313 wd:Q132050}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'office held by head of government', 'o': 'governor'}

 Q: What is the {human} for {voice actor} of {The Lion King}
 SPARQL:  select distinct ?obj where { wd:Q36479 wdt:P725 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Lion King', 'p': 'voice actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the event location in action of the Allies?
 SPARQL: SELECT ?answer WHERE { wd:Q215669 wdt:P607 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Allies', 'p': 'in action', 'o': '$y0'}}

 Q: What is dissertation submitted to for Gordon Brown ?
 SPARQL: select distinct ?answer where { wd:Q10648 wdt:P4101 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gordon Brown', 'p': 'dissertation submitted to', 'o': '?x0'}

 Q: How many academic major subjects required for {jurisprudence} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P812 wd:Q4932206 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'academic major', 'o': 'jurisprudence'}

 Q: What happened in New Zealand on 11/25/1947?
 SPARQL: SELECT ?obj WHERE { wd:Q664 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1947')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New Zealand', 'p': 'type', 'o': '?x0', 't': '1947'}

 Q: What is {construction material} of {tea}, that has {made from} is {Camellia sinensis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6097 wdt:P186 ?answer . ?answer wdt:P1582 wd:Q101815}
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'tea', 'p': 'made from', 'o': '?x0', '?x0': 'Camellia sinensis'}]

 Q: what is the {end time} for {George Frideric Handel} has {educated at} as {University of Halle-Wittenberg} ?
 SPARQL: SELECT ?value WHERE { wd:Q7302 p:P69 ?s . ?s ps:P69 wd:Q32120 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Handel', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Halle-Wittenberg'}}}

 Q: When did educated at of Melinda Gates and academic major?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Melinda Gates', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Melinda Gates', 'p': 'educated at', 'o': '$y0'}}]

 Q: Which is the bore of AK-47?
 SPARQL: select distinct ?answer where { wd:Q37116 wdt:P2556 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'AK-47', 'p': 'bore', 'o': '?x0'}

 Q: Which dialect is the official language of the Achaemenid Empire?
 SPARQL:  select distinct ?obj where { wd:Q389688 wdt:P37 ?obj . ?obj wdt:P31 wd:Q33384 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Achaemenid Empire', 'p': 'official language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect'}}

 Q: What is <male form of label> of <military officer> ?
 SPARQL: select distinct ?answer where { wd:Q189290 wdt:P3321 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'military officer', 'p': 'male form of label', 'o': '?x0'}

 Q: what is the {for work} for {Omar Sharif} has {award received} as {César Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q170515 p:P166 ?s . ?s ps:P166 wd:Q900494 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Omar Sharif', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Cesar Award for Best Actor'}}}

 Q: Tell me about employer of Nora Ephron and occupation?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q214677 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P106 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'occupation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nora Ephron', 'p': 'employer', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'employer', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nora Ephron', 'p': 'employer', 'o': '$y0'}}]

 Q: Which is the Movieplayer film ID for Once Upon a Time in the West?
 SPARQL: select distinct ?answer where { wd:Q168154 wdt:P4783 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Once Upon a Time in the West', 'p': 'Movieplayer film ID', 'o': '?x0'}

 Q: What is the {participant} and the {location} of {Battle_of_Gettysburg} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q33132 wdt:P710 ?ans_1 . wd:Q33132 wdt:P276 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Battle of Gettysburg', 'p': 'participant', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Battle of Gettysburg', 'p': 'location', 'o': '?x1'}]

 Q: What is {has sister} of {actress} of {Red Line} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7304498 wdt:P161 ?X . ?X wdt:P3373 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Red Line', 'p': 'actress', 'o': '$y0'}}

 Q: What is the holds position of the government headed by Frankfurt?
 SPARQL: SELECT ?answer WHERE { wd:Q1794 wdt:P6 ?X . ?X wdt:P39 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'holds position', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frankfurt', 'p': 'government headed by', 'o': '$y0'}}

 Q: Give me {arithmetic calendar} that starts with {'c'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q669102 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'arithmetic calendar'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Give me {space probe} that {start point} {Cape Canaveral Air Force Station Space Launch Complex 41} and which that starts with {'v'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj wdt:P1427 wd:Q1034348 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space probe', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'from', 'o': 'Launch Complex 41'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {seat} of {team played for} of {Alcides Peña} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2467100 wdt:P54 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'seat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alcides Peña', 'p': 'team', 'o': '$y0'}}

 Q: Was Natalia Molchanova born in the Bashkir Autonomous Soviet Socialist Republic?
 SPARQL: SELECT ?obj WHERE { wd:Q59920 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q809806 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'born in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Natalia Molchanova', 'p': 'born in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Bashkir Autonomous Soviet Socialist Republic'}}}

 Q: What is {member of crew of} of {cosmonaut mission} of {Michael Fincke} ?
 SPARQL: SELECT ?answer WHERE { wd:Q362261 wdt:P450 ?X . ?X wdt:P1029 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of crew of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Fincke', 'p': 'cosmonaut mission', 'o': '$y0'}}

 Q: What award medal was given to John Steinbeck ?
 SPARQL:  select distinct ?obj where { wd:Q39212 wdt:P166 ?obj . ?obj wdt:P31 wd:Q131647 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Steinbeck', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medal'}}

 Q: What is timeline of topic for culture of Belle Barth ?
 SPARQL: SELECT ?answer WHERE { wd:Q4883606 wdt:P172 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'timeline of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belle Barth', 'p': 'culture', 'o': '$y0'}}

 Q: who is depicted by Phan Thi Kim Phuc ?
 SPARQL: select distinct ?answer where { wd:Q233383 wdt:P1299 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phan Thi Kim Phuc', 'p': 'depicted by', 'o': '?x0'}

 Q: What is {born at} of {Oliver Hazard Perry}, that has {diplomatic relation} is {Chile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q580513 wdt:P19 ?answer . ?answer wdt:P530 wd:Q298}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Oliver Hazard Perry', 'p': 'born at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Chile'}}

 Q: What is {award received} of {Star Wars Episode V: The Empire Strikes Back} that is {winner} is {Bill Varney} ?
 SPARQL: SELECT ?obj WHERE { wd:Q181795 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q4911227 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'winner', 'o': 'Bill Varney'}}}

 Q: What is the {state} with the {MIN(inflation rate)} whose {instance of} is {sovereign state}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7275 . ?ent wdt:P1279 ?obj . ?ent wdt:P31 wd:Q3624078} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'inflation rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}}

 Q: What is {followed by} and {follows} of {{Communist Party of China} has {chairperson} as {Zhao Ziyang}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q99829 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Zhao Ziyang'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Communist Party of China', 'p': 'chairperson', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'chairperson', 'o': 'Zhao Ziyang'}}}]

 Q: What is {inception} and {dissolved, abolished or demolished} of {{European Union} has {follows} as {European Community}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q458 p:P155 ?s . ?s ps:P155 wd:Q260487 . ?s pq:P571 ?value1 . ?s pq:P576 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inception', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'European Union', 'p': 'follows', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'European Community'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'abolished', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'European Union', 'p': 'follows', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'European Community'}}}]

 Q: What is the motto of Shahada?
 SPARQL: select distinct ?answer where { ?answer wdt:P1546 wd:Q41831}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'motto', 'o': 'Shahada'}

 Q: What is the {official tourism agency} for {tourist office} of {Frankfurt}
 SPARQL:  select distinct ?obj where { wd:Q1794 wdt:P2872 ?obj . ?obj wdt:P31 wd:Q26989327 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Frankfurt', 'p': 'tourist office', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'official tourism agency'}}

 Q: What is ICTV virus ID of Asfarviridae?
 SPARQL: select distinct ?answer where { wd:Q250204 wdt:P1076 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Asfarviridae', 'p': 'ICTV virus ID', 'o': '?x0'}

 Q: what is the {start time} for {Saint-Étienne} has {twinned administrative body} as {Fes} ?
 SPARQL: SELECT ?value WHERE { wd:Q42716 p:P190 ?s . ?s ps:P190 wd:Q80985 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saint-Étienne', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Fes'}}}

 Q: Who is {mother} of {kids} of {Jason Robards} ?
 SPARQL: SELECT ?answer WHERE { wd:Q296630 wdt:P40 ?X . ?X wdt:P25 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jason Robards', 'p': 'son', 'o': '$y0'}}

 Q: What invention contains the word tourbillion in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18119757 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tourbillon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'invention'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tourbillon'}}

 Q: What are the place of birth and the child of Pete Wentz?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q310166 wdt:P19 ?ans_1 . wd:Q310166 wdt:P40 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Pete Wentz', 'p': 'place of birth', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Pete Wentz', 'p': 'child', 'o': '?x1'}]

 Q: What part of the series is preceded by "Hooked on Monkey Fonics"?
 SPARQL: SELECT ?answer WHERE { wd:Q724150 wdt:P155 ?X . ?X wdt:P179 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'part of the series', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hooked on Monkey Fonics', 'p': 'preceded by', 'o': '$y0'}}

 Q: What is the {type of quantum particle} for {antiparticle} of {neutron}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2152 wd:Q2348 . ?sbj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'antiparticle', 'o': 'neutron', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: Is the pKa of ammonia equal to 7.368?
 SPARQL: ASK WHERE { wd:Q4087 wdt:P1117 ?obj filter(?obj = 7.368) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'ammonia', 'p': 'pKa', 'o': '?x0', '?x0': '7.368'}

