 Q: Give me {historical language} that {has grammatical gender} {feminine} and which contains the word {ancient} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2315359 . ?sbj wdt:P5109 wd:Q1775415 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ancient')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical language', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical gender', 'o': 'feminine'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ancient'}}

 Q: What is {known for} of {writer} of {Shakespeare's sonnets} ?
 SPARQL: SELECT ?answer WHERE { wd:Q662550 wdt:P50 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'known for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Shakespeare's sonnets", 'p': 'writer', 'o': '$y0'}}

 Q: Which are the afflicts that has a result of ethylene glycol?
 SPARQL: SELECT ?answer WHERE { wd:Q194207 wdt:P1542 ?X . ?X wdt:P689 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'afflicts', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ethylene glycol', 'p': 'result', 'o': '$y0'}}

 Q: what is the {valid in period} for {Newcastle upon Tyne} has {located in time zone} as {UTC+01:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q1425428 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Newcastle upon Tyne', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+01:00'}}}

 Q: What is the {branch of chemistry} for {studies} of {peat}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2578 wd:Q184624 . ?sbj wdt:P31 wd:Q11790203 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studies', 'o': 'peat', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of chemistry'}}

 Q: How many {court} are to/by {Supreme Court of the United Kingdom} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4884 wd:Q1122261 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'court', 'o': 'Supreme Court of the United Kingdom'}

 Q: What is the {filmography} for {named after} of {Denzel Washington}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q42101 . ?sbj wdt:P31 wd:Q1371849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Denzel Washington', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'filmography'}}

 Q: What award did Paul Dirac receive and how much was the prize money?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q47480 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prize money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Dirac', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Dirac', 'p': 'award', 'o': '$y0'}}]

 Q: What is tourist office for  office ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2872 wd:Q182060}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'tourist office', 'o': 'office'}

 Q: Tell me which train service that is operated by Compagnie Internationale des Wagons-Lits and that contains the word express in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15141321 . ?sbj wdt:P137 wd:Q1121141 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'express')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'train service', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'operated by', 'o': 'Compagnie Internationale des Wagons-Lits'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'express'}}

 Q: What literary work follows the book of Exodus?
 SPARQL:  select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q7725634 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Exodus', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'literary work'}}

 Q: which institution that starts with the letter r
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178706 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'institution'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: What is {position held} of {James Callaghan} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9576 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Callaghan', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Callaghan', 'p': 'position held', 'o': '$y0'}}]

 Q: What is the {chemical compound} for {drug used for treatment} of {post-traumatic stress disorder}
 SPARQL:  select distinct ?obj where { wd:Q202387 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'PTSD', 'p': 'treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}

 Q: What is {discoverer or inventor of} of {major event} of {Nick Faldo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q531520 wdt:P793 ?X . ?X wdt:P61 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discoverer or inventor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nick Faldo', 'p': 'major event', 'o': '$y0'}}

 Q: what is the {determination method} for {Tolyatti} has {population} as {6381.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q1341 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'6381.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tolyatti', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '6381.0'}}}

 Q: What is {animals species kept} of {place of residence} of {Harambe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26388682 wdt:P551 ?X . ?X wdt:P1990 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'species kept', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harambe', 'p': 'residence', 'o': '$y0'}}

 Q: What is {shares border with} of {Île-de-France} that is {start time} is {2016-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q13917 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Île-de-France', 'p': 'border', 'o': '?x0', 't': '2016'}

 Q: Tell me biblical place whose name has the word zorah in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12404340 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zorah')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biblical place'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zorah'}}

 Q: What is the {proposed aircraft} with the {MAX(wing area)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q15061018 . ?ent wdt:P2112 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'wing area', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'proposed aircraft'}}

 Q: What is {profession} of {José Martí}, that has {is said to be the same as} is {Dichter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q103285 wdt:P106 ?answer . ?answer wdt:P460 wd:Q1293108}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jose Marti', 'p': 'profession', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be the same as', 'o': 'Dichter'}}

 Q: Is Barbara Streisand's net worth greater than 312,000,000?
 SPARQL: ASK WHERE { wd:Q4636 wdt:P2218 ?obj filter(?obj > 312000000.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Barbra Streisand', 'p': 'net worth', 'o': '?x0', '?x0': '312000000.0'}

 Q: How many students does Jacques-Louis David teach?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q83155 wdt:P802 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Jacques-Louis David', 'p': 'student', 'o': '?x0'}

 Q: What is {mother} and {date of birth} of {{Pedro I} has {child} as {Pedro II of Brazil}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q156774 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Pedro II of Brazil'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'birthdate', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Pedro II of Brazil'}}}]

 Q: Who is the {life stance} of {Zhuang people} who has {formed in} {Bodh Gaya} ?
 SPARQL: SELECT ?answer WHERE { wd:Q36692 wdt:P140 ?answer . ?answer wdt:P740 wd:Q176767}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zhuang people', 'p': 'life stance', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'formed in', 'o': 'Bodh Gaya'}}

 Q: What is the {human} for {employer} of {J. R. R. Tolkien}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P108 wd:Q892 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Tolkien', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {most eastern} of {comes from} of {sonata} ?
 SPARQL: SELECT ?answer WHERE { wd:Q131269 wdt:P495 ?X . ?X wdt:P1334 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'most eastern', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'sonata', 'p': 'comes from', 'o': '$y0'}}

 Q: What is the {director of photography} and the {director} of {Blade_Runner} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q184843 wdt:P344 ?ans_1 . wd:Q184843 wdt:P57 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Blade Runner', 'p': 'director of photography', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Blade Runner', 'p': 'director', 'o': '?x1'}]

 Q: Which is the NASA biographical ID for Gordon Cooper?
 SPARQL: select distinct ?answer where { wd:Q312833 wdt:P2030 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gordon Cooper', 'p': 'NASA biographical ID', 'o': '?x0'}

 Q: What are the world day which start with the letter n
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2558684 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'world day'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is {writer} of {Ninety-five Theses}, that has {tomb} is {All Saints' Church} ?
 SPARQL: SELECT ?answer WHERE { wd:Q157506 wdt:P50 ?answer . ?answer wdt:P119 wd:Q661752}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ninety-five Theses', 'p': 'writer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tomb', 'o': "All Saints' Church"}}

 Q: What are the standards developing organisation of IEEE 1394, that have subsidiary entities of IEEE Nuclear and Plasma Sciences Society?
 SPARQL: SELECT ?answer WHERE { wd:Q181693 wdt:P1462 ?answer . ?answer wdt:P355 wd:Q3639101}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'IEEE 1394', 'p': 'standards developing organisation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'IEEE Nuclear and Plasma Sciences Society'}}

 Q: What is {results in} of {belongs to} of {AT&T Laboratories} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4654538 wdt:P127 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'results in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'AT&T Laboratories', 'p': 'belongs to', 'o': '$y0'}}

 Q: Is the VAT-rate of South Korea equal to 10?
 SPARQL: ASK WHERE { wd:Q884 wdt:P2855 ?obj filter(?obj = 10) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'South Korea', 'p': 'VAT-rate', 'o': '?x0', '?x0': '10'}

 Q: What is the {human} for {employer} of {Qantas}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P108 wd:Q32491 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'employer', 'o': 'Qantas', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {world war} for {has cause} of {Treaty of Versailles}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P828 wd:Q8736 . ?sbj wdt:P31 wd:Q103495 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'has cause', 'o': 'Treaty of Versailles', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'world war'}}

 Q: What is the {aspect of history} for {history of topic} of {cryptography}
 SPARQL:  select distinct ?obj where { wd:Q8789 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q17524420 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cryptography', 'p': 'history of topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical aspect'}}

 Q: Which is the bridge that is located in the administrative territorial entity of London Borough of Southwark and whose name contains the word bridge?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12280 . ?sbj wdt:P131 wd:Q730706 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bridge')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bridge', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'London Borough of Southwark'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'bridge'}}

 Q: is it true that the age of candidacy of the member of the chamber of deputies of the parliament of czech republic is equal to 18?
 SPARQL: ASK WHERE { wd:Q19803234 wdt:P2998 ?obj filter(?obj = 18) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Member of the Chamber of Deputies of the Parliament of the Czech Republic', 'p': 'age of candidacy', 'o': '?x0', '?x0': '18'}

 Q: Give me {mantra} that {facet of} {Hinduism} and which that starts with {'g'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mantra', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Hinduism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: What is the {owner of} and the {member of} of {Bono} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q834621 wdt:P1830 ?ans_1 . wd:Q834621 wdt:P463 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Bono', 'p': 'owner of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Bono', 'p': 'member of', 'o': '?x1'}]

 Q: What is the Belgium's Enterprise number for the European Parliament?
 SPARQL: select distinct ?answer where { wd:Q8889 wdt:P3376 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'European Parliament', 'p': 'Enterprise number', 'o': '?x0'}

 Q: What is the {human biblical figure} for {mother} of {Jesus Christ}
 SPARQL:  select distinct ?obj where { wd:Q302 wdt:P25 ?obj . ?obj wdt:P31 wd:Q20643955 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jesus', 'p': 'mother', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human biblical figure'}}

 Q: What basic emotion starts with the letter "t"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16748867 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'basic emotion'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {award received} of {Tomas Tranströmer} that is {prize money} is {1e+07} ?
 SPARQL: SELECT ?obj WHERE { wd:Q42122 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'1e+07')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tomas Tranströmer', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '1e+07'}}}

 Q: Was Old English John F. Kennedy's native language?
 SPARQL: ASK WHERE { wd:Q9696 wdt:P103 wd:Q42365 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John F. Kennedy', 'p': 'native language', 'o': '?x0', '?x0': 'Old English'}]

 Q: How many birth name are for Sarah Bernhardt?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q4605 wdt:P1477 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Sarah Bernhardt', 'p': 'birth name', 'o': '?x0'}

 Q: What was the population of Kokand in 1970?
 SPARQL: SELECT ?obj WHERE { wd:Q489890 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kokand', 'p': 'population', 'o': '?x0', 't': '1970'}

 Q: Which is the worst-case space complexity of quicksort?
 SPARQL: select distinct ?answer where { wd:Q486598 wdt:P3755 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'quicksort', 'p': 'worst-case space complexity', 'o': '?x0'}

 Q: What is {catchment basin} of {tributary} of {Lake Saint Clair} ?
 SPARQL: SELECT ?answer WHERE { wd:Q736707 wdt:P974 ?X . ?X wdt:P2053 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'catchment basin', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lake Saint Clair', 'p': 'tributary', 'o': '$y0'}}

 Q: What is {together with} and {earliest date} of {{Alexander Pushkin} has {residence} as {Ulyanovsk}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q7200 p:P551 ?s . ?s ps:P551 wd:Q5627 . ?s pq:P1706 ?value1 . ?s pq:P1319 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Pushkin', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Ulyanovsk'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'earliest date', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Pushkin', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Ulyanovsk'}}}]

 Q: What is the {place of birth} and the {place of death} of {Jane_Austen} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36322 wdt:P19 ?ans_1 . wd:Q36322 wdt:P20 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Jane Austen', 'p': 'place of birth', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Jane Austen', 'p': 'place of death', 'o': '?x1'}]

 Q: What is {head of government} of {Tbilisi} that is {end time} is {2004-4-19} ?
 SPARQL: SELECT ?obj WHERE { wd:Q994 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tbilisi', 'p': 'head of government', 'o': '?x0', 't': '2004'}

 Q: Where is the aerodrome reference point at Hiroshima?
 SPARQL: select distinct ?answer where { wd:Q34664 wdt:P2786 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hiroshima', 'p': 'aerodrome reference point', 'o': '?x0'}

 Q: what is the {point in time} for {Wendy Wasserstein} has {award received} as {William Inge Theatre Festival Distinguished Achievement in the American Theatre Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q450050 p:P166 ?s . ?s ps:P166 wd:Q29458167 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Wendy Wasserstein', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'William Inge Theatre Festival Distinguished Achievement in the American Theatre Award'}, 't': '?x0'}

 Q: What is the {imprint} for {record label} of {50 Cent}
 SPARQL:  select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '50 Cent', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'imprint'}}

 Q: Is Martin Luther a son of Magdalena Luther?
 SPARQL: ASK WHERE { wd:Q9554 wdt:P40 wd:Q6729875 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Martin Luther', 'p': 'son', 'o': '?x0', '?x0': 'Magdalena Luther'}]

 Q: What is the {megacity} for {official language} of {Urdu}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q174844 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Urdu', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'megacity'}}

 Q: what is the {point in time} for {Diana Ross} has {award received} as {Michigan Women's Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q36290 p:P166 ?s . ?s ps:P166 wd:Q6837811 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Diana Ross', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': "Michigan Women's Hall of Fame"}, 't': '?x0'}

 Q: What is <Flora of China ID> of <Citrus ×limon> ?
 SPARQL: select distinct ?answer where { wd:Q500 wdt:P1747 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Citrus ×limon', 'p': 'Flora of China ID', 'o': '?x0'}

 Q: What is license of iTunes ?
 SPARQL: select distinct ?answer where { wd:Q9589 wdt:P275 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'iTunes', 'p': 'license', 'o': '?x0'}

 Q: What is {zipcode} of {buried in} of {Georges Bizet} ?
 SPARQL: SELECT ?answer WHERE { wd:Q56158 wdt:P119 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zip code', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georges Bizet', 'p': 'buried in', 'o': '$y0'}}

 Q: What is cinematografo ID for Wallace Beery?
 SPARQL: select distinct ?answer where { wd:Q322179 wdt:P4768 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wallace Beery', 'p': 'cinematografo ID', 'o': '?x0'}

 Q: What's the capital of Paris?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q90 wdt:P1376 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Paris', 'p': 'capital of', 'o': '?x0'}

 Q: When was Thomas Hardy nominated for the Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q132805 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Thomas Hardy', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: Did {Mitt_Romney} {position held} {bishop} and {United States senator} ?
 SPARQL: ASK WHERE { wd:Q4496 wdt:P39 wd:Q4917468 . wd:Q4496 wdt:P39 wd:Q13217683 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mitt Romney', 'p': 'position held', 'o': '?x0', '?x0': 'bishop'}, {'h': 'IS', 'v': '?x1', 's': 'Mitt Romney', 'p': 'position held', 'o': '?x1', '?x1': 'US senator'}]

 Q: Where is the location of death of John Dowland whose zipcode is BR?
 SPARQL: SELECT ?answer WHERE { wd:Q207355 wdt:P20 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'BR'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Dowland', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'zipcode', 'o': 'br'}}

 Q: What is {agent} of {in conflict} of {Hosni Mubarak} ?
 SPARQL: SELECT ?answer WHERE { wd:Q34105 wdt:P607 ?X . ?X wdt:P710 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'agent', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hosni Mubarak', 'p': 'conflict', 'o': '$y0'}}

 Q: Which member of the sports team Ian Botham left in 1988?
 SPARQL: SELECT ?obj WHERE { wd:Q982121 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ian Botham', 'p': 'team', 'o': '?x0', 't': '1988'}

 Q: What is time zone of subitem of of history of Lithuania?
 SPARQL: SELECT ?answer WHERE { wd:Q215063 wdt:P1269 ?X . ?X wdt:P421 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time zone', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Lithuania', 'p': 'subitem of', 'o': '$y0'}}

 Q: Which is the currency symbol description for Australian dollar?
 SPARQL: select distinct ?answer where { wd:Q259502 wdt:P489 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Australian dollar', 'p': 'currency symbol description', 'o': '?x0'}

 Q: Which unit of pressure has maximum conversion to standard unit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q10751953 . ?ent wdt:P2442 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'conversion to standard unit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unit of pressure'}}

 Q: Which is the sexual orientation for asexuality?
 SPARQL: select distinct ?answer where { ?answer wdt:P91 wd:Q724351}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sexual orientation', 'o': 'asexuality'}

 Q: Which is the league level above the Ligue 1?
 SPARQL: select distinct ?answer where { ?answer wdt:P2499 wd:Q13394}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'league level above', 'o': 'Ligue 1'}

 Q: Which is the clan for the family name of Genghis Khan?
 SPARQL:  select distinct ?obj where { wd:Q720 wdt:P734 ?obj . ?obj wdt:P31 wd:Q211503 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Genghis Khan', 'p': 'family name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'clan'}}

 Q: God Save the Queen is the anthem for which island nation?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P85 wd:Q40807 . ?sbj wdt:P31 wd:Q112099 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'God Save the Queen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'island nation'}}

 Q: what is the {statement is subject of} for {Burl Ives} has {award received} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q315723 p:P166 ?s . ?s ps:P166 wd:Q106291 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Burl Ives', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: What is {rector} of {works for} of {Georg Simmel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76849 wdt:P108 ?X . ?X wdt:P1075 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rector', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Georg Simmel', 'p': 'works for', 'o': '$y0'}}

 Q: What is the {musical} for {screenwriter} of {Andrew Lloyd Webber}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q2743 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'screenwriter', 'o': 'Andrew Lloyd Webber', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical'}}

 Q: Which is the Romanian Olympic and Sports Committee athlete ID for Nadia Comăneci?
 SPARQL: select distinct ?answer where { wd:Q33228 wdt:P4067 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nadia Comăneci', 'p': 'Romanian Olympic and Sports Committee athlete ID', 'o': '?x0'}

 Q: What is {educated at} of {Manmohan Singh} that is {academic degree} is {Doctor of Philosophy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41914 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q752297 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Manmohan Singh', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Doctor of Philosophy'}}}

 Q: What effect did the Big Bang have on the universe?
 SPARQL:  select distinct ?obj where { wd:Q323 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q36906466 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Big Bang', 'p': 'effect', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'universe'}}

 Q: Did {Atlanta} {twinned administrative body} {Athens} and {Nuremberg} ?
 SPARQL: ASK WHERE { wd:Q23556 wdt:P190 wd:Q1524 . wd:Q23556 wdt:P190 wd:Q2090 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Atlanta', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Athens'}, {'h': 'IS', 'v': '?x1', 's': 'Atlanta', 'p': 'twinned administrative body', 'o': '?x1', '?x1': 'Nuremberg'}]

 Q: Give me {borough of New York City} that {located in or next to body of water} {Upper New York Bay} and which that starts with {'m'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj wdt:P206 wd:Q1064776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'borough of New York City', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'located in or next to body of water', 'o': 'Upper New York Bay'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What is {area} of {Indian Ocean} that is {point in time} is {1982-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1239 p:P2046 ?s . ?s ps:P2046 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1982')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Indian Ocean', 'p': 'area', 'o': '?x0', 't': '1982'}

 Q: Which satellite  orbits of Messier 22?
 SPARQL: SELECT ?answer WHERE { wd:Q11392 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'satellite', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 22', 'p': 'orbits', 'o': '$y0'}}

 Q: What is the {sovereign state} for {diplomatic relation} of {African Union}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P530 wd:Q7159 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'African Union', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Who is the parent organization and chief executive officer of the Society of Jesus?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36380 wdt:P749 ?ans_1 . wd:Q36380 wdt:P169 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Society of Jesus', 'p': 'parent organization', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Society of Jesus', 'p': 'chief executive officer', 'o': '?x1'}]

 Q: What is the {food manufacturer} for {owned by} of {Burger King}
 SPARQL:  select distinct ?obj where { wd:Q177054 wdt:P127 ?obj . ?obj wdt:P31 wd:Q1252971 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Burger King', 'p': 'owned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'food manufacturer'}}

 Q: Who is Pan's Labyrinth's make-up artist?
 SPARQL: select distinct ?answer where { wd:Q216006 wdt:P4805 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Pan's Labyrinth", 'p': 'make-up artist', 'o': '?x0'}

