 Q: What is the {human} for {director} of {Who Framed Roger Rabbit}
 SPARQL:  select distinct ?obj where { wd:Q379873 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Who Framed Roger Rabbit', 'p': 'director', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the diplomatic relation of Limp Bizkit's place of origin?
 SPARQL: SELECT ?answer WHERE { wd:Q240767 wdt:P495 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Limp Bizkit', 'p': 'place of origin', 'o': '$y0'}}

 Q: What is the Magnus Carlsen participant's chess competition?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P710 wd:Q106807 . ?sbj wdt:P31 wd:Q59387863 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'participant', 'o': 'Magnus Carlsen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chess competition'}}

 Q: Which is the Companies House officer ID for Boris Johnson?
 SPARQL: select distinct ?answer where { wd:Q180589 wdt:P5297 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Boris Johnson', 'p': 'Companies House officer ID', 'o': '?x0'}

 Q: What is {fields} of {published in journal} of {Laser photodetachment of O3 -} ?
 SPARQL: SELECT ?answer WHERE { wd:Q31929734 wdt:P1433 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'fields', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Laser photodetachment of O3 -', 'p': 'published in', 'o': '$y0'}}

 Q: What is the {eye color} and the {hair color} of {Brigitte_Bardot} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36268 wdt:P1340 ?ans_1 . wd:Q36268 wdt:P1884 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Brigitte Bardot', 'p': 'eyes', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Brigitte Bardot', 'p': 'hair color', 'o': '?x1'}]

 Q: What is <FIS freestyle skier ID> of <Mikaël Kingsbury> ?
 SPARQL: select distinct ?answer where { wd:Q430936 wdt:P2774 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mikaël Kingsbury', 'p': 'FIS freestyle skier ID', 'o': '?x0'}

 Q: what is the {point in time} for {Chinua Achebe} has {nominated for} as {Neustadt International Prize for Literature} ?
 SPARQL: SELECT ?value WHERE { wd:Q155845 p:P1411 ?s . ?s ps:P1411 wd:Q580574 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Chinua Achebe', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Neustadt International Prize for Literature'}, 't': '?x0'}

 Q: What is the {flammable solid} with the {MAX(pKa)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21073024 . ?ent wdt:P1117 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'pKa', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable solid'}}

 Q: What is the {fictional human} for {narrator} of {The Catcher in the Rye}
 SPARQL:  select distinct ?obj where { wd:Q183883 wdt:P2438 ?obj . ?obj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Catcher in the Rye', 'p': 'narrator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional human'}}

 Q: What is ISO 3166-1 alpha-3 code for Réunion ?
 SPARQL: select distinct ?answer where { wd:Q17070 wdt:P298 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Réunion', 'p': 'ISO 3166-1 alpha-3 code', 'o': '?x0'}

 Q: Did {Louis_XVI_of_France} {sibling} {Louis XIV of France} and {Charles X of France} ?
 SPARQL: ASK WHERE { wd:Q7732 wdt:P3373 wd:Q7742 . wd:Q7732 wdt:P3373 wd:Q7758 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Louis XVI', 'p': 'sibling', 'o': '?x0', '?x0': 'Louis XIV of France'}, {'h': 'IS', 'v': '?x1', 's': 'Louis XVI', 'p': 'sibling', 'o': '?x1', '?x1': 'Charles X of France'}]

 Q: What is <season of club or team> of <Chicago Bulls> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5138 wd:Q128109}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'season of club or team', 'o': 'Bulls'}

 Q: How many bases does a quadrilateral have?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3263 wd:Q36810 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'base', 'o': 'quadrilateral'}

 Q: What is {owner} of {player of} of {Milt Palacio} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2449958 wdt:P54 ?X . ?X wdt:P127 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'owner', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Milt Palacio', 'p': 'player of', 'o': '$y0'}}

 Q: Which is the Revised Romanization for Jangsu?
 SPARQL: select distinct ?answer where { wd:Q498810 wdt:P2001 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jangsu', 'p': 'Revised Romanization', 'o': '?x0'}

 Q: What is {country of citizenship} of {Hedy Lamarr} that is {end time} is {1953-4-10} ?
 SPARQL: SELECT ?obj WHERE { wd:Q49034 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hedy Lamarr', 'p': 'citizenship', 'o': '?x0', 't': '1953'}

 Q: What is {has grammatical person} of {language read} of {George Michael} ?
 SPARQL: SELECT ?answer WHERE { wd:Q130311 wdt:P1412 ?X . ?X wdt:P5110 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical person', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Michael', 'p': 'language', 'o': '$y0'}}

 Q: What is {physically interacts with} of {drug interaction} of {erythromycin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q213511 wdt:P769 ?X . ?X wdt:P129 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'physically interacts with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Erythromycin', 'p': 'drug interaction', 'o': '$y0'}}

 Q: What are the scientific theory which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3239681 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'scientific theory'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is <decays to> of <helium-4> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P816 wd:Q1151346}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'decays to', 'o': 'helium-4'}

 Q: What is {has moon} of {parent body} of {Messier 7} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11234 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has moon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 7', 'p': 'parent body', 'o': '$y0'}}

 Q: What is the {practiced by} and the {main regulatory text} of {Taoism} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q9598 wdt:P3095 ?ans_1 . wd:Q9598 wdt:P92 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Taoism', 'p': 'practiced by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Taoism', 'p': 'main regulatory text', 'o': '?x1'}]

 Q: What is {shares border with} of {Andorra} that is {statement is subject of} is {Andorra–France border} ?
 SPARQL: SELECT ?obj WHERE { wd:Q228 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P805 wd:Q2009420 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andorra', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Andorra-France border'}}}

 Q: What toponym of the Spitzer Space Telescope has the forename of Lyman?
 SPARQL: SELECT ?answer WHERE { wd:Q201953 wdt:P138 ?answer . ?answer wdt:P735 wd:Q19830595}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Spitzer Space Telescope', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'forename', 'o': 'Lyman'}}

 Q: Give me {type of statistic} that contains the word {variance} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47103999 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'variance')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of statistic'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'variance'}}

 Q: What is {date of death} and {date of birth} of {{Isabella I of Castile} has {child} as {John, Prince of Asturias}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 wd:Q381871 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'death date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'John, Prince of Asturias'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isabella', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'John, Prince of Asturias'}}}]

 Q: What was the population of Navotas, on January 1, 1939?
 SPARQL: SELECT ?obj WHERE { wd:Q17179 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1939')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Navotas', 'p': 'population', 'o': '?x0', 't': '1939'}

 Q: What is {headquarters location} of {Symantec} that is {country} is {United States of America} ?
 SPARQL: SELECT ?obj WHERE { wd:Q677085 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q30 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Symantec', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'United States of America'}}}

 Q: what is the {replaces} for {Bonaventure} has {position held} as {cardinal-bishop} ?
 SPARQL: SELECT ?value WHERE { wd:Q43746 p:P39 ?s . ?s ps:P39 wd:Q1729113 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bonaventure', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'cardinal-bishop'}}}

 Q: What is {name in official language} of {writes language} of {Giovanni Battista Rubini} ?
 SPARQL: SELECT ?answer WHERE { wd:Q941040 wdt:P1412 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'name in official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Giovanni Battista Rubini', 'p': 'language', 'o': '$y0'}}

 Q: what is the {point in time} for {David Robinson} has {award received} as {Sports Illustrated Sportsperson of the Year} ?
 SPARQL: SELECT ?value WHERE { wd:Q211876 p:P166 ?s . ?s ps:P166 wd:Q1653207 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'David Robinson', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Sports Illustrated Sportsperson of the Year'}, 't': '?x0'}

 Q: What is the { determination method } for { Parkinson's disease } { genetic association } like { RIT2 }?
 SPARQL: SELECT ?value WHERE { wd:Q11085 p:P2293 ?s . ?s ps:P2293 wd:Q18031133 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Parkinson's disease", 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'RIT2'}}}

 Q: What award did Cornelia Funke receive in 2004?
 SPARQL: SELECT ?obj WHERE { wd:Q57971 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cornelia Funke', 'p': 'award', 'o': '?x0', 't': '2004'}

 Q: Tell me rapid transit  whose name has the word subway in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5503 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'subway')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'rapid transit'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'subway'}}

 Q: What is the official language of the topic of the history of Jamaica?
 SPARQL: SELECT ?answer WHERE { wd:Q1994210 wdt:P1269 ?X . ?X wdt:P37 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Jamaica', 'p': 'topic of', 'o': '$y0'}}

 Q: What is the {doctoral student} and the {doctoral advisor} of {Isaac_Newton} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q935 wdt:P185 ?ans_1 . wd:Q935 wdt:P184 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Isaac Newton', 'p': 'doctoral student', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Isaac Newton', 'p': 'doctoral advisor', 'o': '?x1'}]

 Q: Who was the rector of Autonomous University of Barcelona from 2009-1-14?
 SPARQL: SELECT ?obj WHERE { wd:Q43452 p:P1075 ?s . ?s ps:P1075 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Autonomous University of Barcelona', 'p': 'rector', 'o': '?x0', 't': '2009'}

 Q: Which is the Theatricalia theatre ID for Budapest?
 SPARQL: select distinct ?answer where { wd:Q1781 wdt:P2468 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Budapest', 'p': 'Theatricalia theatre ID', 'o': '?x0'}

 Q: What territory was Wrocław a part of during 1138?
 SPARQL: SELECT ?obj WHERE { wd:Q1799 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1138')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wrocław', 'p': 'in', 'o': '?x0', 't': '1138'}

 Q: What is {nominated for} of {Robert Downey, Jr.} that is {for work} is {Chaplin} ?
 SPARQL: SELECT ?obj WHERE { wd:Q165219 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q556967 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Downey', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Chaplin'}}}

 Q: What are the postal codes for Sioux Falls?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q131335 wdt:P281 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Sioux Falls', 'p': 'postal code', 'o': '?x0'}

 Q: Give me {territory of Australia} that {replaced by} {North Australia} and which that starts with {'n'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14192199 . ?sbj wdt:P1366 wd:Q15640003 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'territory of Australia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'North Australia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: Where is the headquarters of Hewlett-Packard with the zip code 94304?
 SPARQL: SELECT ?obj WHERE { wd:Q80978 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'94304')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'headquarters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hewlett-Packard', 'p': 'headquarters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'zip code', 'o': '94304'}}}

 Q: What is <Images d'Art artwork ID> of <Mona Lisa> ?
 SPARQL: select distinct ?answer where { wd:Q12418 wdt:P4761 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mona Lisa', 'p': "Images d'Art artwork ID", 'o': '?x0'}

 Q: what is the {start time} for {PayPal} has {parent organization} as {eBay} ?
 SPARQL: SELECT ?value WHERE { wd:Q483959 p:P749 ?s . ?s ps:P749 wd:Q58024 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'PayPal', 'p': 'parent organization', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'parent organization', 'o': 'eBay'}}}

 Q: what is military decoration starts with w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1788716 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military decoration'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Which presidential election had the most eligible voters?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q858439 . ?ent wdt:P1867 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'eligible voters', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'presidential election'}}

 Q: Which is the artist-info artist ID for Camille Claudel?
 SPARQL: select distinct ?answer where { wd:Q120582 wdt:P5489 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Camille Claudel', 'p': 'artist-info artist ID', 'o': '?x0'}

 Q: Name the country maintaining the diplomatic relationship with Soviet Union
 SPARQL:  select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Soviet Union', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Which sequel is Kingdom of Sardinia, whose chef-lieu is in Rome?
 SPARQL: SELECT ?answer WHERE { wd:Q165154 wdt:P156 ?answer . ?answer wdt:P36 wd:Q220}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kingdom of Sardinia', 'p': 'sequel is', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'chef-lieu', 'o': 'Rome'}}

 Q: Mention the location of headquarters of University of Toronto which has coordinate location 43.661666666667 -79.395?
 SPARQL: SELECT ?obj WHERE { wd:Q180865 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter(contains(?x,'43.661666666667 -79.395')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'University of Toronto', 'p': 'headquarters', 'o': '?x0'}

 Q: What's the active ingredient in fentanyl?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3781 wd:Q407541 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'active ingredient', 'o': 'fentanyl'}

 Q: What is <Australian Poetry Library poet ID> of <Henry Parkes> ?
 SPARQL: select distinct ?answer where { wd:Q1607143 wdt:P5465 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Henry Parkes', 'p': 'Australian Poetry Library poet ID', 'o': '?x0'}

 Q: Is the isospin quantum number of pion less than 1.2?
 SPARQL: ASK WHERE { wd:Q4097 wdt:P1126 ?obj filter(?obj < 1.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'pion', 'p': 'isospin quantum number', 'o': '?x0', '?x0': '1.2'}

 Q: Which is the big city in the continent of North America that starts with the letter v?:
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj wdt:P30 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'big city', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'continent', 'o': 'North America'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {operating profit} of {managed by} of {Taiwan High Speed Rail} ?
 SPARQL: SELECT ?answer WHERE { wd:Q706198 wdt:P137 ?X . ?X wdt:P3362 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operating profit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taiwan High Speed Rail', 'p': 'managed by', 'o': '$y0'}}

 Q: What is the {enterprise} for {business division} of {Walt Disney Parks and Resorts}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P199 wd:Q1431781 . ?sbj wdt:P31 wd:Q6881511 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'business division', 'o': 'Disney Parks', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'company'}}

 Q: What is structure replaced by World Trade Center ?
 SPARQL: select distinct ?answer where { wd:Q11235 wdt:P167 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'World Trade Center', 'p': 'structure replaced by', 'o': '?x0'}

 Q: Which is the resource which contains the word natural in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1554231 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'natural')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'resource'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'natural'}}

 Q: What is the gender expression of Tatum O'Neal, the American actress with the shortened name Аял?
 SPARQL: SELECT ?answer WHERE { wd:Q230138 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'Аял'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Tatum O'Neal", 'p': 'gender expression', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shortened name', 'o': 'аял'}}

 Q: What is the Erdos number for G.H. Hardy?
 SPARQL: select distinct ?answer where { wd:Q184337 wdt:P2021 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'G.H. Hardy', 'p': 'Erdos number', 'o': '?x0'}

 Q: Which is the inception for The Peasants?
 SPARQL: select distinct ?answer where { wd:Q2896338 wdt:P571 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Peasants', 'p': 'inception', 'o': '?x0'}

 Q: What is the work of Annibale Carracci, whose patron saint is Luke the Evangelist?
 SPARQL: SELECT ?answer WHERE { wd:Q7824 wdt:P106 ?answer . ?answer wdt:P417 wd:Q128538}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Annibale Carracci', 'p': 'work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Luke the Evangelist'}}

 Q: Which flammable solid has the highest flammable limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21073024 . ?ent wdt:P2203 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'upper flammable limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flammable solid'}}

 Q: What start located in the constellation of Centaurus has the least radial velocity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q523 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q8844} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'radial velocity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'star', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Centaurus'}}}

 Q: Who is the person that had Adelaide as place of death?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P20 wd:Q5112 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Adelaide', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is confused with semi-trailer truck born on 1977-2-1?
 SPARQL: SELECT ?answer WHERE { wd:Q1936841 wdt:P1889 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1977'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'semi-trailer truck', 'p': 'confused with', 'o': '?x0', 't': '1977'}

 Q: What is the {college} for {affiliation} of {McGill University}
 SPARQL:  select distinct ?obj where { wd:Q201492 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q189004 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'McGill University', 'p': 'affiliation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'college'}}

 Q: What is ethanol's UN class?
 SPARQL: select distinct ?answer where { wd:Q153 wdt:P874 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethanol', 'p': 'UN class', 'o': '?x0'}

 Q: what is the {statement is subject of} for {The Deer Hunter} has {award received} as {Academy Award for Best Picture} ?
 SPARQL: SELECT ?value WHERE { wd:Q201674 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Deer Hunter', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Picture'}}}

 Q: What is {working language} of {deity of} of {Yahweh} ?
 SPARQL: SELECT ?answer WHERE { wd:Q766677 wdt:P1049 ?X . ?X wdt:P2936 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'working language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yahweh', 'p': 'deity of', 'o': '$y0'}}

 Q: What are the specialty which start with the letter visagie
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047113 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'visagie')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'specialty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'visagie'}}

 Q: What is the outcome of Hamad bin Khalifa Al Thani that which has been coined Univision?
 SPARQL: SELECT ?answer WHERE { wd:Q57360 wdt:P793 ?answer . ?answer wdt:P61 wd:Q731824}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hamad bin Khalifa Al Thani', 'p': 'outcome', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'coined', 'o': 'Univision'}}

 Q: Which piece that contains the favorite player Plautus was written by Richard II?
 SPARQL: SELECT ?answer WHERE { wd:Q649562 wdt:P50 ?answer . ?answer wdt:P737 wd:Q47160}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Richard II', 'p': 'written by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'favorite player', 'o': 'Plautus'}}

 Q: What is {genetic association} of {tuberculosis}, that has {start coordinate} is {103109431} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12204 wdt:P2293 ?answer . ?answer wdt:P644 ?x FILTER(contains(?x,'103109431'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'tuberculosis', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'start coordinate', 'o': '103109431'}}

 Q: What are the mode of transport that starts with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q334166 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mode of transport'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {educated at} of {Josef Mengele} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q57109 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Mengele', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Josef Mengele', 'p': 'educated at', 'o': '$y0'}}]

 Q: Did {Holly_Holm} {competition class} {bantamweight}?
 SPARQL: ASK WHERE { wd:Q2414305 wdt:P2094 wd:Q948780 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Holly Holm', 'p': 'competition class', 'o': '?x0', '?x0': 'bantamweight'}]

 Q: what is the {point in time} for {Zibo} has {twinned administrative body} as {Gwangju} ?
 SPARQL: SELECT ?value WHERE { wd:Q198370 p:P190 ?s . ?s ps:P190 wd:Q42069 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Zibo', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Gwangju'}, 't': '?x0'}

 Q: What is the natural product of taxon from Mammuthus?
 SPARQL: select distinct ?answer where { ?answer wdt:P1582 wd:Q36715}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'natural product of taxon', 'o': 'Mammuthus'}

 Q: Is the average short length of the Russian Ark 96?
 SPARQL: ASK WHERE { wd:Q59721 wdt:P2208 ?obj filter(?obj = 96) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Russian Ark', 'p': 'average shot length', 'o': '?x0', '?x0': '96'}

 Q: What is list of works for Charlie Chaplin ?
 SPARQL: select distinct ?answer where { wd:Q882 wdt:P1455 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charlie Chaplin', 'p': 'list of works', 'o': '?x0'}

 Q: What was Patton Oswalt nominated for in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q374065 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Patton Oswalt', 'p': 'nominated for', 'o': '?x0', 't': '2011'}

 Q: What is the executive body of Cyprus?
 SPARQL: select distinct ?answer where { wd:Q229 wdt:P208 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cyprus', 'p': 'executive body', 'o': '?x0'}

 Q: Tell me the award received by Arthur Smith Woodward in 1924?
 SPARQL: SELECT ?obj WHERE { wd:Q542973 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1924')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arthur Smith Woodward', 'p': 'award received', 'o': '?x0', 't': '1924'}

 Q: tell  me social service that name has the word social in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16605260 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'social')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social service'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'social'}}

 Q: what is the {applies to part} for {Nile} has {origin of the watercourse} as {Lake Tana} ?
 SPARQL: SELECT ?value WHERE { wd:Q3392 p:P885 ?s . ?s ps:P885 wd:Q116685 . ?s pq:P518 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nile', 'p': 'origin of the watercourse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'origin of the watercourse', 'o': 'Lake Tana'}}}

 Q: Tell me the festival which starts with the letter v!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132241 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'festival'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is the {National Society of Film Critics Award} for {nominated for} of {Javier Bardem}
 SPARQL:  select distinct ?obj where { wd:Q134895 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q21866939 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Javier Bardem', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'National Society of Film Critics Award'}}

 Q: What metropolis is the sister city of Bern?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q70 . ?sbj wdt:P31 wd:Q200250 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Bern', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'metropolis'}}

