 Q: what is the {character role} for {Lawrence of Arabia} has {cast member} as {Jack Hawkins} ?
 SPARQL: SELECT ?value WHERE { wd:Q228186 p:P161 ?s . ?s ps:P161 wd:Q26118 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'character role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lawrence of Arabia', 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Jack Hawkins'}}}

 Q: What is the occupation of William Shakespeare?
 SPARQL:  select distinct ?obj where { wd:Q692 wdt:P106 ?obj . ?obj wdt:P31 wd:Q12737077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'William Shakespeare', 'p': 'occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'occupation'}}

 Q: Which is the hair color for orange?
 SPARQL: select distinct ?answer where { ?answer wdt:P1884 wd:Q39338}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'hair color', 'o': 'orange'}

 Q: Give me {Catholic cathedral} that {dedicated to} {Virgin Mary} and which that starts with {'d'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj wdt:P825 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Catholic cathedral', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'dedicated to', 'o': 'Virgin Mary'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'd'}}

 Q: What is {elected in} and {end cause} of {{Bonar Law} has {position held} as {Member of the 30th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q166663 p:P39 ?s . ?s ps:P39 wd:Q41582581 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bonar Law', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 30th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bonar Law', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 30th Parliament of the United Kingdom'}}}]

 Q: What is the stop of the genetic association of Parkinson disease?
 SPARQL: SELECT ?answer WHERE { wd:Q11085 wdt:P2293 ?X . ?X wdt:P645 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'stop', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Parkinson', 'p': 'genetic association', 'o': '$y0'}}

 Q: what is the {serial number} for {Semyon Timoshenko} has {award received} as {Order of Victory} ?
 SPARQL: SELECT ?value WHERE { wd:Q191702 p:P166 ?s . ?s ps:P166 wd:Q465316 . ?s pq:P2598 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'serial number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Semyon Timoshenko', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Order of Victory'}}}

 Q: What is the {constitutional republic} for {applies to jurisdiction} of {U.S. Declaration of Independence}
 SPARQL:  select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q1520223 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Declaration of Independence', 'p': 'jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitutional republic'}}

 Q: What is the {regional organization} for {diplomatic relation} of {ASEAN}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P530 wd:Q7768 . ?sbj wdt:P31 wd:Q4120211 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'ASEAN', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'regional organization'}}

 Q: What is the {business} for {owner of} of {American Broadcasting Company}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q169889 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'American Broadcasting Company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: Name a confederation in the Roman Empire.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q2277 . ?sbj wdt:P31 wd:Q170156 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Roman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'confederation'}}

 Q: Who {has sons} of {son of} of {Fu Xi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q236972 wdt:P22 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fu Xi', 'p': 'son of', 'o': '$y0'}}

 Q: What twinned administrative body of Cuenca began on March 14, 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q54886 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cuenca', 'p': 'twinned administrative body', 'o': '?x0', 't': '2000'}

 Q: does the HD 40307 stellar rotational velocity equal 3?
 SPARQL: ASK WHERE { wd:Q26687 wdt:P4296 ?obj filter(?obj = 3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'HD 40307', 'p': 'stellar rotational velocity', 'o': '?x0', '?x0': '3'}

 Q: How many producer for Gladiator?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q128518 wdt:P162 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Gladiator', 'p': 'producer', 'o': '?x0'}

 Q: Is the number of points/goals/sets scored by the 2007 UEFA Futsal Championship more than 66.4?
 SPARQL: ASK WHERE { wd:Q116525 wdt:P1351 ?obj filter(?obj > 66.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '2007 UEFA Futsal Championship', 'p': 'number of points', 'o': '?x0', '?x0': '66.4'}

 Q: What is {position held} of {Boutros Boutros-Ghali} that is {start time} is {1992-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1257 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Boutros Boutros-Ghali', 'p': 'position held', 'o': '?x0', 't': '1992'}

 Q: Which is the animation technique of the facet of 3D animation software and contains the word animation in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj wdt:P1269 wd:Q23442766 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'animation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animation technique', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': '3D animation software'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'animation'}}

 Q: What is {educated at} and {field of work} of {{Gavin McInnes} has {academic degree} as {Bachelor of Arts}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q5528217 p:P512 ?s . ?s ps:P512 wd:Q1765120 . ?s pq:P69 ?value1 . ?s pq:P101 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gavin McInnes', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'Bachelor of Arts'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'field of work', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gavin McInnes', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'Bachelor of Arts'}}}]

 Q: what is the {end time} for {Edred of England} has {country of citizenship} as {Kingdom of Wessex} ?
 SPARQL: SELECT ?value WHERE { wd:Q191767 p:P27 ?s . ?s ps:P27 wd:Q105313 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edred of England', 'p': 'country of citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country of citizenship', 'o': 'Kingdom of Wessex'}}}

 Q: What is {in the administrative unit} of {Cascade Range}, that has {has rural cities} is {Wahkiakum County} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4558 wdt:P131 ?answer . ?answer wdt:P150 wd:Q484015}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cascade Range', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has rural cities', 'o': 'Wahkiakum County'}}

 Q: Who is the {anion} for {conjugate base} of {sulfate ion}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4149 wd:Q172290 . ?sbj wdt:P31 wd:Q107968 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate base', 'o': 'sulfate ion', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anion'}}

 Q: When did series of Star Wars Episode V: The Empire Strikes Back and follows?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q181795 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0'}}]

 Q: What is {seat} of {KGB}, that has {has states} is {Golyanovo District} ?
 SPARQL: SELECT ?answer WHERE { wd:Q80919 wdt:P159 ?answer . ?answer wdt:P150 wd:Q2365753}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'KGB', 'p': 'seat', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has states', 'o': 'Golyanovo District'}}

 Q: How many {mountain range} are to/by {Atlas Mountains} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4552 wd:Q130135 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'range', 'o': 'Atlas Mountains'}

 Q: What is {alma mater} of {musical score by} of {Holly Hobbie and Friends: Surprise Party} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12124801 wdt:P86 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'alma mater', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Holly Hobbie and Friends: Surprise Party', 'p': 'musical score by', 'o': '$y0'}}

 Q: How many {habitat} are in {tropical forest}?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2974 wd:Q199403 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'habitat', 'o': 'tropical forest'}

 Q: Which is the video of Glenn Greenwald?
 SPARQL: select distinct ?answer where { wd:Q5568842 wdt:P10 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Glenn Greenwald', 'p': 'video', 'o': '?x0'}

 Q: What is the Haumea minor planet group?
 SPARQL: select distinct ?answer where { wd:Q601 wdt:P196 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Haumea', 'p': 'minor planet group', 'o': '?x0'}

 Q: What is <conjugate base> of <sulfate ion> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P4149 wd:Q172290}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate base', 'o': 'sulfate ion'}

 Q: What is the {nation of Nineteen Eighty-Four} for {present in work} of {Nineteen Eighty-Four}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q208460 . ?sbj wdt:P31 wd:Q14752002 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Nineteen Eighty-Four', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nation of Nineteen Eighty-Four'}}

 Q: What is <day in year for periodic occurrence> of <Easter> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P837 wd:Q21196}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'day in year for periodic occurrence', 'o': 'Easter'}

 Q: What is {nominated for} of {Jack Lemmon} that is {statement is subject of} is {35th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q94123 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917148 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jack Lemmon', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'subject of', 'o': '35th Academy Awards'}}}

 Q: Tell me about the river located in or next to body of water in Munich.
 SPARQL:  select distinct ?obj where { wd:Q1726 wdt:P206 ?obj . ?obj wdt:P31 wd:Q4022 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Munich', 'p': 'located in or next to body of water', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: What character in Ben-Hur was played by the voice actor Jean-Claude Michel?
 SPARQL: SELECT ?value WHERE { wd:Q180098 p:P725 ?s . ?s ps:P725 wd:Q3165115 . ?s pq:P453 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'as', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ben-Hur', 'p': 'voice actor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'voice actor', 'o': 'Jean-Claude Michel'}}}

 Q: What is <OpenSecrets people ID> of <Hillary Clinton> ?
 SPARQL: select distinct ?answer where { wd:Q6294 wdt:P2686 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hillary Clinton', 'p': 'OpenSecrets people ID', 'o': '?x0'}

 Q: What commandment starts with the letter "t"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497090 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commandment'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the Crunchbase person ID for Rihanna?
 SPARQL: select distinct ?answer where { wd:Q36844 wdt:P2087 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rihanna', 'p': 'Crunchbase person ID', 'o': '?x0'}

 Q: What is the alphabet of Sumeria that has been discovered by Sumerians?
 SPARQL: SELECT ?answer WHERE { wd:Q36790 wdt:P282 ?answer . ?answer wdt:P61 wd:Q656043}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sumerian', 'p': 'alphabet', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'discovered by', 'o': 'Sumerians'}}

 Q: what is the {start time} for {Óscar de la Renta Fiallo} has {country of citizenship} as {Dominican Republic} ?
 SPARQL: SELECT ?value WHERE { wd:Q288029 p:P27 ?s . ?s ps:P27 wd:Q786 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Óscar de la Renta', 'p': 'citizenship', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'citizenship', 'o': 'Dominican Republic'}}}

 Q: What is <target interest rate> of <Federal Reserve System> ?
 SPARQL: select distinct ?answer where { wd:Q53536 wdt:P2661 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Federal Reserve', 'p': 'target interest rate', 'o': '?x0'}

 Q: What is {academic discipline} of {translated by} of {Tractatus Logico-Philosophicus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q655717 wdt:P655 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'discipline', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tractatus Logico-Philosophicus', 'p': 'translated by', 'o': '$y0'}}

 Q: What is the notation of character encoding?
 SPARQL: select distinct ?answer where { ?answer wdt:P913 wd:Q184759}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'notation', 'o': 'character encoding'}

 Q: Amtrak operates which train service?
 SPARQL:  select distinct ?obj where { wd:Q23239 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15141321 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Amtrak', 'p': 'operates', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'train service'}}

 Q: what is the {start time} for {Allen Iverson} has {member of sports team} as {Philadelphia 76ers} ?
 SPARQL: SELECT ?value WHERE { wd:Q190094 p:P54 ?s . ?s ps:P54 wd:Q138089 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Allen Iverson', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Philadelphia 76ers'}}}

 Q: Were Garuda Indonesia and Saudia operators to Boeing 747?
 SPARQL: ASK WHERE { wd:Q179 wdt:P137 wd:Q512468 . wd:Q179 wdt:P137 wd:Q541179 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Boeing 747', 'p': 'operator', 'o': '?x0', '?x0': 'Garuda Indonesia'}, {'h': 'IS', 'v': '?x1', 's': 'Boeing 747', 'p': 'operator', 'o': '?x1', '?x1': 'Saudia'}]

 Q: Tell me the musical duo that contains the word yazoo in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9212979 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yazoo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical duo'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yazoo'}}

 Q: What is {tributary} of {on harbour} of {Guangzhou} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16572 wdt:P206 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guangzhou', 'p': 'on harbour', 'o': '$y0'}}

 Q: What is the rank of food made from artichoke?
 SPARQL: SELECT ?answer WHERE { wd:Q23041430 wdt:P1582 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'artichoke', 'p': 'made from', 'o': '$y0'}}

 Q: How many {facet of} are for {gravity} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q11412 wdt:P1269 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'gravity', 'p': 'facet of', 'o': '?x0'}

 Q: What is {position held} of {Valéry Giscard d'Estaing} that is {end time} is {1981-5-21} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2124 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Giscard', 'p': 'position held', 'o': '?x0', 't': '1981'}

 Q: Who are the inhabitants of the sovereign state of Ulhasnagar?
 SPARQL: SELECT ?answer WHERE { wd:Q460222 wdt:P17 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ulhasnagar', 'p': 'sovereign state', 'o': '$y0'}}

 Q: Which is the Italian Chamber of Deputies dati ID of Silvio Berlusconi?
 SPARQL: select distinct ?answer where { wd:Q11860 wdt:P1341 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Silvio Berlusconi', 'p': 'Italian Chamber of Deputies dati ID', 'o': '?x0'}

 Q: Is it true that the compulsory education for the minimum age in Hungary equals to 3?
 SPARQL: ASK WHERE { wd:Q28 wdt:P3270 ?obj filter(?obj = 3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Hungary', 'p': 'compulsory education (minimum age)', 'o': '?x0', '?x0': '3'}

 Q: what is the {start time} for {Tokyo} has {twinned administrative body} as {Moscow} ?
 SPARQL: SELECT ?value WHERE { wd:Q1490 p:P190 ?s . ?s ps:P190 wd:Q649 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tokyo', 'p': 'twin city', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twin city', 'o': 'Moscow'}}}

 Q: what is the {end time} for {Pierre-Auguste Renoir} has {residence} as {Limoges} ?
 SPARQL: SELECT ?value WHERE { wd:Q39931 p:P551 ?s . ?s ps:P551 wd:Q45656 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pierre-Auguste Renoir', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Limoges'}}}

 Q: What is {work location} of {Artemisia Gentileschi} that is {start time} is {1610-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q212657 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1610')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Artemisia Gentileschi', 'p': 'work location', 'o': '?x0', 't': '1610'}

 Q: Which was the working place established by Eric Johnston?
 SPARQL: SELECT ?answer WHERE { wd:Q5386837 wdt:P108 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eric Johnston', 'p': 'working place', 'o': '$y0'}}

 Q: What is <source website for the property> of <E. M. Forster> ?
 SPARQL: select distinct ?answer where { wd:Q189119 wdt:P1896 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'E. M. Forster', 'p': 'source website for the property', 'o': '?x0'}

 Q: How many {filming location} are for {Lawrence of Arabia} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q228186 wdt:P915 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Lawrence of Arabia', 'p': 'filming location', 'o': '?x0'}

 Q: What is butane's upper flammable limit?
 SPARQL: select distinct ?answer where { wd:Q134192 wdt:P2203 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'butane', 'p': 'upper flammable limit', 'o': '?x0'}

 Q: What is {nominated for} of {It's a Wonderful Life} that is {nominee} is {John O. Aalberg} ?
 SPARQL: SELECT ?obj WHERE { wd:Q204191 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q1699086 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "It's a Wonderful Life", 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'John O. Aalberg'}}}

 Q: What is the human population of the twin town, Tucson?
 SPARQL: SELECT ?answer WHERE { wd:Q18575 wdt:P190 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tucson', 'p': 'twin town', 'o': '$y0'}}

 Q: What is the Revised Hepburn romanization for Jun Maeda, name in native language as 麻枝 准?
 SPARQL: SELECT ?value WHERE { wd:Q683407 p:P1559 ?s . ?s ps:P1559 ?x filter(contains(?x,'麻枝 准')) . ?s pq:P2125 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Revised Hepburn romanization', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jun Maeda', 'p': 'name in native language', 'o': '$y0'}}

 Q: What is <ARKive ID> of <Nelumbo nucifera> ?
 SPARQL: select distinct ?answer where { wd:Q16528 wdt:P2833 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nelumbo nucifera', 'p': 'ARKive ID', 'o': '?x0'}

 Q: is it true that the HD 113538 c of the M sin i equals 0.36?
 SPARQL: ASK WHERE { wd:Q1252981 wdt:P2051 ?obj filter(?obj = 0.36) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'HD 113538 c', 'p': 'M sin i', 'o': '?x0', '?x0': '0.36'}

 Q: What is the {bibliography} for {list of works} of {Charles Dickens}
 SPARQL:  select distinct ?obj where { wd:Q5686 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q1631107 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Charles Dickens', 'p': 'list of works', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'bibliography'}}

 Q: Which is the USB vendor ID for Toshiba?
 SPARQL: select distinct ?answer where { wd:Q49125 wdt:P1167 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Toshiba', 'p': 'USB vendor ID', 'o': '?x0'}

 Q: Who did Mahmoud Ahmadinejad marry on June 12, 2981?
 SPARQL: SELECT ?obj WHERE { wd:Q34448 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mahmoud Ahmadinejad', 'p': 'marry', 'o': '?x0', 't': '1981'}

 Q: When did educated at of Robert J. Shiller and academic degree?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert J. Shiller', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert J. Shiller', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is {stockholder} of {Figure}, that has {deathdate} is {1798-3-22} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5448002 wdt:P127 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1798'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Figure', 'p': 'stockholder', 'o': '?x0', 't': '1798'}

 Q: What is the {legislative body} and the {executive body} of {Assam} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1164 wdt:P194 ?ans_1 . wd:Q1164 wdt:P208 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Assam', 'p': 'legislative body', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Assam', 'p': 'executive body', 'o': '?x1'}]

 Q: What is the motto of Paris?
 SPARQL: SELECT ?obj WHERE { wd:Q90 p:P1451 ?s . ?s ps:P1451 ?obj . ?s pq:P2441 ?x filter(contains(?x,'Його хитає, але він не тоне')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paris', 'p': 'motto', 'o': '?x0'}

 Q: When was The Matrix awarded the National Film Registry?
 SPARQL: SELECT ?value WHERE { wd:Q83495 p:P166 ?s . ?s ps:P166 wd:Q823422 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'The Matrix', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'National Film Registry'}, 't': '?x0'}

 Q: What was Jacques Offenbach country of citizenship in 1860-1-14?
 SPARQL: SELECT ?obj WHERE { wd:Q41555 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1860')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jacques Offenbach', 'p': 'country of citizenship', 'o': '?x0', 't': '1860'}

 Q: What is {academic major} and {end time} of {{Charles Laughton} has {educated at} as {Royal Academy of Dramatic Art}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q55264 p:P69 ?s . ?s ps:P69 wd:Q523926 . ?s pq:P812 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Laughton', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Royal Academy of Dramatic Art'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'to', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Laughton', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Royal Academy of Dramatic Art'}}}]

 Q: Is Russia's total exports 333500000000?
 SPARQL: ASK WHERE { wd:Q159 wdt:P2135 ?obj filter(?obj = 333500000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Russia', 'p': 'total exports', 'o': '?x0', '?x0': '333500000000'}

 Q: How many streaks colors does the color red possess?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P534 wd:Q3142 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'streak', 'o': 'red'}

 Q: What is {literary works} of {starring} of {The Cider House Rules} ?
 SPARQL: SELECT ?answer WHERE { wd:Q648977 wdt:P161 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Cider House Rules', 'p': 'starring', 'o': '$y0'}}

 Q: When was Jean Renoir nominated for the BAFTA Award for Best Film?
 SPARQL: SELECT ?value WHERE { wd:Q50713 p:P1411 ?s . ?s ps:P1411 wd:Q139184 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jean Renoir', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'BAFTA Award for Best Film'}, 't': '?x0'}

 Q: In 1943, Alf Ramsey was member of which sports team?
 SPARQL: SELECT ?obj WHERE { wd:Q311029 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1943')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alf Ramsey', 'p': 'team', 'o': '?x0', 't': '1943'}

 Q: Is it true that the fiscal/tax revenue of Daguioman is less than 40873085.264?
 SPARQL: ASK WHERE { wd:Q28044 wdt:P3087 ?obj filter(?obj < 40873085.264) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Daguioman', 'p': 'fiscal/tax revenue', 'o': '?x0', '?x0': '40873085.264'}

 Q: What is {trend} of {studied under} of {Dardanus of Athens} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2661420 wdt:P1066 ?X . ?X wdt:P135 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'trend', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dardanus of Athens', 'p': 'studied under', 'o': '$y0'}}

 Q: What is the {Greek deity} for {appears in the form of} of {Artemis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4675 wd:Q39503 . ?sbj wdt:P31 wd:Q22989102 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'appears as', 'o': 'Artemis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Greek deity'}}

 Q: What is {actor} of {Downton Abbey}, that has {gender} is {male} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83071 wdt:P161 ?answer . ?answer wdt:P21 wd:Q6581097}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Downton Abbey', 'p': 'actor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'gender', 'o': 'male'}}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{John Charles} has {member of sports team} as {Hereford United F.C.}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 wd:Q18516 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Charles', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Hereford United F.C.'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'goals scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Charles', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Hereford United F.C.'}}}]

 Q: What did Chișinău include in it's administrative territorial region in 08-02-1940?
 SPARQL: SELECT ?obj WHERE { wd:Q21197 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1940')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chișinău', 'p': 'in', 'o': '?x0', 't': '1940'}

 Q: What award did Bobby Darin receive in the year 1960?
 SPARQL: SELECT ?obj WHERE { wd:Q311267 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1960')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bobby Darin', 'p': 'award', 'o': '?x0', 't': '1960'}

 Q: Who was the spouse of Gower Champion in 1973?
 SPARQL: SELECT ?obj WHERE { wd:Q3112833 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1973')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gower Champion', 'p': 'spouse', 'o': '?x0', 't': '1973'}

 Q: What is {nominated for} of {Rush} that is {point in time} is {2013-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q203871 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rush', 'p': 'nominated for', 'o': '?x0', 't': '2013'}

 Q: What is {first minister} of {partner town} of {Hama} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173545 wdt:P190 ?X . ?X wdt:P6 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first minister', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hama', 'p': 'partner town', 'o': '$y0'}}

 Q: which railway company in transport have least operating income?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q249556 . ?ent wdt:P3362 ?obj . ?ent wdt:P452 wd:Q3565868} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'operating income', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway company', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'industry', 'o': 'rail transport'}}}

