 Q: Is Grand Theft Auto V part of the Grand Theft Auto series?
 SPARQL: ASK WHERE { wd:Q17452 wdt:P179 wd:Q132730 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Grand Theft Auto V', 'p': 'series', 'o': '?x0', '?x0': 'Grand Theft Auto'}]

 Q: what is the {point in time} for {We'll Meet Again} has {performer} as {Jim Capaldi} ?
 SPARQL: SELECT ?value WHERE { wd:Q2624195 p:P175 ?s . ?s ps:P175 wd:Q1392515 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': "We'll Meet Again", 'p': 'performer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'performer', 'o': 'Jim Capaldi'}, 't': '?x0'}

 Q: Who is the nominee for Celeste Holm whose winner is Beatrice Straight?
 SPARQL: SELECT ?answer WHERE { wd:Q212957 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q232532}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Celeste Holm', 'p': 'nominee for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Beatrice Straight'}}

 Q: What is {sculptor} of {pressure volume diagram}, that has {method of murder} is {tuberculosis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q311318 wdt:P170 ?answer . ?answer wdt:P509 wd:Q12204}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pressure volume diagram', 'p': 'sculptor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'method of murder', 'o': 'tuberculosis'}}

 Q: What is the {taxon} with the {MAX(heart rate)} whose {described by source} is {Paulys Realenzyklopädie der klassischen Altertumswissenschaft}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3395 ?obj . ?ent wdt:P1343 wd:Q1138524 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'heart rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'described by source', 'o': 'Paulys Realenzyklopädie der klassischen Altertumswissenschaft'}}}

 Q: What is {region} of {interment} of {Pancho Vladigerov} ?
 SPARQL: SELECT ?answer WHERE { wd:Q528781 wdt:P119 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pancho Vladigerov', 'p': 'interment', 'o': '$y0'}}

 Q: Which is the door that was commissioned by Frederick William II of Prussia and starts with the letter b?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36794 . ?sbj wdt:P88 wd:Q152229 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'door', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'commissioned by', 'o': 'Frederick William II of Prussia'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: Was Lionel Richie or Peter Michael Escovedo Nicole Richie father?
 SPARQL: ASK WHERE { wd:Q232495 wdt:P22 wd:Q26695 . wd:Q232495 wdt:P22 wd:Q7175870 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Nicole Richie', 'p': 'father', 'o': '?x0', '?x0': 'Lionel Richie'}, {'h': 'IS', 'v': '?x1', 's': 'Nicole Richie', 'p': 'father', 'o': '?x1', '?x1': 'Peter Michael Escovedo'}]

 Q: How many subsidiary are European Union?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q458 wdt:P355 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'European Union', 'p': 'subsidiary', 'o': '?x0'}

 Q: Which is the disease that L-Tyrosine is used as a treatment drug?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2176 wd:Q188017 . ?sbj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'treatment', 'o': 'L-Tyrosine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: What is executive branch of basin countries of Tigris ?
 SPARQL: SELECT ?answer WHERE { wd:Q35591 wdt:P205 ?X . ?X wdt:P208 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'executive branch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tigris', 'p': 'basin countries', 'o': '$y0'}}

 Q: What is <Deutsche Ultramarathon-Vereinigung ID> of <Dean Karnazes> ?
 SPARQL: select distinct ?answer where { wd:Q331288 wdt:P2162 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dean Karnazes', 'p': 'Deutsche Ultramarathon-Vereinigung ID', 'o': '?x0'}

 Q: Who has kids by Gustav Holst, whose year of birth is 1907-4-12?
 SPARQL: SELECT ?answer WHERE { wd:Q200867 wdt:P40 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1907'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gustav Holst', 'p': 'kid', 'o': '?x0', 't': '1907'}

 Q: Which is the hydrological order number for Morava?
 SPARQL: select distinct ?answer where { wd:Q179251 wdt:P4279 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Morava', 'p': 'hydrological order number', 'o': '?x0'}

 Q: What is {Carnegie Classification of Institutions of Higher Education} of {school attended} of {Tsung-Dao Lee} ?
 SPARQL: SELECT ?answer WHERE { wd:Q183679 wdt:P69 ?X . ?X wdt:P2643 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Carnegie Classification of Institutions of Higher Education', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tsung-Dao Lee', 'p': 'school attended', 'o': '$y0'}}

 Q: What is the {song} for {lyrics by} of {Janet Jackson}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P676 wd:Q131324 . ?sbj wdt:P31 wd:Q7366 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'lyrics by', 'o': 'Janet Jackson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'song'}}

 Q: Which is the Filmfare Awards given to winner Anil Kapoor?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1346 wd:Q313956 . ?sbj wdt:P31 wd:Q37049 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Anil Kapoor', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Filmfare Awards'}}

 Q: What is the {linguistic typology} and the {UNESCO language status} of {Spanish_language} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P1999 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Spanish', 'p': 'linguistic typology', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Spanish', 'p': 'UNESCO language status', 'o': '?x1'}]

 Q: What is <regulates (molecular biology)> of <regulation of gene expression> ?
 SPARQL: select distinct ?answer where { wd:Q411391 wdt:P128 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'regulation of gene expression', 'p': 'regulates (molecular biology)', 'o': '?x0'}

 Q: What is the {branch of biology} for {studied by} of {bat}
 SPARQL:  select distinct ?obj where { wd:Q28425 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q28598684 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'bat', 'p': 'studied by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of biology'}}

 Q: Give me {analytic function} that starts with {'f'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215084 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'f')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'analytic function'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'f'}}

 Q: Who is the production designer of Alejandro Jodorowsky?
 SPARQL: select distinct ?answer where { ?answer wdt:P2554 wd:Q263730}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'production designer', 'o': 'Alejandro Jodorowsky'}

 Q: When did Debrecen stay in the county town?
 SPARQL: SELECT ?value WHERE { wd:Q79880 p:P31 ?s . ?s ps:P31 wd:Q1175512 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Debrecen', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'county town'}}}

 Q: Did {Stevie_Nicks} {field of work} {musical composition}?
 SPARQL: ASK WHERE { wd:Q234691 wdt:P101 wd:Q207628 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Stevie Nicks', 'p': 'field of work', 'o': '?x0', '?x0': 'musical composition'}]

 Q: What's treated by or treats the disease of ether?
 SPARQL: SELECT ?answer WHERE { wd:Q202218 wdt:P2175 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ether', 'p': 'treats', 'o': '$y0'}}

 Q: What is {located in time zone} of {Uppsala} that is {valid in period} is {daylight saving time} ?
 SPARQL: SELECT ?obj WHERE { wd:Q25286 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Uppsala', 'p': 'time', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'valid in period', 'o': 'daylight saving time'}}}

 Q: What follows the Mihira Bhoja series?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1279558 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mihira Bhoja', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mihira Bhoja', 'p': 'series', 'o': '$y0'}}]

 Q: what is the {for work} for {Jackie Chan} has {award received} as {Golden Horse Award for Best Leading Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q36970 p:P166 ?s . ?s ps:P166 wd:Q17500591 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jackie Chan', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Golden Horse Award for Best Leading Actor'}}}

 Q: Give me {mineral acid} that {conjugate base} {hydrogen sulfate ion} and which contains the word {acid} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408683 . ?sbj wdt:P4149 wd:Q3143743 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'acid')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral acid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'conjugate base', 'o': 'hydrogen sulfate ion'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'acid'}}

 Q: What is Liam Neeson's Box Office Mojo person ID?
 SPARQL: select distinct ?answer where { wd:Q58444 wdt:P2688 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Liam Neeson', 'p': 'Box Office Mojo person ID', 'o': '?x0'}

 Q: What is the {mascot} for {represents} of {Iron Maiden}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1268 wd:Q42482 . ?sbj wdt:P31 wd:Q18670161 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'represents', 'o': 'Iron Maiden', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mascot'}}

 Q: What is {genetic association} of {health issue} of {Alfred Deakin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q313805 wdt:P1050 ?X . ?X wdt:P2293 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'genetic association', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alfred Deakin', 'p': 'health issue', 'o': '$y0'}}

 Q: Is Hrithik Roshan ethnic group of Gujarati people
 SPARQL: ASK WHERE { wd:Q233619 wdt:P172 wd:Q1282294 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Hrithik Roshan', 'p': 'ethnic group', 'o': '?x0', '?x0': 'Gujarati people'}]

 Q: Explain me that mutant which contains the word of wraith in their own name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1094617 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wraith')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mutant'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wraith'}}

 Q: What is <State Catalogue of Geographical Names (Russia) ID> of <Khanka Lake> ?
 SPARQL: select distinct ?answer where { wd:Q201843 wdt:P1397 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Khanka Lake', 'p': 'State Catalogue of Geographical Names (Russia) ID', 'o': '?x0'}

 Q: What is the {fictional human} for {student} of {Luke Skywalker}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P802 wd:Q51746 . ?sbj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'student', 'o': 'Luke Skywalker', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional human'}}

 Q: what is the {end time} for {Peter Singer} has {educated at} as {University of Melbourne} ?
 SPARQL: SELECT ?value WHERE { wd:Q211539 p:P69 ?s . ?s ps:P69 wd:Q319078 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Peter Singer', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Melbourne'}}}

 Q: Is the explosive velocity of picric acid equal to 8820?
 SPARQL: ASK WHERE { wd:Q189298 wdt:P2231 ?obj filter(?obj = 8820.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'picric acid', 'p': 'explosive velocity', 'o': '?x0', '?x0': '8820.0'}

 Q: What is the {sovereign state} for {country of citizenship} of {Salman of Saudi Arabia}
 SPARQL:  select distinct ?obj where { wd:Q367825 wdt:P27 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Salman of Saudi Arabia', 'p': 'citizen of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: What is {location of burial} of {Perry Como}, that has {westerly point} is {30.865308333333 -87.634630555556} ?
 SPARQL: SELECT ?answer WHERE { wd:Q333405 wdt:P119 ?answer . ?answer wdt:P1335 ?x FILTER(contains(?x,'30.865308333333 -87.634630555556'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Perry Como', 'p': 'location of burial', 'o': '?x0'}

 Q: Which is the musical by the librettist Alan Jay Lerner that starts with the letter p?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj wdt:P87 wd:Q961893 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'musical', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'librettist', 'o': 'Alan Jay Lerner'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is {higher taxon} of {magnoliids}, that has {disputed equivalence} is {Magnoliidae} ?
 SPARQL: SELECT ?answer WHERE { wd:Q846071 wdt:P171 ?answer . ?answer wdt:P460 wd:Q13582382}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'magnoliids', 'p': 'higher taxon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'disputed equivalence', 'o': 'Magnoliidae'}}

 Q: Is the autoignition temperature of the butan-1-ol less than 276?
 SPARQL: ASK WHERE { wd:Q16391 wdt:P2199 ?obj filter(?obj < 276.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'butan-1-ol', 'p': 'autoignition temperature', 'o': '?x0', '?x0': '276.0'}

 Q: What is the {film series} for {series} of {Star Wars Episode V: The Empire Strikes Back}
 SPARQL:  select distinct ?obj where { wd:Q181795 wdt:P179 ?obj . ?obj wdt:P31 wd:Q24856 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film series'}}

 Q: What is the {constitutional republic} for {country of citizenship} of {Jefferson Davis}
 SPARQL:  select distinct ?obj where { wd:Q162269 wdt:P27 ?obj . ?obj wdt:P31 wd:Q1520223 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jefferson Davis', 'p': 'country of citizenship', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constitutional republic'}}

 Q: What is <Baseball-Reference.com major league player ID> of <Lou Gehrig> ?
 SPARQL: select distinct ?answer where { wd:Q357444 wdt:P1825 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lou Gehrig', 'p': 'Baseball-Reference.com major league player ID', 'o': '?x0'}

 Q: Tell me mathematical notation whose name has the word schläfli in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'schläfli')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mathematical notation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'schläfli'}}

 Q: Which year the Mozambique has 2.12586e+06 number of out of school children?
 SPARQL: SELECT ?value WHERE { wd:Q1029 p:P2573 ?s . ?s ps:P2573 ?x filter(contains(?x,'2.12586e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Mozambique', 'p': 'number of out of school children', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of out of school children', 'o': '2.12586e+06'}, 't': '?x0'}

 Q: what is the {number of points/goals/set scored} for {Valeriy Lobanovskyi} has {member of sports team} as {FC Chornomorets Odesa} ?
 SPARQL: SELECT ?value WHERE { wd:Q324484 p:P54 ?s . ?s ps:P54 wd:Q44296 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Valeriy Lobanovskyi', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'FC Chornomorets Odesa'}}}

 Q: What is {wikibase:geoLatitude ?min} of {location of discovered object} of {neodymium} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1388 wdt:P189 ?X . ?X wdt:P1333 ?answer}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'neodymium', 'p': 'location of discovered object', 'o': '$y0'}

 Q: What was St. George's religion and gender?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q48438 wdt:P140 ?ans_1 . wd:Q48438 wdt:P21 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'St. George', 'p': 'religion', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'St. George', 'p': 'gender', 'o': '?x1'}]

 Q: How many filming location were there for Saving Private Ryan?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q165817 wdt:P915 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Saving Private Ryan', 'p': 'filming location', 'o': '?x0'}

 Q: Is the electrical conductivity of the Galinstan equal to 3460000?
 SPARQL: ASK WHERE { wd:Q675176 wdt:P2055 ?obj filter(?obj = 3460000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Galinstan', 'p': 'electrical conductivity', 'o': '?x0', '?x0': '3460000'}

 Q: What are the Harmonized System Codes for pocket watch?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q849813 wdt:P5471 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'pocket watch', 'p': 'Harmonized System Code', 'o': '?x0'}

 Q: What is the name of the language that uses the Vatteluttu alphabet script and is used by the newspaper Dina Thanthi?
 SPARQL: SELECT ?answer WHERE { wd:Q3522186 wdt:P407 ?answer . ?answer wdt:P282 wd:Q1992000}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dina Thanthi', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'alphabet', 'o': 'Vatteluttu alphabet'}}

 Q: IS THE SPEED LIMIT OF THE CIRCUM BAIKAL RAILWAY IS GREATER THAN 16.0
 SPARQL: ASK WHERE { wd:Q163706 wdt:P3086 ?obj filter(?obj > 16.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Circum-Baikal Railway', 'p': 'speed limit', 'o': '?x0', '?x0': '16.0'}

 Q: Which award was received by Bob Pettit on 0-0-1956?
 SPARQL: SELECT ?obj WHERE { wd:Q368561 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1956')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bob Pettit', 'p': 'award', 'o': '?x0', 't': '1956'}

 Q: How many {place served by transport hub} are to/by {Rome} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P931 wd:Q220 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'place served by transport hub', 'o': 'Rome'}

 Q: what is the {main subject} for {Christopher Hitchens} has {notable work} as {No One Left to Lie To: The Triangulations of William Jefferson Clinton} ?
 SPARQL: SELECT ?value WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q7044696 . ?s pq:P921 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'No One Left to Lie To'}}}

 Q: Tell me archaeological period whose name has the word stage in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15401633 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'stage')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archaeological period'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'stage'}}

 Q: What is {death location} of {Joseph Pinetti}, that has {member of} is {Central Asian Cooperation Organization} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3108128 wdt:P20 ?answer . ?answer wdt:P463 wd:Q2297670}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Pinetti', 'p': 'death location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'Central Asian Cooperation Organization'}}

 Q: What are the branch of psychology which start with the letter psychophysiology
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60680430 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'psychophysiology')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'branch of psychology'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'psychophysiology'}}

 Q: How many Mimas located on astronomical body?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P376 wd:Q15034 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'located on astronomical body', 'o': 'Mimas'}

 Q: What is <Wolfram Language entity code> of <Bachelor of Arts> ?
 SPARQL: select distinct ?answer where { wd:Q1765120 wdt:P4839 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bachelor of Arts', 'p': 'Wolfram Language entity code', 'o': '?x0'}

 Q: What is the {dominion of the British Empire} with the {MAX(retirement age)} whose {described by source} is {Jewish Encyclopedia of Brockhaus and Efron}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q223832 . ?ent wdt:P3001 ?obj . ?ent wdt:P1343 wd:Q4173137 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'retirement age', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dominion of the British Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'described by source', 'o': 'Jewish Encyclopedia of Brockhaus and Efron'}}}

 Q: Which is the Les Archives du Spectacle Person ID of Harold Lloyd?
 SPARQL: select distinct ?answer where { wd:Q104340 wdt:P1977 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Harold Lloyd', 'p': 'Les Archives du Spectacle Person ID', 'o': '?x0'}

 Q: What is the {position} for {office held by head of state} of {Kingdom of Mercia}
 SPARQL:  select distinct ?obj where { wd:Q105092 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kingdom of Mercia', 'p': 'office held by head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is a cinematic technique that starts with the letter t.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1001378 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cinematic technique'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What was the population of Egypt in 1975?
 SPARQL: SELECT ?obj WHERE { wd:Q79 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1975')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Egypt', 'p': 'population', 'o': '?x0', 't': '1975'}

 Q: What is <Canadian Encyclopedia article ID> of <iceberg> ?
 SPARQL: select distinct ?answer where { wd:Q47568 wdt:P5395 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'iceberg', 'p': 'Canadian Encyclopedia article ID', 'o': '?x0'}

 Q: Where is the place of burial and the birthplace of James Arness?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q470190 wdt:P119 ?ans_1 . wd:Q470190 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'James Arness', 'p': 'place of burial', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'James Arness', 'p': 'birthplace', 'o': '?x1'}]

 Q: Which is the coordinate location for Saskatchewan?
 SPARQL: select distinct ?answer where { wd:Q1989 wdt:P625 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Saskatchewan', 'p': 'coordinate location', 'o': '?x0'}

 Q: Which is {end time} and {start time} of {{Belfast} has {country} as {United Kingdom of Great Britain and Ireland}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 wd:Q174193 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belfast', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'United Kingdom of Great Britain and Ireland'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'start time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belfast', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'United Kingdom of Great Britain and Ireland'}}}]

 Q: Did {Kajol} {award received} {Filmfare Award for Best Film} and {Filmfare Award for Best Performance in a Negative Role} ?
 SPARQL: ASK WHERE { wd:Q147395 wdt:P166 wd:Q1414525 . wd:Q147395 wdt:P166 wd:Q389636 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Kajol', 'p': 'award received', 'o': '?x0', '?x0': 'Filmfare Award for Best Film'}, {'h': 'IS', 'v': '?x1', 's': 'Kajol', 'p': 'award received', 'o': '?x1', '?x1': 'Filmfare Award for Best Performance in a Negative Role'}]

 Q: What is {total fertility rate} of {main topic} of {history of Chile} ?
 SPARQL: SELECT ?answer WHERE { wd:Q472967 wdt:P1269 ?X . ?X wdt:P4841 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'total fertility rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'history of Chile', 'p': 'main topic', 'o': '$y0'}}

 Q: What is {nominated for} of {Ruth Gordon} that is {statement is subject of} is {20th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q232562 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q303473 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ruth Gordon', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '20th Academy Awards'}}}

 Q: Who was the spouse of Roger Vadim on 1990-12-21?
 SPARQL: SELECT ?obj WHERE { wd:Q383420 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Roger Vadim', 'p': 'spouse', 'o': '?x0', 't': '1990'}

 Q: What does Jules Rimet play whose executive authority is FIFA?
 SPARQL: SELECT ?answer WHERE { wd:Q199642 wdt:P641 ?answer . ?answer wdt:P797 wd:Q253414}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jules Rimet', 'p': 'play', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'authority', 'o': 'FIFA'}}

 Q: What is {from time} of {prequel of} of {baroque music} ?
 SPARQL: SELECT ?answer WHERE { wd:Q8361 wdt:P156 ?X . ?X wdt:P580 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'baroque music', 'p': 'prequel of', 'o': '$y0'}}

 Q: What is the seat of team member Shohei Yamamoto?
 SPARQL: SELECT ?answer WHERE { wd:Q3299867 wdt:P54 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'seat', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shohei Yamamoto', 'p': 'team', 'o': '$y0'}}

 Q: Is the event distance of the 20 kilometres race walk greater than 16.0?
 SPARQL: ASK WHERE { wd:Q210673 wdt:P3157 ?obj filter(?obj > 16.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': '20 kilometres race walk', 'p': 'event distance', 'o': '?x0', '?x0': '16.0'}

 Q: What currency was used and where was the capital of the Roman Republic?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q17167 wdt:P38 ?ans_1 . wd:Q17167 wdt:P36 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Roman Republic', 'p': 'currency', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Roman Republic', 'p': 'capital', 'o': '?x1'}]

 Q: When was Johan Huizinga nominated for the Nobel Prize in Literature?
 SPARQL: SELECT ?value WHERE { wd:Q276280 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Johan Huizinga', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Literature'}, 't': '?x0'}

 Q: what is the {end time} for {Boeing} has {chief executive officer} as {William McPherson Allen} ?
 SPARQL: SELECT ?value WHERE { wd:Q66 p:P169 ?s . ?s ps:P169 wd:Q1493920 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Boeing', 'p': 'CEO', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'CEO', 'o': 'William McPherson Allen'}}}

 Q: Which  colours of team played for  Cédric Moukouri ?
 SPARQL: SELECT ?answer WHERE { wd:Q3009942 wdt:P54 ?X . ?X wdt:P462 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'colour', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cédric Moukouri', 'p': 'team', 'o': '$y0'}}

 Q: Which ketone has the highest minimal lethal dose?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q170744 . ?ent wdt:P2300 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'minimal lethal dose', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ketone'}}

 Q: How many {measures} are to/by {intelligence} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2575 wd:Q83500 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'measures', 'o': 'intelligence'}

 Q: what is the {end time} for {Erwin Rommel} has {military branch} as {Württembergische Sicherheitstruppen} ?
 SPARQL: SELECT ?value WHERE { wd:Q14060 p:P241 ?s . ?s ps:P241 wd:Q2596869 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Erwin Rommel', 'p': 'military branch', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'military branch', 'o': 'Württembergische Sicherheitstruppen'}}}

