 Q: What is the genus with the highest chromosome count in the taxon rank?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P105 wd:Q34740 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'chromosome count', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon rank', 'o': 'genus'}}}

 Q: What is EDIT16 catalogue author ID for Leo X ?
 SPARQL: select distinct ?answer where { wd:Q49237 wdt:P5492 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leo X', 'p': 'EDIT16 catalogue author ID', 'o': '?x0'}

 Q: What is the {human} for {collection} of {Venice}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P195 wd:Q641 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'collection', 'o': 'Venice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mankind'}}

 Q: What award was Maria Montessori nominated for on January 1, 1950?
 SPARQL: SELECT ?obj WHERE { wd:Q131117 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1950')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maria Montessori', 'p': 'nominated for', 'o': '?x0', 't': '1950'}

 Q: Does the height of the BMW i8 equal 1?
 SPARQL: ASK WHERE { wd:Q796799 wdt:P2048 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'BMW i8', 'p': 'height', 'o': '?x0', '?x0': '1'}

 Q: What is {position held} of {Martin Van Buren} that is {replaced by} is {Edward Livingston} ?
 SPARQL: SELECT ?obj WHERE { wd:Q11820 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q544396 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Martin Van Buren', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Edward Livingston'}}}

 Q: What family of vehicles starts with the letter "v"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22999537 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'family of vehicles'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is the {protein} for {physically interacts with} of {oxytocin}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P129 wd:Q169960 . ?sbj wdt:P31 wd:Q8054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'physically interacts with', 'o': 'oxytocin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protein'}}

 Q: Which is the LTI Korea Library ID for Choe Chiwon?
 SPARQL: select distinct ?answer where { wd:Q487042 wdt:P4760 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Choe Chiwon', 'p': 'LTI Korea Library ID', 'o': '?x0'}

 Q: What are the ancient civilization which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient civilization'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What's the name of a novel series that starts with the letter "t"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'novel series'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {award received} of {György Ligeti} that is {point in time} is {2000-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q154331 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'György Ligeti', 'p': 'award', 'o': '?x0', 't': '2000'}

 Q: What are the municipality of the Netherlands  which start with the letter s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of the Netherlands'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: What is {place of residence} of {Pierre Curie}, that has {timezone} is {UTC−02:00} ?
 SPARQL: SELECT ?answer WHERE { wd:Q37463 wdt:P551 ?answer . ?answer wdt:P421 wd:Q6536}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Pierre Curie', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'timezone', 'o': 'UTC-02:00'}}

 Q: What is {safety classification and labelling} of {magnesium sulfate anhydrous} that is {NFPA Fire} is {0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q288266 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P994 ?x filter(contains(?x,'0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'safety classification and labelling', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'magnesium sulfate', 'p': 'safety classification and labelling', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'NFPA Fire', 'o': '0'}}}

 Q: Who was the head of government in Palestine on June 2, 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q219060 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Palestine', 'p': 'head of government', 'o': '?x0', 't': '2014'}

 Q: What non-metropolitan county shares a border with Hampshire?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q769603 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Hampshire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'non-metropolitan county'}}

 Q: Is the position angle of northwest by north equal to 391.5?
 SPARQL: ASK WHERE { wd:Q20968407 wdt:P2211 ?obj filter(?obj = 391.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'northwest by north', 'p': 'position angle', 'o': '?x0', '?x0': '391.5'}

 Q: Which are the first aid measures of petroleum jelly?
 SPARQL: select distinct ?answer where { ?answer wdt:P2239 wd:Q457239}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'first aid measures', 'o': 'petroleum jelly'}

 Q: Which is Xeno-canto species ID for Meleagris gallopavo?
 SPARQL: select distinct ?answer where { wd:Q26844 wdt:P2426 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Meleagris gallopavo', 'p': 'Xeno-canto species ID', 'o': '?x0'}

 Q: What is the secular state of the MIN(PPP GDP per capita) whose diplomatic relation is with India?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q859563 . ?ent wdt:P2299 ?obj . ?ent wdt:P530 wd:Q668} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'PPP GDP per capita', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'secular state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'India'}}}

 Q: what is the {located in the administrative territorial entity} for {Edward Hopper} has {place of death} as {New York City} ?
 SPARQL: SELECT ?value WHERE { wd:Q203401 p:P20 ?s . ?s ps:P20 wd:Q60 . ?s pq:P131 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edward Hopper', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'New York City'}}}

 Q: What is {nominated for} of {Gone with the Wind} that is {nominee} is {Ray Rennahan} ?
 SPARQL: SELECT ?obj WHERE { wd:Q2875 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q367614 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gone with the Wind', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominee', 'o': 'Ray Rennahan'}}}

 Q: How many {maintained by} are to/by {Ōita Prefecture} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P126 wd:Q133924 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'maintained by', 'o': 'Ōita Prefecture'}

 Q: What is the {former administrative territorial entity} for {located on terrain feature} of {classical antiquity}
 SPARQL:  select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q19953632 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'classical antiquity', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'former administrative territorial entity'}}

 Q: How many file formats are done on Portable Document Format?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2701 wd:Q42332 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'file format', 'o': 'Portable Document Format'}

 Q: How many {carries} are to/by {road} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2505 wd:Q34442 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'carries', 'o': 'road'}

 Q: What city became a twin city of Klagenfurt in 1990?
 SPARQL: SELECT ?obj WHERE { wd:Q41753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Klagenfurt', 'p': 'twin city', 'o': '?x0', 't': '1990'}

 Q: what is the {start time} for {Julie Andrews} has {spouse} as {Tony Walton} ?
 SPARQL: SELECT ?value WHERE { wd:Q161819 p:P26 ?s . ?s ps:P26 wd:Q2803671 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Julie Andrews', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Tony Walton'}}}

 Q: What was the population of Lucknow in 2011?
 SPARQL: SELECT ?obj WHERE { wd:Q47916 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lucknow', 'p': 'population', 'o': '?x0', 't': '2011'}

 Q: Who is the person for the military branch of KGB?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P241 wd:Q80919 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'military branch', 'o': 'KGB', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: Is the watershed area of the rio de Santa Maria Zobenigo greater than 0.00083176?
 SPARQL: ASK WHERE { wd:Q3432782 wdt:P2053 ?obj filter(?obj > 0.00083176) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'rio de Santa Maria Zobenigo', 'p': 'watershed area', 'o': '?x0', '?x0': '0.00083176'}

 Q: What is {mother} and {date of death} of {{Pedro I} has {child} as {Princess Januária of Brazil}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q261802 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Januária of Brazil'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pedro I', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Princess Januária of Brazil'}}}]

 Q: What is {contains administrative territorial entity} of {Liguria} that is {start time} is {2015-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1256 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Liguria', 'p': 'contains administrative territorial entity', 'o': '?x0', 't': '2015'}

 Q: What is <category for recipients of this award> of <honor> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2517 wd:Q207333}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'category for recipients of this award', 'o': 'honor'}

 Q: what is the {start time} for {Okinawa Prefecture} has {twinned administrative body} as {Santa Cruz Department} ?
 SPARQL: SELECT ?value WHERE { wd:Q766445 p:P190 ?s . ?s ps:P190 wd:Q235106 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Okinawa Prefecture', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Santa Cruz Department'}}}

 Q: What division does Jurandir Fatori's team play for?
 SPARQL: SELECT ?answer WHERE { wd:Q21020118 wdt:P54 ?X . ?X wdt:P118 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'division', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jurandir Fatori', 'p': 'team', 'o': '$y0'}}

 Q: What is the {sex or gender} and the {country of citizenship} of {Freddy_Krueger} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q329466 wdt:P21 ?ans_1 . wd:Q329466 wdt:P27 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Freddy Krueger', 'p': 'man', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Freddy Krueger', 'p': 'country of citizenship', 'o': '?x1'}]

 Q: What award did Claude Brasseur receive in 1977-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q106544 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Claude Brasseur', 'p': 'award', 'o': '?x0', 't': '1977'}

 Q: Which is the decay mode for alpha decay?
 SPARQL: select distinct ?answer where { ?answer wdt:P817 wd:Q179856}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'decay mode', 'o': 'alpha decay'}

 Q: What is {earliest date} and {together with} of {{Alexander Pushkin} has {residence} as {Ulyanovsk}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q7200 p:P551 ?s . ?s ps:P551 wd:Q5627 . ?s pq:P1319 ?value1 . ?s pq:P1706 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'earliest date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Pushkin', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Ulyanovsk'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'together with', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Pushkin', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Ulyanovsk'}}}]

 Q: What is {contains} of {comes from} of {The Star-Spangled Banner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44696 wdt:P495 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'contains', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Star-Spangled Banner', 'p': 'comes from', 'o': '$y0'}}

 Q: When is the location born in Jamshid Mashayekhi which is a partner town of Havana?
 SPARQL: SELECT ?answer WHERE { wd:Q3026288 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1563}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jamshid Mashayekhi', 'p': 'born in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Havana'}}

 Q: Is the dynamic viscosity of the acetic acid greater than 0.6288?
 SPARQL: ASK WHERE { wd:Q47512 wdt:P3070 ?obj filter(?obj > 0.6288) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'acetic acid', 'p': 'dynamic viscosity', 'o': '?x0', '?x0': '0.6288'}

 Q: What is {voice dubber} of {from work} of {Rukh} ?
 SPARQL: SELECT ?answer WHERE { wd:Q30060903 wdt:P1441 ?X . ?X wdt:P725 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'voice dubber', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rukh', 'p': 'from work', 'o': '$y0'}}

 Q: What is {educated at} of {Christopher Wren} that is {academic major} is {Latin} ?
 SPARQL: SELECT ?obj WHERE { wd:Q170373 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q397 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Wren', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'major', 'o': 'Latin'}}}

 Q: How many {exemplar of} are to/by {Gospel of John} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1574 wd:Q36766 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'exemplar of', 'o': 'Gospel of John'}

 Q: What is {language used} of {Gibraltar} that is {has quality} is {second language} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1410 p:P2936 ?s . ?s ps:P2936 ?obj . ?s pq:P1552 wd:Q125421 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gibraltar', 'p': 'language used', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'quality', 'o': 'second language'}}}

 Q: Who is the human partner of Chow Yun-fat?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P451 wd:Q181425 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'partner', 'o': 'Chow Yun-fat', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {human} for {stepparent} of {Johnny Cash}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3448 wd:Q42775 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stepparent', 'o': 'Johnny Cash', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {present in work} of {Deadpool} that is {subject has role} is {title character} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1631090 p:P1441 ?s . ?s ps:P1441 ?obj . ?s pq:P2868 wd:Q3246821 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'present in work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Deadpool', 'p': 'present in work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'role', 'o': 'title character'}}}

 Q: What is in the administrative region of Fukuoka Prefecture, whose total fertility rate is 1.39?
 SPARQL: SELECT ?answer WHERE { wd:Q123258 wdt:P131 ?answer . ?answer wdt:P4841 ?x FILTER(contains(?x,'1.39'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fukuoka Prefecture', 'p': 'is in the administrative region of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'total fertility rate', 'o': '1.39'}}

 Q: What is field of exercise for affiliated with Terje Langli ?
 SPARQL: SELECT ?answer WHERE { wd:Q954719 wdt:P1416 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of exercise', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Terje Langli', 'p': 'affiliated with', 'o': '$y0'}}

 Q: what is the {determination method} for {migraine} has {genetic association} as {PRDM16} ?
 SPARQL: SELECT ?value WHERE { wd:Q133823 p:P2293 ?s . ?s ps:P2293 wd:Q18045527 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'migraine', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'PRDM16'}}}

 Q: what is the {start time} for {Riga} has {country} as {Latvia} ?
 SPARQL: SELECT ?value WHERE { wd:Q1773 p:P17 ?s . ?s ps:P17 wd:Q211 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Riga', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Latvia'}}}

 Q: Is the operating temperature of the Nesjavellir power station 190?
 SPARQL: ASK WHERE { wd:Q693330 wdt:P5066 ?obj filter(?obj = 190) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Nesjavellir Power Station', 'p': 'operating temperature', 'o': '?x0', '?x0': '190'}

 Q: How much was the population of Normandy in 2005?
 SPARQL: SELECT ?obj WHERE { wd:Q18677875 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Normandy', 'p': 'population', 'o': '?x0', 't': '2005'}

 Q: What is the {theatrical character} for {characters} of {Hamlet}
 SPARQL:  select distinct ?obj where { wd:Q41567 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3375722 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hamlet', 'p': 'characters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theatrical character'}}

 Q: What is the {ceremonial county of England} for {enclave within} of {Leicester}
 SPARQL:  select distinct ?obj where { wd:Q83065 wdt:P501 ?obj . ?obj wdt:P31 wd:Q180673 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Leicester', 'p': 'enclave within', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ceremonial county of England'}}

 Q: Tell me the brain region that contains the word thalamus in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thalamus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'brain region'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'thalamus'}}

 Q: Is the kinematic viscosity of propylene glycol equal to 0.054?
 SPARQL: ASK WHERE { wd:Q161495 wdt:P2118 ?obj filter(?obj = 0.054) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'propylene glycol', 'p': 'kinematic viscosity', 'o': '?x0', '?x0': '0.054'}

 Q: What was Leonardo Bonacci's date of death in the year 1240?
 SPARQL: SELECT ?obj WHERE { wd:Q8763 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1240')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Leonardo Bonacci', 'p': 'date of death', 'o': '?x0', 't': '1240'}

 Q: Which is the parity of Higgs boson?
 SPARQL: select distinct ?answer where { wd:Q402 wdt:P1123 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Higgs boson', 'p': 'parity', 'o': '?x0'}

 Q: what is the {for work} for {Ryan O'Neal} has {nominated for} as {Golden Globe Award for Best Actor – Motion Picture Drama} ?
 SPARQL: SELECT ?value WHERE { wd:Q272923 p:P1411 ?s . ?s ps:P1411 wd:Q593098 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Ryan O'Neal", 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Golden Globe Award for Best Actor – Motion Picture Drama'}}}

 Q: Who was the manager/director of the Metropolitan Museum of Art starting in 1910?
 SPARQL: SELECT ?obj WHERE { wd:Q160236 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1910')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Metropolitan Museum of Art', 'p': 'manager', 'o': '?x0', 't': '1910'}

 Q: what is the using of the remake of smoothsort?
 SPARQL: SELECT ?answer WHERE { wd:Q1714823 wdt:P144 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'using', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'smoothsort', 'p': 'remake of', 'o': '$y0'}}

 Q: What is the {theorem} for {proved by} of {Grigori Perelman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1318 wd:Q117346 . ?sbj wdt:P31 wd:Q65943 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'proved by', 'o': 'Grigori Perelman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'theorem'}}

 Q: What is {career} of {characters} of {Buffy the Vampire Slayer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q183513 wdt:P674 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'career', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Buffy the Vampire Slayer', 'p': 'characters', 'o': '$y0'}}

 Q: What country was started in the year 1871 in Wiesbaden?
 SPARQL: SELECT ?obj WHERE { wd:Q1721 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1871')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wiesbaden', 'p': 'country', 'o': '?x0', 't': '1871'}

 Q: what is the {start time} for {Nantes} has {head of government} as {Johanna Rolland} ?
 SPARQL: SELECT ?value WHERE { wd:Q12191 p:P6 ?s . ?s ps:P6 wd:Q16037012 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nantes', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Johanna Rolland'}}}

 Q: How many {occupation} are to/by {Shah} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P106 wd:Q184299 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'occupation', 'o': 'Shah'}

 Q: When was the population of Dalian 4480000?
 SPARQL: SELECT ?value WHERE { wd:Q74881 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4480000')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dalian', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '4480000'}, 't': '?x0'}

 Q: What is the {human} for {head of state} of {Austrian Empire}
 SPARQL:  select distinct ?obj where { wd:Q131964 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Austrian Empire', 'p': 'head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is Cyworld ID for Park Geun-hye ?
 SPARQL: select distinct ?answer where { wd:Q138048 wdt:P4226 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Park Geun-hye', 'p': 'Cyworld ID', 'o': '?x0'}

 Q: Which is the OS grid reference for Bradford?
 SPARQL: select distinct ?answer where { wd:Q22905 wdt:P613 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bradford', 'p': 'OS grid reference', 'o': '?x0'}

 Q: How many {activating neurotransmitter} are to/by {γ-aminobutyric acid} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P928 wd:Q210021 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'activating neurotransmitter', 'o': 'γ-aminobutyric acid'}

 Q: What is the stainless steel with the highest operating temperature whose has part is nitrogen?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q172587 . ?ent wdt:P5066 ?obj . ?ent wdt:P527 wd:Q627 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'operating temperature', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stainless steel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has part', 'o': 'nitrogen'}}}

 Q: Who was married to Lynn Margulis in June of 1957?
 SPARQL: SELECT ?obj WHERE { wd:Q234583 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lynn Margulis', 'p': 'married to', 'o': '?x0', 't': '1957'}

 Q: Which is the ISBN-13 for Watership Down?
 SPARQL: select distinct ?answer where { wd:Q936801 wdt:P212 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Watership Down', 'p': 'ISBN-13', 'o': '?x0'}

 Q: Name the subtopic of the tagline "Free, Sovereign, and Independent", a history of Honduras.
 SPARQL: SELECT ?answer WHERE { wd:Q687152 wdt:P1269 ?answer . ?answer wdt:P1451 ?x FILTER(contains(?x,'Free, Sovereign and Independent'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'history of Honduras', 'p': 'topic of', 'o': '?x0'}

 Q: David Letterman is producer?
 SPARQL: select distinct ?answer where { ?answer wdt:P162 wd:Q217298}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'producer', 'o': 'David Letterman'}

 Q: What is the {human} with the {MAX(number of victims of killer)} whose {native language} is {French}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1345 ?obj . ?ent wdt:P103 wd:Q150 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of victims of killer', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'native language', 'o': 'French'}}}

 Q: What is the {Athletics} for {owner of} of {Stanford University}
 SPARQL:  select distinct ?obj where { wd:Q41506 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q3628059 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stanford University', 'p': 'owner of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Athletics'}}

 Q: Does the SAF 2507 have a pitting resistance equivalent number that is greater than  45.24?
 SPARQL: ASK WHERE { wd:Q7388540 wdt:P5624 ?obj filter(?obj > 45.24) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'SAF 2507', 'p': 'pitting resistance equivalent number', 'o': '?x0', '?x0': '45.24'}

 Q: How many {designed by} are for {Doom} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q189784 wdt:P287 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Doom', 'p': 'designed by', 'o': '?x0'}

 Q: What is {subtopic of} of {geological history of Earth}, that has {has moon} is {Moon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2389585 wdt:P1269 ?answer . ?answer wdt:P398 wd:Q405}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'geological history of Earth', 'p': 'topic of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has moon', 'o': 'Moon'}}

 Q: What is {owner} of {The Kiss}, that has {member of} is {G20} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2418237 wdt:P127 ?answer . ?answer wdt:P463 wd:Q19771}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Kiss', 'p': 'owner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'G20'}}

 Q: What is {position held} of {Félix Faure} that is {replaced by} is {Émile Loubet} ?
 SPARQL: SELECT ?obj WHERE { wd:Q296076 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q169502 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Félix Faure', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Émile Loubet'}}}

 Q: Who is the son of master Lou Harrison?
 SPARQL: SELECT ?answer WHERE { wd:Q590911 wdt:P1066 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lou Harrison', 'p': 'master', 'o': '$y0'}}

 Q: What sports team did Kapil Dev stopped being a member of in 1992?
 SPARQL: SELECT ?obj WHERE { wd:Q558189 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kapil Dev', 'p': 'team', 'o': '?x0', 't': '1992'}

 Q: Who is born at Charlotte Dujardin, which has a zip code of E?
 SPARQL: SELECT ?answer WHERE { wd:Q272533 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'E'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Charlotte Dujardin', 'p': 'born at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'zip code', 'o': 'e'}}

 Q: How many {participating teams} are to/by {Juventus F.C.} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1923 wd:Q1422 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'participating team', 'o': 'Juventus F.C.'}

 Q: Who first described the element osmium and was born in Selby?
 SPARQL: SELECT ?answer WHERE { wd:Q751 wdt:P61 ?answer . ?answer wdt:P19 wd:Q527846}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'osmium', 'p': 'first described', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Selby'}}

