 Q: what is the {together with} for {Shimon Peres} has {award received} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q57410 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P1706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shimon Peres', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Nobel Peace Prize'}}}

 Q: What is the date of death and birth date of Charlemagne? Is her child as Charles the Younger?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'birth date', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}]

 Q: What is the {natural satellite} for {parent astronomical body} of {Neptune}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P397 wd:Q332 . ?sbj wdt:P31 wd:Q2537 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Neptune', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'moon'}}

 Q: What is {has influence} of {created by} of {Eldarion} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1632303 wdt:P170 ?X . ?X wdt:P737 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has influence', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eldarion', 'p': 'created by', 'o': '$y0'}}

 Q: What is {learning what?} of {sociology}, that has {is said to be the same as} is {sex} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21201 wdt:P2578 ?answer . ?answer wdt:P460 wd:Q290}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'sociology', 'p': 'learning what?', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be the same as', 'o': 'sex'}}

 Q: Is the prisoner count of the Ebensee concentration camp equal to 27000?
 SPARQL: ASK WHERE { wd:Q699561 wdt:P5630 ?obj filter(?obj = 27000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ebensee concentration camp', 'p': 'prisoner count', 'o': '?x0', '?x0': '27000'}

 Q: What is <IPNI author ID> of <Jean-Jacques Rousseau> ?
 SPARQL: select distinct ?answer where { wd:Q6527 wdt:P586 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jean-Jacques Rousseau', 'p': 'IPNI author ID', 'o': '?x0'}

 Q: Tell me government agency whose name has the word yuan in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327333 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yuan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'government agency'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yuan'}}

 Q: A series of 1 would be followed by what?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q199 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '1', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': '1', 'p': 'series', 'o': '$y0'}}]

 Q: What are the private university which start with the letter university
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'university')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'private university'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'university'}}

 Q: What is {editor} of {Francisco Jiménez de Cisneros} that is {place of publication} is {Alcalá de Henares} ?
 SPARQL: SELECT ?obj WHERE { wd:Q342392 p:P98 ?s . ?s ps:P98 ?obj . ?s pq:P291 wd:Q46940 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'editor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francisco Jimenez de Cisneros', 'p': 'editor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of publication', 'o': 'Alcala de Henares'}}}

 Q: Irving Berling was the founder of which nonprofit organization?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P112 wd:Q128746 . ?sbj wdt:P31 wd:Q163740 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'founder', 'o': 'Irving Berlin', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonprofit organization'}}

 Q: Which extinct language is the indigenous to the Khazars?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2341 wd:Q173282 . ?sbj wdt:P31 wd:Q38058796 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'indigenous to', 'o': 'Khazars', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'extinct language'}}

 Q: What is in the  OKPD code of the good or service of grapefruit juice ?
 SPARQL: select distinct ?answer where { wd:Q1138468 wdt:P3245 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'grapefruit juice', 'p': 'OKPD code of the good or service', 'o': '?x0'}

 Q: When did the Salta Province reach a population of 1333365?
 SPARQL: SELECT ?value WHERE { wd:Q44803 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1333365')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Salta Province', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1333365'}, 't': '?x0'}

 Q: What is <BNE ID> of <Bo Diddley> ?
 SPARQL: select distinct ?answer where { wd:Q208881 wdt:P950 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bo Diddley', 'p': 'BNE ID', 'o': '?x0'}

 Q: What is given name of Lajos Tihanyi ?
 SPARQL: select distinct ?answer where { wd:Q856707 wdt:P735 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lajos Tihanyi', 'p': 'given name', 'o': '?x0'}

 Q: Which attendee of the meeting on Brexit has the acronym Соединённое Королевство?
 SPARQL: SELECT ?answer WHERE { wd:Q7888194 wdt:P710 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'Соединённое Королевство'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Brexit', 'p': 'attendee', 'o': '?x0'}

 Q: What award did Titanic receive in 1997?
 SPARQL: SELECT ?obj WHERE { wd:Q44578 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1997')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Titanic', 'p': 'award', 'o': '?x0', 't': '1997'}

 Q: what is the {start time} for {David Ben-Gurion} has {position held} as {Knesset member} ?
 SPARQL: SELECT ?value WHERE { wd:Q37610 p:P39 ?s . ?s ps:P39 wd:Q4047513 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Ben-Gurion', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Knesset member'}}}

 Q: What is the {video game console model} for {said to be the same as} of {Nintendo Entertainment System}
 SPARQL:  select distinct ?obj where { wd:Q172742 wdt:P460 ?obj . ?obj wdt:P31 wd:Q56682555 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nintendo Entertainment System', 'p': 'said to be the same as', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game console model'}}

 Q: How many philosopher's are patron saint's?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q4964182 wdt:P417 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'philosopher', 'p': 'patron saint', 'o': '?x0'}

 Q: Did {John_Mayer} {occupation} {singer} and {blogger} ?
 SPARQL: ASK WHERE { wd:Q215215 wdt:P106 wd:Q177220 . wd:Q215215 wdt:P106 wd:Q8246794 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Mayer', 'p': 'occupation', 'o': '?x0', '?x0': 'singer'}, {'h': 'IS', 'v': '?x1', 's': 'John Mayer', 'p': 'occupation', 'o': '?x1', '?x1': 'blogger'}]

 Q: What is {drug interaction} of {treatment} of {malaria} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12156 wdt:P2176 ?X . ?X wdt:P769 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'drug interaction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'malaria', 'p': 'treatment', 'o': '$y0'}}

 Q: What is the {place of burial} and the {place of birth} of {Rock_Hudson} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q184378 wdt:P119 ?ans_1 . wd:Q184378 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Rock Hudson', 'p': 'place of burial', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Rock Hudson', 'p': 'place of birth', 'o': '?x1'}]

 Q: What tributary is the watercourse outflow of Po?
 SPARQL: SELECT ?answer WHERE { wd:Q643 wdt:P403 ?X . ?X wdt:P974 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'tributary', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Po', 'p': 'watercourse outflow', 'o': '$y0'}}

 Q: What are the ballet which start with the letter terpsichore
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15079786 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'terpsichore')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ballet'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'terpsichore'}}

 Q: What is affiliation for Rostock ?
 SPARQL: select distinct ?answer where { wd:Q2861 wdt:P1416 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rostock', 'p': 'affiliation', 'o': '?x0'}

 Q: What is {has designer} of {Fortran}, that has {prize awarded} is {Turing Award} ?
 SPARQL: SELECT ?answer WHERE { wd:Q83303 wdt:P287 ?answer . ?answer wdt:P166 wd:Q185667}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fortran', 'p': 'has designer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'award', 'o': 'Turing Award'}}

 Q: What is {first aid response} of {outcome} of {phosphoric acid} ?
 SPARQL: SELECT ?answer WHERE { wd:Q184782 wdt:P1542 ?X . ?X wdt:P2239 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first aid response', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'phosphoric acid', 'p': 'outcome', 'o': '$y0'}}

 Q: what is the {replaces} for {Tokhtamysh} has {position held} as {Khan} ?
 SPARQL: SELECT ?value WHERE { wd:Q309585 p:P39 ?s . ?s ps:P39 wd:Q181888 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tokhtamysh', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Khan'}}}

 Q: Is the mass of the Theta Centauri less than 3.2?
 SPARQL: ASK WHERE { wd:Q14225 wdt:P2067 ?obj filter(?obj < 3.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Theta Centauri', 'p': 'mass', 'o': '?x0', '?x0': '3.2'}

 Q: Is Katy Perry's family name Hudson?
 SPARQL: ASK WHERE { wd:Q42493 wdt:P734 wd:Q2720681 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Katy Perry', 'p': 'family name', 'o': '?x0', '?x0': 'Hudson'}]

 Q: What is {capital city} of {Alabama}, that has {category of associated people} is {Category:People from Tuscaloosa, Alabama} ?
 SPARQL: SELECT ?answer WHERE { wd:Q173 wdt:P36 ?answer . ?answer wdt:P1792 wd:Q8751891}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alabama', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'category of associated people', 'o': 'Category:People from Tuscaloosa, Alabama'}}

 Q: What is Turkmenistan short name in the emoji flag sequence?
 SPARQL: SELECT ?obj WHERE { wd:Q874 p:P1813 ?s . ?s ps:P1813 ?obj . ?s pq:P31 wd:Q28840786 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'short name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Turkmenistan', 'p': 'short name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'emoji flag sequence'}}}

 Q: Which is the SunshineTour ID for Gary Player?
 SPARQL: select distinct ?answer where { wd:Q469721 wdt:P3582 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gary Player', 'p': 'SunshineTour ID', 'o': '?x0'}

 Q: What is the {medical examinations} and the {drug used for treatment} of {Colorectal_cancer} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q188874 wdt:P923 ?ans_1 . wd:Q188874 wdt:P2176 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'colorectal cancer', 'p': 'medical examinations', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'colorectal cancer', 'p': 'used for treatment', 'o': '?x1'}]

 Q: Who is the {awarded} of {Le Duc Tho} whose {champion} is {Tunisian National Dialogue Quartet}?
 SPARQL: SELECT ?answer WHERE { wd:Q233969 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q21078159}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Le Duc Tho', 'p': 'award', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'champion', 'o': 'Tunisian National Dialogue Quartet'}}

 Q: What is {marriage age} of {location of death} of {Sundance Kid} ?
 SPARQL: SELECT ?answer WHERE { wd:Q460918 wdt:P20 ?X . ?X wdt:P3000 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'marriage age', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sundance Kid', 'p': 'location of death', 'o': '$y0'}}

 Q: What is the {constituency of the Rajya Sabha} for {coextensive with} of {Mizoram}
 SPARQL:  select distinct ?obj where { wd:Q1502 wdt:P3403 ?obj . ?obj wdt:P31 wd:Q57156205 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mizoram', 'p': 'coextensive with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'constituency of the Rajya Sabha'}}

 Q: Which is the Historia de la Medicina person ID of John Hunter?
 SPARQL: select distinct ?answer where { wd:Q505981 wdt:P5468 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Hunter', 'p': 'Historia de la Medicina person ID', 'o': '?x0'}

 Q: What is {significant event} of {Ellen Johnson Sirleaf} that is {sex or gender} is {male} ?
 SPARQL: SELECT ?obj WHERE { wd:Q43179 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P21 wd:Q6581097 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'significant event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ellen Johnson Sirleaf', 'p': 'significant event', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'gender', 'o': 'm'}}}

 Q: What is the {historical country} for {diplomatic relation} of {German Democratic Republic}
 SPARQL:  select distinct ?obj where { wd:Q16957 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'German Democratic Republic', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: Which is the economic branch of the administrator of Waterfront?
 SPARQL: SELECT ?answer WHERE { wd:Q1625437 wdt:P137 ?X . ?X wdt:P452 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'branch', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Waterfront', 'p': 'administrator', 'o': '$y0'}}

 Q: When did Durham had a population of 6679 people?
 SPARQL: SELECT ?value WHERE { wd:Q49229 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'6679.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Durham', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '6679.0'}, 't': '?x0'}

 Q: Is the maximum duration of antimicrobial therapy for pediatric pneumonia 12
 SPARQL: ASK WHERE { wd:Q61707499 wdt:P4135 ?obj filter(?obj = 12.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Duration of Antimicrobial Therapy for Paediatric Pneumonia', 'p': 'maximum age', 'o': '?x0', '?x0': '12.0'}

 Q: What is {member of} of {is in the region of} of {Veracruz} ?
 SPARQL: SELECT ?answer WHERE { wd:Q60130 wdt:P131 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Veracruz', 'p': 'region', 'o': '$y0'}}

 Q: Who is the {version, edition, or translation} for {author} of {Salman Rushdie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q44306 . ?sbj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Salman Rushdie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'version, edition, or translation'}}

 Q: What is {often confused with} of {cousin}, that has {date of first written record} is {1416-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23009870 wdt:P1889 ?answer . ?answer wdt:P1249 ?x FILTER(contains(YEAR(?x),'1416'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'cousin', 'p': 'confused with', 'o': '?x0', 't': '1416'}

 Q: What is the {human} for {commissioned by} of {Mausoleum of Maussollos}
 SPARQL:  select distinct ?obj where { wd:Q45368 wdt:P88 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mausoleum of Maussollos', 'p': 'commissioned by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {performer} of {Jill Valentine} that is {object has role} is {voice actor} ?
 SPARQL: SELECT ?obj WHERE { wd:Q840368 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P3831 wd:Q2405480 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jill Valentine', 'p': 'actor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'object has role', 'o': 'voice actor'}}}

 Q: What is the taxon parent of Scorpaeniformes, whose vernacular name is Lớp Cá vây tia?
 SPARQL: SELECT ?answer WHERE { wd:Q208777 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Lớp Cá vây tia'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Scorpaeniformes', 'p': 'taxon parent', 'o': '?x0'}

 Q: What university starts with the letter "u"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is Mount Baker's Bivouac.com mountain ID?
 SPARQL: select distinct ?answer where { wd:Q594387 wdt:P3507 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mount Baker', 'p': 'Bivouac.com mountain ID', 'o': '?x0'}

 Q: Give me {crude drug} that {crystal system} {monoclinic crystal system} and which that starts with {'g'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q735160 . ?sbj wdt:P556 wd:Q624543 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'crude drug', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'crystal system', 'o': 'monoclinic'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: What is the {gene} for {genetic association} of {colorectal cancer}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2293 wd:Q188874 . ?sbj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'colorectal cancer', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: What is the {Academy Awards ceremony} for {presenter} of {Ellen DeGeneres}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q16913666 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'Ellen DeGeneres', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Academy Awards ceremony'}}

 Q: Which is the mountains classification of Chris Froome?
 SPARQL: select distinct ?answer where { ?answer wdt:P4320 wd:Q319591}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'mountains classification', 'o': 'Chris Froome'}

 Q: What is Sony a member of and who owns it?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q41187 wdt:P463 ?ans_1 . wd:Q41187 wdt:P1830 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Sony', 'p': 'member of', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Sony', 'p': 'owns', 'o': '?x1'}]

 Q: Who is the human biblical figure for the significant person of Saul?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3342 wd:Q28730 . ?sbj wdt:P31 wd:Q20643955 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Saul', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human biblical figure'}}

 Q: How many mountains classifications are there in the {Chris Froome} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4320 wd:Q319591 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'mountains classification', 'o': 'Chris Froome'}

 Q: Which publication place of Kojiki has a CPI inflation rate of 0.8?
 SPARQL: SELECT ?answer WHERE { wd:Q813031 wdt:P291 ?answer . ?answer wdt:P1279 ?x FILTER(contains(?x,'0.8'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kojiki', 'p': 'publication place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inflation rate', 'o': '0.8'}}

 Q: Which is the unary operation of the notation of integral symbol and contains the word integral in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj wdt:P913 wd:Q1665420 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'integral')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'unary operation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'notation', 'o': 'integral symbol'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'integral'}}

 Q: How many {costume designer} are to/by {Christian Dior} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2515 wd:Q159694 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'costume designer', 'o': 'Christian Dior'}

 Q: What is the {dominion of the British Empire} for {contains administrative territorial entity} of {Tripura}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q1363 . ?sbj wdt:P31 wd:Q223832 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Tripura', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dominion of the British Empire'}}

 Q: What member of Marshall Islands started on 1992-9-23?
 SPARQL: SELECT ?obj WHERE { wd:Q709 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marshall Islands', 'p': 'member of', 'o': '?x0', 't': '1992'}

 Q: When did Belfast stop being part of the Kingdom of Ireland?
 SPARQL: SELECT ?value WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 wd:Q215530 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Belfast', 'p': 'land', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'land', 'o': 'Kingdom of Ireland'}}}

 Q: what is the {replaces} for {U Thant} has {position held} as {United Nations Secretary-General} ?
 SPARQL: SELECT ?value WHERE { wd:Q1264 p:P39 ?s . ?s ps:P39 wd:Q81066 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaces', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'U Thant', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United Nations Secretary-General'}}}

 Q: what is the {applies to jurisdiction} for {The Little Prince} has {public domain date} as {2005-1-1} ?
 SPARQL: SELECT ?value WHERE { wd:Q25338 p:P3893 ?s . ?s ps:P3893 ?x filter(contains(YEAR(?x),'2005')) . ?s pq:P1001 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to jurisdiction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Little Prince', 'p': 'public domain date', 'o': '$y0'}}

 Q: What is the criteria used to name polar night which is the opposite of midnight sun?
 SPARQL: SELECT ?value WHERE { wd:Q190991 p:P461 ?s . ?s ps:P461 wd:Q774621 . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criteria used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'polar night', 'p': 'opposite of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'opposite of', 'o': 'midnight sun'}}}

 Q: Which is the melting point of lindane?
 SPARQL: select distinct ?answer where { wd:Q282003 wdt:P2101 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'lindane', 'p': 'melting point', 'o': '?x0'}

 Q: Which federation has the largest Gini coefficient?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q43702 . ?ent wdt:P1125 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'Gini coefficient', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federation'}}

 Q: what is the {end time} for {Lu Xun} has {spouse} as {Zhu An} ?
 SPARQL: SELECT ?value WHERE { wd:Q23114 p:P26 ?s . ?s ps:P26 wd:Q11093843 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lu Xun', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Zhu An'}}}

 Q: What is {position held} of {Konstantinos Karamanlis} that is {start time} is {1974-7-24} ?
 SPARQL: SELECT ?obj WHERE { wd:Q156806 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Konstantinos Karamanlis', 'p': 'position held', 'o': '?x0', 't': '1974'}

 Q: what is the {start time} for {Nelson Mandela Bay Metropolitan Municipality} has {twinned administrative body} as {Gothenburg} ?
 SPARQL: SELECT ?value WHERE { wd:Q1856565 p:P190 ?s . ?s ps:P190 wd:Q25287 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nelson Mandela Bay Metropolitan Municipality', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Gothenburg'}}}

 Q: When did Alicante have a population of 322,673?
 SPARQL: SELECT ?value WHERE { wd:Q11959 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'322673.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alicante', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '322673.0'}, 't': '?x0'}

 Q: Tell me which is the aqueous solution that has fermentation as fabrication method and contains the word vinegar in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906356 . ?sbj wdt:P2079 wd:Q41760 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vinegar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aqueous solution', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'fabrication method', 'o': 'fermentation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vinegar'}}

 Q: Tell me about socialist state for public holiday of Chinese New Year?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P832 wd:Q131772 . ?sbj wdt:P31 wd:Q842112 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'public holiday', 'o': 'Chinese New Year', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'socialist state'}}

 Q: What is the board game with the highest number of minimum players?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q131436 . ?ent wdt:P1872 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'minimum players', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'board game'}}

 Q: what are the linear combination which start with the letter p
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q27628 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'linear combination'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is the {human} for {residence} of {Rome}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P551 wd:Q220 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'residence', 'o': 'Rome', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what are the alloy which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37756 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'alloy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: How many drainage basins are determined for Tarim Basin?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4614 wd:Q216622 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'drainage basin', 'o': 'Tarim Basin'}

 Q: what is the {start time} for {Venice} has {country} as {Republic of Venice} ?
 SPARQL: SELECT ?value WHERE { wd:Q641 p:P17 ?s . ?s ps:P17 wd:Q4948 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Venice', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Republic of Venice'}}}

 Q: what is the {start time} for {Tianjin} has {twinned administrative body} as {Hakodate} ?
 SPARQL: SELECT ?value WHERE { wd:Q11736 p:P190 ?s . ?s ps:P190 wd:Q26418 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tianjin', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Hakodate'}}}

 Q: What is {diplomatic relation} of {Taiwan} that is {statement is subject of} is {Netherlands–Taiwan relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q865 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15926013 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Taiwan', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Netherlands–Taiwan relations'}}}

 Q: Did {John_Gotti} {convicted of} {obstruction of justice} and {tax noncompliance} ?
 SPARQL: ASK WHERE { wd:Q301646 wdt:P1399 wd:Q525302 . wd:Q301646 wdt:P1399 wd:Q15279749 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Gotti', 'p': 'convicted of', 'o': '?x0', '?x0': 'obstruction of justice'}, {'h': 'IS', 'v': '?x1', 's': 'John Gotti', 'p': 'convicted of', 'o': '?x1', '?x1': 'tax noncompliance'}]

 Q: What is {work} of {designer} of {Metropolitan Railway A Class} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6825216 wdt:P287 ?X . ?X wdt:P800 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Metropolitan Railway A Class', 'p': 'designer', 'o': '$y0'}}

