 Q: Which is the inscription for Le Déjeuner sur l'herbe?
 SPARQL: select distinct ?answer where { wd:Q152509 wdt:P1684 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Le Déjeuner sur l'herbe", 'p': 'inscription', 'o': '?x0'}

 Q: What is the SI derived unit for the measured physical quantity of density?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P111 wd:Q29539 . ?sbj wdt:P31 wd:Q208469 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'measured physical quantity', 'o': 'density', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'SI derived unit'}}

 Q: How many power plants use two-stroke engines?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P516 wd:Q152323 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'engine', 'o': 'two-stroke engine'}

 Q: What is {chronology of topic} of {located in the administrative territorial entity} of {Grace Episcopal Church} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5591137 wdt:P131 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chronology of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grace Episcopal Church', 'p': 'in', 'o': '$y0'}}

 Q: "Where is {place of residence} of {Ewan McGregor}, whhich has {subdivided into} is {Alhambra} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q165518 wdt:P551 ?answer . ?answer wdt:P150 wd:Q752681}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ewan McGregor', 'p': 'residence', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divided into', 'o': 'Alhambra'}}

 Q: What is {satellite} of {motif} of {Jupiter Heliopolitanus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q20669412 wdt:P180 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'satellite', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jupiter Heliopolitanus', 'p': 'motif', 'o': '$y0'}}

 Q: Which is the Deezer artist ID for Green Day?
 SPARQL: select distinct ?answer where { wd:Q47871 wdt:P2722 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Green Day', 'p': 'Deezer artist ID', 'o': '?x0'}

 Q: What is {series} of {Parshvanatha} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q1400271 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Parshvanatha', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Parshvanatha', 'p': 'series', 'o': '$y0'}}]

 Q: Is the watershed area of Itzstedter Sea .28?
 SPARQL: ASK WHERE { wd:Q1675385 wdt:P2053 ?obj filter(?obj = 0.28) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Itzstedter See', 'p': 'watershed area', 'o': '?x0', '?x0': '0.28'}

 Q: What is the crafted from of the artist of The Thin Mercury Sound?
 SPARQL: SELECT ?answer WHERE { wd:Q7768705 wdt:P175 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'crafted from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Thin Mercury Sound', 'p': 'artist', 'o': '$y0'}}

 Q: What is {voice actresses} of {from work} of {Death the Kid} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3704333 wdt:P1441 ?X . ?X wdt:P725 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'voice actress', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Death the Kid', 'p': 'from work', 'o': '$y0'}}

 Q: tell me steroid hormone that starts with t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q422137 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steroid hormone'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: what is the {for work} for {Sissy Spacek} has {nominated for} as {Academy Award for Best Actress} ?
 SPARQL: SELECT ?value WHERE { wd:Q190994 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sissy Spacek', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actress'}}}

 Q: when is the {point in time} for {Jawaharlal Nehru} who {nominated for} as {Nobel Peace Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q1047 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Jawaharlal Nehru', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Peace Prize'}, 't': '?x0'}

 Q: How many {home port} are to/by {Southampton} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P504 wd:Q79848 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'home port', 'o': 'Southampton'}

 Q: What is {head of state} of {Georgia} that is {end time} is {2004-1-25} ?
 SPARQL: SELECT ?obj WHERE { wd:Q230 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Georgia', 'p': 'head of state', 'o': '?x0', 't': '2004'}

 Q: what is the {point in time} for {Nicki Minaj} has {nominated for} as {Grammy Award for Album of the Year} ?
 SPARQL: SELECT ?value WHERE { wd:Q162202 p:P1411 ?s . ?s ps:P1411 wd:Q904528 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nicki Minaj', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Grammy Award for Album of the Year'}, 't': '?x0'}

 Q: Tell me the CGNDB Unique ID of the Saskatchewan River?
 SPARQL: select distinct ?answer where { wd:Q3047 wdt:P821 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Saskatchewan River', 'p': 'CGNDB Unique ID', 'o': '?x0'}

 Q: What is {open period to} and {closed on} of {{British Museum} has {open days} as {all weekdays}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 wd:Q26214163 . ?s pq:P3028 ?value1 . ?s pq:P3026 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'open period to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'open days', 'o': 'all weekdays'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'closed on', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'open days', 'o': 'all weekdays'}}}]

 Q: What kind of employment do the spouses of Jussi Björling do?
 SPARQL: SELECT ?answer WHERE { wd:Q56157 wdt:P26 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employment', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jussi Björling', 'p': 'spouse', 'o': '$y0'}}

 Q: Which is the genealogics.org person ID of Robert Walpole?
 SPARQL: select distinct ?answer where { wd:Q104190 wdt:P1819 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Walpole', 'p': 'genealogics.org person ID', 'o': '?x0'}

 Q: What are the political system which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28108 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {noble title} of {Louis the Pious} and {followed by}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'royal title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'royal title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis the Pious', 'p': 'royal title', 'o': '$y0'}}]

 Q: What award did Amnesty International receive in 1988?
 SPARQL: SELECT ?obj WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Amnesty International', 'p': 'award', 'o': '?x0', 't': '1988'}

 Q: What was Ian McEwan nominated for in 2007?
 SPARQL: SELECT ?obj WHERE { wd:Q190379 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ian McEwan', 'p': 'nominated for', 'o': '?x0', 't': '2007'}

 Q: Is the vibration of the Makita GA7021 equal to 12.3?
 SPARQL: ASK WHERE { wd:Q23775563 wdt:P2806 ?obj filter(?obj = 12.3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Makita GA7021', 'p': 'vibration', 'o': '?x0', '?x0': '12.3'}

 Q: Did {Wladimir_Klitschko} {victory} {Wladimir Klitschko vs. Sultan Ibragimov}?
 SPARQL: ASK WHERE { wd:Q18797 wdt:P2522 wd:Q39059190 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Wladimir Klitschko', 'p': 'victory', 'o': '?x0', '?x0': 'Wladimir Klitschko vs. Sultan Ibragimov'}]

 Q: Which is the Butterflies and Moths of North America ID for Geometridae?
 SPARQL: select distinct ?answer where { wd:Q45559 wdt:P3398 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Geometridae', 'p': 'Butterflies and Moths of North America ID', 'o': '?x0'}

 Q: Is it true that the prize money of the Aleksis Kivi Award is 150000?
 SPARQL: ASK WHERE { wd:Q1812708 wdt:P2121 ?obj filter(?obj = 15000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Aleksis Kivi Award', 'p': 'prize money', 'o': '?x0', '?x0': '15000'}

 Q: What is <Twitch game ID> of <Dota 2> ?
 SPARQL: select distinct ?answer where { wd:Q771541 wdt:P4467 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dota 2', 'p': 'Twitch game ID', 'o': '?x0'}

 Q: what is the {start time} for {Billie Jean King} has {award received} as {Library of Congress Living Legend} ?
 SPARQL: SELECT ?value WHERE { wd:Q54527 p:P166 ?s . ?s ps:P166 wd:Q6542686 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Billie Jean King', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Library of Congress Living Legend'}}}

 Q: Give me {Flavored tea} that {named after} {Charles Grey, 2nd Earl Grey} and which contains the word {earl} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3526264 . ?sbj wdt:P138 wd:Q294662 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'earl')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'flavored tea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Charles Grey, 2nd Earl Grey'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'earl'}}

 Q: What is {member of sports team} of {Garrincha} and {number of points/goals/set scored}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q180642 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Garrincha', 'p': 'member of sports team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'member of sports team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Garrincha', 'p': 'member of sports team', 'o': '$y0'}}]

 Q: What is {treated by} of {method of murder} of {Mohammed Rafi} ?
 SPARQL: SELECT ?answer WHERE { wd:Q156815 wdt:P509 ?X . ?X wdt:P2176 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'treated by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mohammed Rafi', 'p': 'method of murder', 'o': '$y0'}}

 Q: What is the local authority for Greater London?
 SPARQL:  select distinct ?obj where { wd:Q23306 wdt:P797 ?obj . ?obj wdt:P31 wd:Q837766 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Greater London', 'p': 'authority', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'local authority'}}

 Q: What is the name of the secondary national association football team for the Zinedine Zidane Team members?
 SPARQL:  select distinct ?obj where { wd:Q1835 wdt:P54 ?obj . ?obj wdt:P31 wd:Q45053817 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zinedine Zidane', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'secondary national association football team'}}

 Q: What is {postal index number} of {lives in} of {Ludwig Mies van der Rohe} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41508 wdt:P551 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'zipcode', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ludwig Mies van der Rohe', 'p': 'lives in', 'o': '$y0'}}

 Q: What are the human which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {human} for {significant event} of {Indian independence movement}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Indian independence movement', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is the permanent duplicated item of famine?
 SPARQL: select distinct ?answer where { ?answer wdt:P2959 wd:Q168247}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'permanent duplicated item', 'o': 'famine'}

 Q: Who gave the {prequel of} of {location of narrative} of {Candide} ?
 SPARQL: SELECT ?answer WHERE { wd:Q215894 wdt:P840 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'prequel of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Candide', 'p': 'location of narrative', 'o': '$y0'}}

 Q: What is {ortholog} of {genetic association} of {amyotrophic lateral sclerosis} ?
 SPARQL: SELECT ?answer WHERE { wd:Q206901 wdt:P2293 ?X . ?X wdt:P684 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ortholog', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'amyotrophic lateral sclerosis', 'p': 'genetic association', 'o': '$y0'}}

 Q: Who is the publisher and illustrator of The Little Prince?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q25338 wdt:P123 ?ans_1 . wd:Q25338 wdt:P110 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'The Little Prince', 'p': 'publisher', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'The Little Prince', 'p': 'illustrator', 'o': '?x1'}]

 Q: What is the {vehicle model} with the {MAX(shelf life)} whose {subclass of} is {spacecraft}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q29048322 . ?ent wdt:P4218 ?obj . ?ent wdt:P279 wd:Q40218 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'shelf life', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'vehicle model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'spaceship'}}}

 Q: Tell me artistic theme whose name has the word theotokos in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1406161 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'theotokos')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'artistic theme'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'theotokos'}}

 Q: What is {nominated for} of {Jon Voight} that is {for work} is {Anaconda} ?
 SPARQL: SELECT ?obj WHERE { wd:Q167520 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q464042 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jon Voight', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Anaconda'}}}

 Q: With a population of 434516, what is the capital of Majorca?
 SPARQL: SELECT ?answer WHERE { wd:Q8828 wdt:P36 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'434516'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Majorca', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'population', 'o': '434516'}}

 Q: What is {has brother} of {Nefertiti}, that has {daddy} is {Ay} ?
 SPARQL: SELECT ?answer WHERE { wd:Q40930 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q146029}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nefertiti', 'p': 'bro', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'father', 'o': 'Ay'}}

 Q: Is Uruguay's minimum age for compulsory education the number 6?
 SPARQL: ASK WHERE { wd:Q77 wdt:P3270 ?obj filter(?obj = 6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Uruguay', 'p': 'compulsory education (minimum age)', 'o': '?x0', '?x0': '6'}

 Q: What is the earliest date for John the Baptist's death in the year 30?
 SPARQL: SELECT ?value WHERE { wd:Q40662 p:P570 ?s . ?s ps:P570 ?x filter(contains(?x,'30-0-0')) . ?s pq:P1319 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'earliest date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John the Baptist', 'p': 'death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'death', 'o': '30-0-0'}}}

 Q: Tell me freeway network whose name has the word system in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55504191 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'system')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'freeway network'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'system'}}

 Q: Which is the Model Manual ID for Cindy Crawford?
 SPARQL: select distinct ?answer where { wd:Q199801 wdt:P3379 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cindy Crawford', 'p': 'Model Manual ID', 'o': '?x0'}

 Q: What is the U.S. National Geodetic Survey ID of Mount Mitchell?
 SPARQL: select distinct ?answer where { wd:Q615337 wdt:P3514 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mount Mitchell', 'p': 'U.S. National Geodetic Survey ID', 'o': '?x0'}

 Q: Which is the Scoresway soccer person ID for Gareth Bale?
 SPARQL: select distinct ?answer where { wd:Q184586 wdt:P3043 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gareth Bale', 'p': 'Scoresway soccer person ID', 'o': '?x0'}

 Q: What are the writing system which start with the letter W
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8192 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'writing system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {silent short film} for {depicted by} of {Richard III of England}
 SPARQL:  select distinct ?obj where { wd:Q133028 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q20667187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Richard III of England', 'p': 'depicted by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'silent short film'}}

 Q: IS THE TIME IN SPACE OF CATHERINE COLEMAN EQUALS TO 207552.O
 SPARQL: ASK WHERE { wd:Q7468 wdt:P2873 ?obj filter(?obj = 207552.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Catherine Coleman', 'p': 'time in space', 'o': '?x0', '?x0': '207552.0'}

 Q: Which is the Ethnologue language status for Esperanto?
 SPARQL: select distinct ?answer where { wd:Q143 wdt:P3823 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'Ethnologue language status', 'o': '?x0'}

 Q: What is the {goddess} for {country of citizenship} of {Inca Empire}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P27 wd:Q28573 . ?sbj wdt:P31 wd:Q205985 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': 'Inca Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'goddess'}}

 Q: which doctrine starts with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q117850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'doctrine'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is Mathematical Reviews ID for Gérard Debreu ?
 SPARQL: select distinct ?answer where { wd:Q210960 wdt:P889 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Gérard Debreu', 'p': 'Mathematical Reviews ID', 'o': '?x0'}

 Q: Give me {pair of enantiomers} that {disjoint union of} {list values as qualifiers} and which contains the word {nicotine} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55662747 . ?sbj wdt:P2738 wd:Q23766486 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nicotine')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pair of enantiomers', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'disjoint union of', 'o': 'list values as qualifiers'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'nicotine'}}

 Q: What is the {insecticide} with the {MAX(melting point)} whose {has part} is {phosphorus}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q181322 . ?ent wdt:P2101 ?obj . ?ent wdt:P527 wd:Q674 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'melting point', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'insecticide', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'contain', 'o': 'phosphorus'}}}

 Q: what is the {start time} for {Auschwitz concentration camp} has {instance of} as {Nazi concentration camp} ?
 SPARQL: SELECT ?value WHERE { wd:Q7341 p:P31 ?s . ?s ps:P31 wd:Q328468 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Auschwitz', 'p': 'type', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'type', 'o': 'Nazi concentration camp'}}}

 Q: What is in conflict of armed with of A.100 ?
 SPARQL: SELECT ?answer WHERE { wd:Q381204 wdt:P520 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'A.100', 'p': 'armed with', 'o': '$y0'}}

 Q: What is {antiparticle of} of {positron}, that has {interaction} is {gravity} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3229 wdt:P2152 ?answer . ?answer wdt:P517 wd:Q11412}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'positron', 'p': 'antiparticle', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'interaction', 'o': 'gravity'}}

 Q: How many collections are in the Royal Danish Library?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P195 wd:Q867885 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'collection', 'o': 'Royal Danish Library'}

 Q: Who is the speaker Nicolas Sarkozy?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P823 wd:Q329 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'speaker', 'o': 'Nicolas Sarkozy'}

 Q: What is the {cooperative} for {editor} of {Dewey Decimal Classification}
 SPARQL:  select distinct ?obj where { wd:Q48460 wdt:P98 ?obj . ?obj wdt:P31 wd:Q4539 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dewey Decimal Classification', 'p': 'editor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cooperative'}}

 Q: Which is the WikiSkripta ID for cell signaling?
 SPARQL: select distinct ?answer where { wd:Q210973 wdt:P3471 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cell signaling', 'p': 'WikiSkripta ID', 'o': '?x0'}

 Q: What is {inhabitants} of {studio where filmed} of {Halloween} ?
 SPARQL: SELECT ?answer WHERE { wd:Q221103 wdt:P915 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Halloween', 'p': 'studio where filmed', 'o': '$y0'}}

 Q: what is the {criterion used} for {Higgs boson} has {mean lifetime} as {1e-05} ?
 SPARQL: SELECT ?value WHERE { wd:Q402 p:P2645 ?s . ?s ps:P2645 ?x filter(contains(?x,'1e-05')) . ?s pq:P1013 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'criterion used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Higgs boson', 'p': 'mean lifetime', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'mean lifetime', 'o': '1e-05'}}}

 Q: What's the cell component of cholesterol?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q43656 wdt:P681 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'cholesterol', 'p': 'cell component', 'o': '?x0'}

 Q: What is the birthplace of Yi Xing, that borders Anhui.
 SPARQL: SELECT ?answer WHERE { wd:Q710705 wdt:P19 ?answer . ?answer wdt:P47 wd:Q40956}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yi Xing', 'p': 'birthplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'border', 'o': 'Anhui'}}

 Q: What are the data serialization format that contains the word yaml in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24451526 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yaml')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'data serialization format'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yaml'}}

 Q: IS THE SUBLIMATION TEMPERTATURE OF THE SYNTHETIC GRAPHITE GREATER THAN 7922.4
 SPARQL: ASK WHERE { wd:Q21057320 wdt:P2113 ?obj filter(?obj > 7922.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'synthetic graphite', 'p': 'sublimation temperature', 'o': '?x0', '?x0': '7922.4'}

 Q: what is the {point in time} for {Raghuram Rajan} has {award received} as {Fischer Black Prize} ?
 SPARQL: SELECT ?value WHERE { wd:Q981496 p:P166 ?s . ?s ps:P166 wd:Q741683 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Raghuram Rajan', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Fischer Black Prize'}, 't': '?x0'}

 Q: When was Whoopi Goldberg has received award for British Academy of Film and Television Arts?
 SPARQL: SELECT ?value WHERE { wd:Q49001 p:P166 ?s . ?s ps:P166 wd:Q159661 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Whoopi Goldberg', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'British Academy of Film and Television Arts'}, 't': '?x0'}

 Q: when was National Film Award for Best Screenplay  award received of the Arundhati Roy?
 SPARQL: SELECT ?value WHERE { wd:Q212801 p:P166 ?s . ?s ps:P166 wd:Q1967202 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Arundhati Roy', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'National Film Award for Best Screenplay'}, 't': '?x0'}

 Q: What is {type of taxon} of {taxon parent} of {Cupressus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q146911 wdt:P171 ?X . ?X wdt:P105 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of taxon', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cupressus', 'p': 'taxon parent', 'o': '$y0'}}

 Q: What is {is in the municipality of} of {The Kyle and Jackie O Show}, that has {has counties} is {City of Fairfield} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7745007 wdt:P131 ?answer . ?answer wdt:P150 wd:Q571368}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Kyle and Jackie O Show', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has counties', 'o': 'City of Fairfield'}}

 Q: Is it true that the maximum operating altitude of the Albatros D.I is greater than 11808?
 SPARQL: ASK WHERE { wd:Q114039 wdt:P2254 ?obj filter(?obj > 11808.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Albatros D.I', 'p': 'maximum operating altitude', 'o': '?x0', '?x0': '11808.0'}

 Q: which mosque starts with s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32815 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mosque'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {award received} of {Dolly Parton} that is {for work} is {Transamerica} ?
 SPARQL: SELECT ?obj WHERE { wd:Q180453 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q742614 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dolly Parton', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Transamerica'}}}

 Q: what is the {start time} for {Alan Sugar} has {position held} as {Enterprise Champion} ?
 SPARQL: SELECT ?value WHERE { wd:Q336520 p:P39 ?s . ?s ps:P39 wd:Q5380297 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Sugar', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Enterprise Champion'}}}

 Q: What is Peter Gabriel's record label?
 SPARQL:  select distinct ?obj where { wd:Q175195 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Peter Gabriel', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'record label'}}

 Q: What is the leaf material used for ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P186 wd:Q33971 . ?sbj wdt:P31 wd:Q1724915 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'material used', 'o': 'leaf', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'use'}}

 Q: What is <students count> of <Aix-Marseille University> ?
 SPARQL: select distinct ?answer where { wd:Q2302586 wdt:P2196 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aix-Marseille University', 'p': 'students count', 'o': '?x0'}

 Q: What area of law starts with "l"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1756157 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'area of law'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Which means {instrument} for {harmonica} ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1303 wd:Q51290}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'instrument', 'o': 'harmonica'}

