 Q: Did {IBM} {owner of} {Cognos} and {Mark sense} ?
 SPARQL: ASK WHERE { wd:Q37156 wdt:P1830 wd:Q1107048 . wd:Q37156 wdt:P1830 wd:Q16928019 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'IBM', 'p': 'owner of', 'o': '?x0', '?x0': 'Cognos'}, {'h': 'IS', 'v': '?x1', 's': 'IBM', 'p': 'owner of', 'o': '?x1', '?x1': 'Mark sense'}]

 Q: What is {official symbol} of {Quebec} that is {applies to part} is {tree} ?
 SPARQL: SELECT ?obj WHERE { wd:Q176 p:P2238 ?s . ?s ps:P2238 ?obj . ?s pq:P518 wd:Q10884 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'official symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Quebec', 'p': 'official symbol', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'tree'}}}

 Q: What is {deathplace} of {Gerrit Rietveld}, that has {populated places within} is {Themaat} ?
 SPARQL: SELECT ?answer WHERE { wd:Q160435 wdt:P20 ?answer . ?answer wdt:P1383 wd:Q1846873}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gerrit Rietveld', 'p': 'death place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'populated places within', 'o': 'Themaat'}}

 Q: Which is the domain of subset?
 SPARQL: select distinct ?answer where { wd:Q177646 wdt:P1568 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'subset', 'p': 'domain', 'o': '?x0'}

 Q: what is the {together with} for {Kid Cudi} has {award received} as {Grammy Award for Best Rap/Sung Performance} ?
 SPARQL: SELECT ?value WHERE { wd:Q299138 p:P166 ?s . ?s ps:P166 wd:Q1542172 . ?s pq:P1706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'together with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kid Cudi', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best Rap/Sung Performance'}}}

 Q: What is ISzDb company ID of The Walt Disney Company?
 SPARQL: select distinct ?answer where { wd:Q7414 wdt:P3115 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Walt Disney Company', 'p': 'ISzDb company ID', 'o': '?x0'}

 Q: In which language of work or name do heart has a pronunciation audio as Ru-сердце.ogg?
 SPARQL: SELECT ?value WHERE { wd:Q1072 p:P443 ?s . ?s ps:P443 ?x filter(contains(?x,'Ru-сердце.ogg')) . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language of work or name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'heart', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'pronunciation audio', 'o': 'ru-сердце.ogg'}}}

 Q: What is the {religious text} for {present in work} of {Melchizedek}
 SPARQL:  select distinct ?obj where { wd:Q219395 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Melchizedek', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: How many platforms does Tomb Raider have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q270503 wdt:P400 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Tomb Raider', 'p': 'platform', 'o': '?x0'}

 Q: Which is the LIPID MAPS ID for abscisic acid?
 SPARQL: select distinct ?answer where { wd:Q332211 wdt:P2063 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'abscisic acid', 'p': 'LIPID MAPS ID', 'o': '?x0'}

 Q: What is {nominated for} of {Claudette Colbert} that is {statement is subject of} is {8th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q203819 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q132080 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Claudette Colbert', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '8th Academy Awards'}}}

 Q: what is the {statement is subject of} for {Iowa} has {nickname} as {The Hawkeye State} ?
 SPARQL: SELECT ?value WHERE { wd:Q1546 p:P1449 ?s . ?s ps:P1449 ?x filter(contains(?x,'The Hawkeye State')) . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iowa', 'p': 'nickname', 'o': '$y0'}}

 Q: Name an online dictionary written by John Simpson that contains the word "dictionnary" in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3327521 . ?sbj wdt:P50 wd:Q6257950 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dictionary')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'online dictionary', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'written by', 'o': 'John Simpson'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'dictionary'}}

 Q: Is the fee of Ueno Zoo equal to 300?
 SPARQL: ASK WHERE { wd:Q162722 wdt:P2555 ?obj filter(?obj = 300) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Ueno Zoo', 'p': 'fee', 'o': '?x0', '?x0': '300'}

 Q: Which is the academic major and the academic degree of John Updike who was educated at the Harvard University?
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q105756 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Updike', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Updike', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Harvard University'}}}]

 Q: What is killed by Harry Potter?
 SPARQL: select distinct ?answer where { ?answer wdt:P157 wd:Q3244512}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'killed by', 'o': 'Harry Potter'}

 Q: How many employers are there for Edward Snowden?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q13424289 wdt:P108 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Edward Snowden', 'p': 'employer', 'o': '?x0'}

 Q: What is {elected in} and {end cause} of {{Jeremy Corbyn} has {position held} as {Member of the 56th Parliament of the United Kingdom}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q291169 p:P39 ?s . ?s ps:P39 wd:Q30524718 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeremy Corbyn', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 56th Parliament of the United Kingdom'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end cause', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jeremy Corbyn', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the 56th Parliament of the United Kingdom'}}}]

 Q: What is {award received} of {Gwendolyn Brooks} that is {point in time} is {1994-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q270715 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gwendolyn Brooks', 'p': 'award', 'o': '?x0', 't': '1994'}

 Q: The conjugate acid of water has a monoanion of?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4147 wd:Q283 . ?sbj wdt:P31 wd:Q55523986 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'conjugate acid', 'o': 'water', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monoanion'}}

 Q: Which is the summit of the highest point of Shanghai?
 SPARQL:  select distinct ?obj where { wd:Q8686 wdt:P610 ?obj . ?obj wdt:P31 wd:Q207326 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shanghai', 'p': 'highest point', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'summit'}}

 Q: What is {medium} of {maker of} of {textile arts} ?
 SPARQL: SELECT ?answer WHERE { wd:Q10988986 wdt:P1056 ?X . ?X wdt:P186 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'medium', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'textile art', 'p': 'maker of', 'o': '$y0'}}

 Q: What is the CPI inflation rate of the endemic to of  the Indian cuisine ?
 SPARQL: SELECT ?answer WHERE { wd:Q192087 wdt:P2341 ?X . ?X wdt:P1279 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inflation rate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Indian cuisine', 'p': 'endemic to', 'o': '$y0'}}

 Q: Who is {club manager} of {actress} of {WrestleMania III} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50817 wdt:P161 ?X . ?X wdt:P286 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manager', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'WrestleMania III', 'p': 'actress', 'o': '$y0'}}

 Q: How many {head of government} are for {German Democratic Republic} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q16957 wdt:P6 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'German Democratic Republic', 'p': 'head of government', 'o': '?x0'}

 Q: What is the {religious text} for {followed by} of {Exodus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P156 wd:Q9190 . ?sbj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'followed by', 'o': 'Exodus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: What award did Hume Cronyn recieve in 1964?
 SPARQL: SELECT ?obj WHERE { wd:Q395205 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1964')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hume Cronyn', 'p': 'award', 'o': '?x0', 't': '1964'}

 Q: Which is Agassiz checklist number for Danaus plexippus?
 SPARQL: select distinct ?answer where { wd:Q212398 wdt:P1744 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Danaus plexippus', 'p': 'Agassiz checklist number', 'o': '?x0'}

 Q: What is {captain} of {plays for} of {Gerry Brisson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q746901 wdt:P54 ?X . ?X wdt:P634 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'captain', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerry Brisson', 'p': 'plays for', 'o': '$y0'}}

 Q: How many {payment types accepted} are to/by {money} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2851 wd:Q1368 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'payment types accepted', 'o': 'money'}

 Q: What is located in the landscape of The Scream?
 SPARQL: SELECT ?answer WHERE { wd:Q471379 wdt:P180 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'is located in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Scream', 'p': 'landscape of', 'o': '$y0'}}

 Q: Who is the airline alliance of Singapore Airlines?
 SPARQL: select distinct ?answer where { wd:Q32245 wdt:P114 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Singapore Airlines', 'p': 'airline alliance', 'o': '?x0'}

 Q: Who are Sandrart.net artwork ID of Laocoön and His Sons?
 SPARQL: select distinct ?answer where { wd:Q465762 wdt:P4380 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Laocoön and His Sons', 'p': 'Sandrart.net artwork ID', 'o': '?x0'}

 Q: What is the official symbol of New Brunswick?
 SPARQL: select distinct ?answer where { wd:Q1965 wdt:P2238 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'New Brunswick', 'p': 'official symbol', 'o': '?x0'}

 Q: Which is the update method for iTunes?
 SPARQL: select distinct ?answer where { ?answer wdt:P4387 wd:Q9589}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'update method', 'o': 'iTunes'}

 Q: what is the {point in time} for {George Clooney} has {award received} as {Indiana Film Journalists Association Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q23844 p:P166 ?s . ?s ps:P166 wd:Q16058281 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'George Clooney', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Indiana Film Journalists Association Award for Best Actor'}, 't': '?x0'}

 Q: What is {item used} of {coincident with} of {human body} ?
 SPARQL: SELECT ?answer WHERE { wd:Q23852 wdt:P1382 ?X . ?X wdt:P2283 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'used', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'human body', 'p': 'coincident with', 'o': '$y0'}}

 Q: What is {ranking} of {Jimmy Connors} that is {sport} is {tennis singles} ?
 SPARQL: SELECT ?obj WHERE { wd:Q53393 p:P1352 ?s . ?s ps:P1352 ?obj . ?s pq:P641 wd:Q18123880 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'rank', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jimmy Connors', 'p': 'rank', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sport', 'o': 'tennis singles'}}}

 Q: What is <modified version of> of <Over the Rainbow> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P5059 wd:Q161402}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'modified version of', 'o': 'Over the Rainbow'}

 Q: What is {followed by} and {follows} of {{Lothair I} has {noble title} as {monarch of Italy}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lothair I', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lothair I', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'monarch of Italy'}}}]

 Q: what is the {start time} for {Bangalore} has {located in the administrative territorial entity} as {Mysore State} ?
 SPARQL: SELECT ?value WHERE { wd:Q1355 p:P131 ?s . ?s ps:P131 wd:Q3374892 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bangalore', 'p': 'located in the administrative territorial entity', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'located in the administrative territorial entity', 'o': 'Mysore State'}}}

 Q: When is {date of death} of {Luca Pacioli} whose {earliest date} is {1517-4-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q87620 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1517')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Luca Pacioli', 'p': 'date of death', 'o': '?x0', 't': '1517'}

 Q: What is tutor Andreas Vesalius' career?
 SPARQL: SELECT ?answer WHERE { wd:Q170267 wdt:P1066 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'career', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andreas Vesalius', 'p': 'tutor', 'o': '$y0'}}

 Q: When did Wuppertal have a population of 345,425?
 SPARQL: SELECT ?value WHERE { wd:Q2107 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'345425.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Wuppertal', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '345425.0'}, 't': '?x0'}

 Q: What capital of the Tran dynasty has a position of 105.841?
 SPARQL: SELECT ?answer WHERE { wd:Q3111454 wdt:P36 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'105.841'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tran dynasty', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'position', 'o': '105.841'}}

 Q: What is {music by} of {Gayane}, that has {born on} is {1903-6-6} ?
 SPARQL: SELECT ?answer WHERE { wd:Q539437 wdt:P86 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1903'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gayane', 'p': 'music by', 'o': '?x0', 't': '1903'}

 Q: Did {Tonya_Harding} {sport} {pair skating}?
 SPARQL: ASK WHERE { wd:Q236278 wdt:P641 wd:Q1682809 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Tonya Harding', 'p': 'sport', 'o': '?x0', '?x0': 'pair skating'}]

 Q: Is the quantity of Sandbox on December 12th less than 9.6?
 SPARQL: ASK WHERE { wd:Q5248913 wdt:P1106 ?obj filter(?obj < 9.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'December 12', 'p': 'Sandbox-Quantity', 'o': '?x0', '?x0': '9.6'}

 Q: Give me {history of a country or state} that {facet of} {Israel} and which that starts with {'h'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj wdt:P1269 wd:Q801 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'history of a country or state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'Israel'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'h'}}

 Q: Give me {ancient monument} that {World Heritage criteria} {(iii)} and which that starts with {'g'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3395377 . ?sbj wdt:P2614 wd:Q23038977 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient monument', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'World Heritage criteria', 'o': '(iii)'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: Who is the {gene} for {genetic association} of {allergic rhinitis}
 SPARQL:  select distinct ?obj where { wd:Q272436 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'allergic rhinitis', 'p': 'genetic association', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: What is <Unifrance film ID> of <The Wages of Fear> ?
 SPARQL: select distinct ?answer where { wd:Q465773 wdt:P3961 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Wages of Fear', 'p': 'Unifrance film ID', 'o': '?x0'}

 Q: What was the population of Bermuda on 0-0-1988?
 SPARQL: SELECT ?obj WHERE { wd:Q23635 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bermuda', 'p': 'population', 'o': '?x0', 't': '1988'}

 Q: Give me {municipality of Norway} that starts with {'ø'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q755707 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'ø')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality of Norway'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'ø'}}

 Q: Mention the fictional human character murdered by Luke Skywalker
 SPARQL:  select distinct ?obj where { wd:Q51746 wdt:P157 ?obj . ?obj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Luke Skywalker', 'p': 'murdered by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional human'}}

 Q: What is <JMA Seismic Intensity Database ID> of <2011 Tōhoku earthquake and tsunami> ?
 SPARQL: select distinct ?answer where { wd:Q36204 wdt:P5182 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '2011 Tōhoku earthquake and tsunami', 'p': 'JMA Seismic Intensity Database ID', 'o': '?x0'}

 Q: Who contributed to the published works of El Mundo?
 SPARQL: select distinct ?answer where { ?answer wdt:P3919 wd:Q921217}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contributed to', 'o': 'El Mundo'}

 Q: Which is the GS1 Manufacturer code for Google?
 SPARQL: select distinct ?answer where { wd:Q95 wdt:P3193 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Google', 'p': 'GS1 Manufacturer code', 'o': '?x0'}

 Q: What are the political system which start with the letter totalitarianism
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28108 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'totalitarianism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political system'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'totalitarianism'}}

 Q: Which is the public company that has the material produced of Coca-Cola?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1056 wd:Q2813 . ?sbj wdt:P31 wd:Q891723 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'material produced', 'o': 'Coca-Cola', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public company'}}

 Q: What is the {designed by} and the {influenced by} of {JavaScript} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q2005 wdt:P287 ?ans_1 . wd:Q2005 wdt:P737 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'JavaScript', 'p': 'designed by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'JavaScript', 'p': 'influenced by', 'o': '?x1'}]

 Q: What is the {human} for {creator} of {Esperanto}
 SPARQL:  select distinct ?obj where { wd:Q143 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Esperanto', 'p': 'created', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What series is World of Warcraft followed by?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q131007 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'World of Warcraft', 'p': 'series', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'series', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'World of Warcraft', 'p': 'series', 'o': '$y0'}}]

 Q: Where is the governmental capital of Ujjinakoppa?
 SPARQL: SELECT ?answer WHERE { wd:Q7878225 wdt:P131 ?X . ?X wdt:P36 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'capital', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ujjinakoppa', 'p': 'in', 'o': '$y0'}}

 Q: What is {parent company of} of {alumnus of} of {Virgil Thomson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q544485 wdt:P69 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent company of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Virgil Thomson', 'p': 'alumnus of', 'o': '$y0'}}

 Q: What is {nominated for} of {Dianne Wiest} that is {statement is subject of} is {67th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q217573 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857001 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dianne Wiest', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '67th Academy Awards'}}}

 Q: : Does Zhigulevskoye has alcohol by volume equal to 4.8
 SPARQL: ASK WHERE { wd:Q134899 wdt:P2665 ?obj filter(?obj = 4.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Zhigulevskoye', 'p': 'alcohol by volume', 'o': '?x0', '?x0': '4.8'}

 Q: Tell me me a municipality whose name consist of the word "barcelona" and whose patron saint Virgin Mary
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15284 . ?sbj wdt:P417 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'barcelona')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'municipality', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Virgin Mary'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'barcelona'}}

 Q: What is {book publisher} of {on the tracklist of} of {Examining the race-specific prevalence of hidradenitis suppurativa at a large academic center; results from a retrospective chart review.} ?
 SPARQL: SELECT ?answer WHERE { wd:Q38716727 wdt:P1433 ?X . ?X wdt:P123 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Examining the race-specific prevalence of hidradenitis suppurativa at a large academic center; results from a retrospective chart review.', 'p': 'on the tracklist of', 'o': '$y0'}}

 Q: Who is the operator and builder of the Bombardier Dash 8?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q736765 wdt:P137 ?ans_1 . wd:Q736765 wdt:P176 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Bombardier Dash 8', 'p': 'operator', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Bombardier Dash 8', 'p': 'builder', 'o': '?x1'}]

 Q: How many position held are by the lieutenant general?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P39 wd:Q152951 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'position held', 'o': 'lieutenant general'}

 Q: What is the {fictional profession} for {opposite of} of {superhero}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P461 wd:Q188784 . ?sbj wdt:P31 wd:Q17305127 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'opposite of', 'o': 'superhero', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional profession'}}

 Q: Which is the two-part episode for the series The X-Files?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21664088 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'The X-Files', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'two-part episode'}}

 Q: What is {birthdate} of {kids} of {Teodoro Obiang Nguema Mbasogo} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57385 wdt:P40 ?X . ?X wdt:P569 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'birthdate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Teodoro Obiang', 'p': 'child', 'o': '$y0'}}

 Q: Which is part of the ecology?
 SPARQL: select distinct ?answer where { wd:Q7150 wdt:P361 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ecology', 'p': 'part of', 'o': '?x0'}

 Q: What was the population of Little Rock as of 2/4/1935?
 SPARQL: SELECT ?value WHERE { wd:Q33405 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'193524')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Little Rock', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '193524'}, 't': '?x0'}

 Q: Which is the male given name for the language of work in Russian?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q12308941 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language of work', 'o': 'Russian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'male given name'}}

 Q: What are the Luther city which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Luther city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Who is the  {Turkish bath} for {named after} of {Suleiman the Magnificent}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P138 wd:Q8474 . ?sbj wdt:P31 wd:Q28077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'named after', 'o': 'Suleiman the Magnificent', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Turkish bath'}}

 Q: What is {played by} of {sequel of} of {Romance Revisited: The Love Songs of Jose Mari Chan} ?
 SPARQL: SELECT ?answer WHERE { wd:Q12508854 wdt:P155 ?X . ?X wdt:P175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Romance Revisited: The Love Songs of Jose Mari Chan', 'p': 'sequel of', 'o': '$y0'}}

 Q: What is {award received} of {André Gide} that is {prize money} is {146115.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q47484 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'146115.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andre Gide', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '146115.0'}}}

 Q: Which is the Open Library ID for Albert Ellis?
 SPARQL: select distinct ?answer where { wd:Q313931 wdt:P648 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Albert Ellis', 'p': 'Open Library ID', 'o': '?x0'}

 Q: Which business division does The Walt Disney Company belong to?
 SPARQL:  select distinct ?obj where { wd:Q7414 wdt:P199 ?obj . ?obj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Walt Disney Company', 'p': 'business division', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: How many {honorific prefix} are to/by {Dame} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P511 wd:Q901407 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'honorific prefix', 'o': 'dame'}

 Q: What is the {human} for {relative} of {Heinrich Himmler}
 SPARQL:  select distinct ?obj where { wd:Q43067 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Heinrich Himmler', 'p': 'relative', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {university} for {employer} of {Linus Pauling}
 SPARQL:  select distinct ?obj where { wd:Q48983 wdt:P108 ?obj . ?obj wdt:P31 wd:Q3918 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Linus Pauling', 'p': 'employer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university'}}

 Q: Which means {World Golf Hall of Fame player ID} for{Tom Watson} ?
 SPARQL: select distinct ?answer where { wd:Q532111 wdt:P4461 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tom Watson', 'p': 'World Golf Hall of Fame player ID', 'o': '?x0'}

 Q: When did Henry Steele Commager receive his education from the University of Chicago ?
 SPARQL: SELECT ?value WHERE { wd:Q3785004 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Steele Commager', 'p': 'education', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'education', 'o': 'University of Chicago'}}}

 Q: Which Chinese character has the tallest stroke count?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'stroke count', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Chinese character'}}

 Q: What is on the coast of Aleutian Islands, that has a tributary in Los Angeles River?
 SPARQL: SELECT ?answer WHERE { wd:Q119285 wdt:P206 ?answer . ?answer wdt:P974 wd:Q542965}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aleutian Islands', 'p': 'on the coast of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Los Angeles River'}}

