 Q: What is the {human} for {student} of {Ip Man}
 SPARQL:  select distinct ?obj where { wd:Q163830 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ip Man', 'p': 'student', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the arrondissement of Cathedral of Santiago de Compostela, and has a partner town of Mashhad?
 SPARQL: SELECT ?answer WHERE { wd:Q205136 wdt:P131 ?answer . ?answer wdt:P190 wd:Q121157}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cathedral of Santiago de Compostela', 'p': 'town', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Mashhad'}}

 Q: Which is the video game of the series of Call of Duty?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P179 wd:Q192156 . ?sbj wdt:P31 wd:Q7889 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'series', 'o': 'Call of Duty', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game'}}

 Q: what are the military rank which starts with s
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56019 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'military rank'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What is {pronunciation audio} of {cattle} that is {language of work or name} is {Tamil} ?
 SPARQL: SELECT ?obj WHERE { wd:Q830 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q5885 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'cattle', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'Tamil'}}}

 Q: what is the {point in time} for {Imus} has {population} as {301624.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q63145 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'301624.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Imus', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '301624.0'}, 't': '?x0'}

 Q: Which extrasolar planet within the constellation Aquarius has the smallest radius?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q44559 . ?ent wdt:P2120 ?obj . ?ent wdt:P59 wd:Q10576} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'radius', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'extrasolar planet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'constellation', 'o': 'Aquarius'}}}

 Q: Give me {aspect of history} that starts with {'r'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of history'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: what is the {point in time} for {Sacha Baron Cohen} has {award received} as {Los Angeles Film Critics Association Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q29055 p:P166 ?s . ?s ps:P166 wd:Q503034 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Sacha Baron Cohen', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Los Angeles Film Critics Association Award for Best Actor'}, 't': '?x0'}

 Q: "Which is {uses language} of {Imre Kertész}, that has {AWLD status} is {1 safe} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q47755 wdt:P1412 ?answer . ?answer wdt:P1999 wd:Q20672086}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Imre Kertész', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'AWLD status', 'o': '1 safe'}}

 Q: what is the {determination method} for {Badalona} has {population} as {217210.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q15468 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'217210.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Badalona', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '217210.0'}}}

 Q: Is the member count of the Club of Rome 80.0?
 SPARQL: ASK WHERE { wd:Q107569 wdt:P2124 ?obj filter(?obj = 80.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Club of Rome', 'p': 'member count', 'o': '?x0', '?x0': '80.0'}

 Q: What is {human population} of {located in the administrative territorial entity} of {Madeira} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26253 wdt:P131 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Madeira', 'p': 'in', 'o': '$y0'}}

 Q: What is <Gran Enciclopèdia Catalana ID> of <Yue Fei> ?
 SPARQL: select distinct ?answer where { wd:Q334398 wdt:P1296 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Yue Fei', 'p': 'Gran Enciclopèdia Catalana ID', 'o': '?x0'}

 Q: What is <class> of <dessert> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2308 wd:Q182940}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'class', 'o': 'dessert'}

 Q: When did Ray Bradbury get the doctor honoris causa degree?
 SPARQL: SELECT ?value WHERE { wd:Q40640 p:P512 ?s . ?s ps:P512 wd:Q11415564 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ray Bradbury', 'p': 'degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'doctor honoris causa'}, 't': '?x0'}

 Q: Is the fee of the Ueno Zoo greater than 240.0?
 SPARQL: ASK WHERE { wd:Q162722 wdt:P2555 ?obj filter(?obj > 240.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Ueno Zoo', 'p': 'fee', 'o': '?x0', '?x0': '240.0'}

 Q: Which is {birthplace} {state} of {Victor Emmanuel I of Sardinia} ?
 SPARQL: SELECT ?answer WHERE { wd:Q175250 wdt:P19 ?X . ?X wdt:P17 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'state', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Victor Emmanuel I of Sardinia', 'p': 'birthplace', 'o': '$y0'}}

 Q: Give me {comic genre} that starts with {'n'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comic genre'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'n'}}

 Q: What is the career of the creators of The Sims?
 SPARQL: SELECT ?answer WHERE { wd:Q4897444 wdt:P170 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'career', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Sims', 'p': 'creator', 'o': '$y0'}}

 Q: When was the population of Special Region of Yogyakarta 3,542,078?
 SPARQL: SELECT ?value WHERE { wd:Q3741 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'3542078')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Special Region of Yogyakarta', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '3542078'}, 't': '?x0'}

 Q: How many first aid measures are there for mercury poisoning?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q408089 wdt:P2239 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'mercury poisoning', 'p': 'first aid measures', 'o': '?x0'}

 Q: Tell me railroad line whose name has the word schluff in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'schluff')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railroad line'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'schluff'}}

 Q: What is the {fictional human} for {present in work} of {Macbeth}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1441 wd:Q130283 . ?sbj wdt:P31 wd:Q15632617 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'present in work', 'o': 'Macbeth', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional person'}}

 Q: Who is the person of the family of House of Medici?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P53 wd:Q170022 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'family', 'o': 'House of Medici', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person'}}

 Q: What is {treatment} of {hypertension}, that has {treats} is {hypersalivation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41861 wdt:P2176 ?answer . ?answer wdt:P2175 wd:Q761862}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'hypertension', 'p': 'treatment', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'treats', 'o': 'hypersalivation'}}

 Q: How many anthems are by God Save the Queen?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P85 wd:Q40807 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'anthem', 'o': 'God Save the Queen'}

 Q: What is the {sovereign state} for {significant event} of {Indian independence movement}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Indian Independence Movement', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: Which is the Trustpilot company ID for Wikipedia?
 SPARQL: select distinct ?answer where { wd:Q52 wdt:P5161 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wikipedia', 'p': 'Trustpilot company ID', 'o': '?x0'}

 Q: Which is National Gallery of Canada artist ID for Camille Pissarro?
 SPARQL: select distinct ?answer where { wd:Q134741 wdt:P5368 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Camille Pissarro', 'p': 'National Gallery of Canada artist ID', 'o': '?x0'}

 Q: What is the economic activity that starts with the letter 'v'?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8187769 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic activity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: What is {is in the county of} of {Jigawa State}, that has {administrative centre} is {Abuja} ?
 SPARQL: SELECT ?answer WHERE { wd:Q682691 wdt:P131 ?answer . ?answer wdt:P36 wd:Q3787}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jigawa State', 'p': 'is in the county of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'administrative centre', 'o': 'Abuja'}}

 Q: Iggy Pop is a member of what band?
 SPARQL:  select distinct ?obj where { wd:Q182665 wdt:P463 ?obj . ?obj wdt:P31 wd:Q215380 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iggy Pop', 'p': 'member of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'band'}}

 Q: what is the {type of kinship} for {Adolf Hitler} has {relative} as {Johanna Hiedler} ?
 SPARQL: SELECT ?value WHERE { wd:Q352 p:P1038 ?s . ?s ps:P1038 wd:Q6216378 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adolf Hitler', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Johanna Hiedler'}}}

 Q: What is {award received} of {Nikolai Kryuchkov} that is {point in time} is {1980-12-23} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1196388 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1980')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nikolai Kryuchkov', 'p': 'award', 'o': '?x0', 't': '1980'}

 Q: Tell me about position held of Vladimir Putin and manager/director?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7747 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1037 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'manager', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Putin', 'p': 'position held', 'o': '$y0'}}]

 Q: How many {designated as terrorist by} are for {Hezbollah} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q41053 wdt:P3461 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Hezbollah', 'p': 'designated as terrorist by', 'o': '?x0'}

 Q: which is the {determination method} for {Montana} where {population} as {559456.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q1212 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'559456.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Montana', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '559456.0'}}}

 Q: What is {personal name} of {Isaac Fawkes}, that has {same as} is {Isaach} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6076303 wdt:P735 ?answer . ?answer wdt:P460 wd:Q30231991}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isaac Fawkes', 'p': 'personal name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Isaach'}}

 Q: Which is the character role of Luciano Pavarotti?
 SPARQL: select distinct ?answer where { wd:Q37615 wdt:P453 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Luciano Pavarotti', 'p': 'character role', 'o': '?x0'}

 Q: Which is the doctoral thesis of Dorothy Hodgkin?
 SPARQL: select distinct ?answer where { wd:Q7487 wdt:P1026 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Dorothy Hodgkin', 'p': 'thesis', 'o': '?x0'}

 Q: Is the electrical resistivity of Grivory GM-4H equal to 1000000000000?
 SPARQL: ASK WHERE { wd:Q57051271 wdt:P5679 ?obj filter(?obj = 1000000000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Grivory GM-4H', 'p': 'electrical resistivity', 'o': '?x0', '?x0': '1000000000000'}

 Q: What is the {public office} for {officeholder} of {Jacinda Ardern}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1308 wd:Q3606816 . ?sbj wdt:P31 wd:Q294414 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'officeholder', 'o': 'Jacinda Ardern', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public office'}}

 Q: What determination method Washington uses for its population 1.14199e+06?
 SPARQL: SELECT ?value WHERE { wd:Q1223 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.14199e+06')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Washington', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.14199e+06'}}}

 Q: What is the {craft} for {occupation} of {Joseph}
 SPARQL:  select distinct ?obj where { wd:Q128267 wdt:P106 ?obj . ?obj wdt:P31 wd:Q2207288 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joseph', 'p': 'occupation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'craft'}}

 Q: What is the {member of sports team} and the {position played on team / speciality} of {Tom_Brady} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q313381 wdt:P54 ?ans_1 . wd:Q313381 wdt:P413 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Tom Brady', 'p': 'team', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Tom Brady', 'p': 'position played on team / speciality', 'o': '?x1'}]

 Q: Is George O'Leary's number of losses of less than 121.2?
 SPARQL: ASK WHERE { wd:Q5542970 wdt:P1356 ?obj filter(?obj < 121.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': "George O'Leary", 'p': 'number of losses', 'o': '?x0', '?x0': '121.2'}

 Q: What is <companion of> of <Proxima Centauri> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P399 wd:Q14266}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'companion of', 'o': 'Proxima Centauri'}

 Q: When did landlocked country for currency of Russian ruble?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q123480 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Russian ruble', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landlocked country'}}

 Q: What is the {consolidated city-county} for {twinned administrative body} of {Thessaloniki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q17151 . ?sbj wdt:P31 wd:Q3301053 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Thessaloniki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'consolidated city-county'}}

 Q: What is the total assets owned by the Royal Dutch Shell?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q154950 wdt:P2403 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Royal Dutch Shell', 'p': 'total assets', 'o': '?x0'}

 Q: Who was Andrei Konchalovsky's spouse from 1965-1-1 onward?
 SPARQL: SELECT ?obj WHERE { wd:Q55208 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1965')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Andrei Konchalovsky', 'p': 'spouse', 'o': '?x0', 't': '1965'}

 Q: Which is the cipM poet ID of John Cage?
 SPARQL: select distinct ?answer where { wd:Q180727 wdt:P5393 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Cage', 'p': 'cipM poet ID', 'o': '?x0'}

 Q: Who was Kim Basinger's husband until 2002?
 SPARQL: SELECT ?obj WHERE { wd:Q131380 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2002')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kim Basinger', 'p': 'husband', 'o': '?x0', 't': '2002'}

 Q: Is it true that the production rate of Volvo is greater than 427465.6?
 SPARQL: ASK WHERE { wd:Q215293 wdt:P2197 ?obj filter(?obj > 427465.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Volvo', 'p': 'production rate', 'o': '?x0', '?x0': '427465.6'}

 Q: What books were illustrated by William Blake?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P110 wd:Q41513 . ?sbj wdt:P31 wd:Q571 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'illustrated by', 'o': 'William Blake', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'book'}}

 Q: Tell me firearm whose name has the word shotgun in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12796 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shotgun')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'firearm'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'shotgun'}}

 Q: What are the ancient city which start with the letter zemar
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15661340 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zemar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ancient city'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zemar'}}

 Q: which is the {type of kinship} for {Jesse Louis Lasky} whose {relative} as {Samuel Goldwyn} ?
 SPARQL: SELECT ?value WHERE { wd:Q1384661 p:P1038 ?s . ?s ps:P1038 wd:Q72579 . ?s pq:P1039 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kinship', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jesse Louis Lasky', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'relative', 'o': 'Samuel Goldwyn'}}}

 Q: What is the {youth organization} for {official language} of {Hebrew}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P37 wd:Q9288 . ?sbj wdt:P31 wd:Q1572070 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Hebrew', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'youth organization'}}

 Q: what is the {end time} for {Charlie's Angels} has {cast member} as {Tanya Roberts} ?
 SPARQL: SELECT ?value WHERE { wd:Q617274 p:P161 ?s . ?s ps:P161 wd:Q232356 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Charlie's Angels", 'p': 'cast member', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cast member', 'o': 'Tanya Roberts'}}}

 Q: Where is the location of the river source for the Hudson River?
 SPARQL: SELECT ?obj WHERE { wd:Q3140 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hudson River', 'p': 'location', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for', 'o': 'river source'}}}

 Q: who is the Vidhan Sabha for legislative body of Assam?
 SPARQL:  select distinct ?obj where { wd:Q1164 wdt:P194 ?obj . ?obj wdt:P31 wd:Q3091020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Assam', 'p': 'legislative body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Vidhan Sabha'}}

 Q: Wikipedia is the operator of what foundation?
 SPARQL:  select distinct ?obj where { wd:Q52 wdt:P137 ?obj . ?obj wdt:P31 wd:Q157031 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Wikipedia', 'p': 'operator', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'foundation'}}

 Q: Which Hanseatic city has a twinned administrative body of Thessaloniki?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q17151 . ?sbj wdt:P31 wd:Q707813 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Thessaloniki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Hanseatic city'}}

 Q: What is {position held} of {Gerry Adams} that is {end cause} is {dissolution of parliament} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76139 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 wd:Q741182 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gerry Adams', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'end cause', 'o': 'dissolution of parliament'}}}

 Q: Was Billy Joel a member of the Billy Joel Band?
 SPARQL: ASK WHERE { wd:Q194333 wdt:P463 wd:Q4912802 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Billy Joel', 'p': 'member of', 'o': '?x0', '?x0': 'Billy Joel Band'}]

 Q: Which is {award received} of {Annie Leibovitz} where {point in time} is {2003-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q225283 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Annie Leibovitz', 'p': 'award received', 'o': '?x0', 't': '2003'}

 Q: Was cancer the cause of death of Paul Newman?
 SPARQL: ASK WHERE { wd:Q41871 wdt:P509 wd:Q12078 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Paul Newman', 'p': 'cause of death', 'o': '?x0', '?x0': 'cancer'}]

 Q: Give me {space program} that contains the word {space} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60054001 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'space')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space program'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'space'}}

 Q: Which are the coordinates of the point of view for Bliss?
 SPARQL: select distinct ?answer where { wd:Q2368 wdt:P1259 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bliss', 'p': 'coordinates of the point of view', 'o': '?x0'}

 Q: tell me railway tunnel that contains the word tunel in the name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tünel')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'railway tunnel'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tünel'}}

 Q: Which  is party chief representative of Xi Jinping ?
 SPARQL: select distinct ?answer where { ?answer wdt:P210 wd:Q15031}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'party chief representative', 'o': 'Xi Jinping'}

 Q: What are the thunder god which start with the letter zeus
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q842697 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'thunder god'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zeus'}}

 Q: Who is the organizer of FIFA World Cup?
 SPARQL: select distinct ?answer where { wd:Q19317 wdt:P664 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'FIFA World Cup', 'p': 'organizer', 'o': '?x0'}

 Q: Which is the genomic end of RHO?
 SPARQL: select distinct ?answer where { wd:Q14859555 wdt:P645 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'RHO', 'p': 'genomic end', 'o': '?x0'}

 Q: What country is located in the administrative territorial entity of Khyber Pakhtunkhwa?
 SPARQL:  select distinct ?obj where { wd:Q183314 wdt:P131 ?obj . ?obj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Khyber Pakhtunkhwa', 'p': 'located in the administrative territorial entity', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: Is it true that the electric charge of the pion equals to -1?
 SPARQL: ASK WHERE { wd:Q4097 wdt:P2200 ?obj filter(?obj = -1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'pion', 'p': 'electric charge', 'o': '?x0', '?x0': '-1'}

 Q: Amtrak is the owner of which tower station ?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P127 wd:Q23239 . ?sbj wdt:P31 wd:Q55484 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owner', 'o': 'Amtrak', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tower station'}}

 Q: What is {duty} of {prescribed drug} of {bipolar disorder} ?
 SPARQL: SELECT ?answer WHERE { wd:Q131755 wdt:P2176 ?X . ?X wdt:P2868 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'duty', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'bipolar disorder', 'p': 'prescribed drug', 'o': '$y0'}}

 Q: What is <medical examinations> of <phenotype> ?
 SPARQL: select distinct ?answer where { ?answer wdt:P923 wd:Q104053}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'medical examinations', 'o': 'phenotype'}

 Q: Name the spouse of Paavo Haavikko, who passed away on October 10, 2008.
 SPARQL: SELECT ?obj WHERE { wd:Q444876 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paavo Haavikko', 'p': 'spouse', 'o': '?x0', 't': '2008'}

 Q: When is {diplomatic relation} {comes from} {Hunger} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1062365 wdt:P495 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hunger', 'p': 'comes from', 'o': '$y0'}}

 Q: Who are the alumnus of Chris Burden whose Carnegie Classification of Institutions of Higher Education is exclusively undergraduate four-year?
 SPARQL: SELECT ?answer WHERE { wd:Q720832 wdt:P69 ?answer . ?answer wdt:P2643 wd:Q23623476}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Chris Burden', 'p': 'alumnus of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Carnegie Classification of Institutions of Higher Education', 'o': 'exclusively undergraduate four-year'}}

 Q: How many {discoverer or inventor} are to/by {Andrey Kolmogorov} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P61 wd:Q153224 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'discoverer or inventor', 'o': 'Andrey Kolmogorov'}

 Q: What is <Swimrankings.net swimmer ID> of <Ryan Lochte> ?
 SPARQL: select distinct ?answer where { wd:Q201517 wdt:P2640 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ryan Lochte', 'p': 'Swimrankings.net swimmer ID', 'o': '?x0'}

 Q: what is the {determination method} for {Iloilo City} has {population} as {334539.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q459787 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'334539.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iloilo City', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '334539.0'}}}

 Q: What is key event of h capital that has Grand Duchy of Moscow ?
 SPARQL: SELECT ?answer WHERE { wd:Q170770 wdt:P36 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key event', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Grand Duchy of Moscow', 'p': 'capital', 'o': '$y0'}}

 Q: What is the Official name of Lahore?
 SPARQL: select distinct ?answer where { wd:Q11739 wdt:P1448 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lahore', 'p': 'name', 'o': '?x0'}

 Q: What is {form of government} of {national of} of {William Kidd} ?
 SPARQL: SELECT ?answer WHERE { wd:Q26558 wdt:P27 ?X . ?X wdt:P122 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'form of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Kidd', 'p': 'national of', 'o': '$y0'}}

 Q: Which is the PhilPapers publication ID of Mind?
 SPARQL: select distinct ?answer where { wd:Q1936338 wdt:P3236 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Mind', 'p': 'PhilPapers publication ID', 'o': '?x0'}

 Q: What is the {historical Chinese state} for {replaced by} of {Yuan dynasty}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1366 wd:Q7313 . ?sbj wdt:P31 wd:Q50068795 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Yuan', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical Chinese state'}}

 Q: who is the birth house for place of birth of Ronald Reagan?
 SPARQL:  select distinct ?obj where { wd:Q9960 wdt:P19 ?obj . ?obj wdt:P31 wd:Q19979289 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ronald Reagan', 'p': 'place of birth', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'birth house'}}

 Q: Tell me about the state in the Confederation of the Rhine located in the administrative territorial entity of Weimar Republic.
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q41304 . ?sbj wdt:P31 wd:Q26879769 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'located in the administrative territorial entity', 'o': 'Weimar Republic', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state in the Confederation of the Rhine'}}

 Q: What is in the  MCN code of fuel oil ?
 SPARQL: select distinct ?answer where { wd:Q214199 wdt:P1987 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'fuel oil', 'p': 'MCN code', 'o': '?x0'}

