 Q: What is an international association football national teams competition that starts with the letter c.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542827 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international association football national teams competition'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'c'}}

 Q: Which season is the opposite of midnight sun based on the naming criteria used?
 SPARQL: SELECT ?obj WHERE { wd:Q774621 p:P461 ?s . ?s ps:P461 ?obj . ?s pq:P1013 wd:Q24384 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'opposite of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'midnight sun', 'p': 'opposite of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'criteria used', 'o': 'season'}}}

 Q: What is the {commune of France} for {twinned administrative body} of {Bilbao}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P190 wd:Q8692 . ?sbj wdt:P31 wd:Q484170 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'twinned administrative body', 'o': 'Bilbao', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France'}}

 Q: Which is the Académie des sciences d'outre-mer member ID for Aimé Césaire?
 SPARQL: select distinct ?answer where { wd:Q223955 wdt:P5374 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aimé Césaire', 'p': "Académie des sciences d'outre-mer member ID", 'o': '?x0'}

 Q: Who was {participant in conflict} of {sister} {Emilio Polli} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3724488 wdt:P3373 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Emilio Polli', 'p': 'sister', 'o': '$y0'}}

 Q: What is {educated at} of {Niels Bohr} and {doctoral thesis}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q7085 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P1026 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'thesis', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Niels Bohr', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Niels Bohr', 'p': 'educated at', 'o': '$y0'}}]

 Q: when was Linus Pauling nominated for a Nobel Prize in Chemistry
 SPARQL: SELECT ?value WHERE { wd:Q48983 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Linus Pauling', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Chemistry'}, 't': '?x0'}

 Q: What is the {film} for {fictional universe described in} of {Marvel Cinematic Universe}
 SPARQL:  select distinct ?obj where { wd:Q642878 wdt:P1445 ?obj . ?obj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marvel Cinematic Universe', 'p': 'fictional universe described in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: Which is the CycleBase cyclist ID for Greg LeMond?
 SPARQL: select distinct ?answer where { wd:Q312697 wdt:P4508 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Greg LeMond', 'p': 'CycleBase cyclist ID', 'o': '?x0'}

 Q: Which is the pregnancy category for penicillin?
 SPARQL: select distinct ?answer where { wd:Q12190 wdt:P3489 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'penicillin', 'p': 'pregnancy category', 'o': '?x0'}

 Q: What is the {landlocked country} for {located on terrain feature} of {East Asia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P706 wd:Q27231 . ?sbj wdt:P31 wd:Q123480 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'East Asia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'landlocked country'}}

 Q: What is {has administrative divisions} of {Nicaragua}, that has {location} is {11.85 -86.2} ?
 SPARQL: SELECT ?answer WHERE { wd:Q811 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'11.85 -86.2'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nicaragua', 'p': 'has administrative divisions', 'o': '?x0'}

 Q: What is {given name} of {Louis Agassiz} that is {series ordinal} is {1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q122972 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter(contains(?x,'1')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'first name', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Louis Agassiz', 'p': 'first name', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '1'}}}

 Q: "What is the co-ordinate location  -90.0? do not to be confused with of the Western world
 SPARQL: SELECT ?answer WHERE { wd:Q160381 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-90.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Western world', 'p': 'confused with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'co-ordinate location', 'o': '-90.0'}}

 Q: What is {nominated for} of {Rachel McAdams} that is {statement is subject of} is {88th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q190386 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q20022969 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rachel McAdams', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '88th Academy Awards'}}}

 Q: Who is Michel Houellebecq's role model, that works as a librarian?
 SPARQL: SELECT ?answer WHERE { wd:Q103114 wdt:P737 ?answer . ?answer wdt:P106 wd:Q182436}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michel Houellebecq', 'p': 'role model', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'work', 'o': 'librarian'}}

 Q: What is Sybaris' Digital Atlas of the Roman Empire ID?
 SPARQL: select distinct ?answer where { wd:Q220583 wdt:P1936 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sybaris', 'p': 'Digital Atlas of the Roman Empire ID', 'o': '?x0'}

 Q: Who was the dedicatee at the place of interment for Jude the Apostle?
 SPARQL: SELECT ?answer WHERE { wd:Q43945 wdt:P119 ?X . ?X wdt:P825 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'dedicatee', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jude the Apostle', 'p': 'interment', 'o': '$y0'}}

 Q: What is the {republican regime in France} for {head of state} of {Emmanuel Macron}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P35 wd:Q3052772 . ?sbj wdt:P31 wd:Q17152708 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of state', 'o': 'Emmanuel Macron', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'republican regime in France'}}

 Q: What was the end time for Eino Kaila's spouse Anna Snellman-Kaila?
 SPARQL: SELECT ?value WHERE { wd:Q670103 p:P26 ?s . ?s ps:P26 wd:Q11851614 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eino Kaila', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Anna Snellman-Kaila'}}}

 Q: What is {victory} of {Jackie Stewart} that is {point in time} is {1969-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3188 p:P2522 ?s . ?s ps:P2522 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jackie Stewart', 'p': 'victory', 'o': '?x0', 't': '1969'}

 Q: Tell me social networking service whose name has the word yak in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3220391 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yak')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social networking service'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'yak'}}

 Q: Who was the partner of Edith Piaf in 1948?
 SPARQL: SELECT ?obj WHERE { wd:Q1631 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1948')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Edith Piaf', 'p': 'partner', 'o': '?x0', 't': '1948'}

 Q: What is {start time} and {end time} of {{Abigail Adams} has {spouse} as {John Adams}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P26 ?s . ?s ps:P26 wd:Q11806 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'John Adams'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'end time', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'John Adams'}}}]

 Q: Give me {Pavo} that starts with {'p'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Pavo'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: How many languages did Oscar Wilde speak, write, or sign?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q30875 wdt:P1412 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Oscar Wilde', 'p': 'language', 'o': '?x0'}

 Q: Tell me the name of Thomas Piketty's spouse as of 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q984448 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Thomas Piketty', 'p': 'spouse', 'o': '?x0', 't': '2014'}

 Q: What is the {whistleblower platform} for {author} of {Julian Assange}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P50 wd:Q360 . ?sbj wdt:P31 wd:Q1344897 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'author', 'o': 'Julian Assange', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'whistleblower platform'}}

 Q: Which is the mushroom ecological type of parasitism?
 SPARQL: select distinct ?answer where { ?answer wdt:P788 wd:Q186517}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'mushroom ecological type', 'o': 'parasitism'}

 Q: What thermodynamic potential starts with the letter "g"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2420179 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'thermodynamic potential'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'g'}}

 Q: Which is the IEDB Epitope ID for L-Serine?
 SPARQL: select distinct ?answer where { wd:Q183290 wdt:P4168 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'L-Ser', 'p': 'IEDB Epitope ID', 'o': '?x0'}

 Q: What religious order did Augustine of Hippo belong to?
 SPARQL:  select distinct ?obj where { wd:Q8018 wdt:P611 ?obj . ?obj wdt:P31 wd:Q2061186 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Augustine of Hippo', 'p': 'religious order', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious order'}}

 Q: who is the steamship for designed by of Isambard Kingdom Brunel?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q207380 . ?sbj wdt:P31 wd:Q12859788 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Isambard Kingdom Brunel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steamship'}}

 Q: Which is an academic major studied by Nubia?
 SPARQL:  select distinct ?obj where { wd:Q135028 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q4671286 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nubia', 'p': 'studied by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'academic major'}}

 Q: what is the {start time} for {Metz} has {located in the administrative territorial entity} as {Moselle} ?
 SPARQL: SELECT ?value WHERE { wd:Q22690 p:P131 ?s . ?s ps:P131 wd:Q12652 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Metz', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Moselle'}}}

 Q: Was Megyn Kelly CNN employer ?
 SPARQL: ASK WHERE { wd:Q293260 wdt:P108 wd:Q48340 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Megyn Kelly', 'p': 'employer', 'o': '?x0', '?x0': 'CNN'}]

 Q: what is the {end time} for {John Winthrop} has {position held} as {Governor of the Massachusetts Bay Colony} ?
 SPARQL: SELECT ?value WHERE { wd:Q720766 p:P39 ?s . ?s ps:P39 wd:Q48955989 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Winthrop', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Governor of the Massachusetts Bay Colony'}}}

 Q: What is {position held} of {Justin Trudeau} that is {start time} is {2008-10-14} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3099714 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Justin Trudeau', 'p': 'position held', 'o': '?x0', 't': '2008'}

 Q: What is the isotope of lutetium with the highest half-life whose instance of is isotope of lutetium?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q618200 . ?ent wdt:P2114 ?obj . ?ent wdt:P31 wd:Q618200 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'half-life', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of lutetium'}}

 Q: What is {adjacent to} of {death location} of {Michelangelo Antonioni} ?
 SPARQL: SELECT ?answer WHERE { wd:Q55433 wdt:P20 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'adjacent to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michelangelo Antonioni', 'p': 'death location', 'o': '$y0'}}

 Q: Tell me the survival skill that followed by food presentation and which contains the word cooking in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P156 wd:Q3480053 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'survival skill', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'followed by', 'o': 'food presentation'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cooking'}}

 Q: Does Botnkrona Opp have an average gradient of less than 0.1884?
 SPARQL: ASK WHERE { wd:Q11962019 wdt:P2198 ?obj filter(?obj < 0.1884) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Botnkrona Opp', 'p': 'average gradient', 'o': '?x0', '?x0': '0.1884'}

 Q: What is the {sense} for {anatomical location} of {ear}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P927 wd:Q7362 . ?sbj wdt:P31 wd:Q173253 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'anatomical location', 'o': 'ear', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sense'}}

 Q: what is the {end time} for {Asturias} has {head of government} as {Sergio Marqués Fernández} ?
 SPARQL: SELECT ?value WHERE { wd:Q3934 p:P6 ?s . ?s ps:P6 wd:Q3181289 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asturias', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Sergio Marqués Fernández'}}}

 Q: Which position applies to the jurisdiction of Bilbao?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q8692 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'jurisdiction', 'o': 'Bilbao', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: What is the {place of death} and the {place of birth} of {Catherine_the_Great} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q36450 wdt:P20 ?ans_1 . wd:Q36450 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Catherine the Great', 'p': 'place of death', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Catherine the Great', 'p': 'place of birth', 'o': '?x1'}]

 Q: "Which is {language of work} of {L'après-midi d'un faune}, that has {name in official language} is {langue française} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q1880607 wdt:P407 ?answer . ?answer wdt:P1705 ?x FILTER(contains(?x,'langue française'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "L'après-midi d'un faune", 'p': 'language of work', 'o': '?x0'}

 Q: What is the musical instrument of the songwriter of "Piano Concerto No. 5"?
 SPARQL: SELECT ?answer WHERE { wd:Q239700 wdt:P86 ?X . ?X wdt:P1303 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'instrument', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piano Concerto No. 5', 'p': 'songwriter', 'o': '$y0'}}

 Q: How many {manifestation of} are to/by {UTF-8} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1557 wd:Q193537 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'UTF-8'}

 Q: Which is the weekly newspaper owner of which is StarWipe and contains the word onion in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj wdt:P1830 wd:Q21189788 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'onion')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'weekly newspaper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'StarWipe'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'onion'}}

 Q: What is {first name} of {Jules Léotard}, that has {is said to be the same as} is {Júlio} ?
 SPARQL: SELECT ?answer WHERE { wd:Q356388 wdt:P735 ?answer . ?answer wdt:P460 wd:Q6321687}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jules Léotard', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Júlio'}}

 Q: Where is the place of grave of Makarios III, founded in 1001-1-17?
 SPARQL: SELECT ?answer WHERE { wd:Q153509 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1001'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Makarios III', 'p': 'place of grave', 'o': '?x0', 't': '1001'}

 Q: Name the mascot for Iron Maiden.
 SPARQL:  select distinct ?obj where { wd:Q42482 wdt:P822 ?obj . ?obj wdt:P31 wd:Q18670161 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Iron Maiden', 'p': 'mascot', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mascot'}}

 Q: What is {founder} of {Cricket World Cup}, that has {has states} is {North East England} ?
 SPARQL: SELECT ?answer WHERE { wd:Q192202 wdt:P112 ?answer . ?answer wdt:P150 wd:Q47983}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cricket World Cup', 'p': 'founder', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has states', 'o': 'North East England'}}

 Q: Is the Ministry of Biblical and History Prophecy Symbols thickness less than 0.508
 SPARQL: ASK WHERE { wd:Q20537968 wdt:P2610 ?obj filter(?obj < 0.508) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Ministry of Biblical and History Prophecy Symbols', 'p': 'thickness', 'o': '?x0', '?x0': '0.508'}

 Q: What is {comes from} of {label} of {LCD Soundsystem} ?
 SPARQL: SELECT ?answer WHERE { wd:Q45752 wdt:P264 ?X . ?X wdt:P495 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'comes from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'LCD Soundsystem', 'p': 'label', 'o': '$y0'}}

 Q: What is the {procedural programming language} for {developer} of {Dennis M. Ritchie}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q28922885 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'developed by', 'o': 'Dennis M. Ritchie', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'procedural programming language'}}

 Q: What is {easterly} of {national of} of {Henry Luce} ?
 SPARQL: SELECT ?answer WHERE { wd:Q516473 wdt:P27 ?X . ?X wdt:P1334 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'easterly', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Luce', 'p': 'national of', 'o': '$y0'}}

 Q: What is the {human spaceflight} with the {MAX(orbits completed)} whose {instance of} is {spacecraft}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q752783 . ?ent wdt:P1418 ?obj . ?ent wdt:P31 wd:Q40218 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'orbits completed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human spaceflight', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'spacecraft'}}}

 Q: What is {diplomatic relation} of {citizen of} of {Dizzee Rascal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q366506 wdt:P27 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dizzee Rascal', 'p': 'citizen of', 'o': '$y0'}}

 Q: Which is the Ringgold ID for Kyoto University?
 SPARQL: select distinct ?answer where { wd:Q336264 wdt:P3500 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kyoto University', 'p': 'Ringgold ID', 'o': '?x0'}

 Q: When did publisher of Pac-Man and publication date?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q173626 p:P123 ?s . ?s ps:P123 ?obj . ?s pq:P577 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publication date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pac-Man', 'p': 'publisher', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'publisher', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pac-Man', 'p': 'publisher', 'o': '$y0'}}]

 Q: What is the {county of Oklahoma} for {located in the administrative territorial entity} of {Oklahoma City}
 SPARQL:  select distinct ?obj where { wd:Q34863 wdt:P131 ?obj . ?obj wdt:P31 wd:Q13414760 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Oklahoma City', 'p': 'is located in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'county of Oklahoma'}}

 Q: What award did Ousmane Sembène receive in 1966?
 SPARQL: SELECT ?obj WHERE { wd:Q314966 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ousmane Sembène', 'p': 'award', 'o': '?x0', 't': '1966'}

 Q: What is {mother} and {date of birth} of {{Charlemagne} has {child} as {Bertha, daughter of Charlemagne}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q827676 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'daughter', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'daughter', 'o': 'Bertha'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of birth', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'daughter', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'daughter', 'o': 'Bertha'}}}]

 Q: For what was Isabelle Adjani nominated for in the year 1995.
 SPARQL: SELECT ?obj WHERE { wd:Q106383 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1995')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Isabelle Adjani', 'p': 'nominated for', 'o': '?x0', 't': '1995'}

 Q: What is {to be distinguished from} of {pub}, that has {co-ordinates} is {25.9077 64.3467} ?
 SPARQL: SELECT ?answer WHERE { wd:Q212198 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'25.9077 64.3467'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'pub', 'p': 'distinguished from', 'o': '?x0'}

 Q: What is the son of Ja'far al-Sadiq whose sister is Asmaa Bint Jafar?
 SPARQL: SELECT ?answer WHERE { wd:Q170046 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q18595646}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Ja'far al-Sadiq", 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister', 'o': 'Asmaa Bint Jafar'}}

 Q: What is {open period from} and {closed on} of {{British Museum} has {open days} as {all weekdays}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 wd:Q26214163 . ?s pq:P3027 ?value1 . ?s pq:P3026 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'open period from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'open days', 'o': 'all weekdays'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'closed on', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'British Museum', 'p': 'open days', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'open days', 'o': 'all weekdays'}}}]

 Q: How much is to be replaced by the Canadian dollar?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1366 wd:Q1104069 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'replaced by', 'o': 'Canadian dollar'}

 Q: What award did Kiri Te Kanawa receive on 1/26/1990?
 SPARQL: SELECT ?obj WHERE { wd:Q380133 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kiri Te Kanawa', 'p': 'award', 'o': '?x0', 't': '1990'}

 Q: What is the {Mario franchise character} for {notable work} of {Shigeru Miyamoto}
 SPARQL:  select distinct ?obj where { wd:Q12382 wdt:P800 ?obj . ?obj wdt:P31 wd:Q33093124 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shigeru Miyamoto', 'p': 'notable work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Mario franchise character'}}

 Q: At what point in history did Cologne have a population of 1.0817e+06?
 SPARQL: SELECT ?value WHERE { wd:Q365 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'1.0817e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Cologne', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '1.0817e+06'}, 't': '?x0'}

 Q: IS THE SLOPE OF THE BLACK RUN EQAULS TO 50
 SPARQL: ASK WHERE { wd:Q1923663 wdt:P4184 ?obj filter(?obj = 50) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'black run', 'p': 'slope', 'o': '?x0', '?x0': '50'}

 Q: What is the oxidation state for nickel?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q744 wdt:P1121 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'nickel', 'p': 'oxidation state', 'o': '?x0'}

 Q: When Anna Netrebko was awarded State Prize of the Russian Federation?
 SPARQL: SELECT ?value WHERE { wd:Q78516 p:P166 ?s . ?s ps:P166 wd:Q4146631 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Anna Netrebko', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'State Prize of the Russian Federation'}, 't': '?x0'}

 Q: What is the {political party} for {chairperson} of {Aung San Suu Kyi}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q36740 . ?sbj wdt:P31 wd:Q7278 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Aung San Suu Kyi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political party'}}

 Q: what is the {field of work} for {Zubin Mehta} has {award received} as {Padma Vibhushan} ?
 SPARQL: SELECT ?value WHERE { wd:Q157635 p:P166 ?s . ?s ps:P166 wd:Q672392 . ?s pq:P101 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zubin Mehta', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Padma Vibhushan'}}}

 Q: What is the {political conspiracy} for {conflict} of {Guy Fawkes}
 SPARQL:  select distinct ?obj where { wd:Q13898 wdt:P607 ?obj . ?obj wdt:P31 wd:Q25446819 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Guy Fawkes', 'p': 'conflict', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'conspiracy'}}

 Q: Which dwarf elliptical galaxy for parent astronomical body of  Andromeda Galaxy
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P397 wd:Q2469 . ?sbj wdt:P31 wd:Q234077 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent astronomical body', 'o': 'Andromeda Galaxy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dwarf elliptical galaxy'}}

 Q: Was Seinfeld characters Cosmo Kramer and Jackie Chiles?
 SPARQL: ASK WHERE { wd:Q23733 wdt:P674 wd:Q2916792 . wd:Q23733 wdt:P674 wd:Q6116288 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Seinfeld', 'p': 'characters', 'o': '?x0', '?x0': 'Cosmo Kramer'}, {'h': 'IS', 'v': '?x1', 's': 'Seinfeld', 'p': 'characters', 'o': '?x1', '?x1': 'Jackie Chiles'}]

 Q: When did Philip K. Dick receive the Science Fiction Hall of Fame award?
 SPARQL: SELECT ?value WHERE { wd:Q171091 p:P166 ?s . ?s ps:P166 wd:Q7433537 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Philip K. Dick', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Science Fiction Hall of Fame'}, 't': '?x0'}

 Q: What is {award received} of {Paul Heyse} that is {prize money} is {140703.0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76487 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter(contains(?x,'140703.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Heyse', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'prize money', 'o': '140703.0'}}}

 Q: What is {pronunciation audio} of {language native} of {Guy de Maupassant} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9327 wdt:P103 ?X . ?X wdt:P443 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy de Maupassant', 'p': 'language native', 'o': '$y0'}}

 Q: What is the educational level of Joseph Koo, who has PIN Code 02215?
 SPARQL: SELECT ?answer WHERE { wd:Q698537 wdt:P69 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'02215'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joseph Koo', 'p': 'education', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'PIN Code', 'o': '02215'}}

 Q: Which is the language of the writing system of the Arabic alphabet?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q8196 . ?sbj wdt:P31 wd:Q34770 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'Arabic alphabet', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}}

 Q: Is the angular resolution of the Discovery Channel Telescope equal to .03?
 SPARQL: ASK WHERE { wd:Q1383460 wdt:P3439 ?obj filter(?obj = 0.03) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Discovery Channel Telescope', 'p': 'angular resolution', 'o': '?x0', '?x0': '0.03'}

 Q: What is {award received} of {Michael Collins} that is {for work} is {The Keepers of Truth} ?
 SPARQL: SELECT ?obj WHERE { wd:Q104859 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q7744059 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael Collins', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Keepers of Truth'}}}

