 Q: What is the {fictional company} for {creator} of {Jerry Seinfeld}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P170 wd:Q215506 . ?sbj wdt:P31 wd:Q5446565 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'creator', 'o': 'Jerry Seinfeld', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional company'}}

 Q: What is the {ethnic group} for {language used} of {Norwegian}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q41710 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Norwegian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ethnic group'}}

 Q: What is the {steam locomotive} with the {MAX(number of cylinders)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q171043 . ?ent wdt:P1100 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of cylinders', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'steam locomotive'}}

 Q: What is {created in document} of {source location of group/organisation} of {Dream Theater} ?
 SPARQL: SELECT ?answer WHERE { wd:Q162586 wdt:P740 ?X . ?X wdt:P457 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'created in document', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dream Theater', 'p': 'source location of group/organisation', 'o': '$y0'}}

 Q: Is  the number of graves of the Argentine Military Cemetery equal to 237?
 SPARQL: ASK WHERE { wd:Q772556 wdt:P2351 ?obj filter(?obj = 237) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Argentine Military Cemetery', 'p': 'number of graves', 'o': '?x0', '?x0': '237'}

 Q: What is {elected in} and {electoral district} of {{John Gorton} has {position held} as {Member of the Australian House of Representatives}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q356411 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value1 . ?s pq:P768 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Gorton', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'electoral district', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Gorton', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of the Australian House of Representatives'}}}]

 Q: Tell me religious belief whose name has the word pacha in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2728698 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pacha')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious belief'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pacha'}}

 Q: What is the age of the oldest person to have an award?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q618779 . ?ent wdt:P4135 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum age', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award'}}

 Q: What is {route of administration} of {has symptom} of {toluene} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15779 wdt:P1542 ?X . ?X wdt:P636 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'route of administration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'toluene', 'p': 'has symptom', 'o': '$y0'}}

 Q: What position in public office did Joko Widodo hold?
 SPARQL:  select distinct ?obj where { wd:Q3318231 wdt:P39 ?obj . ?obj wdt:P31 wd:Q294414 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Joko Widodo', 'p': 'public office', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'public office'}}

 Q: Alan Shearer is the member of what secondary national association football team ?
 SPARQL:  select distinct ?obj where { wd:Q483583 wdt:P54 ?obj . ?obj wdt:P31 wd:Q45053817 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Alan Shearer', 'p': 'team', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'secondary national association football team'}}

 Q: who sister city of location born of Shawn Stasiak ?
 SPARQL: SELECT ?answer WHERE { wd:Q999056 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sister city', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shawn Stasiak', 'p': 'location born', 'o': '$y0'}}

 Q: What is {has planet} of {orbits} of {Io} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3123 wdt:P397 ?X . ?X wdt:P398 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has planet', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Io', 'p': 'orbits', 'o': '$y0'}}

 Q: Which is the proxy war for the event of the Cuban Missile Crisis?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q128160 . ?sbj wdt:P31 wd:Q864113 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'event', 'o': 'Cuban Missile Crisis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'proxy war'}}

 Q: which is depicted by and immediate cause of Computer_network?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q1301371 wdt:P1299 ?ans_1 . wd:Q1301371 wdt:P1536 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'network', 'p': 'depicted by', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'network', 'p': 'immediate cause of', 'o': '?x1'}]

 Q: How many {item operated} are for {cook} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q156839 wdt:P121 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'cook', 'p': 'item operated', 'o': '?x0'}

 Q: Name a concept studied by sociology that starts with letter S
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj wdt:P2579 wd:Q21201 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'concept', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'sociology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: what is the {point in time} for {Robert Falcon Scott} has {award received} as {Scheele Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q102527 p:P166 ?s . ?s ps:P166 wd:Q15303658 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Robert Falcon Scott', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Scheele Award'}, 't': '?x0'}

 Q: Which kinship has the strongest family relationship degree?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q171318 . ?ent wdt:P4500 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'family relationship degree', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'kinship'}}

 Q: What is {percent of area that is water} of {deathplace} of {Thomas Brackett Reed} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2094078 wdt:P20 ?X . ?X wdt:P2927 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'percent of area that is water', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas Brackett Reed', 'p': 'deathplace', 'o': '$y0'}}

 Q: Which is the pair of enantiomers which starts with the letter t?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55662747 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'pair of enantiomers'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {superhero} for {member of} of {X-Men}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P463 wd:Q128452 . ?sbj wdt:P31 wd:Q188784 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'X-Men', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'superhero'}}

 Q: Is it true that the limiting oxygen index of the nylon 6-6 is less than 31.2?
 SPARQL: ASK WHERE { wd:Q7071155 wdt:P5929 ?obj filter(?obj < 31.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'nylon 6-6', 'p': 'limiting oxygen index', 'o': '?x0', '?x0': '31.2'}

 Q: What is {acop} of {formation} of {Thomas W. Steed} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7794787 wdt:P241 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'acop', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thomas W. Steed', 'p': 'formation', 'o': '$y0'}}

 Q: What award did Dmitry Khvorostovsky achieve in 1991?
 SPARQL: SELECT ?obj WHERE { wd:Q333201 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dmitry Khvorostovsky', 'p': 'award', 'o': '?x0', 't': '1991'}

 Q: Which muscle insertion is use over the rib?
 SPARQL: select distinct ?answer where { ?answer wdt:P3491 wd:Q196672}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'muscle insertion', 'o': 'rib'}

 Q: What is {location of death} of {Antonio Canova}, that has {category of associated people} is {Category:People from Venice} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5547 wdt:P20 ?answer . ?answer wdt:P1792 wd:Q7234650}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antonio Canova', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'category of associated people', 'o': 'Category:People from Venice'}}

 Q: What is {twinned administrative body} of {Vologda} that is {start time} is {2009-12-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1957 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vologda', 'p': 'twinned administrative body', 'o': '?x0', 't': '2009'}

 Q: What is {personal name} of {William George Beers}, that has {main events} is {most frequent first names at birth in Rotterdam (1811-1913)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3568653 wdt:P735 ?answer . ?answer wdt:P793 wd:Q21142040}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William George Beers', 'p': 'first name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'main events', 'o': 'most frequent first names at birth in Rotterdam (1811-1913)'}}

 Q: Which road leads to Seville?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P609 wd:Q8717 . ?sbj wdt:P31 wd:Q34442 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'to', 'o': 'Seville', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'road'}}

 Q: Who was the Anna Karina's husband in the year 1982?
 SPARQL: SELECT ?obj WHERE { wd:Q232113 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1982')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Anna Karina', 'p': 'husband', 'o': '?x0', 't': '1982'}

 Q: On September 21st, 1821, what degree did Jules Michelet have?
 SPARQL: SELECT ?obj WHERE { wd:Q310791 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1821')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jules Michelet', 'p': 'degree', 'o': '?x0', 't': '1821'}

 Q: Which works of Emma Watson have a Category II Filmiroda rating?
 SPARQL: SELECT ?answer WHERE { wd:Q39476 wdt:P800 ?answer . ?answer wdt:P2747 wd:Q23830577}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Emma Watson', 'p': 'work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'Filmiroda rating', 'o': 'Category II'}}

 Q: What is {coat of arms} of {state} of {Lake Winnebago} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1801110 wdt:P17 ?X . ?X wdt:P237 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coat of arms', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lake Winnebago', 'p': 'state', 'o': '$y0'}}

 Q: What is {part of constellation} of {planetary system} of {Messier 13} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11312 wdt:P397 ?X . ?X wdt:P59 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constellation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 13', 'p': 'planetary system', 'o': '$y0'}}

 Q: Is 0 the the number of houses of the Schuleroch?
 SPARQL: ASK WHERE { wd:Q2251145 wdt:P4080 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Schulerloch', 'p': 'number of houses', 'o': '?x0', '?x0': '0'}

 Q: what is the {statement is subject of} for {Edith Head} has {award received} as {Academy Award for Best Costume Design, Black-and-White} ?
 SPARQL: SELECT ?value WHERE { wd:Q234961 p:P166 ?s . ?s ps:P166 wd:Q22120095 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Edith Head', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Costume Design, Black-and-White'}}}

 Q: What is {speed of sound} of {mercury} that is {phase of matter} is {liquid} ?
 SPARQL: SELECT ?obj WHERE { wd:Q925 p:P2075 ?s . ?s ps:P2075 ?obj . ?s pq:P515 wd:Q11435 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'speed of sound', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'mercury', 'p': 'speed of sound', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'phase of matter', 'o': 'liquid'}}}

 Q: What is the main food source and the locomotion means of Orangutan?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q41050 wdt:P1034 ?ans_1 . wd:Q41050 wdt:P3512 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Orangutan', 'p': 'main food source', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Orangutan', 'p': 'locomotion', 'o': '?x1'}]

 Q: What is the wavelength of 2MASS?
 SPARQL: select distinct ?answer where { wd:Q1454942 wdt:P2808 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': '2MASS', 'p': 'wavelength', 'o': '?x0'}

 Q: What is the perimeter of Kahoolawe?
 SPARQL: select distinct ?answer where { wd:Q224086 wdt:P2547 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kahoolawe', 'p': 'perimeter', 'o': '?x0'}

 Q: How many have received the award of baron?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P166 wd:Q165503 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'award', 'o': 'baron'}

 Q: What arrondissement is the Waikato Region, the highest judicial authority in the Supreme Court of New Zealand?
 SPARQL: SELECT ?answer WHERE { wd:Q139918 wdt:P131 ?answer . ?answer wdt:P209 wd:Q1355832}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Waikato Region', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'highest judicial authority', 'o': 'Supreme Court of New Zealand'}}

 Q: What is the maximum lifetime of isotope of neutronium?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12525553 . ?ent wdt:P2645 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'mean lifetime', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of neutronium'}}

 Q: What is {leader} of {political party} of {Robert Borrie} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7342220 wdt:P102 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'leader', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Borrie', 'p': 'party', 'o': '$y0'}}

 Q: What is {position held} of {Benedict XVI} and {followed by}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q2494 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'successor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benedict XVI', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Benedict XVI', 'p': 'position held', 'o': '$y0'}}]

 Q: What is {number of employees} of {developed by} of {x86-64} ?
 SPARQL: SELECT ?answer WHERE { wd:Q272629 wdt:P178 ?X . ?X wdt:P1128 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employees', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'x86-64', 'p': 'developed by', 'o': '$y0'}}

 Q: What is {award received} of {Rakhee Gulzar} that is {for work} is {Tapasya} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3196775 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q3427471 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Rakhee Gulzar', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Tapasya'}}}

 Q: What is {language spoken} of {Nathaniel Hawthorne}, that has {has grammatical person} is {third-person neuter singular} ?
 SPARQL: SELECT ?answer WHERE { wd:Q69339 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q52433289}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nathaniel Hawthorne', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has grammatical person', 'o': 'third-person neuter singular'}}

 Q: Is the lowest atmospheric pressure of the Typhoon Nina greater than 1092.0?
 SPARQL: ASK WHERE { wd:Q134484 wdt:P2532 ?obj filter(?obj > 1092.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Typhoon Nina', 'p': 'lowest atmospheric pressure', 'o': '?x0', '?x0': '1092.0'}

 Q: What is {characters} of {is shown in} of {Bowser} ?
 SPARQL: SELECT ?answer WHERE { wd:Q845864 wdt:P1441 ?X . ?X wdt:P674 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bowser', 'p': 'is shown in', 'o': '$y0'}}

 Q: What is {educated at} of {Newt Gingrich} that is {academic degree} is {Doctor of Philosophy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q182788 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q752297 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Newt Gingrich', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Doctor of Philosophy'}}}

 Q: When Saint Petersburg has its population 2.92e+06?
 SPARQL: SELECT ?value WHERE { wd:Q656 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'2.92e+06')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Saint Petersburg', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '2.92e+06'}, 't': '?x0'}

 Q: What is the {F-type main-sequence star} with the {MAX(absolute magnitude)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1353952 . ?ent wdt:P1457 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'absolute magnitude', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'F-type main-sequence star'}}

 Q: What is the region of the Battle of Leipzig whose partner town is Lyon?
 SPARQL: SELECT ?answer WHERE { wd:Q151005 wdt:P276 ?answer . ?answer wdt:P190 wd:Q456}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Battle of Leipzig', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'partner town', 'o': 'Lyon'}}

 Q: Is it true that the operating income of the AeroLogic is less than 9840000?
 SPARQL: ASK WHERE { wd:Q381509 wdt:P3362 ?obj filter(?obj < 9840000.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'AeroLogic', 'p': 'operating income', 'o': '?x0', '?x0': '9840000.0'}

 Q: Tell me which is the reference model that starts with the letter m!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'reference model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'm'}}

 Q: What are the social philosophy which start with the letter eugenics
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180592 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'eugenics')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social philosophy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'eugenics'}}

 Q: What is {has moon} of {Uranus}, that has {developer of} is {David C. Jewitt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q324 wdt:P398 ?answer . ?answer wdt:P61 wd:Q382992}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Uranus', 'p': 'has moon', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'developed by', 'o': 'David C. Jewitt'}}

 Q: What is the {computer network protocol} for {uses} of {Internet Protocol version 4}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2283 wd:Q11103 . ?sbj wdt:P31 wd:Q15836568 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'uses', 'o': 'Internet Protocol version 4', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer network protocol'}}

 Q: What is {musical artist} of {Deck the Halls}, that has {nomination received} is {MTV Video Music Award for Best Artist Website} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2287842 wdt:P175 ?answer . ?answer wdt:P1411 wd:Q821166}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Deck the Halls', 'p': 'musician', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'nomination received', 'o': 'MTV Video Music Award for Best Artist Website'}}

 Q: What is in the manifestation of Sleeping Beauty?
 SPARQL: select distinct ?answer where { ?answer wdt:P1557 wd:Q11824}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'Sleeping Beauty'}

 Q: What is Tate artist identifier for William Etty?
 SPARQL: select distinct ?answer where { wd:Q766362 wdt:P2741 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'William Etty', 'p': 'Tate artist identifier', 'o': '?x0'}

 Q: Who is the{film} for {distributor} of {20th Century Fox}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P750 wd:Q434841 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'distributor', 'o': '20th Century Fox', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: Is the mortality rate of Finland 163.3
 SPARQL: ASK WHERE { wd:Q24175139 wdt:P2844 ?obj filter(?obj = 163.3) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'mortality in Finland', 'p': 'incidence', 'o': '?x0', '?x0': '163.3'}

 Q: what is the {replaced by} for {Suharto} has {position held} as {Secretary General of the Non-Aligned Movement} ?
 SPARQL: SELECT ?value WHERE { wd:Q44819 p:P39 ?s . ?s ps:P39 wd:Q15647601 . ?s pq:P1366 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Suharto', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Secretary General of the Non-Aligned Movement'}}}

 Q: what is the {start time} for {Henan} has {capital} as {Zhengzhou} ?
 SPARQL: SELECT ?value WHERE { wd:Q43684 p:P36 ?s . ?s ps:P36 wd:Q30340 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henan', 'p': 'capital', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'capital', 'o': 'Zhengzhou'}}}

 Q: Nigel Farage was employed by whom and until when?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q318471 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'until', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigel Farage', 'p': 'employed by', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'employed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigel Farage', 'p': 'employed by', 'o': '$y0'}}]

 Q: What is editor for  Catherine II of Russia
 SPARQL: select distinct ?answer where { ?answer wdt:P98 wd:Q36450}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'editor', 'o': 'Catherine II of Russia'}

 Q: Is the annual energy output of Walney Wind Farm equal to 1300?
 SPARQL: ASK WHERE { wd:Q1330226 wdt:P4131 ?obj filter(?obj = 1300) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Walney Wind Farm', 'p': 'annual energy output', 'o': '?x0', '?x0': '1300'}

 Q: Who is the chairman of the member of Gordon S. Wood?
 SPARQL: SELECT ?answer WHERE { wd:Q5585778 wdt:P463 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chair', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gordon S. Wood', 'p': 'member of', 'o': '$y0'}}

 Q: What is {constructed} of {developed by} of {Frogger} ?
 SPARQL: SELECT ?answer WHERE { wd:Q524267 wdt:P178 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'constructed', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frogger', 'p': 'developed by', 'o': '$y0'}}

 Q: what are the mineral species that contains the word zoisite  in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zoisite')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral species'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zoisite'}}

 Q: What is {sibling} of {Joe DiMaggio} that is {type of kinship} is {brother} ?
 SPARQL: SELECT ?obj WHERE { wd:Q297142 p:P3373 ?s . ?s ps:P3373 ?obj . ?s pq:P1039 wd:Q10861465 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'bro', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joe DiMaggio', 'p': 'bro', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'brother'}}}

 Q: Did Glen Campbell have the record label Motown and Liberty Records?
 SPARQL: ASK WHERE { wd:Q162667 wdt:P264 wd:Q43327 . wd:Q162667 wdt:P264 wd:Q1392321 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Glen Campbell', 'p': 'record label', 'o': '?x0', '?x0': 'Motown'}, {'h': 'IS', 'v': '?x1', 's': 'Glen Campbell', 'p': 'record label', 'o': '?x1', '?x1': 'Liberty'}]

 Q: What is the {river} for {located in or next to body of water} of {Baltimore}
 SPARQL:  select distinct ?obj where { wd:Q5092 wdt:P206 ?obj . ?obj wdt:P31 wd:Q4022 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Baltimore', 'p': 'located in or next to body of water', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'river'}}

 Q: What is {continent} of {taiga}, that has {wgs-84} is {46.0 7.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q69564 wdt:P30 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'46.0 7.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'taiga', 'p': 'continent', 'o': '?x0'}

 Q: What is the headquarters of Ghent University, whose telephone prefix is 09?
 SPARQL: SELECT ?answer WHERE { wd:Q1137665 wdt:P159 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'09'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ghent University', 'p': 'headquarters', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'telephone prefix', 'o': '09'}}

 Q: Which is the religious text that follows the Exodus?
 SPARQL:  select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q179461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Exodus', 'p': 'follows', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'religious text'}}

 Q: Give me {Hindu deity} that starts with {'y'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q979507 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Hindu deity'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: Is the lower flammable limit of styrene less than 1.08?
 SPARQL: ASK WHERE { wd:Q28917 wdt:P2202 ?obj filter(?obj < 1.08) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'styrene', 'p': 'lower flammable limit', 'o': '?x0', '?x0': '1.08'}

 Q: what is the {start time} for {Charles VII of France} has {position held} as {King of France} ?
 SPARQL: SELECT ?value WHERE { wd:Q133372 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles VII of France', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'King of France'}}}

 Q: "What is {made by} of {Cthulhu}, which has {floruit start} is {1897-0-0} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q12038 wdt:P170 ?answer . ?answer wdt:P2031 ?x FILTER(contains(YEAR(?x),'1897'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cthulhu', 'p': 'made by', 'o': '?x0', 't': '1897'}

 Q: Henry II of France wore what kind of plate armor?
 SPARQL:  select distinct ?obj where { wd:Q132545 wdt:P3828 ?obj . ?obj wdt:P31 wd:Q3391846 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Henry II of France', 'p': 'wore', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'plate armor'}}

 Q: What is {native label} of {Leviathan} that is {transliteration} is {Liwyāṯān} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192677 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P2440 ?x filter(contains(?x,'Liwyāṯān')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'native label', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leviathan', 'p': 'native label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'transliteration', 'o': 'liwyāṯān'}}}

 Q: What is <Anime News Network anime ID> of <Nausicaä of the Valley of the Wind> ?
 SPARQL: select distinct ?answer where { wd:Q8885676 wdt:P1985 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nausicaä of the Valley of the Wind', 'p': 'Anime News Network anime ID', 'o': '?x0'}

 Q: What is the  translation of birth name of Averroes?
 SPARQL: SELECT ?obj WHERE { wd:Q39837 p:P1477 ?s . ?s ps:P1477 ?obj . ?s pq:P2440 ?x filter(contains(?x,'Abū l-Walīd Muhammad ibn Ahmad ibn Rushd')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Averroes', 'p': 'birth name', 'o': '?x0'}

 Q: What is {doctoral advisor} and {academic degree} of {{Joseph Goebbels} has {educated at} as {Heidelberg University}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q41749 p:P69 ?s . ?s ps:P69 wd:Q151510 . ?s pq:P184 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Goebbels', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Heidelberg University'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'academic degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Goebbels', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'Heidelberg University'}}}]

 Q: What award did Earl Warren receive in the year 1969?
 SPARQL: SELECT ?obj WHERE { wd:Q311197 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Earl Warren', 'p': 'award', 'o': '?x0', 't': '1969'}

 Q: What is {original title} of {murder method} of {Henry III, Holy Roman Emperor} ?
 SPARQL: SELECT ?answer WHERE { wd:Q153023 wdt:P509 ?X . ?X wdt:P1476 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'title', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry III', 'p': 'murder method', 'o': '$y0'}}

