 Q: Give me {shipwrecking} that {start point} {Southampton} and which that starts with {'r'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj wdt:P1427 wd:Q79848 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'shipwrecking', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'Southampton'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'r'}}

 Q: When was Harold Urey nominated for Nobel Prize in Physics?
 SPARQL: SELECT ?value WHERE { wd:Q179777 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Harold Urey', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Nobel Prize in Physics'}, 't': '?x0'}

 Q: What is the smartphone model with the highest maximum size or capacity whose brand is Motorola?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q19723451 . ?ent wdt:P3559 ?obj . ?ent wdt:P1716 wd:Q259011 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'maximum size or capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'smartphone model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'brand', 'o': 'Motorola'}}}

 Q: Is Adam Mickiewicz a resident in the area that divides into Vyborgsky District, Saint Petersburg
 SPARQL: SELECT ?answer WHERE { wd:Q79822 wdt:P551 ?answer . ?answer wdt:P150 wd:Q219907}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Adam Mickiewicz', 'p': 'resident in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'divides into', 'o': 'Vyborgsky District, Saint Petersburg'}}

 Q: When was Shiraz female population of 842454.0?
 SPARQL: SELECT ?value WHERE { wd:Q6397066 p:P1539 ?s . ?s ps:P1539 ?x filter(contains(?x,'842454.0')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Shiraz', 'p': 'female population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'female population', 'o': '842454.0'}, 't': '?x0'}

 Q: What is the Gazetteer of Planetary Nomenclature ID for Olympus Mons?
 SPARQL: select distinct ?answer where { wd:Q520 wdt:P2824 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Olympus Mons', 'p': 'Gazetteer of Planetary Nomenclature ID', 'o': '?x0'}

 Q: What is {award received} of {Katie Ledecky} that is {follows} is {Simone Biles} ?
 SPARQL: SELECT ?obj WHERE { wd:Q137374 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q7520267 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Katie Ledecky', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'follows', 'o': 'Simone Biles'}}}

 Q: What is {nominated for} of {Gregg Toland} that is {statement is subject of} is {14th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q166000 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508406 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Gregg Toland', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '14th Academy Awards'}}}

 Q: Which are the floors below ground of Taipei 101?
 SPARQL: select distinct ?answer where { wd:Q83101 wdt:P1139 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Taipei 101', 'p': 'floors below ground', 'o': '?x0'}

 Q: Did {Chelsea_Manning} {residence} {North Bethesda}?
 SPARQL: ASK WHERE { wd:Q298423 wdt:P551 wd:Q602896 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Chelsea Manning', 'p': 'residence', 'o': '?x0', '?x0': 'North Bethesda'}]

 Q: What is the inhabitants of the arrondissement of Apulia ?
 SPARQL: SELECT ?answer WHERE { wd:Q1447 wdt:P131 ?X . ?X wdt:P1082 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'inhabitants', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Apulia', 'p': 'in', 'o': '$y0'}}

 Q: What is the {human} for {professional or sports partner} of {Matt Stone}
 SPARQL:  select distinct ?obj where { wd:Q44410 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Matt Stone', 'p': 'sports partner', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {member of sports team} of {Ricardo Zamora} and {number of matches played}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q296337 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ricardo Zamora', 'p': 'team', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'team', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ricardo Zamora', 'p': 'team', 'o': '$y0'}}]

 Q: Name a recurring event happening in the Pershing County that starts with letter B
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj wdt:P131 wd:Q484342 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'b')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'recurring event', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Pershing County'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'b'}}

 Q: What is {location of death} of {Alp Arslan}, that has {tributary} is {Vakhsh River} ?
 SPARQL: SELECT ?answer WHERE { wd:Q200193 wdt:P20 ?answer . ?answer wdt:P974 wd:Q8526}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Alp Arslan', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'tributary', 'o': 'Vakhsh River'}}

 Q: In Georgius Agricola, what section, paragraph, and verse is it in?
 SPARQL: select distinct ?answer where { wd:Q76579 wdt:P958 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Georgius Agricola', 'p': 'section', 'o': '?x0'}

 Q: Which is the photo library of the chairperson of Bill Gates?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P488 wd:Q5284 . ?sbj wdt:P31 wd:Q2912944 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chairperson', 'o': 'Bill Gates', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'photo library'}}

 Q: What is {award received} of {John Huston} that is {for work} is {The Treasure of the Sierra Madre} ?
 SPARQL: SELECT ?obj WHERE { wd:Q51575 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q251559 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award received', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John Huston', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Treasure of the Sierra Madre'}}}

 Q: What is {god of} of {solar deity}, that has {orbited by} is {400308 Antonkutter} ?
 SPARQL: SELECT ?answer WHERE { wd:Q511056 wdt:P2925 ?answer . ?answer wdt:P398 wd:Q25397719}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'solar deity', 'p': 'god of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'orbited by', 'o': '400308 Antonkutter'}}

 Q: Give me {state function} that contains the word {zenitverzögerung} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q230937 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zenitverzögerung')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'state function'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'zenitverzögerung'}}

 Q: What is the DocCheck Flexikon De ID of myocardial infarction?
 SPARQL: select distinct ?answer where { wd:Q12152 wdt:P3292 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'myocardial infarction', 'p': 'DocCheck Flexikon De ID', 'o': '?x0'}

 Q: What is the {god} for {culture} of {Hittites}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2596 wd:Q5406 . ?sbj wdt:P31 wd:Q6058157 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'culture', 'o': 'Hittites', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'god'}}

 Q: How many architectural styles are detectable in the Peterhof Palace?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1258473 wdt:P149 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Peterhof Palace', 'p': 'architectural style', 'o': '?x0'}

 Q: When did Sophia Loren received an award as Telegatto?
 SPARQL: SELECT ?value WHERE { wd:Q43252 p:P166 ?s . ?s ps:P166 wd:Q843823 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Sophia Loren', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Telegatto'}, 't': '?x0'}

 Q: Where is Glasgow nearest body of water located and where is the administrative territorial entity located?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q4093 wdt:P206 ?ans_1 . wd:Q4093 wdt:P131 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Glasgow', 'p': 'body of water', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Glasgow', 'p': 'in', 'o': '?x1'}]

 Q: iWhat are the isotope of hydrogen that contains the word tritium in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q466603 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tritium')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of hydrogen'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tritium'}}

 Q: what is the {for work} for {Penelope Lively} has {award received} as {Carnegie Medal} ?
 SPARQL: SELECT ?value WHERE { wd:Q262274 p:P166 ?s . ?s ps:P166 wd:Q1043985 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Penelope Lively', 'p': 'win', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'win', 'o': 'Carnegie Medal'}}}

 Q: Was the official symbol of Seattle the bald eagle?
 SPARQL: ASK WHERE { wd:Q5083 wdt:P2238 wd:Q127216 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Seattle', 'p': 'official symbol', 'o': '?x0', '?x0': 'bald eagle'}]

 Q: Which is the IETF language tag of the Classical Chinese?
 SPARQL: select distinct ?answer where { wd:Q37041 wdt:P305 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Classical Chinese', 'p': 'IETF language tag', 'o': '?x0'}

 Q: Tell me who is found guilty of the head of national government of Pitcairn Islands.
 SPARQL: SELECT ?answer WHERE { wd:Q35672 wdt:P6 ?X . ?X wdt:P1399 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'guilty of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Pitcairn Islands', 'p': 'head of national government', 'o': '$y0'}}

 Q: which is significant person of Frederick Douglass ?
 SPARQL: select distinct ?answer where { ?answer wdt:P3342 wd:Q215562}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant person', 'o': 'Frederick Douglass'}

 Q: What is {afflicts} of {treats} of {ibuprofen} ?
 SPARQL: SELECT ?answer WHERE { wd:Q186969 wdt:P2175 ?X . ?X wdt:P689 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'afflicts', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ibuprofen', 'p': 'treats', 'o': '$y0'}}

 Q: What is {operator of} of {administrator} of {RAF Ascension Island} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1968916 wdt:P137 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operator of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'RAF Ascension Island', 'p': 'operator', 'o': '$y0'}}

 Q: What is {educated at} of {Barack Obama} that is {start time} is {1988-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q76 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1988')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Barack Obama', 'p': 'educated at', 'o': '?x0', 't': '1988'}

 Q: Does arsenic-76 half life equal to 1.0942?
 SPARQL: ASK WHERE { wd:Q2070638 wdt:P2114 ?obj filter(?obj = 1.0942) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'arsenic-76', 'p': 'half-life', 'o': '?x0', '?x0': '1.0942'}

 Q: What is {worked at} of {grandchildren} of {Jan Smets} ?
 SPARQL: SELECT ?answer WHERE { wd:Q19334606 wdt:P1038 ?X . ?X wdt:P108 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'worked at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jan Smets', 'p': 'grandchild', 'o': '$y0'}}

 Q: What is {date of death} of {Callimachus} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q192417 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Callimachus', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'c'}}}

 Q: What is {peerage} of {creators} of {A l'aube} ?
 SPARQL: SELECT ?answer WHERE { wd:Q22041562 wdt:P170 ?X . ?X wdt:P97 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'peerage', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "A l'aube", 'p': 'creator', 'o': '$y0'}}

 Q: How many {location of discovery} are to/by {Naples} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P189 wd:Q2634 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'location of discovery', 'o': 'Naples'}

 Q: What are the colours of Mark Zuckerberg's education?
 SPARQL: SELECT ?answer WHERE { wd:Q36215 wdt:P69 ?X . ?X wdt:P462 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'colour', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Mark Zuckerberg', 'p': 'education', 'o': '$y0'}}

 Q: Who is the {geography of geographic location} for {geography of topic} of {Arab League}
 SPARQL:  select distinct ?obj where { wd:Q7172 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Arab League', 'p': 'geography of topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geography of geographic location'}}

 Q: What is {constructed out of} of {goat cheese}, that has {made from} is {goat} ?
 SPARQL: SELECT ?answer WHERE { wd:Q198815 wdt:P186 ?answer . ?answer wdt:P1582 wd:Q2934}
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'goat cheese', 'p': 'made from', 'o': '?x0', '?x0': 'goat'}]

 Q: Tell me about this edition of Rolling Stone.
 SPARQL:  select distinct ?obj where { wd:Q33511 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Rolling Stone', 'p': 'edition', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'edition'}}

 Q: What is the {imprint} for {record label} of {Eminem}
 SPARQL:  select distinct ?obj where { wd:Q5608 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eminem', 'p': 'record label', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'imprint'}}

 Q: What Marjane Satrapi was nominated for at 2009-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q126633 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Marjane Satrapi', 'p': 'nominated for', 'o': '?x0', 't': '2009'}

 Q: Was Joan Crawford married to Phillip Terry?
 SPARQL: ASK WHERE { wd:Q40475 wdt:P26 wd:Q1846029 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Joan Crawford', 'p': 'married to', 'o': '?x0', '?x0': 'Phillip Terry'}]

 Q: What significant event occurred in The Blue Boy on 1-1-1802?
 SPARQL: SELECT ?obj WHERE { wd:Q604761 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1802')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Blue Boy', 'p': 'significant event', 'o': '?x0', 't': '1802'}

 Q: What is {publication place} of {Variety}, that has {council} is {New York City Council} ?
 SPARQL: SELECT ?answer WHERE { wd:Q471728 wdt:P291 ?answer . ?answer wdt:P194 wd:Q645195}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Variety', 'p': 'publication place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'council', 'o': 'New York City Council'}}

 Q: Which head of state has the shortest term length of office?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q4164871 . ?ent wdt:P2097 ?obj . ?ent wdt:P279 wd:Q48352} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'term length of office', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'office', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'head of state'}}}

 Q: Give me {historical region} that {studied by} {egyptology} and which that starts with {'a'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620908 . ?sbj wdt:P2579 wd:Q145903 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'a')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical region', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'egyptology'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'a'}}

 Q: What is the {human} for {stepparent} of {John Huston}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3448 wd:Q51575 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'stepparent', 'o': 'John Huston', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is population of Osh in the point in time of 1897-0-0?
 SPARQL: SELECT ?obj WHERE { wd:Q47282 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1897')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Osh', 'p': 'population', 'o': '?x0', 't': '1897'}

 Q: What is {son of} of {has brother} of {Piero the Unfortunate} ?
 SPARQL: SELECT ?answer WHERE { wd:Q262212 wdt:P3373 ?X . ?X wdt:P22 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Piero the Unfortunate', 'p': 'bro', 'o': '$y0'}}

 Q: What is the native language and languages spoken, written, or signed of Robert Plant?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q428223 wdt:P103 ?ans_1 . wd:Q428223 wdt:P1412 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Robert Plant', 'p': 'native language', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Robert Plant', 'p': 'language', 'o': '?x1'}]

 Q: What is the {nation at the Olympics} for {country} of {Hong Kong}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P17 wd:Q8646 . ?sbj wdt:P31 wd:Q26213387 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'country', 'o': 'Hong Kong', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nation at the Olympics'}}

 Q: Which is the Foursquare venue ID of Sequoia National Park?
 SPARQL: select distinct ?answer where { wd:Q152660 wdt:P1968 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sequoia National Park', 'p': 'Foursquare venue ID', 'o': '?x0'}

 Q: What is the {mountain stage} with the {MAX(speed)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q20646668 . ?ent wdt:P2052 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'speed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mountain stage'}}

 Q: What is {role model} of {words by} of {¿Dónde Estás Corazón?} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2728376 wdt:P676 ?X . ?X wdt:P737 ?answer}
 ALIST: {}

 Q: What is the name of an algorithm that starts with the letter s.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8366 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'algorithm'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Is the life expectancy of Lithuania greater than 89.18634?
 SPARQL: ASK WHERE { wd:Q37 wdt:P2250 ?obj filter(?obj > 89.18634) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Lithuania', 'p': 'life expectancy', 'o': '?x0', '?x0': '89.18634'}

 Q: what is the {statement is subject of} for {William Wyler} has {award received} as {Academy Award for Best Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q51495 p:P166 ?s . ?s ps:P166 wd:Q103360 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'William Wyler', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Award for Best Director'}}}

 Q: tell me geological process name has  word subduction in it
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11827301 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'subduction')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geological process'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'subduction'}}

 Q: How many {present in work} are for {Catwoman} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q158952 wdt:P1441 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Catwoman', 'p': 'present in work', 'o': '?x0'}

 Q: How many people or cargo transported to coal?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3437 wd:Q24489 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'people or cargo transported', 'o': 'coal'}

 Q: What is the {type of quantum particle} with the {MAX(decay width)} whose {subclass of} is {boson}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2223 ?obj . ?ent wdt:P279 wd:Q43101 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'decay width', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subclass of', 'o': 'boson'}}}

 Q: What is {writer} of {is shown in} of {Nico Robin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1190653 wdt:P1441 ?X . ?X wdt:P50 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'writer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nico Robin', 'p': 'is shown in', 'o': '$y0'}}

 Q: What is {date of commencement} of {role model} of {BASIC} ?
 SPARQL: SELECT ?answer WHERE { wd:Q42979 wdt:P737 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'commencement date', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'BASIC', 'p': 'role model', 'o': '$y0'}}

 Q: Is the operating temperature of TACLANE-10G less than 30.0?
 SPARQL: ASK WHERE { wd:Q55236031 wdt:P5066 ?obj filter(?obj < 30.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'TACLANE-10G', 'p': 'operating temperature', 'o': '?x0', '?x0': '30.0'}

 Q: What is {position held} of {Robert Menzies} that is {replaces} is {Albert Dunstan} ?
 SPARQL: SELECT ?obj WHERE { wd:Q214438 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q4710054 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Menzies', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Albert Dunstan'}}}

 Q: How many movements are for The Internationale ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q49617 wdt:P135 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'The Internationale', 'p': 'movement', 'o': '?x0'}

 Q: What is {employer} of {Fernand Braudel} that is {position held} is {professor} ?
 SPARQL: SELECT ?obj WHERE { wd:Q185105 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q121594 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'employer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fernand Braudel', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'professor'}}}

 Q: Which is the translation of the edition of Twenty Thousand Leagues Under the Sea?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P629 wd:Q183565 . ?sbj wdt:P31 wd:Q39811647 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'edition of', 'o': 'Twenty Thousand Leagues Under the Sea', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'translation'}}

 Q: What is {diplomatic relation} of {South Ossetia} that is {statement is subject of} is {Nicaragua–South Ossetia relations} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23427 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q7024510 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'South Ossetia', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'Nicaragua–South Ossetia relations'}}}

 Q: What is {category of associated people} of {adjacent to} of {Extremadura} ?
 SPARQL: SELECT ?answer WHERE { wd:Q5777 wdt:P47 ?X . ?X wdt:P1792 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'category of associated people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Extremadura', 'p': 'next to', 'o': '$y0'}}

 Q: Give me {district of Austria} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q871419 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'district of Austria'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is {place of burial} of {Michel Ney} that is {start time} is {1815-12-8} ?
 SPARQL: SELECT ?obj WHERE { wd:Q40756 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1815')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Michel Ney', 'p': 'place of burial', 'o': '?x0', 't': '1815'}

 Q: What is {followed by} and {follows} of {{Isaiah} has {series} as {Nevi'im}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q131458 p:P179 ?s . ?s ps:P179 wd:Q216383 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'precedes', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isaiah', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "Nevi'im"}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Isaiah', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': "Nevi'im"}}}]

 Q: what is the {language of work or name} for {Antigone} has {has edition} as {Antygona} ?
 SPARQL: SELECT ?value WHERE { wd:Q241077 p:P747 ?s . ?s ps:P747 wd:Q24791655 . ?s pq:P407 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Antigone', 'p': 'edition', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'edition', 'o': 'Antygona'}}}

 Q: Give me {federal holidays in the United States} that {location} {Spain} and which contains the word {thanksgiving} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj wdt:P276 wd:Q29 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thanksgiving')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federal holidays in the United States', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Spain'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'thanksgiving'}}

 Q: Which is the location on terrain feature for Iberian Peninsula?
 SPARQL: select distinct ?answer where { ?answer wdt:P706 wd:Q12837}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Iberian Peninsula'}

 Q: What is {position held} of {John F. Kennedy} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q9696 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John F. Kennedy', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'John F. Kennedy', 'p': 'position held', 'o': '$y0'}}]

 Q: Tell me language whose name has the word äynu in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'äynu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'language'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'äynu'}}

 Q: who is predecessor of position held by head of government of Tainan ?
 SPARQL: SELECT ?answer WHERE { wd:Q140631 wdt:P1313 ?X . ?X wdt:P1365 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'predecessor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tainan', 'p': 'position held by head of government', 'o': '$y0'}}

 Q: Where in Paradisgatan 2 is the Lund University headquarters located?
 SPARQL: SELECT ?obj WHERE { wd:Q218506 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter(contains(?x,'Paradisgatan 2')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lund University', 'p': 'headquarters', 'o': '?x0'}

 Q: What are the medical specialty which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930752 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical specialty'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: How many children does Grover Cleveland have?
 SPARQL: select distinct ?answer where { wd:Q35171 wdt:P1971 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Grover Cleveland', 'p': 'children', 'o': '?x0'}

 Q: IS THE NOTATION PERIOD OF THE 17 THETIS EQUALS 12.27048
 SPARQL: ASK WHERE { wd:Q142553 wdt:P2147 ?obj filter(?obj = 12.27048) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '17 Thetis', 'p': 'rotation period', 'o': '?x0', '?x0': '12.27048'}

 Q: How many developers of Panasonic are there?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P178 wd:Q53247 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Panasonic'}

 Q: Which  member of the deme Aristophanes ?
 SPARQL: select distinct ?answer where { wd:Q43353 wdt:P2462 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Aristophanes', 'p': 'member of the deme', 'o': '?x0'}

