 Q: Give me {land-grant university} that {affiliation} {Purdue University system} and which contains the word {purdue} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj wdt:P1416 wd:Q929715 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'purdue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'land-grant university', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'affiliation', 'o': 'Purdue University system'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'purdue'}}

 Q: What is {has mother} of {role model} of {Diana Gabaldon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q272492 wdt:P737 ?X . ?X wdt:P25 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mother', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Diana Gabaldon', 'p': 'role model', 'o': '$y0'}}

 Q: What is {doctoral supervisor} of {academic supervisor} of {Émile Durkheim} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15948 wdt:P1066 ?X . ?X wdt:P184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral supervisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Émile Durkheim', 'p': 'supervisor', 'o': '$y0'}}

 Q: In 2014, what was the population of New Haven?
 SPARQL: SELECT ?obj WHERE { wd:Q49145 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'New Haven', 'p': 'population', 'o': '?x0', 't': '2014'}

 Q: Did {Bali} {located in or next to body of water} {Indian Ocean} and {Gulf of Thailand} ?
 SPARQL: ASK WHERE { wd:Q4648 wdt:P206 wd:Q1239 . wd:Q4648 wdt:P206 wd:Q131217 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Bali', 'p': 'located in or next to body of water', 'o': '?x0', '?x0': 'Indian Ocean'}, {'h': 'IS', 'v': '?x1', 's': 'Bali', 'p': 'located in or next to body of water', 'o': '?x1', '?x1': 'Gulf of Thailand'}]

 Q: tell me animated character that starts name with w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15711870 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated character'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Give me {newspaper} that {newspaper format} {broadsheet} and which that starts with {'t'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj wdt:P3912 wd:Q665319 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'newspaper', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'newspaper format', 'o': 'broadsheet'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: "What is the {personal name} of {Jan Swammerdam}, whose {audio language} is {Swedish} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q336794 wdt:P735 ?answer . ?answer wdt:P407 wd:Q9027}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jan Swammerdam', 'p': 'personal name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'audio language', 'o': 'Swedish'}}

 Q: What is {middle name} of {Lisa del Giocondo}, that has {said to be different from} is {Liesel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q153032 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19689474}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Lisa del Giocondo', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'said to be different from', 'o': 'Liesel'}}

 Q: what is the {start time} for {Cape Town} has {head of government} as {Dan Plato} ?
 SPARQL: SELECT ?value WHERE { wd:Q5465 p:P6 ?s . ?s ps:P6 wd:Q379122 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cape Town', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Dan Plato'}}}

 Q: Give me {nonmetal} that {location of discovery} {England} and which contains the word {oxygen} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19600 . ?sbj wdt:P189 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'oxygen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'nonmetal', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'location of discovery', 'o': 'England'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'oxygen'}}

 Q: What is the magazine with the highest readership whose publisher is National Parks Conservation Association?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q41298 . ?ent wdt:P4295 ?obj . ?ent wdt:P123 wd:Q6974765 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'readership', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'magazine', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'publisher', 'o': 'National Parks Conservation Association'}}}

 Q: Is it true that the Gini coefficient of France is greater than 40.02?
 SPARQL: ASK WHERE { wd:Q142 wdt:P1125 ?obj filter(?obj > 40.02) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'France', 'p': 'Gini coefficient', 'o': '?x0', '?x0': '40.02'}

 Q: What award did Maria Rojo receive in 1978?
 SPARQL: SELECT ?obj WHERE { wd:Q290301 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maria Rojo', 'p': 'award', 'o': '?x0', 't': '1978'}

 Q: What is {language} of {Paul von Hindenburg}, that has {has case} is {dative case} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2667 wdt:P1412 ?answer . ?answer wdt:P2989 wd:Q145599}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Paul von Hindenburg', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'has case', 'o': 'dative case'}}

 Q: How many continents are in the Portuguese Empire?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q200464 wdt:P30 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Portuguese Empire', 'p': 'continent', 'o': '?x0'}

 Q: What is {toponym} of {St. Elmo's fire}, that has {historical era} is {Roman Empire}?
 SPARQL: SELECT ?answer WHERE { wd:Q120688 wdt:P138 ?answer . ?answer wdt:P2348 wd:Q2277}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "St. Elmo's fire", 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'era', 'o': 'Roman Empire'}}

 Q: Which is the original language of work for The Muppet Show?
 SPARQL: select distinct ?answer where { wd:Q2120540 wdt:P364 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Muppet Show', 'p': 'original language', 'o': '?x0'}

 Q: What is the {biological process} for {contributing factor of} of {necrosis}
 SPARQL:  select distinct ?obj where { wd:Q178069 wdt:P1537 ?obj . ?obj wdt:P31 wd:Q2996394 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'necrosis', 'p': 'contributing factor of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'biological process'}}

 Q: What is place served by transport hub for Fairbanks ?
 SPARQL: select distinct ?answer where { ?answer wdt:P931 wd:Q79638}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place served by transport hub', 'o': 'Fairbanks'}

 Q: Who is the graduate of the sculptor of Red & Black?
 SPARQL: SELECT ?answer WHERE { wd:Q27894648 wdt:P170 ?X . ?X wdt:P69 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'graduate of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Red & Black', 'p': 'sculptor', 'o': '$y0'}}

 Q: What is the {film} with the {MAX(box office)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2142 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'box office', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film'}}

 Q: what is the {start time} for {Charlie Chaplin} has {spouse} as {Oona O'Neill} ?
 SPARQL: SELECT ?value WHERE { wd:Q882 p:P26 ?s . ?s ps:P26 wd:Q137808 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlie Chaplin', 'p': 'married', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'married', 'o': "Oona O'Neill"}}}

 Q: What editions, developed by, Cascading Style Sheets, is in the World Wide Web Consortium?
 SPARQL: SELECT ?answer WHERE { wd:Q46441 wdt:P747 ?answer . ?answer wdt:P178 wd:Q37033}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cascading Style Sheets', 'p': 'editions', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'developed by', 'o': 'World Wide Web Consortium'}}

 Q: Which is the main regulatory text for Antarctic?
 SPARQL: select distinct ?answer where { wd:Q1555938 wdt:P92 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Antarctic', 'p': 'main regulatory text', 'o': '?x0'}

 Q: Is the lower flammable limit of methanol equal to 0?
 SPARQL: ASK WHERE { wd:Q14982 wdt:P2202 ?obj filter(?obj = 6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'methanol', 'p': 'lower flammable limit', 'o': '?x0', '?x0': '6'}

 Q: What is the {sovereign state} for {applies to jurisdiction} of {pope}
 SPARQL:  select distinct ?obj where { wd:Q19546 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pope', 'p': 'applies to jurisdiction', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: what is the {valid in period} for {Zhytomyr Oblast} has {located in time zone} as {UTC+03:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q40637 p:P421 ?s . ?s ps:P421 wd:Q6760 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Zhytomyr Oblast', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+3'}}}

 Q: Who was Doris Day's husband in the year 1946?
 SPARQL: SELECT ?obj WHERE { wd:Q104372 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1946')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Doris Day', 'p': 'husband', 'o': '?x0', 't': '1946'}

 Q: Which camera is different from a still camera to catch taxon parent of eukaryote?
 SPARQL: SELECT ?answer WHERE { wd:Q15328 wdt:P1889 ?answer . ?answer wdt:P171 wd:Q19088}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'camera', 'p': 'different from', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'taxon parent', 'o': 'eukaryote'}}

 Q: What is the ZVG number of  hafnium?
 SPARQL: select distinct ?answer where { wd:Q1119 wdt:P679 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hafnium', 'p': 'ZVG number', 'o': '?x0'}

 Q: What is {parent company of} of {superior formation} of {Academy for Spatial Research and Planning} ?
 SPARQL: SELECT ?answer WHERE { wd:Q414327 wdt:P749 ?X . ?X wdt:P355 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent company of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Academy for Spatial Research and Planning', 'p': 'superior formation', 'o': '$y0'}}

 Q: What is the {provisional government} for {head of government} of {Josip Broz Tito}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P6 wd:Q9161 . ?sbj wdt:P31 wd:Q59281 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'head of government', 'o': 'Josip Broz Tito', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'provisional government'}}

 Q: How many {instrumentation} are for {The Carnival of the Animals} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q941724 wdt:P870 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'The Carnival of the Animals', 'p': 'instrumentation', 'o': '?x0'}

 Q: Which is the parent body of Enceladus, that have child body as Hyrrokkin?
 SPARQL: SELECT ?answer WHERE { wd:Q3303 wdt:P397 ?answer . ?answer wdt:P398 wd:Q18032}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Enceladus', 'p': 'parent body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'child body', 'o': 'Hyrrokkin'}}

 Q: Who is the  {operationalization} for {manifestation of} of {inertia}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q122508 . ?sbj wdt:P31 wd:Q286017 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'inertia', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'operationalization'}}

 Q: What is {academic area} of {PhD advisor} of {Vladimir Berkovich} ?
 SPARQL: SELECT ?answer WHERE { wd:Q7938273 wdt:P184 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'area', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Vladimir Berkovich', 'p': 'advisor', 'o': '$y0'}}

 Q: What is {date of death} and {mother} of {{Joseph Stalin} has {child} as {Vasily Dzhugashvili}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P570 ?value1 . ?s pq:P25 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Vasily Dzhugashvili'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'mother', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Joseph Stalin', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Vasily Dzhugashvili'}}}]

 Q: What is {position held} of {Douglas Nicholls} that is {replaces} is {Mark Oliphant} ?
 SPARQL: SELECT ?obj WHERE { wd:Q447675 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q727443 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Douglas Nicholls', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaces', 'o': 'Mark Oliphant'}}}

 Q: Give me {province of Pakistan} that contains the word {sindh} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15058985 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sindh')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'province of Pakistan'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'sindh'}}

 Q: Which is the INSPIRE-HEP author ID for Niels Bohr?
 SPARQL: select distinct ?answer where { wd:Q7085 wdt:P2930 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Niels Bohr', 'p': 'INSPIRE-HEP author ID', 'o': '?x0'}

 Q: What is the event location of the took part in of Florin Prunea ?
 SPARQL: SELECT ?answer WHERE { wd:Q1333942 wdt:P1344 ?X . ?X wdt:P276 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'location', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Florin Prunea', 'p': 'took part', 'o': '$y0'}}

 Q: what is the {start time} for {Arthur Wellesley, 1st Duke of Wellington} has {position held} as {Prime Minister of the United Kingdom} ?
 SPARQL: SELECT ?value WHERE { wd:Q131691 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arthur Wellesley, 1st Duke of Wellington', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Prime Minister of the United Kingdom'}}}

 Q: In 1944 who was the spouse of Simone Signoret?
 SPARQL: SELECT ?obj WHERE { wd:Q106126 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1944')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Simone Signoret', 'p': 'spouse', 'o': '?x0', 't': '1944'}

 Q: Who is the superpartner of Higgs boson?
 SPARQL: select distinct ?answer where { ?answer wdt:P2376 wd:Q402}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'superpartner of', 'o': 'Higgs boson'}

 Q: How many carries are by Canal du Midi?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2505 wd:Q202494 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'carries', 'o': 'Canal du Midi'}

 Q: What is the PDB structure ID for rhenium?
 SPARQL: select distinct ?answer where { wd:Q737 wdt:P638 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'rhenium', 'p': 'PDB structure ID', 'o': '?x0'}

 Q: What is the {earthquake} with the {MAX(aftershocks)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2320 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'aftershocks', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'earthquake'}}

 Q: What is {partner} of {Demi Lovato} that is {end time} is {2016-6-3} ?
 SPARQL: SELECT ?obj WHERE { wd:Q41173 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2016')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Demi Lovato', 'p': 'partner', 'o': '?x0', 't': '2016'}

 Q: Tell me the social networking service which starts with the letter y?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3220391 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'social networking service'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is {symbol} of {measures} of {ruler} ?
 SPARQL: SELECT ?answer WHERE { wd:Q104555 wdt:P2575 ?X . ?X wdt:P416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ruler', 'p': 'measures', 'o': '$y0'}}

 Q: What is the {human} for {stepparent} of {Barack Obama}
 SPARQL:  select distinct ?obj where { wd:Q76 wdt:P3448 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Barack Obama', 'p': 'stepparent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {Class IB flammable liquid} with the {MAX(surface tension)} whose {instance of} is {chemical compound}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P3013 ?obj . ?ent wdt:P31 wd:Q11173 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'surface tension', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IB flammable liquid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'chemical compound'}}}

 Q: what is the {for work} for {Paul Newman} has {nominated for} as {Academy Award for Best Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q41871 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paul Newman', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Actor'}}}

 Q: Name the feminine name behind the language work of Russian
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q11879590 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language', 'o': 'Russian', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'feminine name'}}

 Q: What is Harold Wilson's middle name?  Is it the same as Andrin's?
 SPARQL: SELECT ?answer WHERE { wd:Q128956 wdt:P735 ?answer . ?answer wdt:P460 wd:Q511611}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Harold Wilson', 'p': 'middle name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Andrin'}}

 Q: what is the {valid in period} for {Molise} has {located in time zone} as {UTC+02:00} ?
 SPARQL: SELECT ?value WHERE { wd:Q1443 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'valid in period', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Molise', 'p': 'time zone', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'time zone', 'o': 'UTC+02:00'}}}

 Q: What are the mass media which start with the letter youtube
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'youtube')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mass media'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'youtube'}}

 Q: What is the EPHE ID of Marcel Mauss?
 SPARQL: select distinct ?answer where { wd:Q295393 wdt:P4890 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marcel Mauss', 'p': 'EPHE ID', 'o': '?x0'}

 Q: what is the {number of points/goals/set scored} for {Bobby Charlton} has {member of sports team} as {Manchester United F.C.} ?
 SPARQL: SELECT ?value WHERE { wd:Q171583 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P1351 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bobby Charlton', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Manchester United F.C.'}}}

 Q: Which is different to liquorice , that played by Bride?
 SPARQL: SELECT ?answer WHERE { wd:Q138811 wdt:P1889 ?answer . ?answer wdt:P175 wd:Q913552}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'liquorice', 'p': 'different to', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'played by', 'o': 'Bride'}}

 Q: What cast member joined Sesame Street in 1972?
 SPARQL: SELECT ?obj WHERE { wd:Q155629 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1972')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Sesame Street', 'p': 'cast member', 'o': '?x0', 't': '1972'}

 Q: What is the {historical country} for {territory claimed by} of {German Democratic Republic}
 SPARQL:  select distinct ?obj where { wd:Q16957 wdt:P1336 ?obj . ?obj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'German Democratic Republic', 'p': 'claimed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: How many noble titles owned by {emir} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P97 wd:Q166382 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'noble title', 'o': 'emir'}

 Q: Tell me the time which starts with the letter p!
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11471 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'time'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: what is the {start time} for {Ilse Koch} has {member of political party} as {NSDAP} ?
 SPARQL: SELECT ?value WHERE { wd:Q58036 p:P102 ?s . ?s ps:P102 wd:Q7320 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ilse Koch', 'p': 'party', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'party', 'o': 'NSDAP'}}}

 Q: What is the {megacity} for {work location} of {Vladimir Lenin}
 SPARQL:  select distinct ?obj where { wd:Q1394 wdt:P937 ?obj . ?obj wdt:P31 wd:Q174844 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vladimir Lenin', 'p': 'work location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'megacity'}}

 Q: What is {location of burial} of {Gioseffo Zarlino}, that has {WHS criteria} is {(iii)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q365805 wdt:P119 ?answer . ?answer wdt:P2614 wd:Q23038977}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gioseffo Zarlino', 'p': 'location of burial', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'WHS criteria', 'o': '(iii)'}}

 Q: Which annual event was inspired by the Eurovision Song Contest?
 SPARQL:  select distinct ?obj where { wd:Q276 wdt:P941 ?obj . ?obj wdt:P31 wd:Q18574946 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Eurovision Song Contest', 'p': 'inspired by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'annual event'}}

 Q: What features are associated with playing on a skateboard?
 SPARQL: SELECT ?answer WHERE { wd:Q15783 wdt:P641 ?X . ?X wdt:P3095 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'associated with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'skateboard', 'p': 'play', 'o': '$y0'}}

 Q: What is the {material used} and the {indigenous to} of {Tequila} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q122195 wdt:P186 ?ans_1 . wd:Q122195 wdt:P2341 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'tequila', 'p': 'material used', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'tequila', 'p': 'indigenous to', 'o': '?x1'}]

 Q: What is {feedstock} of {chair}, that has {mass} is {55.935} ?
 SPARQL: SELECT ?answer WHERE { wd:Q15026 wdt:P186 ?answer . ?answer wdt:P2067 ?x FILTER(contains(?x,'55.935'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'chair', 'p': 'feedstock', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mass', 'o': '55.935'}}

 Q: What is {relative} of {Augustus} that is {type of kinship} is {adoptive parent} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1405 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q20746742 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'relative', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Augustus', 'p': 'relative', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'kinship', 'o': 'adoptive parent'}}}

 Q: what is the {determination method} for {multiple sclerosis} has {genetic association} as {VAV2} ?
 SPARQL: SELECT ?value WHERE { wd:Q8277 p:P2293 ?s . ?s ps:P2293 wd:Q18032316 . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'multiple sclerosis', 'p': 'genetic association', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'genetic association', 'o': 'VAV2'}}}

 Q: What is {spouse} of {Anna Karina} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q232113 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Karina', 'p': 'married', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anna Karina', 'p': 'married', 'o': '$y0'}}]

 Q: What is {creates} of {has designer} of {Thunderbolt} ?
 SPARQL: SELECT ?answer WHERE { wd:Q329003 wdt:P287 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'creates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Thunderbolt', 'p': 'has designer', 'o': '$y0'}}

 Q: Which is the URL for Civil Disobedience?
 SPARQL: select distinct ?answer where { wd:Q331092 wdt:P2699 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Civil Disobedience', 'p': 'URL', 'o': '?x0'}

 Q: What is {son-in-law} of {co-founded by} of {Catholic Church} ?
 SPARQL: SELECT ?answer WHERE { wd:Q9592 wdt:P112 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'son-in-law', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Catholic Church', 'p': 'co-founder', 'o': '$y0'}}

 Q: How many {instance of} are to/by {instruction set architecture} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P31 wd:Q272683 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'instruction set architecture'}

 Q: What what is Fibonacci number edition or translation of by Lexicon Forestale and also which starts with letter 1
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47577 . ?sbj wdt:P629 wd:Q62469935 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '1')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Fibonacci number', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'edition or translation of', 'o': 'Lexicon Forestale'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': '1'}}

 Q: Which songwriter of Suite bergamasque died in Paris?
 SPARQL: SELECT ?answer WHERE { wd:Q1367599 wdt:P86 ?answer . ?answer wdt:P20 wd:Q90}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Suite bergamasque', 'p': 'songwriter', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'died in', 'o': 'Paris'}}

 Q: How many {open days} are to/by {Sunday} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3025 wd:Q132 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'open days', 'o': 'Sunday'}

 Q: What is the aspect ratio of Law & Order that ended in May 5, 1994?
 SPARQL: SELECT ?obj WHERE { wd:Q321423 p:P2061 ?s . ?s ps:P2061 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1994')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Law & Order', 'p': 'aspect ratio', 'o': '?x0', 't': '1994'}

 Q: What is {position held} of {Halford Mackinder} that is {electoral district} is {Glasgow Camlachie} ?
 SPARQL: SELECT ?obj WHERE { wd:Q299938 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q5566762 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Halford Mackinder', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'electoral district', 'o': 'Glasgow Camlachie'}}}

 Q: what is the {point in time} for {André Previn} has {award received} as {Grammy Lifetime Achievement Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q155712 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'André Previn', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Lifetime Achievement Award'}, 't': '?x0'}

 Q: Is the electric charge of a proton greater than 1.92261194496e-19?
 SPARQL: ASK WHERE { wd:Q2294 wdt:P2200 ?obj filter(?obj > 1.92261194496e-19) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'proton', 'p': 'electric charge', 'o': '?x0', '?x0': '1.92261194496e-19'}

 Q: Name the capital city of the Empire of Japan.
 SPARQL:  select distinct ?obj where { wd:Q188712 wdt:P36 ?obj . ?obj wdt:P31 wd:Q515 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire of Japan', 'p': 'capital', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city'}}

