 Q: Is the duration of 2064-2065 one-year-period equal to 1.2?
 SPARQL: ASK WHERE { wd:Q61702903 wdt:P2047 ?obj filter(?obj = 1.2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '2064-2065 one-year-period', 'p': 'duration', 'o': '?x0', '?x0': '1.2'}

 Q: What is {father} and {date of death} of {{Abigail Adams} has {child} as {John Quincy Adams}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q11816 . ?s pq:P22 ?value1 . ?s pq:P570 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'father', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'John Quincy Adams'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'date of death', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abigail Adams', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'John Quincy Adams'}}}]

 Q: Give me {dialect} that contains the word {öömrang} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'öömrang')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'öömrang'}}

 Q: What is the {position} for {position held} of {John Jay}
 SPARQL:  select distinct ?obj where { wd:Q310847 wdt:P39 ?obj . ?obj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'John Jay', 'p': 'position held', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: what is the {has quality} for {Heidelberg University} has {IPv4 routing prefix} as {129.206.0.0/16} ?
 SPARQL: SELECT ?value WHERE { wd:Q151510 p:P3761 ?s . ?s ps:P3761 ?x filter(contains(?x,'129.206.0.0/16')) . ?s pq:P1552 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has quality', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Heidelberg University', 'p': 'IPv4 routing prefix', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'IPv4 routing prefix', 'o': '129.206.0.0/16'}}}

 Q: Which sport discipline does Abebe Bikila compete in?
 SPARQL: select distinct ?answer where { wd:Q52596 wdt:P2416 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Abebe Bikila', 'p': 'sport discipline', 'o': '?x0'}

 Q: Which is designated as terrorist by of Boko Haram?
 SPARQL: select distinct ?answer where { wd:Q212372 wdt:P3461 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Boko Haram', 'p': 'designated as terrorist by', 'o': '?x0'}

 Q: Is it true that cloud computing win the 2014 Laurence Olivier Awards?
 SPARQL: ASK WHERE { wd:Q483639 wdt:P166 wd:Q16995982 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'cloud computing', 'p': 'win', 'o': '?x0', '?x0': '2014 Laurence Olivier Awards'}]

 Q: What is the {human} for {place of death} of {Venice}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P20 wd:Q641 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'died in', 'o': 'Venice', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What equipment is operated by the administrator of the B-52 Stratofortress?
 SPARQL: SELECT ?answer WHERE { wd:Q174534 wdt:P137 ?X . ?X wdt:P121 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'operated', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stratofortress', 'p': 'operated by', 'o': '$y0'}}

 Q: What is the {high school} for {educated at} of {Phil Hartman}
 SPARQL:  select distinct ?obj where { wd:Q366834 wdt:P69 ?obj . ?obj wdt:P31 wd:Q9826 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Phil Hartman', 'p': 'educated at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'high school'}}

 Q: In 1978, what was Graham Greene nominated for?
 SPARQL: SELECT ?obj WHERE { wd:Q128560 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Graham Greene', 'p': 'nominated for', 'o': '?x0', 't': '1978'}

 Q: What is {position held} of {Daniel Webster} that is {replaces} is {John Middleton Clayton} ?
 SPARQL: SELECT ?obj WHERE { wd:Q106231 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q17889 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Daniel Webster', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced', 'o': 'John Middleton Clayton'}}}

 Q: Which is the capitol building that Thomas Jefferson was the architect for?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P84 wd:Q11812 . ?sbj wdt:P31 wd:Q3284499 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architect', 'o': 'Thomas Jefferson', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'capitol building'}}

 Q: What was the population of Connecticut as of 2010-4-1?
 SPARQL: SELECT ?obj WHERE { wd:Q779 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Connecticut', 'p': 'population', 'o': '?x0', 't': '2010'}

 Q: What was the royal of the noble rank of the head of state in the Roman Empire?
 SPARQL:  select distinct ?obj where { wd:Q2277 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q355567 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Roman Empire', 'p': 'head of state', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'noble rank'}}

 Q: Which is the historical country that replaced the Ottoman Empire?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'replaced', 'o': 'Ottoman Empire', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: What is the {location of formation} and the {place of birth} of {Barbra_Streisand} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q4636 wdt:P740 ?ans_1 . wd:Q4636 wdt:P19 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Barbra Streisand', 'p': 'location of formation', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Barbra Streisand', 'p': 'place of birth', 'o': '?x1'}]

 Q: What is the {university and college sports club} for {represents} of {Georgetown University}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1268 wd:Q333886 . ?sbj wdt:P31 wd:Q2367225 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'represents', 'o': 'Georgetown University', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'university and college sports club'}}

 Q: How many {authority} are to/by {European Union} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P797 wd:Q458 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'authority', 'o': 'eu'}

 Q: What is {date of birth} and {mother} of {{Charlemagne} has {child} as {Charles the Younger}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P569 ?value1 . ?s pq:P25 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of birth', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'mother', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charlemagne', 'p': 'child', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'child', 'o': 'Charles the Younger'}}}]

 Q: What is {nominated for} of {Saul Bellow} that is {for work} is {Humboldt's Gift} ?
 SPARQL: SELECT ?obj WHERE { wd:Q83059 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q3793856 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Saul Bellow', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': "Humboldt's Gift"}}}

 Q: What is the taxon parent of Dugong dugon which is known by the vernacular name 儒艮?
 SPARQL: SELECT ?answer WHERE { wd:Q129544 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'儒艮'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Dugong dugon', 'p': 'taxon parent', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vernacular name', 'o': '儒艮'}}

 Q: What is the {historical country} for {capital} of {Thiruvananthapuram}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P36 wd:Q167715 . ?sbj wdt:P31 wd:Q3024240 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital', 'o': 'Thiruvananthapuram', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'historical country'}}

 Q: What is {signs language} of {Francisco Morazán}, that has {label in original language} is {castellano} ?
 SPARQL: SELECT ?answer WHERE { wd:Q332111 wdt:P1412 ?answer . ?answer wdt:P1705 ?x FILTER(contains(?x,'castellano'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Francisco Morazan', 'p': 'language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'label in original language', 'o': 'castellano'}}

 Q: What is {educated at} of {Muhammad Iqbal} that is {academic degree} is {Bachelor of Arts} ?
 SPARQL: SELECT ?obj WHERE { wd:Q484141 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q1765120 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Muhammad Iqbal', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Bachelor of Arts'}}}

 Q: What is the {dialect} for {dialect of} of {Old English}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P4913 wd:Q42365 . ?sbj wdt:P31 wd:Q33384 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'dialect of', 'o': 'Old English', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dialect'}}

 Q: What is the GeoNames ID for Bengbu?
 SPARQL: select distinct ?answer where { wd:Q360069 wdt:P1566 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bengbu', 'p': 'GeoNames ID', 'o': '?x0'}

 Q: When did educated at of Umberto Eco and academic degree
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q12807 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Umberto Eco', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Umberto Eco', 'p': 'educated at', 'o': '$y0'}}]

 Q: How many deaths took place as a result of conflict of Axis?
 SPARQL: SELECT ?answer WHERE { wd:Q43056 wdt:P607 ?X . ?X wdt:P1120 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'deaths', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Axis', 'p': 'conflict', 'o': '$y0'}}

 Q: What disease has the shortest incubation period in humans?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P3488 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'minimal incubation period in humans', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: What is Webb-site organization ID for The University of Hong Kong ?
 SPARQL: select distinct ?answer where { wd:Q15568 wdt:P5300 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'University of Hong Kong', 'p': 'Webb-site organization ID', 'o': '?x0'}

 Q: What is {employer} of {Jean-Baptiste Say} that is {start time} is {1831-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q13513 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1831')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jean-Baptiste Say', 'p': 'employer', 'o': '?x0', 't': '1831'}

 Q: What is the {type of quantum particle} with the {MAX(g-factor)} whose {different from} is {neutronium}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P1097 ?obj . ?ent wdt:P1889 wd:Q1195471 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'g-factor', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'different from', 'o': 'neutronium'}}}

 Q: How many landing locations are there in the Atlantic Ocean?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1158 wd:Q97 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'landing location', 'o': 'Atlantic Ocean'}

 Q: What is the {mother} and the {child} of {Philip_II_of_Spain} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q34417 wdt:P25 ?ans_1 . wd:Q34417 wdt:P40 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Felipe II', 'p': 'mother', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Felipe II', 'p': 'child', 'o': '?x1'}]

 Q: Which is Yad Vashem Encyclopedia of the Ghettos ID for Warsaw Ghetto?
 SPARQL: select distinct ?answer where { wd:Q154607 wdt:P3735 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Warsaw Ghetto', 'p': 'Yad Vashem Encyclopedia of the Ghettos ID', 'o': '?x0'}

 Q: What is {position held} of {George Stephanopoulos} that is {replaced by} is {Sidney Blumenthal} ?
 SPARQL: SELECT ?obj WHERE { wd:Q1655924 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q3483318 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Stephanopoulos', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Sidney Blumenthal'}}}

 Q: What was located in the administrative territorial entity of Arkhangelsk on September 23, 1937?
 SPARQL: SELECT ?obj WHERE { wd:Q1851 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1937')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Arkhangelsk', 'p': 'located in the administrative territorial entity', 'o': '?x0', 't': '1937'}

 Q: What is the {disease} for {medical condition treated} of {hydrogen peroxide}
 SPARQL:  select distinct ?obj where { wd:Q171877 wdt:P2175 ?obj . ?obj wdt:P31 wd:Q12136 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'hydrogen peroxide', 'p': 'medical condition treated', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease'}}

 Q: Did {Andy_Warhol} {place of death} {New York City}?
 SPARQL: ASK WHERE { wd:Q5603 wdt:P20 wd:Q60 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Andy Warhol', 'p': 'place of death', 'o': '?x0', '?x0': 'NYC'}]

 Q: What is {is in the village of} of {works at} of {David Sumner} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21062278 wdt:P108 ?X . ?X wdt:P131 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'David Sumner', 'p': 'worked at', 'o': '$y0'}}

 Q: what is model of Naomi Parker Fraley ?
 SPARQL: select distinct ?answer where { ?answer wdt:P2634 wd:Q47486504}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'model', 'o': 'Naomi Parker Fraley'}

 Q: What is the member of the political party and sports team of Andre Agassi?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q7407 wdt:P102 ?ans_1 . wd:Q7407 wdt:P54 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Andre Agassi', 'p': 'party', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Andre Agassi', 'p': 'team', 'o': '?x1'}]

 Q: What is {diplomatic relation} of {national of} of {Alan Dargin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2623428 wdt:P27 ?X . ?X wdt:P530 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'diplomatic relation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alan Dargin', 'p': 'national of', 'o': '$y0'}}

 Q: what is the {point in time} for {Coronation Street} has {nominated for} as {British Academy Television Awards} ?
 SPARQL: SELECT ?value WHERE { wd:Q945030 p:P1411 ?s . ?s ps:P1411 wd:Q1369077 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Coronation Street', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'British Academy Television Awards'}, 't': '?x0'}

 Q: what is the {start time} for {Tomsk} has {located in the administrative territorial entity} as {Tomsk Governorate} ?
 SPARQL: SELECT ?value WHERE { wd:Q976 p:P131 ?s . ?s ps:P131 wd:Q1378406 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tomsk', 'p': 'in', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'in', 'o': 'Tomsk Governorate'}}}

 Q: Which tablet computer has the largest memory capacity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q155972 . ?ent wdt:P2928 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'memory capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tablet computer'}}

 Q: Is the partition coefficient water/octanol of the trichloromonofluoromethane equal to 2.53?
 SPARQL: ASK WHERE { wd:Q423000 wdt:P2993 ?obj filter(?obj = 2.53) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'trichloromonofluoromethane', 'p': 'partition coefficient water/octanol', 'o': '?x0', '?x0': '2.53'}

 Q: what is the {end time} for {Ivo Andrić} has {member of} as {Serbian Academy of Sciences and Arts} ?
 SPARQL: SELECT ?value WHERE { wd:Q47561 p:P463 ?s . ?s ps:P463 wd:Q1132636 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ivo Andrić', 'p': 'member of', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of', 'o': 'Serbian Academy of Sciences and Arts'}}}

 Q: Tell me the folk religion that has as foundational text Nihon Shoki and starts with the letter s?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1068640 . ?sbj wdt:P457 wd:Q813935 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'folk religion', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'foundational text', 'o': 'Nihon Shoki'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: Which is the name in native language for Paul Strand?
 SPARQL: select distinct ?answer where { wd:Q453839 wdt:P1559 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paul Strand', 'p': 'name in native language', 'o': '?x0'}

 Q: What is <Library of Congress Demographic Group Terms ID> of <housekeeper> ?
 SPARQL: select distinct ?answer where { wd:Q2596569 wdt:P4946 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'housekeeper', 'p': 'Library of Congress Demographic Group Terms ID', 'o': '?x0'}

 Q: Which is the Electronic Enlightenment ID for Napoleon?
 SPARQL: select distinct ?answer where { wd:Q517 wdt:P3429 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Napoleon', 'p': 'Electronic Enlightenment ID', 'o': '?x0'}

 Q: What is the intensive quantity measured by amperes per volt meter that contains the word "conductivity " in its name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj wdt:P1880 wd:Q20966435 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'conductivity')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intensive quantity', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'measured by', 'o': 'amperes per volt meter'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'conductivity'}}

 Q: Is the maximum gradient of Chiemsee-Bahn equal to 2.5?
 SPARQL: ASK WHERE { wd:Q659425 wdt:P2595 ?obj filter(?obj = 2.5) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Chiemsee-Bahn', 'p': 'maximum gradient', 'o': '?x0', '?x0': '2.5'}

 Q: which type of medical test starts with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55215251 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of medical test'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: What is {educated at} of {Lloyd Shapley} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q244739 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lloyd Shapley', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lloyd Shapley', 'p': 'educated at', 'o': '$y0'}}]

 Q: Did {London} {twinned administrative body} {Phnom Penh}?
 SPARQL: ASK WHERE { wd:Q84 wdt:P190 wd:Q1850 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'London', 'p': 'twinned administrative body', 'o': '?x0', '?x0': 'Phnom Penh'}]

 Q: What is {died in} of {Nadezhda Mandelstam}, that has {sister city} is {Vienna} ?
 SPARQL: SELECT ?answer WHERE { wd:Q234765 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1741}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nadezhda Mandelstam', 'p': 'died in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'sister city', 'o': 'Vienna'}}

 Q: Who are rhe sons of Emperor Wu of Jin whose surname is Sima?
 SPARQL: SELECT ?answer WHERE { wd:Q7356 wdt:P40 ?answer . ?answer wdt:P734 wd:Q592176}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Emperor Wu of Jin', 'p': 'son', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'surname', 'o': 'Sima'}}

 Q: Is Kenya's nominal GDP per capita equal to 1376.71?
 SPARQL: ASK WHERE { wd:Q114 wdt:P2132 ?obj filter(?obj = 1376.71) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Kenya', 'p': 'nominal GDP per capita', 'o': '?x0', '?x0': '1376.71'}

 Q: what is the {point in time} for {Groucho Marx} has {award received} as {Academy Honorary Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q103846 p:P166 ?s . ?s ps:P166 wd:Q727328 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Groucho Marx', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Academy Honorary Award'}, 't': '?x0'}

 Q: What is {number of matches played} and {number of points/goals/set scored} of {{Marco van Basten} has {member of sports team} as {Netherlands national under-21 football team}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q483629 p:P54 ?s . ?s ps:P54 wd:Q1811026 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'matches played', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marco van Basten', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Netherlands national under-21 football team'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'number of points/goals/set scored', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marco van Basten', 'p': 'team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'team', 'o': 'Netherlands national under-21 football team'}}}]

 Q: What is {political party} of {governor} of {Altmarkkreis Salzwedel} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6061 wdt:P6 ?X . ?X wdt:P102 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'party', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Altmarkkreis Salzwedel', 'p': 'governor', 'o': '$y0'}}

 Q: "Which male relating to Antonio Stradivari, has an abbreviation of мужской ?"
 SPARQL: SELECT ?answer WHERE { wd:Q182011 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'мужской'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Antonio Stradivari', 'p': 'male', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'abbreviation', 'o': 'мужской'}}

 Q: What was the Papua New Guinea inflation rate in 2008-1-1?
 SPARQL: SELECT ?obj WHERE { wd:Q691 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Papua New Guinea', 'p': 'inflation rate', 'o': '?x0', 't': '2008'}

 Q: Which characters of Tosca Are U  carceriere?
 SPARQL: SELECT ?obj WHERE { wd:Q192941 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P1705 ?x filter(contains(?x,'Un carceriere')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tosca', 'p': 'characters', 'o': '?x0'}

 Q: What is {place of burial} of {Coco Chanel} that is {coordinate location} is {46.519952777778 6.6010833333333} ?
 SPARQL: SELECT ?obj WHERE { wd:Q45661 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P625 ?x filter(contains(?x,'46.519952777778 6.6010833333333')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Coco Chanel', 'p': 'place of burial', 'o': '?x0'}

 Q: What is {position held} of {Malcolm Fraser} and {electoral district}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q315979 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Fraser', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Malcolm Fraser', 'p': 'position held', 'o': '$y0'}}]

 Q: Which is the Brooklyn Museum artwork ID for butter knife?
 SPARQL: select distinct ?answer where { wd:Q2561443 wdt:P4740 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'butter knife', 'p': 'Brooklyn Museum artwork ID', 'o': '?x0'}

 Q: Is Tina Turner's family name Turner?
 SPARQL: ASK WHERE { wd:Q131814 wdt:P734 wd:Q12804512 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Tina Turner', 'p': 'family name', 'o': '?x0', '?x0': 'Turner'}]

 Q: Is the angular resolution of AMiBA equal to 2?
 SPARQL: ASK WHERE { wd:Q1094807 wdt:P3439 ?obj filter(?obj = 2) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'AMiBA', 'p': 'angular resolution', 'o': '?x0', '?x0': '2'}

 Q: tell  me ice hockey team league National Hockey League starts with o
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P118 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ice hockey team', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'league', 'o': 'National Hockey League'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'o'}}

 Q: What award did Eugene Fama receive on 1-1-2013?
 SPARQL: SELECT ?obj WHERE { wd:Q359317 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2013')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Eugene Fama', 'p': 'award', 'o': '?x0', 't': '2013'}

 Q: What is the {ring system} for {child astronomical body} of {Jupiter}
 SPARQL:  select distinct ?obj where { wd:Q319 wdt:P398 ?obj . ?obj wdt:P31 wd:Q28951811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jupiter', 'p': 'child astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'ring system'}}

 Q: Does the Scoville grade of the Carolina Reaper equal 1255440.0
 SPARQL: ASK WHERE { wd:Q15427475 wdt:P2658 ?obj filter(?obj = 1255440.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Carolina Reaper', 'p': 'Scoville grade', 'o': '?x0', '?x0': '1255440.0'}

 Q: What is the parent organisation of the label Wayfaring Sons?
 SPARQL: SELECT ?answer WHERE { wd:Q7975896 wdt:P264 ?X . ?X wdt:P749 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'parent organisation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wayfaring Sons', 'p': 'label', 'o': '$y0'}}

 Q: What is {key incident} of {record producer} of {Marma Veeran} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6772032 wdt:P162 ?X . ?X wdt:P793 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'key incident', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marma Veeran', 'p': 'producer', 'o': '$y0'}}

 Q: What is <PlantList-ID> of <Spinacia oleracea> ?
 SPARQL: select distinct ?answer where { wd:Q81464 wdt:P1070 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Spinacia oleracea', 'p': 'PlantList-ID', 'o': '?x0'}

 Q: What is {record producer} of {part of series} of {It Hurts Me Too} ?
 SPARQL: SELECT ?answer WHERE { wd:Q50397044 wdt:P179 ?X . ?X wdt:P162 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'producer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'It Hurts Me Too', 'p': 'part of series', 'o': '$y0'}}

 Q: What is {libretto by} of {Das Rheingold}, that has {famous books} is {Lohengrin} ?
 SPARQL: SELECT ?answer WHERE { wd:Q327717 wdt:P87 ?answer . ?answer wdt:P800 wd:Q23085}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Das Rheingold', 'p': 'libretto by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'famous books', 'o': 'Lohengrin'}}

 Q: What is the {federated state} for {headquarters location} of {Nazi Germany}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q7318 . ?sbj wdt:P31 wd:Q107390 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Nazi Germany', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'federated state'}}

 Q: What is {location born} of {Fischer Black}, that has {inhabitants} is {572059.0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q963275 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'572059.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Fischer Black', 'p': 'location born', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inhabitants', 'o': '572059.0'}}

 Q: Is the muzzle velocity of the AK47 less than 572
 SPARQL: ASK WHERE { wd:Q37116 wdt:P4137 ?obj filter(?obj < 572.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'AK47', 'p': 'muzzle velocity', 'o': '?x0', '?x0': '572.0'}

 Q: Did {Antonin_Scalia} {educated at} {Stanford Law School} and {Georgetown College} ?
 SPARQL: ASK WHERE { wd:Q11156 wdt:P69 wd:Q8012895 . wd:Q11156 wdt:P69 wd:Q5546980 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Antonin Scalia', 'p': 'educated at', 'o': '?x0', '?x0': 'Stanford Law School'}, {'h': 'IS', 'v': '?x1', 's': 'Antonin Scalia', 'p': 'educated at', 'o': '?x1', '?x1': 'Georgetown College'}]

 Q: What is the {video game publisher} for {developer} of {Space Invaders}
 SPARQL:  select distinct ?obj where { wd:Q220665 wdt:P178 ?obj . ?obj wdt:P31 wd:Q1137109 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Space Invaders', 'p': 'developer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game publisher'}}

 Q: Give me {film character} that {publisher} {Marvel Comics} and which contains the word {wolverine} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P123 wd:Q173496 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolverine')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'film character', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'publisher', 'o': 'Marvel Comics'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wolverine'}}

 Q: Which is the posthumous work that was the notable work of Ludwig Wittgenstein?
 SPARQL:  select distinct ?obj where { wd:Q9391 wdt:P800 ?obj . ?obj wdt:P31 wd:Q17518461 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ludwig Wittgenstein', 'p': 'notable work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'posthumous work'}}

