 Q: What is the title of the anthem of Somaliland?
 SPARQL: SELECT ?obj WHERE { wd:Q34754 p:P85 ?s . ?s ps:P85 ?obj . ?s pq:P51 ?x filter(contains(?x,'Heesta Qaranka Somaliland.ogg')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Somaliland', 'p': 'anthem', 'o': '?x0'}

 Q: What was the population of Le Mans at the beginning of 2015?
 SPARQL: SELECT ?obj WHERE { wd:Q1476 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Le Mans', 'p': 'population', 'o': '?x0', 't': '2015'}

 Q: What is {nominated for} of {Judy Holliday} that is {for work} is {Born Yesterday} ?
 SPARQL: SELECT ?obj WHERE { wd:Q253298 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q375594 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nominated for', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Judy Holliday', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Born Yesterday'}}}

 Q: Which is {PIN Code} of {deathplace} of {Doug Henning} ?
 SPARQL: SELECT ?answer WHERE { wd:Q301559 wdt:P20 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'PIN Code', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Doug Henning', 'p': 'deathplace', 'o': '$y0'}}

 Q: "What is {confused with} {kinematics}, that is the {inverse} of {statics} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q11476 wdt:P1889 ?answer . ?answer wdt:P461 wd:Q169019}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'kinematics', 'p': 'confused with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'inverse', 'o': 'statics'}}

 Q: What is the mouthpiece of the {Deutsche Bahn} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q9322 wdt:P2813 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Deutsche Bahn', 'p': 'mouthpiece', 'o': '?x0'}

 Q: Which is the FilmPolski.pl ID of Constantin Stanislavski?
 SPARQL: select distinct ?answer where { wd:Q49484 wdt:P3495 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Constantin Stanislavski', 'p': 'FilmPolski.pl ID', 'o': '?x0'}

 Q: What is <WOEID> of <Stuttgart> ?
 SPARQL: select distinct ?answer where { wd:Q1022 wdt:P1281 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Stuttgart', 'p': 'WOEID', 'o': '?x0'}

 Q: What is the {charter city} for {narrative location} of {Die Hard}
 SPARQL:  select distinct ?obj where { wd:Q105598 wdt:P840 ?obj . ?obj wdt:P31 wd:Q13218391 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Die Hard', 'p': 'narrative location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'charter city'}}

 Q: What is {afflicts} of {cause of} of {2,4,6-trinitrotoluene} ?
 SPARQL: SELECT ?answer WHERE { wd:Q170167 wdt:P1542 ?X . ?X wdt:P689 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'afflicts', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '2,4,6-trinitrotoluene', 'p': 'cause of', 'o': '$y0'}}

 Q: What is the {sovereign state} for {country} of {Himachal Pradesh}
 SPARQL:  select distinct ?obj where { wd:Q1177 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Himachal Pradesh', 'p': 'country', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sovereign state'}}

 Q: For Karlheinz Stockhausen was spoused was in the end time in the year 1972?
 SPARQL: SELECT ?obj WHERE { wd:Q154556 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1972')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Karlheinz Stockhausen', 'p': 'spouse', 'o': '?x0', 't': '1972'}

 Q: Give me {shipwrecking} that contains the word {ålesundsolyckorna} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ålesundsolyckorna')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'shipwrecking'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'ålesundsolyckorna'}}

 Q: Which is the FFH-Habitat which contains the word vegetation in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60029820 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vegetation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'FFH-Habitat'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vegetation'}}

 Q: Give me {occupation} that starts with {'w'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12737077 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'occupation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: What is the {aspect of history} for {facet of} of {polymerase chain reaction}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1269 wd:Q176996 . ?sbj wdt:P31 wd:Q17524420 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'facet of', 'o': 'polymerase chain reaction', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'aspect of history'}}

 Q: What is {writers} of {The Right Stuff}, that has {career} is {non-fiction writer} ?
 SPARQL: SELECT ?answer WHERE { wd:Q3301814 wdt:P50 ?answer . ?answer wdt:P106 wd:Q15980158}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Right Stuff', 'p': 'author', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'career', 'o': 'non-fiction writer'}}

 Q: Which is the position that applies to the jurisdiction of Coptic Orthodox Church of Alexandria?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1001 wd:Q198998 . ?sbj wdt:P31 wd:Q4164871 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'jurisdiction', 'o': 'Coptic Orthodox Church of Alexandria', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position'}}

 Q: Which is the international organization of the secretary general Vladimir Norov and contains the word cooperation in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484652 . ?sbj wdt:P3975 wd:Q365665 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooperation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'international organization', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'secretary general', 'o': 'Vladimir Norov'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'cooperation'}}

 Q: Tell me the population of Makati on 2010-5-1?
 SPARQL: SELECT ?obj WHERE { wd:Q1508 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Makati', 'p': 'population', 'o': '?x0', 't': '2010'}

 Q: What is {spouse} of {Ingrid Bergman} and {end time}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q43247 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ingrid Bergman', 'p': 'married', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ingrid Bergman', 'p': 'married', 'o': '$y0'}}]

 Q: Is the refractive index of water equal to 1.32524?
 SPARQL: ASK WHERE { wd:Q283 wdt:P1109 ?obj filter(?obj = 1.32524) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'water', 'p': 'refractive index', 'o': '?x0', '?x0': '1.32524'}

 Q: What is the ISSF ID of Kim Rhode?
 SPARQL: select distinct ?answer where { wd:Q233759 wdt:P2730 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Kim Rhode', 'p': 'ISSF ID', 'o': '?x0'}

 Q: Is it true that the VAT-rate of the Australia equals to 8.0?
 SPARQL: ASK WHERE { wd:Q408 wdt:P2855 ?obj filter(?obj = 8.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Australia', 'p': 'VAT-rate', 'o': '?x0', '?x0': '8.0'}

 Q: Where is the tourist office of Hanover?
 SPARQL: select distinct ?answer where { wd:Q1715 wdt:P2872 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hanover', 'p': 'tourist office', 'o': '?x0'}

 Q: What is the {film} for {director} of {Baz Luhrmann}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P57 wd:Q250545 . ?sbj wdt:P31 wd:Q11424 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'director', 'o': 'Baz Luhrmann', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'movie'}}

 Q: Who is the current holder of the award once won by Andre Geim?
 SPARQL: SELECT ?answer WHERE { wd:Q104104 wdt:P166 ?X . ?X wdt:P1346 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'won by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andre Geim', 'p': 'award', 'o': '$y0'}}

 Q: What actor plays Professor X in the film X-Men: Apocalypse?
 SPARQL: SELECT ?obj WHERE { wd:Q838076 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q17042878 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Professor X', 'p': 'actor', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'of', 'o': 'X-Men: Apocalypse'}}}

 Q: what is the {end time} for {Sebastian Vettel} has {member of sports team} as {Scuderia Toro Rosso} ?
 SPARQL: SELECT ?value WHERE { wd:Q42311 p:P54 ?s . ?s ps:P54 wd:Q141818 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sebastian Vettel', 'p': 'member of sports team', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'member of sports team', 'o': 'Scuderia Toro Rosso'}}}

 Q: Give me {integer} that contains the word {10} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12503 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), '10')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'integer'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': '10'}}

 Q: Is the topographic isolation of Signalkuppe equal to 0.56?
 SPARQL: ASK WHERE { wd:Q30405 wdt:P2659 ?obj filter(?obj = 0.56) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Signalkuppe', 'p': 'topographic isolation', 'o': '?x0', '?x0': '0.56'}

 Q: Who is {educated at} of {Rachel Maddow} where {end time} is {2001-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q555 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2001')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rachel Maddow', 'p': 'educated at', 'o': '?x0', 't': '2001'}

 Q: What is the {country} for {contains administrative territorial entity} of {Beijing}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P150 wd:Q956 . ?sbj wdt:P31 wd:Q6256 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'contains administrative territorial entity', 'o': 'Beijing', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'country'}}

 Q: When did Alexander III of Russia receive the award for Knight Grand Cross of the Military Order of William?
 SPARQL: SELECT ?value WHERE { wd:Q120180 p:P166 ?s . ?s ps:P166 wd:Q2424158 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Alexander III of Russia', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Knight Grand Cross of the Military Order of William'}, 't': '?x0'}

 Q: How many constellations are there in the Milky Way?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q321 wdt:P59 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Milky Way', 'p': 'constellation', 'o': '?x0'}

 Q: What award was Terry Pratchett nominated for?
 SPARQL:  select distinct ?obj where { wd:Q46248 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q618779 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Terry Pratchett', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'award'}}

 Q: Is the unemployment rate of Lesotho equal to 26?
 SPARQL: ASK WHERE { wd:Q1013 wdt:P1198 ?obj filter(?obj = 26) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Lesotho', 'p': 'unemployment rate', 'o': '?x0', '?x0': '26'}

 Q: How many {record held} are to/by {pole vault} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1000 wd:Q185027 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'record held', 'o': 'pole vault'}

 Q: is it true that the thermal conductivity of tin II oxide is equal to 38.24?
 SPARQL: ASK WHERE { wd:Q204980 wdt:P2068 ?obj filter(?obj = 38.24) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'tin(II) oxide', 'p': 'thermal conductivity', 'o': '?x0', '?x0': '38.24'}

 Q: What is the {geography of geographic location} for {geography of topic} of {Sindh}
 SPARQL:  select distinct ?obj where { wd:Q37211 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sindh', 'p': 'geography of topic', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'geography of geographic location'}}

 Q: what is the {start time} for {Marche} has {head of government} as {Luca Ceriscioli} ?
 SPARQL: SELECT ?value WHERE { wd:Q1279 p:P6 ?s . ?s ps:P6 wd:Q3838079 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Marche', 'p': 'head of government', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'head of government', 'o': 'Luca Ceriscioli'}}}

 Q: What is {developed by} of {Advanced Audio Coding}, that has {wgs 84} is {49.5472} ?
 SPARQL: SELECT ?answer WHERE { wd:Q337594 wdt:P178 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'49.5472'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Advanced Audio Coding', 'p': 'developed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'wgs 84', 'o': '49.5472'}}

 Q: What is {split from} of {musical key} of {Violin Concerto No. 1 (Bruch)} ?
 SPARQL: SELECT ?answer WHERE { wd:Q163689 wdt:P826 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'split from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Violin Concerto No. 1', 'p': 'musical key', 'o': '$y0'}}

 Q: Is the vertical depth of Midenata peshtera equal to 0?
 SPARQL: ASK WHERE { wd:Q60040067 wdt:P4511 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Midenata peshtera', 'p': 'vertical depth', 'o': '?x0', '?x0': '0'}

 Q: Is it true that the number of survivors of September 13 incident is greater than 0?
 SPARQL: ASK WHERE { wd:Q10878635 wdt:P1561 ?obj filter(?obj > 0.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'September 13 incident', 'p': 'number of survivors', 'o': '?x0', '?x0': '0.0'}

 Q: What is the conflict of J.R.R. Tolkien?
 SPARQL: select distinct ?answer where { wd:Q892 wdt:P607 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tolkien', 'p': 'conflict', 'o': '?x0'}

 Q: How many {member of} are to/by {International Hydrographic Organization} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P463 wd:Q233611 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'member of', 'o': 'International Hydrographic Organization'}

 Q: What is the combustion enthalpy for acetylene?
 SPARQL: select distinct ?answer where { wd:Q133145 wdt:P2117 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'acetylene', 'p': 'combustion enthalpy', 'o': '?x0'}

 Q: What is the {type of quantum particle} for {antiparticle} of {photon}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2152 wd:Q3198 . ?sbj wdt:P31 wd:Q22675015 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'antiparticle', 'o': 'photon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'type of quantum particle'}}

 Q: How many {influenced by} are to/by {Thomas Hobbes} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q37621 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'influenced by', 'o': 'Thomas Hobbes'}

 Q: what is the {point in time} for {Shania Twain} has {nominated for} as {Grammy Award for Best Female Country Vocal Performance} ?
 SPARQL: SELECT ?value WHERE { wd:Q131433 p:P1411 ?s . ?s ps:P1411 wd:Q5593802 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Shania Twain', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Grammy Award for Best Female Country Vocal Performance'}, 't': '?x0'}

 Q: what is the {start time} for {Kaliningrad} has {twinned administrative body} as {Baranovichi} ?
 SPARQL: SELECT ?value WHERE { wd:Q1829 p:P190 ?s . ?s ps:P190 wd:Q237655 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'from', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Kaliningrad', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Baranovichi'}}}

 Q: What is the {human} for {editor} of {The New York Times}
 SPARQL:  select distinct ?obj where { wd:Q9684 wdt:P98 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The New York Times', 'p': 'editor', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is {goddess of} of {executioner} of {Osiris} ?
 SPARQL: SELECT ?answer WHERE { wd:Q46491 wdt:P157 ?X . ?X wdt:P2925 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'goddess of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Osiris', 'p': 'executioner', 'o': '$y0'}}

 Q: what is the {object has role} for {Buddenbrooks} has {characters} as {Bendix Grünlich} ?
 SPARQL: SELECT ?value WHERE { wd:Q326909 p:P674 ?s . ?s ps:P674 wd:Q42324827 . ?s pq:P3831 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'object has role', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Buddenbrooks', 'p': 'characters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'characters', 'o': 'Bendix Grünlich'}}}

 Q: What's the total amount of operators employed in the London Underground?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q20075 wdt:P137 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'London Underground', 'p': 'operator', 'o': '?x0'}

 Q: Does the takeoff roll of the G.91T equal to 4760?
 SPARQL: ASK WHERE { wd:Q21024216 wdt:P2430 ?obj filter(?obj = 4760) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'G.91T', 'p': 'takeoff roll', 'o': '?x0', '?x0': '4760'}

 Q: Which taxon has the highest heart rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3395 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'heart rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'taxon'}}

 Q: When did the Dakahlia Governorate have the population 6492381?
 SPARQL: SELECT ?value WHERE { wd:Q31068 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'6492381')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Dakahlia Governorate', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'population', 'o': '6492381'}, 't': '?x0'}

 Q: What is Tampere's Finnish municipality number?
 SPARQL: select distinct ?answer where { wd:Q40840 wdt:P1203 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Tampere', 'p': 'Finnish municipality number', 'o': '?x0'}

 Q: Is the total shots in career of  Kyle Rossiter equal to 1?
 SPARQL: ASK WHERE { wd:Q3200939 wdt:P6543 ?obj filter(?obj = 1) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Kyle Rossiter', 'p': 'total shots in career', 'o': '?x0', '?x0': '1'}

 Q: What is {actress} of {comes before} of {Dumb and Dumberer: When Harry Met Lloyd} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1265087 wdt:P156 ?X . ?X wdt:P161 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'actress', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dumb and Dumberer: When Harry Met Lloyd', 'p': 'comes before', 'o': '$y0'}}

 Q: What is {position held} of {Donald Tusk} that is {replaces} is {Herman Van Rompuy} ?
 SPARQL: SELECT ?obj WHERE { wd:Q946 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q12983 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Donald Tusk', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced', 'o': 'Herman Van Rompuy'}}}

 Q: Who did Wallis Simpson marry in 1928?
 SPARQL: SELECT ?obj WHERE { wd:Q209417 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1928')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Wallis Simpson', 'p': 'marry', 'o': '?x0', 't': '1928'}

 Q: Name the district of China that contains Shanghai.
 SPARQL:  select distinct ?obj where { wd:Q8686 wdt:P150 ?obj . ?obj wdt:P31 wd:Q1065118 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Shanghai', 'p': 'contains', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'district of China'}}

 Q: What is Zygoptera's BHL Page ID?
 SPARQL: select distinct ?answer where { wd:Q230502 wdt:P687 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Zygoptera', 'p': 'BHL Page ID', 'o': '?x0'}

 Q: Which is {label in official language} of {muscle insertion} {clavicle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16343 wdt:P3491 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'label in official language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'clavicle', 'p': 'muscle insertion', 'o': '$y0'}}

 Q: What is the {television station} for {language used} of {Japanese}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2936 wd:Q5287 . ?sbj wdt:P31 wd:Q1616075 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'language used', 'o': 'Japanese', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television station'}}

 Q: What is Spotify artist ID for R. Kelly ?
 SPARQL: select distinct ?answer where { wd:Q273055 wdt:P1902 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'R. Kelly', 'p': 'Spotify artist ID', 'o': '?x0'}

 Q: Which is the MOOMA artist ID of Vanessa Paradis?
 SPARQL: select distinct ?answer where { wd:Q51023 wdt:P3733 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Vanessa Paradis', 'p': 'MOOMA artist ID', 'o': '?x0'}

 Q: Did {Philosophy} {different from} {dogma}?
 SPARQL: ASK WHERE { wd:Q5891 wdt:P1889 wd:Q620749 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'philosophy', 'p': 'different from', 'o': '?x0', '?x0': 'dogma'}]

 Q: Give me {disease} that {pathogen transmission process} {contact transmission} and which that starts with {'s'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj wdt:P1060 wd:Q15304512 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'disease', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'pathogen transmission process', 'o': 'contact'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: What product was built by Asus ZenWatch 3?
 SPARQL: SELECT ?answer WHERE { wd:Q30161124 wdt:P176 ?X . ?X wdt:P1056 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'product', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Asus ZenWatch 3', 'p': 'built by', 'o': '$y0'}}

 Q: What is the academic subject of Michael J. D. Powell's recognition title?
 SPARQL: SELECT ?answer WHERE { wd:Q588371 wdt:P166 ?X . ?X wdt:P101 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'subject', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michael J. D. Powell', 'p': 'recognition title', 'o': '$y0'}}

 Q: What is the {human settlement} for {capital of} of {Tokugawa shogunate}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1376 wd:Q205662 . ?sbj wdt:P31 wd:Q486972 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'capital of', 'o': 'Tokugawa Shogunate', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human settlement'}}

 Q: What is {nominated for} of {Adolf von Baeyer} that is {point in time} is {1904-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q57078 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1904')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Adolf von Baeyer', 'p': 'nominated for', 'o': '?x0', 't': '1904'}

 Q: What is {twinned administrative body} of {Qingdao} that is {start time} is {2009-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q170322 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2009')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Qingdao', 'p': 'twinned administrative body', 'o': '?x0', 't': '2009'}

 Q: What is {eponym} of {Gaussian elimination}, that has {birth year} is {1777-4-30} ?
 SPARQL: SELECT ?answer WHERE { wd:Q2658 wdt:P138 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1777'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gaussian elimination', 'p': 'eponym', 'o': '?x0', 't': '1777'}

 Q: What is {sequel is} of {temporal range end} of {Iguanodon} ?
 SPARQL: SELECT ?answer WHERE { wd:Q130980 wdt:P524 ?X . ?X wdt:P156 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sequel is', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Iguanodon', 'p': 'temporal range end', 'o': '$y0'}}

 Q: How many superpowers does Superman have?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q79015 wdt:P2563 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Superman', 'p': 'superpower', 'o': '?x0'}

 Q: What is {disease treated} of {treated by} of {lymphoma} ?
 SPARQL: SELECT ?answer WHERE { wd:Q208414 wdt:P2176 ?X . ?X wdt:P2175 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'disease treated', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'lymphoma', 'p': 'treatment', 'o': '$y0'}}

 Q: What is {played by] of {computer network} that {painting of} is {network}?
 SPARQL: SELECT ?answer WHERE { wd:Q1301371 wdt:P1299 ?answer . ?answer wdt:P180 wd:Q1900326}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'computer network', 'p': 'played by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'painting of', 'o': 'network'}}

 Q: Give me {Devi} that {worshipped by} {Hinduism} and which that starts with {'l'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q494511 . ?sbj wdt:P1049 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'devi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'worshipped by', 'o': 'Hinduism'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: which set of numbers with the highest upper limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q3054943 . ?ent wdt:P5448 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'upper limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'set of numbers'}}

 Q: What is the {standards body} and the {main regulatory text} of {Hypertext_Transfer_Protocol} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q8777 wdt:P1462 ?ans_1 . wd:Q8777 wdt:P92 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Hypertext Transfer Protocol', 'p': 'standards body', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Hypertext Transfer Protocol', 'p': 'main regulatory text', 'o': '?x1'}]

 Q: Is BDSM different from violence?
 SPARQL: ASK WHERE { wd:Q190845 wdt:P1889 wd:Q124490 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'BDSM', 'p': 'different from', 'o': '?x0', '?x0': 'violence'}]

 Q: What is {established} of {member of} of {Franz Boas} ?
 SPARQL: SELECT ?answer WHERE { wd:Q76857 wdt:P463 ?X . ?X wdt:P571 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'established', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Boas', 'p': 'member of', 'o': '$y0'}}

 Q: Which country shared border with Nazi Germany until 1939?
 SPARQL: SELECT ?obj WHERE { wd:Q7318 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1939')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nazi Germany', 'p': 'border', 'o': '?x0', 't': '1939'}

 Q: What is {admin HQ} of {team played for} of {Somchai Subpherm} ?
 SPARQL: SELECT ?answer WHERE { wd:Q4926223 wdt:P54 ?X . ?X wdt:P159 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'HQ', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Somchai Subpherm', 'p': 'team', 'o': '$y0'}}

 Q: What is {position held} of {Lenín Moreno} that is {elected in} is {Ecuadorian general election, 2006} ?
 SPARQL: SELECT ?obj WHERE { wd:Q518626 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q1285633 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Lenín Moreno', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'election', 'o': 'Ecuadorian general election, 2006'}}}

 Q: IS THE BASIC SALARY OF GEORGE STEHENSON LESS THAN 528?
 SPARQL: ASK WHERE { wd:Q133614 wdt:P3618 ?obj filter(?obj < 528.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'George Stephenson', 'p': 'base salary', 'o': '?x0', '?x0': '528.0'}

 Q: Which is the Orphanet ID of leprosy?
 SPARQL: select distinct ?answer where { wd:Q36956 wdt:P1550 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'leprosy', 'p': 'Orphanet ID', 'o': '?x0'}

 Q: What is the MPAA film rating of Ghostbusters?
 SPARQL: select distinct ?answer where { wd:Q108745 wdt:P1657 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ghostbusters', 'p': 'MPAA film rating', 'o': '?x0'}

 Q: Who is the plaintiff of Plessy v. Ferguson?
 SPARQL: select distinct ?answer where { wd:Q656660 wdt:P1620 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Plessy v. Ferguson', 'p': 'plaintiff', 'o': '?x0'}

 Q: Is it true that the annual number of weddings of Kaprijke is less than 16.8?
 SPARQL: ASK WHERE { wd:Q12437 wdt:P5982 ?obj filter(?obj < 16.8) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Kaprijke', 'p': 'annual number of weddings', 'o': '?x0', '?x0': '16.8'}

 Q: Does the attendance of the 19th Grey Cup equal 4089.6?
 SPARQL: ASK WHERE { wd:Q4595757 wdt:P1110 ?obj filter(?obj = 4089.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '19th Grey Cup', 'p': 'attendance', 'o': '?x0', '?x0': '4089.6'}

 Q: What fictional dog is said to be the same dog as Goofy?
 SPARQL:  select distinct ?obj where { wd:Q111135 wdt:P460 ?obj . ?obj wdt:P31 wd:Q15720625 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Goofy', 'p': 'same', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'fictional dog'}}

 Q: What is {occupation} of {Bettie Page} and {follows}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q61898 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P155 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'follows', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bettie Page', 'p': 'job', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'job', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Bettie Page', 'p': 'job', 'o': '$y0'}}]

 Q: What is {culture} of {executioner} of {Juan Rodríguez Suárez} ?
 SPARQL: SELECT ?answer WHERE { wd:Q598409 wdt:P157 ?X . ?X wdt:P172 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'culture', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Juan Rodriguez Suarez', 'p': 'executioner', 'o': '$y0'}}

