 Q: Give me {space observatory} that {start point} {ELA-3} and which contains the word {space} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj wdt:P1427 wd:Q455731 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'space')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'space observatory', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'start point', 'o': 'ELA-3'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'space'}}

 Q: What is the {human} for {production designer} of {The Birth of a Nation}
 SPARQL:  select distinct ?obj where { wd:Q220394 wdt:P2554 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Birth of a Nation', 'p': 'production designer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the standard molar entropy of ethanol?
 SPARQL: select distinct ?answer where { wd:Q153 wdt:P3071 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'ethanol', 'p': 'standard molar entropy', 'o': '?x0'}

 Q: Who is the spouse of John Denver, who died in 1993?
 SPARQL: SELECT ?obj WHERE { wd:Q105460 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1993')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Denver', 'p': 'spouse', 'o': '?x0', 't': '1993'}

 Q: What is founded by University of Chicago for the role of donor?
 SPARQL: SELECT ?obj WHERE { wd:Q131252 p:P112 ?s . ?s ps:P112 ?obj . ?s pq:P3831 wd:Q1968442 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'founded by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'University of Chicago', 'p': 'founded by', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'role', 'o': 'donor'}}}

 Q: What is {number of out of school children} of {Oceania} that is {point in time} is {2005-1-1} ?
 SPARQL: SELECT ?obj WHERE { wd:Q538 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Oceania', 'p': 'number of out of school children', 'o': '?x0', 't': '2005'}

 Q: Who is the {human} for {place of death} of {Madrid}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P20 wd:Q2807 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Madrid', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: How many {located on terrain feature} are to/by {Andaman Sea} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P706 wd:Q47632 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'location', 'o': 'Andaman Sea'}

 Q: What is the vapor pressure of butane when its temperature is at 68.0?
 SPARQL: SELECT ?obj WHERE { wd:Q134192 p:P2119 ?s . ?s ps:P2119 ?obj . ?s pq:P2076 ?x filter(contains(?x,'68.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'vapor pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'butane', 'p': 'vapor pressure', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'temperature', 'o': '68.0'}}}

 Q: What is <produced by> of <coral> ?
 SPARQL: select distinct ?answer where { wd:Q171446 wdt:P2849 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'coral', 'p': 'produced by', 'o': '?x0'}

 Q: Who was the spouse of John Gilbert up until the beginning of 1931?
 SPARQL: SELECT ?obj WHERE { wd:Q503956 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1931')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Gilbert', 'p': 'spouse', 'o': '?x0', 't': '1931'}

 Q: Is the stated age at the event of the Hammou Mouhal greater than 30.4?
 SPARQL: ASK WHERE { wd:Q3126541 wdt:P3629 ?obj filter(?obj > 30.4) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Hammou Mouhal', 'p': 'age at event', 'o': '?x0', '?x0': '30.4'}

 Q: What is the {mass murder} for {immediate cause of} of {War on Terror}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1536 wd:Q185729 . ?sbj wdt:P31 wd:Q750215 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'immediate cause of', 'o': 'War on Terror', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mass murder'}}

 Q: What is {award received} of {Sidney Sheldon} that is {statement is subject of} is {20th Academy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q105118 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q303473 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sidney Sheldon', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '20th Academy Awards'}}}

 Q: Who was Jiang Qing's spouse after 1936?
 SPARQL: SELECT ?obj WHERE { wd:Q236017 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1936')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Jiang Qing', 'p': 'spouse', 'o': '?x0', 't': '1936'}

 Q: What is {pronunciation audio} of {ecology} that is {language of work or name} is {German} ?
 SPARQL: SELECT ?obj WHERE { wd:Q7150 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q188 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pronunciation audio', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'ecology', 'p': 'pronunciation audio', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'language of work or name', 'o': 'German'}}}

 Q: What is {audio} of {harpsichord} that is {media legend} is {Preludi en do major de Johann Sebastian Bach per a clavicèmbal} ?
 SPARQL: SELECT ?obj WHERE { wd:Q81982 p:P51 ?s . ?s ps:P51 ?obj . ?s pq:P2096 ?x filter(contains(?x,'Preludi en do major de Johann Sebastian Bach per a clavicèmbal')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'harpsichord', 'p': 'audio', 'o': '?x0'}

 Q: What is the partner town of the birth place of Leonardo DiCaprio?
 SPARQL: SELECT ?answer WHERE { wd:Q38111 wdt:P19 ?X . ?X wdt:P190 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'partner town', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Leonardo DiCaprio', 'p': 'birth place', 'o': '$y0'}}

 Q: What is the {hypothesis} for {manifestation of} of {many-worlds interpretation}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1557 wd:Q40590 . ?sbj wdt:P31 wd:Q41719 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'manifestation of', 'o': 'many-worlds interpretation', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'hypothesis'}}

 Q: What was Mickey Rourke nominated for and what award did he receive?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q178552 wdt:P1411 ?ans_1 . wd:Q178552 wdt:P166 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Mickey Rourke', 'p': 'nominated for', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Mickey Rourke', 'p': 'award', 'o': '?x1'}]

 Q: The biological process of learning is what?
 SPARQL: select distinct ?answer where { ?answer wdt:P682 wd:Q133500}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'biological process', 'o': 'learning'}

 Q: What Class IB flammable liquid has the highest time-weighted average exposure limit?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2404 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'time-weighted average exposure limit', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Class IB flammable liquid'}}

 Q: What is Cao Xueqin's Eight Banner register?
 SPARQL: select distinct ?answer where { wd:Q182874 wdt:P470 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Cao Xueqin', 'p': 'Eight Banner register', 'o': '?x0'}

 Q: Is the nominal GDP per capita of North Macedonia more than 5823.192?
 SPARQL: ASK WHERE { wd:Q221 wdt:P2132 ?obj filter(?obj > 5823.192) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'North Macedonia', 'p': 'nominal GDP per capita', 'o': '?x0', '?x0': '5823.192'}

 Q: What is the moveable object location of the Sicilian Expedition, that has a coordinate moveable object location of 14.0154?
 SPARQL: SELECT ?answer WHERE { wd:Q844289 wdt:P276 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'14.0154'))}
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Sicilian Expedition', 'p': 'location', 'o': '?x0', '?x0': '14.0154'}]

 Q: What is {chronology of topic} of {citizenship} of {Harry Chipeni} ?
 SPARQL: SELECT ?answer WHERE { wd:Q45781169 wdt:P27 ?X . ?X wdt:P2184 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chronology of topic', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Harry Chipeni', 'p': 'citizenship', 'o': '$y0'}}

 Q: What is {has grammatical person} of {languages of expression} of {Magda Szabó} ?
 SPARQL: SELECT ?answer WHERE { wd:Q231948 wdt:P1412 ?X . ?X wdt:P5110 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has grammatical person', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Magda Szabó', 'p': 'languages of expression', 'o': '$y0'}}

 Q: What is the artfor of the moveable object location of Ärztestopp?
 SPARQL: SELECT ?answer WHERE { wd:Q256634 wdt:P276 ?X . ?X wdt:P805 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'artfor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ärztestopp', 'p': 'location', 'o': '$y0'}}

 Q: Which is the maximum operating altitude for Airbus A380?
 SPARQL: select distinct ?answer where { wd:Q5830 wdt:P2254 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Airbus A380', 'p': 'maximum operating altitude', 'o': '?x0'}

 Q: What was the population of San Francisco at the beginning of 1880?
 SPARQL: SELECT ?obj WHERE { wd:Q62 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1880')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'San Francisco', 'p': 'population', 'o': '?x0', 't': '1880'}

 Q: What is {Classification of Instructional Programs ID} of {aspect of} of {standard deviation} ?
 SPARQL: SELECT ?answer WHERE { wd:Q159375 wdt:P1269 ?X . ?X wdt:P2357 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Classification of Instructional Programs ID', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'standard deviation', 'p': 'aspect of', 'o': '$y0'}}

 Q: What is {position held} of {Henry Temple, 3rd Viscount Palmerston} that is {end time} is {1841-6-23} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193656 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1841')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Henry Temple, 3rd Viscount Palmerston', 'p': 'position held', 'o': '?x0', 't': '1841'}

 Q: What is the {business} for {chief executive officer} of {Indra Nooyi}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P169 wd:Q264913 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'chief executive officer', 'o': 'Indra Nooyi', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is <Fauna Europaea New ID> of <Annelida> ?
 SPARQL: select distinct ?answer where { wd:Q25522 wdt:P4807 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Annelida', 'p': 'Fauna Europaea New ID', 'o': '?x0'}

 Q: What is the {monoanion} for {conjugate base} of {water}
 SPARQL:  select distinct ?obj where { wd:Q283 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55523986 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'water', 'p': 'conjugate base', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'monoanion'}}

 Q: What is {took part in} of {Mark Skaife}, that has {outcome} is {1926 24 Hours of Le Mans} ?
 SPARQL: SELECT ?answer WHERE { wd:Q963937 wdt:P1344 ?answer . ?answer wdt:P793 wd:Q216349}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Mark Skaife', 'p': 'took part', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'outcome', 'o': '1926 24 Hours of Le Mans'}}

 Q: What is <TV.com ID> of <Schindler's List> ?
 SPARQL: select distinct ?answer where { wd:Q483941 wdt:P2638 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': "Schindler's List", 'p': 'TV.com ID', 'o': '?x0'}

 Q: What is the {abstract strategy game} with the {MIN(minimum number of players)} whose {instance of} is {abstract strategy game}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q573573 . ?ent wdt:P1872 ?obj . ?ent wdt:P31 wd:Q573573} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'minimum number of players', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'abstract strategy game'}}

 Q: On the date 29th January 2018 , what award was received by Joko Widodo?
 SPARQL: SELECT ?obj WHERE { wd:Q3318231 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Joko Widodo', 'p': 'award', 'o': '?x0', 't': '2018'}

 Q: What is the {perpetual war} for {significant event} of {Cuban Missile Crisis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P793 wd:Q128160 . ?sbj wdt:P31 wd:Q1469686 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'significant event', 'o': 'Cuban Missile Crisis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'perpetual war'}}

 Q: What is the motif of the mascot of the Wisconsin Badgers?
 SPARQL: SELECT ?answer WHERE { wd:Q3098117 wdt:P822 ?X . ?X wdt:P180 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'motif', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Wisconsin Badgers', 'p': 'mascot', 'o': '$y0'}}

 Q: What is the {safety classification and labelling} and the {found in taxon} of {Ethanol} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q153 wdt:P4952 ?ans_1 . wd:Q153 wdt:P703 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Ethanol', 'p': 'safety classification and labelling', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Ethanol', 'p': 'found in taxon', 'o': '?x1'}]

 Q: Is the damage cost of the Tulsa Massacre 30000000?
 SPARQL: ASK WHERE { wd:Q1824714 wdt:P2630 ?obj filter(?obj = 30000000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tulsa Massacre', 'p': 'damage', 'o': '?x0', '?x0': '30000000'}

 Q: What is {commands} of {Anthony Eden}, that has {demolished} is {1966-0-0} ?
 SPARQL: SELECT ?answer WHERE { wd:Q128995 wdt:P598 ?answer . ?answer wdt:P576 ?x FILTER(contains(YEAR(?x),'1966'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Earl of Avon', 'p': 'commands', 'o': '?x0', 't': '1966'}

 Q: What award did John Wayne receive in 2007?
 SPARQL: SELECT ?obj WHERE { wd:Q40531 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'John Wayne', 'p': 'award', 'o': '?x0', 't': '2007'}

 Q: What is {label in original language} of {is daughter of} of {Tyr} ?
 SPARQL: SELECT ?answer WHERE { wd:Q172713 wdt:P22 ?X . ?X wdt:P1705 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'label in original language', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tyr', 'p': 'daughter of', 'o': '$y0'}}

 Q: Is the total votes of the Popular Initiative, "Protection Against Passive Smoking" 1150388?
 SPARQL: ASK WHERE { wd:Q3151185 wdt:P1111 ?obj filter(?obj = 1150388.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Popular initiative "protection against passive smoking"', 'p': 'votes received', 'o': '?x0', '?x0': '1150388.0'}

 Q: Is the draft of Adler XI equal to 1.45?
 SPARQL: ASK WHERE { wd:Q358239 wdt:P2262 ?obj filter(?obj = 1.45) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Adler XI', 'p': 'draft', 'o': '?x0', '?x0': '1.45'}

 Q: Which is the dual to the pyramid?
 SPARQL: select distinct ?answer where { wd:Q3358290 wdt:P1322 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pyramid', 'p': 'dual to', 'o': '?x0'}

 Q: What is {end cause} and {elected in} of {{Park Geun-hye} has {position held} as {Member of National Assembly of South Korea}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q138048 p:P39 ?s . ?s ps:P39 wd:Q14850694 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end cause', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Geun-hye', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of National Assembly of South Korea'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'elected in', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Park Geun-hye', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'Member of National Assembly of South Korea'}}}]

 Q: What is {noble title} of {Guy of Lusignan} and {followed by}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'noble title', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guy of Lusignan', 'p': 'noble title', 'o': '$y0'}}]

 Q: What is {characters} of {SpongeBob SquarePants} that is {voice actor} is {Clancy Brown} ?
 SPARQL: SELECT ?obj WHERE { wd:Q83279 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P725 wd:Q4488 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'characters', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'SpongeBob SquarePants', 'p': 'characters', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'voice actor', 'o': 'Clancy Brown'}}}

 Q: What is {field of this profession} of {profession} of {Sataspes} ?
 SPARQL: SELECT ?answer WHERE { wd:Q956216 wdt:P106 ?X . ?X wdt:P425 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of this profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sataspes', 'p': 'work', 'o': '$y0'}}

 Q: What is {border} of {place of activity} of {Paulo Freire} ?
 SPARQL: SELECT ?answer WHERE { wd:Q164797 wdt:P937 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Paulo Freire', 'p': 'place of activity', 'o': '$y0'}}

 Q: What is {form of government} of {place of origin} of {death metal} ?
 SPARQL: SELECT ?answer WHERE { wd:Q483251 wdt:P495 ?X . ?X wdt:P122 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'form of government', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'death metal', 'p': 'place of origin', 'o': '$y0'}}

 Q: what is the {start time} for {Fort Lauderdale} has {twinned administrative body} as {Astrakhan} ?
 SPARQL: SELECT ?value WHERE { wd:Q165972 p:P190 ?s . ?s ps:P190 wd:Q3927 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Fort Lauderdale', 'p': 'twinned administrative body', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'twinned administrative body', 'o': 'Astrakhan'}}}

 Q: What is {place of burial} of {Nestor Makhno} that is {Commons category} is {Grave of Nestor Makhno} ?
 SPARQL: SELECT ?obj WHERE { wd:Q47900 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P373 ?x filter(contains(?x,'Grave of Nestor Makhno')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Nestor Makhno', 'p': 'place of burial', 'o': '?x0'}

 Q: What is the {transcontinental country} for {diplomatic relation} of {Empire of Japan}
 SPARQL:  select distinct ?obj where { wd:Q188712 wdt:P530 ?obj . ?obj wdt:P31 wd:Q1323642 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Empire of Japan', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'transcontinental country'}}

 Q: What is the {national library} for {archives at} of {James Joyce}
 SPARQL:  select distinct ?obj where { wd:Q6882 wdt:P485 ?obj . ?obj wdt:P31 wd:Q22806 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'James Joyce', 'p': 'archives at', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national library'}}

 Q: What murder method of Camaron de la Isla is due to air pollution?
 SPARQL: SELECT ?answer WHERE { wd:Q312093 wdt:P509 ?answer . ?answer wdt:P828 wd:Q131123}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Camaron', 'p': 'murder method', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'due to', 'o': 'air pollution'}}

 Q: What award was received by Seymour Hersh in 1970?
 SPARQL: SELECT ?obj WHERE { wd:Q435792 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1970')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Seymour Hersh', 'p': 'award', 'o': '?x0', 't': '1970'}

 Q: When did Liza Minnelli and her husband David Gest get divorced?
 SPARQL: SELECT ?value WHERE { wd:Q14441 p:P26 ?s . ?s ps:P26 wd:Q10264401 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'divorced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Liza Minnelli', 'p': 'husband', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'husband', 'o': 'David Gest'}}}

 Q: How many symbols are there for Manitoba?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q1948 wdt:P2238 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Manitoba', 'p': 'symbol', 'o': '?x0'}

 Q: Is Ceraunius' diamater higher than 0?
 SPARQL: ASK WHERE { wd:Q24064213 wdt:P2386 ?obj filter(?obj > 0.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Ceraunius', 'p': 'diameter', 'o': '?x0', '?x0': '0.0'}

 Q: Who was married to Faye Dunaway and when did it end?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q168721 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faye Dunaway', 'p': 'married to', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'married to', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Faye Dunaway', 'p': 'married to', 'o': '$y0'}}]

 Q: What are the Colonial Colleges which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1188663 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Colonial Colleges'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: Which is the city district that contains the administrative territorial entity of Bonn?
 SPARQL:  select distinct ?obj where { wd:Q586 wdt:P150 ?obj . ?obj wdt:P31 wd:Q4286337 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bonn', 'p': 'contains', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city district'}}

 Q: What is {award received} of {Adele} that is {statement is subject of} is {59th Annual Grammy Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q23215 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q25060439 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Adele', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '59th Annual Grammy Awards'}}}

 Q: Does the total valid votes of the Catalan reqional election of 2015 in Montseny equal to 231?
 SPARQL: ASK WHERE { wd:Q44874612 wdt:P1697 ?obj filter(?obj = 231) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Catalan regional election 2015 in Montseny', 'p': 'total valid votes', 'o': '?x0', '?x0': '231'}

 Q: What is {award received} of {Cormac McCarthy} that is {for work} is {The Road} ?
 SPARQL: SELECT ?obj WHERE { wd:Q272610 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q1140295 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Cormac McCarthy', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'The Road'}}}

 Q: What is Russia's national anthem?
 SPARQL:  select distinct ?obj where { wd:Q34266 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Russia', 'p': 'anthem', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'national anthem'}}

 Q: What is {academic degree} and {academic major} of {{Dwayne Johnson} has {educated at} as {University of Miami}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q10738 p:P69 ?s . ?s ps:P69 wd:Q738258 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'degree', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dwayne Johnson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Miami'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'major', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Dwayne Johnson', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'educated at', 'o': 'University of Miami'}}}]

 Q: What is the {intergovernmental organization} for {parent organization} of {International Court of Justice}
 SPARQL:  select distinct ?obj where { wd:Q7801 wdt:P749 ?obj . ?obj wdt:P31 wd:Q245065 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'International Court of Justice', 'p': 'parent organization', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'intergovernmental organization'}}

 Q: Who is the {gene} for {genetic association} of {allergic rhinitis}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2293 wd:Q272436 . ?sbj wdt:P31 wd:Q7187 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'genetic association', 'o': 'allergic rhinitis', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'gene'}}

 Q: Give me {position} that {vehicle normally used} {popemobile} and which contains the word {pope} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4164871 . ?sbj wdt:P3438 wd:Q739445 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pope')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'position', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'vehicle normally used', 'o': 'popemobile'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'pope'}}

 Q: What is copy of products for Arcadia Machine & Tool ?
 SPARQL: SELECT ?answer WHERE { wd:Q4034274 wdt:P1056 ?X . ?X wdt:P144 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'copy of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Arcadia Machine & Tool', 'p': 'product', 'o': '$y0'}}

 Q: What part of the stomach is the venous return connected to?
 SPARQL: SELECT ?answer WHERE { wd:Q1029907 wdt:P2789 ?X . ?X wdt:P2289 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'venous return', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'stomach', 'p': 'connected to', 'o': '$y0'}}

 Q: what is the {Wylie transliteration} for {Abhidharma} has {native label} as {མཛོད་ཕུག} ?
 SPARQL: SELECT ?value WHERE { wd:Q612405 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'མཛོད་ཕུག')) . ?s pq:P4187 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'Wylie transliteration', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Abhidharma', 'p': 'native label', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'native label', 'o': 'མཛོད་ཕུག'}}}

 Q: Which is the FootballDatabase.eu ID of Abedi Pele?
 SPARQL: select distinct ?answer where { wd:Q336916 wdt:P3537 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Abedi Pele', 'p': 'FootballDatabase.eu ID', 'o': '?x0'}

 Q: What is {member of sports team} of {Adam Gilchrist} that is {start time} is {2008-0-0} ?
 SPARQL: SELECT ?obj WHERE { wd:Q349516 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2008')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Adam Gilchrist', 'p': 'team', 'o': '?x0', 't': '2008'}

 Q: What is pollinated by Coleoptera ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1703 wd:Q22671}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'is pollinated by', 'o': 'Coleoptera'}

 Q: What are the binary operation which start with the letter u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164307 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'binary operation'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: what is the {series ordinal} for {The Godfather} has {series} as {Godfather trilogy} ?
 SPARQL: SELECT ?value WHERE { wd:Q47703 p:P179 ?s . ?s ps:P179 wd:Q3225260 . ?s pq:P1545 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'series ordinal', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'The Godfather', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Godfather trilogy'}}}

 Q: what is the {applies to jurisdiction} for {George VI} has {position held} as {monarch} ?
 SPARQL: SELECT ?value WHERE { wd:Q280856 p:P39 ?s . ?s ps:P39 wd:Q116 . ?s pq:P1001 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'applies to jurisdiction', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George VI', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'monarch'}}}

 Q: What is the diplomatic relation between Tunisia and its official language Tuvan?
 SPARQL: SELECT ?answer WHERE { wd:Q948 wdt:P530 ?answer . ?answer wdt:P37 wd:Q34119}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Tunisia', 'p': 'diplomatic relation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'official language', 'o': 'Tuvan'}}

 Q: Who started serving as the Zambia head of state on 10-24-1964?
 SPARQL: SELECT ?obj WHERE { wd:Q953 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1964')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zambia', 'p': 'head of state', 'o': '?x0', 't': '1964'}

 Q: Which is the organization for what is said to be the same of Scientology?
 SPARQL:  select distinct ?obj where { wd:Q131036 wdt:P460 ?obj . ?obj wdt:P31 wd:Q43229 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Scientology', 'p': 'same', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'organization'}}

 Q: Which UCI ProTeam has the highest budget?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q20638319 . ?ent wdt:P2769 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'budget', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'UCI ProTeam'}}

 Q: What is {followed by} and {follows} of {{Charles the Fat} has {noble title} as {king of Franks}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles the Fat', 'p': 'noble title', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'noble title', 'o': 'king of Franks'}}}]

 Q: What is the {filming location} and the {narrative location} of {The_X-Files} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P915 ?ans_1 . wd:Q2744 wdt:P840 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'X-Files', 'p': 'filming location', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'X-Files', 'p': 'narrative location', 'o': '?x1'}]

