 Q: What is the {Population I star} for {child astronomical body} of {Pluto}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P398 wd:Q339 . ?sbj wdt:P31 wd:Q3592493 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'child astronomical body', 'o': 'Pluto', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Population I star'}}

 Q: What are the computer model which start with the letter z
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55990535 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'computer model'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'z'}}

 Q: Is the binding energy of tritium greater than 6785.436?
 SPARQL: ASK WHERE { wd:Q54389 wdt:P2154 ?obj filter(?obj > 6785.436) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'tritium', 'p': 'binding energy', 'o': '?x0', '?x0': '6785.436'}

 Q: what is the {together with} for {Alexander Fleming} has {award received} as {Nobel Prize in Physiology or Medicine} ?
 SPARQL: SELECT ?value WHERE { wd:Q37064 p:P166 ?s . ?s ps:P166 wd:Q80061 . ?s pq:P1706 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'with', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Alexander Fleming', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Nobel Prize in Physiology or Medicine'}}}

 Q: What location in Hyderabad the administrative territorial entity in the year 1724?
 SPARQL: SELECT ?obj WHERE { wd:Q1361 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1724')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Hyderabad', 'p': 'in', 'o': '?x0', 't': '1724'}

 Q: What is the collection of Pietà?
 SPARQL: select distinct ?answer where { wd:Q235242 wdt:P195 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Pietà', 'p': 'collection', 'o': '?x0'}

 Q: What is Cinemagia actor ID for Lionel Messi?
 SPARQL: select distinct ?answer where { wd:Q615 wdt:P4666 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lionel Messi', 'p': 'Cinemagia actor ID', 'o': '?x0'}

 Q: What is Nuremberg's Bavarikon ID?
 SPARQL: select distinct ?answer where { wd:Q2090 wdt:P4005 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Nuremberg', 'p': 'Bavarikon ID', 'o': '?x0'}

 Q: What is the stateless nation of the Bilbao location?
 SPARQL:  select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q1151616 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Bilbao', 'p': 'location', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'stateless nation'}}

 Q: What is {record producer} of {split from} of {I Feel Fine} ?
 SPARQL: SELECT ?answer WHERE { wd:Q268440 wdt:P155 ?X . ?X wdt:P162 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'producer', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'I Feel Fine', 'p': 'split from', 'o': '$y0'}}

 Q: What is {position held} of {Juan Carlos I} that is {replaced by} is {Felipe VI of Spain} ?
 SPARQL: SELECT ?obj WHERE { wd:Q19943 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q191045 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Juan Carlos I', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Felipe VI of Spain'}}}

 Q: Which is the MR Author ID of Niels Bohr?
 SPARQL: select distinct ?answer where { wd:Q7085 wdt:P4955 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Niels Bohr', 'p': 'MR Author ID', 'o': '?x0'}

 Q: Which is the Dictionnaire critique des historiens de l'art ID for Théophile Gautier?
 SPARQL: select distinct ?answer where { wd:Q183713 wdt:P5372 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Théophile Gautier', 'p': "Dictionnaire critique des historiens de l'art ID", 'o': '?x0'}

 Q: What is the {family name} for {writing system} of {Chinese characters}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P282 wd:Q8201 . ?sbj wdt:P31 wd:Q101352 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'writing system', 'o': 'Chinese characters', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'family name'}}

 Q: what are the train service which start with the letter v
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15141321 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'train service'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'v'}}

 Q: Which is the average space complexity of quicksort?
 SPARQL: select distinct ?answer where { wd:Q486598 wdt:P3757 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'quicksort', 'p': 'average space complexity', 'o': '?x0'}

 Q: Did {John_Wayne_Gacy} {employer} {Jollibee Foods Corporation}?
 SPARQL: ASK WHERE { wd:Q298252 wdt:P108 wd:Q37614 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Gacy', 'p': 'employer', 'o': '?x0', '?x0': 'Jollibee'}]

 Q: What is the {human} for {sports discipline competed in} of {high jump}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2416 wd:Q165704 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sports discipline competed in', 'o': 'high jump', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is <Persée author ID> of <Marija Gimbutas> ?
 SPARQL: select distinct ?answer where { wd:Q221084 wdt:P2732 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Marija Gimbutas', 'p': 'Persée author ID', 'o': '?x0'}

 Q: What volcanic eruption occurred in the Dutch East Indies?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P131 wd:Q188161 . ?sbj wdt:P31 wd:Q7692360 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'in', 'o': 'Dutch East Indies', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'volcanic eruption'}}

 Q: What award did Aaliyah receive in the year 2000?
 SPARQL: SELECT ?obj WHERE { wd:Q11617 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Aaliyah', 'p': 'award', 'o': '?x0', 't': '2000'}

 Q: What is {award received} of {Laurence Fishburne} that is {statement is subject of} is {46th Tony Awards} ?
 SPARQL: SELECT ?obj WHERE { wd:Q193048 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q4638408 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Laurence Fishburne', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': '46th Tony Awards'}}}

 Q: How much market capitalization are for JPMorgan Chase?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q192314 wdt:P2226 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'JPMorgan Chase', 'p': 'market capitalization', 'o': '?x0'}

 Q: What is {cfsi} of {setting location} of {Le Pere Goriot} ?
 SPARQL: SELECT ?answer WHERE { wd:Q240617 wdt:P840 ?X . ?X wdt:P1740 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'cfsi', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Le Pere Goriot', 'p': 'setting location', 'o': '$y0'}}

 Q: What is the {human} for {head coach} of {Boston Celtics}
 SPARQL:  select distinct ?obj where { wd:Q131371 wdt:P286 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Celtics', 'p': 'head coach', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which voting round for Marine Le Pen had the most spoilt votes?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5044 ?obj . ?ent wdt:P726 wd:Q12927 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'spoilt votes', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'voting round', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'candidate', 'o': 'Marine Le Pen'}}}

 Q: What is {shares border with} of {Basque Autonomous Community} that is {applies to part} is {Pyrénées-Atlantiques} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3995 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P518 wd:Q12703 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Basque Autonomous Community', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'Pyrenees-Atlantiques'}}}

 Q: What is {predecessor} of {formed from} of {Santa Monica} ?
 SPARQL: SELECT ?answer WHERE { wd:Q41108665 wdt:P186 ?X . ?X wdt:P155 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'predecessor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Santa Monica', 'p': 'formed from', 'o': '$y0'}}

 Q: What is {spouse} of {James Joyce} that is {place of marriage} is {London} ?
 SPARQL: SELECT ?obj WHERE { wd:Q6882 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q84 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'married to', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James Joyce', 'p': 'married to', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of marriage', 'o': 'London'}}}

 Q: How many crystal systems are in an amorphous solid?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P556 wd:Q103382 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'crystal system', 'o': 'amorphous solid'}

 Q: What is the {television series} for {characters} of {Robin Hood}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P674 wd:Q122634 . ?sbj wdt:P31 wd:Q5398426 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'characters', 'o': 'Robin Hood', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'television series'}}

 Q: What play depicts the life of Richard III of England?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P180 wd:Q133028 . ?sbj wdt:P31 wd:Q25379 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'depicts', 'o': 'Richard III of England', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'play'}}

 Q: What is the {building complex} with the {MIN(number of elevators)} whose {structural engineer} is {Arup}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1497364 . ?ent wdt:P1301 ?obj . ?ent wdt:P631 wd:Q716737} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'elevators', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'building complex', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'engineer', 'o': 'Arup'}}}

 Q: Who is the husband and child of Anthony Dryden Marshall
 SPARQL: SELECT ?answer WHERE { wd:Q4772424 wdt:P22 ?X . ?X wdt:P26 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'husband', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Anthony Dryden Marshall', 'p': 'child of', 'o': '$y0'}}

 Q: At what pressure does phosphoric acid need to be at to have a boiling point of 415.0?
 SPARQL: SELECT ?value WHERE { wd:Q184782 p:P2102 ?s . ?s ps:P2102 ?x filter(contains(?x,'415.0')) . ?s pq:P2077 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'pressure', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'phosphoric acid', 'p': 'boiling point', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'boiling point', 'o': '415.0'}}}

 Q: What is the symbol of the physical quantity of pound per square inch ?
 SPARQL: SELECT ?answer WHERE { wd:Q626299 wdt:P111 ?X . ?X wdt:P416 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'symbol', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'pound per square inch', 'p': 'quantity', 'o': '$y0'}}

 Q: When converted to SI unit, is the darcy equal to 1.18428e-12?
 SPARQL: ASK WHERE { wd:Q1165725 wdt:P2370 ?obj filter(?obj = 1.18428e-12) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'darcy', 'p': 'conversion to SI unit', 'o': '?x0', '?x0': '1.18428e-12'}

 Q: what is the {point in time} for {Seiichi Morimura} has {award received} as {Edogawa Rampo Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q2318799 p:P166 ?s . ?s ps:P166 wd:Q906975 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Seiichi Morimura', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Edogawa Rampo Award'}, 't': '?x0'}

 Q: what is economic union starts with u
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3623811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'economic union'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'u'}}

 Q: How many opposites are there of the word parent?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P461 wd:Q7566 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'opposite', 'o': 'parent'}

 Q: What is {Christian name} of {Poul Anderson}, that has {the same as} is {Pavle} ?
 SPARQL: SELECT ?answer WHERE { wd:Q220883 wdt:P735 ?answer . ?answer wdt:P460 wd:Q2064754}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Poul Anderson', 'p': 'Christian name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'same as', 'o': 'Pavle'}}

 Q: What is the {race horse} for {child} of {Seabiscuit}
 SPARQL:  select distinct ?obj where { wd:Q1500356 wdt:P40 ?obj . ?obj wdt:P31 wd:Q10855242 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Seabiscuit', 'p': 'child', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'race horse'}}

 Q: What is the mobile network operator founded by Verizon?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P112 wd:Q467752 . ?sbj wdt:P31 wd:Q1941618 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'founded by', 'o': 'Verizon', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mobile network operator'}}

 Q: Is Planck's constant less than 5.300856032e-34?
 SPARQL: ASK WHERE { wd:Q122894 wdt:P1181 ?obj filter(?obj < 5.300856032e-34) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'h', 'p': 'numeric value', 'o': '?x0', '?x0': '5.300856032e-34'}

 Q: Mention the doctoral advisor-ship and the academic qualifying degree achieved by Raghuram Rajan when he studied at Massachusetts Institute of Technology.
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q981496 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P184 ?value1 . ?s pq:P512 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'doctoral advisor', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Raghuram Rajan', 'p': 'studied at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'studied at', 'o': 'Massachusetts Institute of Technology'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'degree', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Raghuram Rajan', 'p': 'studied at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'studied at', 'o': 'Massachusetts Institute of Technology'}}}]

 Q: What was proximately caused by the consequence  of bubonic plague ?
 SPARQL: SELECT ?answer WHERE { wd:Q217519 wdt:P1542 ?X . ?X wdt:P1478 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'proximately caused by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'bubonic plague', 'p': 'consequence', 'o': '$y0'}}

 Q: What is the place of incorporation of the The Police, that has Zip + 4 and is W1F 0HS?
 SPARQL: SELECT ?answer WHERE { wd:Q178095 wdt:P740 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'W1F 0HS'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'The Police', 'p': 'place of incorporation', 'o': '?x0'}

 Q: Who is the person from the People's Republic of China that has the most century breaks?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4912 ?obj . ?ent wdt:P27 wd:Q148 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'century breaks', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'person', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country of citizenship', 'o': "People's Republic of China"}}}

 Q: What are the legendary figure which start with the letter e
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13002315 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'legendary figure'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'é'}}

 Q: Is it true Pamela is the given name of Pamela Anderson?
 SPARQL: ASK WHERE { wd:Q83325 wdt:P735 wd:Q262119 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Pamela Anderson', 'p': 'given name', 'o': '?x0', '?x0': 'Pamela'}]

 Q: What is ceiling exposure limit for phenol which duration is 15.0?
 SPARQL: SELECT ?obj WHERE { wd:Q130336 p:P2405 ?s . ?s ps:P2405 ?obj . ?s pq:P2047 ?x filter(contains(?x,'15.0')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ceiling exposure limit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'phenol', 'p': 'ceiling exposure limit', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'duration', 'o': '15.0'}}}

 Q: What is the award received by Rick Barry in 1974?
 SPARQL: SELECT ?obj WHERE { wd:Q434824 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1974')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Rick Barry', 'p': 'award received', 'o': '?x0', 't': '1974'}

 Q: Is the maximum number of players of Abalone equal to 6?
 SPARQL: ASK WHERE { wd:Q17247 wdt:P1873 ?obj filter(?obj = 6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Abalone', 'p': 'maximum number of players', 'o': '?x0', '?x0': '6'}

 Q: What is {team} of {teleplay by} of {Ripper} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1477823 wdt:P58 ?X . ?X wdt:P54 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'team', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ripper', 'p': 'teleplay by', 'o': '$y0'}}

 Q: Is it true that the admission rate of the Massachusetts Institute of Technology equals to 0.08?
 SPARQL: ASK WHERE { wd:Q49108 wdt:P5822 ?obj filter(?obj = 0.08) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Massachusetts Institute of Technology', 'p': 'admission rate', 'o': '?x0', '?x0': '0.08'}

 Q: What is the fault of Nazca Plate?
 SPARQL: select distinct ?answer where { ?answer wdt:P5095 wd:Q538867}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'fault', 'o': 'Nazca Plate'}

 Q: what is the {start time} for {Tashkent} has {country} as {Uzbekistan} ?
 SPARQL: SELECT ?value WHERE { wd:Q269 p:P17 ?s . ?s ps:P17 wd:Q265 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tashkent', 'p': 'country', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'country', 'o': 'Uzbekistan'}}}

 Q: How many {category contains} are to/by {castle} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4224 wd:Q23413 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'category contains', 'o': 'castle'}

 Q: Does the illiterate population of the Asanbani equal 0?
 SPARQL: ASK WHERE { wd:Q60376426 wdt:P6498 ?obj filter(?obj = 0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Asanbani', 'p': 'illiterate population', 'o': '?x0', '?x0': '0'}

 Q: What is {net profit} of {Nissan} that is {sourcing circumstances} is {fiscal year} ?
 SPARQL: SELECT ?obj WHERE { wd:Q20165 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P1480 wd:Q191891 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'net profit', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nissan', 'p': 'net profit', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'fiscal year'}}}

 Q: what is the {end time} for {Jagiellonian University} has {rector} as {Andrzej Pelczar} ?
 SPARQL: SELECT ?value WHERE { wd:Q189441 p:P1075 ?s . ?s ps:P1075 wd:Q515383 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Jagiellonian University', 'p': 'rector', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'rector', 'o': 'Andrzej Pelczar'}}}

 Q: What is {discoverer} of {natural selection}, that has {birth year} is {1809-2-12} ?
 SPARQL: SELECT ?answer WHERE { wd:Q43478 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1809'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'natural selection', 'p': 'discoverer', 'o': '?x0', 't': '1809'}

 Q: What is {position held} of {Carlos Andrés Pérez da costa} that is {replaced by} is {Luis Herrera Campins} ?
 SPARQL: SELECT ?obj WHERE { wd:Q295790 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q455661 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Carlos Andres Perez', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'replaced by', 'o': 'Luis Herrera Campins'}}}

 Q: What is the profession of Henry Washington Younger sons?
 SPARQL: SELECT ?answer WHERE { wd:Q5729891 wdt:P40 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'profession', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Henry Washington Younger', 'p': 'son', 'o': '$y0'}}

 Q: Which is the vertical depth for Lake Winnipeg?
 SPARQL: select distinct ?answer where { wd:Q3272 wdt:P4511 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Winnipeg', 'p': 'vertical depth', 'o': '?x0'}

 Q: what is the {sourcing circumstances} for {Roald Amundsen} has {place of death} as {Bear Island} ?
 SPARQL: SELECT ?value WHERE { wd:Q926 p:P20 ?s . ?s ps:P20 wd:Q194364 . ?s pq:P1480 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sourcing circumstances', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Roald Amundsen', 'p': 'place of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'place of death', 'o': 'Bear Island'}}}

 Q: Is the career plus-minus rating of the Roland Eriksson equal to -70?
 SPARQL: ASK WHERE { wd:Q283133 wdt:P6547 ?obj filter(?obj = -70) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Roland Eriksson', 'p': 'career plus-minus rating', 'o': '?x0', '?x0': '-70'}

 Q: What is the Forth Bridge's Historic Scotland ID number?
 SPARQL: select distinct ?answer where { wd:Q275 wdt:P709 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Forth Bridge', 'p': 'Historic Scotland ID', 'o': '?x0'}

 Q: Who is the producer and executive producer of Fight Club?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q190050 wdt:P162 ?ans_1 . wd:Q190050 wdt:P1431 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Fight Club', 'p': 'producer', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Fight Club', 'p': 'executive producer', 'o': '?x1'}]

 Q: Do the aftershocks of the 2011 Lorca earthquake equal 131
 SPARQL: ASK WHERE { wd:Q584613 wdt:P2320 ?obj filter(?obj = 131) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': '2011 Lorca earthquake', 'p': 'aftershocks', 'o': '?x0', '?x0': '131'}

 Q: Was Genghis Khan's wife named Yesui?
 SPARQL: ASK WHERE { wd:Q720 wdt:P26 wd:Q4177257 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Genghis Khan', 'p': 'wife', 'o': '?x0', '?x0': 'Yesui'}]

 Q: What was the political party membership of Robert Moses?
 SPARQL: SELECT ?answer WHERE { wd:Q1111386 wdt:P102 ?X . ?X wdt:P2124 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'membership', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Moses', 'p': 'party', 'o': '$y0'}}

 Q: What is the {single} for {tracklist} of {Led Zeppelin IV}
 SPARQL:  select distinct ?obj where { wd:Q201940 wdt:P658 ?obj . ?obj wdt:P31 wd:Q134556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Led Zeppelin IV', 'p': 'tracklist', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single'}}

 Q: What's Russia's inception?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q159 wdt:P571 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Russia', 'p': 'inception', 'o': '?x0'}

 Q: Is the coastline of borovoe less than 16.32?
 SPARQL: ASK WHERE { wd:Q5092054 wdt:P5141 ?obj filter(?obj < 16.32) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Borovoe', 'p': 'coastline', 'o': '?x0', '?x0': '16.32'}

 Q: Is the mean age of England less than 30.88?
 SPARQL: ASK WHERE { wd:Q21 wdt:P4442 ?obj filter(?obj < 30.88) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'England', 'p': 'mean age', 'o': '?x0', '?x0': '30.88'}

 Q: How many demonyms are there for Croatia?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q224 wdt:P1549 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Croatia', 'p': 'demonym', 'o': '?x0'}

 Q: What is the {human} for {place of death} of {Thessaloniki}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P20 wd:Q17151 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'place of death', 'o': 'Thessaloniki', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is occupation of the TV host of Top Gear?
 SPARQL: SELECT ?answer WHERE { wd:Q33162 wdt:P371 ?X . ?X wdt:P106 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'occupation', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Top Gear', 'p': 'host', 'o': '$y0'}}

 Q: Who was Emmylou Harris' spouse in 1984?
 SPARQL: SELECT ?obj WHERE { wd:Q231286 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1984')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Emmylou Harris', 'p': 'spouse', 'o': '?x0', 't': '1984'}

 Q: How many {does not have part} are to/by {antimatter} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3113 wd:Q83197 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'does not have part', 'o': 'antimatter'}

 Q: What is {deathdate} of {inventor} of {Messier 83} ?
 SPARQL: SELECT ?answer WHERE { wd:Q14030 wdt:P61 ?X . ?X wdt:P570 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'deathdate', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Messier 83', 'p': 'inventor', 'o': '$y0'}}

 Q: What is {position held} of {Stanley Baldwin} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanley Baldwin', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Stanley Baldwin', 'p': 'position held', 'o': '$y0'}}]

 Q: Is Tony Robbins' occupation motivational speaker and manager?
 SPARQL: ASK WHERE { wd:Q380429 wdt:P106 wd:Q15982858 . wd:Q380429 wdt:P106 wd:Q6746710 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Tony Robbins', 'p': 'occupation', 'o': '?x0', '?x0': 'motivational speaker'}, {'h': 'IS', 'v': '?x1', 's': 'Tony Robbins', 'p': 'occupation', 'o': '?x1', '?x1': 'manager'}]

 Q: What is {field of study} of {supervisor} of {Sonia Fisch-Muller} ?
 SPARQL: SELECT ?answer WHERE { wd:Q25368065 wdt:P184 ?X . ?X wdt:P2650 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of study', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sonia Fisch-Muller', 'p': 'supervisor', 'o': '$y0'}}

 Q: Who is often confused with the snake that has a higher taxon than Ophidia
 SPARQL: SELECT ?answer WHERE { wd:Q2102 wdt:P1889 ?answer . ?answer wdt:P171 wd:Q16986904}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'snake', 'p': 'confused with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'higher taxon', 'o': 'Ophidia'}}

 Q: Is the incidence of pancreatic cancer less than 1.6?
 SPARQL: ASK WHERE { wd:Q212961 wdt:P2844 ?obj filter(?obj < 1.6) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'pancreatic cancer', 'p': 'incidence', 'o': '?x0', '?x0': '1.6'}

 Q: What is {coordinate location} of {Amur} that is {applies to part} is {river mouth} ?
 SPARQL: SELECT ?obj WHERE { wd:Q6862 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'coordinates', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amur', 'p': 'coordinates', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'applies to part', 'o': 'river mouth'}}}

 Q: What is {script} of {previous job holder} of {Modern English} ?
 SPARQL: SELECT ?answer WHERE { wd:Q1649537 wdt:P1365 ?X . ?X wdt:P282 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'script', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Modern English', 'p': 'previous job holder', 'o': '$y0'}}

 Q: What is {followed by} and {follows} of {{Star Wars Episode V: The Empire Strikes Back} has {series} as {Star Wars original trilogy}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q181795 p:P179 ?s . ?s ps:P179 wd:Q25540859 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars original trilogy'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'follows', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Star Wars Episode V: The Empire Strikes Back', 'p': 'series', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series', 'o': 'Star Wars original trilogy'}}}]

 Q: What is the {architectural structure} for {architectural style} of {Bauhaus}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q811979 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'architectural style', 'o': 'Bauhaus', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'architectural structure'}}

 Q: "Who is {brother or sister} of {Khadijah bint Khuwaylid}, which has {marry} is {Safiyyah bint ‘Abd al-Muttalib} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q42034 wdt:P3373 ?answer . ?answer wdt:P26 wd:Q2740828}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Khadijah', 'p': 'sister', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'marry', 'o': 'Safiyyah bint ‘Abd al-Muttalib'}}

 Q: Who  is married to Cheryl Tiegs in the year 1981?
 SPARQL: SELECT ?obj WHERE { wd:Q2408009 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1981')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cheryl Tiegs', 'p': 'married to', 'o': '?x0', 't': '1981'}

 Q: what is the {determination method} for {Meknes} has {number of households} as {100470.0} ?
 SPARQL: SELECT ?value WHERE { wd:Q178663 p:P1538 ?s . ?s ps:P1538 ?x filter(contains(?x,'100470.0')) . ?s pq:P459 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'determination method', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Meknes', 'p': 'number of households', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'number of households', 'o': '100470.0'}}}

 Q: What award did George Marshall receive on May the 4th, 1959?
 SPARQL: SELECT ?obj WHERE { wd:Q151414 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1959')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'George Marshall', 'p': 'award', 'o': '?x0', 't': '1959'}

