 Q: What is Newton's law of cooling named after, that was born in Parnu?
 SPARQL: SELECT ?answer WHERE { wd:Q2902868 wdt:P138 ?answer . ?answer wdt:P19 wd:Q102365}
 ALIST: {'h': 'Value', 'v': '?x0', 's': "Newton's law of cooling", 'p': 'named after', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'born in', 'o': 'Parnu'}}

 Q: What is {Christian name} of {Edmund Gwenn}, that has {disputed equivalence} is {Hans} ?
 SPARQL: SELECT ?answer WHERE { wd:Q344750 wdt:P735 ?answer . ?answer wdt:P460 wd:Q632842}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Edmund Gwenn', 'p': 'Christian name', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'disputed equivalence', 'o': 'Hans'}}

 Q: How many different boyar social classifications are there?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3716 wd:Q203563 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'social classification', 'o': 'boyar'}

 Q: what is the {followed by} for {The Handmaid's Tale} has {award received} as {Arthur C. Clarke Award} ?
 SPARQL: SELECT ?value WHERE { wd:Q1541914 p:P166 ?s . ?s ps:P166 wd:Q708830 . ?s pq:P156 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'followed by', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "The Handmaid's Tale", 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Arthur C. Clarke Award'}}}

 Q: What are the political philosophy which start with the letter whiggism
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'whiggism')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'political philosophy'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'whiggism'}}

 Q: What is the birth place of Raffaele Calace, whose patron saint is Januarius?
 SPARQL: SELECT ?answer WHERE { wd:Q1344676 wdt:P19 ?answer . ?answer wdt:P417 wd:Q315312}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Raffaele Calace', 'p': 'birth place', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Januarius'}}

 Q: What is the {moon of Jupiter} for {child astronomical body} of {Jupiter}
 SPARQL:  select distinct ?obj where { wd:Q319 wdt:P398 ?obj . ?obj wdt:P31 wd:Q61702557 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Jupiter', 'p': 'child astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'moon of Jupiter'}}

 Q: What is {nephew} of {sister or brother} of {Sanada Nobumasa} ?
 SPARQL: SELECT ?answer WHERE { wd:Q11583366 wdt:P3373 ?X . ?X wdt:P1038 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'nephew', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sanada Nobumasa', 'p': 'sister', 'o': '$y0'}}

 Q: How many presenters are held in the {Adriano Celentano} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P371 wd:Q199943 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'presenter', 'o': 'Adriano Celentano'}

 Q: What is {has administrative divisions} of {neighborhood} of {Eastern Front} ?
 SPARQL: SELECT ?answer WHERE { wd:Q154573 wdt:P276 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has administrative divisions', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Eastern Front', 'p': 'location', 'o': '$y0'}}

 Q: What are the game of skill  which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1368898 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'game of skill'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is {used language} of {Latin literature}, that has {cases} is {ablative case} ?
 SPARQL: SELECT ?answer WHERE { wd:Q184890 wdt:P407 ?answer . ?answer wdt:P2989 wd:Q156986}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Latin literature', 'p': 'used language', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'cases', 'o': 'ablative case'}}

 Q: Is the shear modulus of polyethylene equal to 93.6?
 SPARQL: ASK WHERE { wd:Q143429 wdt:P5673 ?obj filter(?obj = 93.6) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'polyethylene', 'p': 'shear modulus', 'o': '?x0', '?x0': '93.6'}

 Q: Which is the approximation algorithm of pi?
 SPARQL: select distinct ?answer where { wd:Q167 wdt:P1171 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'pi', 'p': 'approximation algorithm', 'o': '?x0'}

 Q: what is the {for work} for {Hayley Williams} has {award received} as {Grammy Award for Best Rock Song} ?
 SPARQL: SELECT ?value WHERE { wd:Q201562 p:P166 ?s . ?s ps:P166 wd:Q282636 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hayley Williams', 'p': 'award received', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award received', 'o': 'Grammy Award for Best Rock Song'}}}

 Q: Who is {chairperson} and {member of} {Popular Unity} ?
 SPARQL: SELECT ?answer WHERE { wd:Q21957427 wdt:P463 ?X . ?X wdt:P488 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'chairperson', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Popular Unity', 'p': 'member of', 'o': '$y0'}}

 Q: What's the population of Yokohama in 2018?
 SPARQL: SELECT ?obj WHERE { wd:Q38283 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yokohama', 'p': 'population', 'o': '?x0', 't': '2018'}

 Q: Tell me {city of India} which start with the letter w
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58339717 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city of India'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'w'}}

 Q: Tell me about cola for product or material produced of The Coca-Cola Company?
 SPARQL:  select distinct ?obj where { wd:Q3295867 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q134041 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'The Coca-Cola Company', 'p': 'product or material produced', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cola'}}

 Q: What is the {city/town} for {currency} of {Russian ruble}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q7930989 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'currency', 'o': 'Russian ruble', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'city/town'}}

 Q: what is the {end time} for {Frank Peters Jr.} has {employer} as {KWTO (AM)} ?
 SPARQL: SELECT ?value WHERE { wd:Q19839467 p:P108 ?s . ?s ps:P108 wd:Q15231856 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frank Peters Jr.', 'p': 'employer', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'employer', 'o': 'KWTO'}}}

 Q: What is the {arch bridge} for {designed by} of {Isambard Kingdom Brunel}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P287 wd:Q207380 . ?sbj wdt:P31 wd:Q158438 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'designed by', 'o': 'Isambard Kingdom Brunel', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'arch bridge'}}

 Q: What is the destination point of Franz Josef Land ?
 SPARQL: select distinct ?answer where { ?answer wdt:P1444 wd:Q185018}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'destination point', 'o': 'Franz Josef Land'}

 Q: What UNICEF was awarded in the year 1957?
 SPARQL: SELECT ?obj WHERE { wd:Q740308 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1957')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'UNICEF', 'p': 'award', 'o': '?x0', 't': '1957'}

 Q: What are the dog type which start with the letter t
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'dog type'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 't'}}

 Q: What is the {human} for {sibling} of {Paul McCartney}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3373 wd:Q2599 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'sibling', 'o': 'Paul McCartney', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: Which is after a work by Stanisława Przybyszewska?
 SPARQL: select distinct ?answer where { ?answer wdt:P1877 wd:Q3067991}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'after a work by', 'o': 'Stanisława Przybyszewska'}

 Q: What petroleum product has the lowest consumption rate?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q2424752 . ?ent wdt:P2292 ?obj . ?ent wdt:P910 wd:Q6572327} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'consumption rate', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'product', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': "topic's main category", 'o': 'Category:Petroleum'}}}

 Q: Which is the category for employees of the organization of the National Autonomous University of Mexico?
 SPARQL: select distinct ?answer where { wd:Q222738 wdt:P4195 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'National Autonomous University of Mexico', 'p': 'category for employees of the organization', 'o': '?x0'}

 Q: what is the {replaces} for {Albert Gallatin} has {position held} as {United States senator} ?
 SPARQL: SELECT ?value WHERE { wd:Q500046 p:P39 ?s . ?s ps:P39 wd:Q13217683 . ?s pq:P1365 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'replaced', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Albert Gallatin', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'United States senator'}}}

 Q: "Where is {work location} of {William Beveridge}, that has {PIN Code} is {SW3 6RS} ?"
 SPARQL: SELECT ?answer WHERE { wd:Q335049 wdt:P937 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'SW3 6RS'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'William Beveridge', 'p': 'work location', 'o': '?x0'}

 Q: Did the brother of Frederick IV, Duke of Austria have any children?
 SPARQL: SELECT ?answer WHERE { wd:Q550692 wdt:P3373 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'child', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Frederick IV, Duke of Austria', 'p': 'bro', 'o': '$y0'}}

 Q: What cellular component has the word "vesicle" in its name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5058355 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vesicle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cellular component'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vesicle'}}

 Q: What Academy Awards was Ron Howard nominated for?
 SPARQL:  select distinct ?obj where { wd:Q103646 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ron Howard', 'p': 'nominated for', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Academy Awards'}}

 Q: Did {Phil_Hartman} {educated at} {Santa Monica College} and {Manual Arts High School} ?
 SPARQL: ASK WHERE { wd:Q366834 wdt:P69 wd:Q1033692 . wd:Q366834 wdt:P69 wd:Q6752299 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Phil Hartman', 'p': 'educated at', 'o': '?x0', '?x0': 'Santa Monica College'}, {'h': 'IS', 'v': '?x1', 's': 'Phil Hartman', 'p': 'educated at', 'o': '?x1', '?x1': 'Manual Arts High School'}]

 Q: When was Nicholas I of Russia awarded the Order of St. Alexander Nevsky?
 SPARQL: SELECT ?value WHERE { wd:Q130734 p:P166 ?s . ?s ps:P166 wd:Q10514065 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Nicholas I of Russia', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Order of St. Alexander Nevsky'}, 't': '?x0'}

 Q: Who is ideology of member of party of Michel Pouzol ?
 SPARQL: SELECT ?answer WHERE { wd:Q3310625 wdt:P102 ?X . ?X wdt:P1142 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'ideology', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Michel Pouzol', 'p': 'party', 'o': '$y0'}}

 Q: Was the dissertation submitted to TU Dresden?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4101 wd:Q158158 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'dissertation submitted to', 'o': 'TU Dresden'}

 Q: What is {award received} of {George Orwell} that is {for work} is {Animal Farm} ?
 SPARQL: SELECT ?obj WHERE { wd:Q3335 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q1396889 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'award', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Orwell', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'for work', 'o': 'Animal Farm'}}}

 Q: What was Eyvind Johnson nominated for in 1963?
 SPARQL: SELECT ?obj WHERE { wd:Q131326 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Eyvind Johnson', 'p': 'nominated for', 'o': '?x0', 't': '1963'}

 Q: what is the {point in time} for {Charles Mingus Jr.} has {award received} as {Grammy Hall of Fame} ?
 SPARQL: SELECT ?value WHERE { wd:Q107432 p:P166 ?s . ?s ps:P166 wd:Q81180 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Charles Mingus', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Grammy Hall of Fame'}, 't': '?x0'}

 Q: For what Cyril Ramaphosa was in position held in the year 2018?
 SPARQL: SELECT ?obj WHERE { wd:Q1148669 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2018')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cyril Ramaphosa', 'p': 'position held', 'o': '?x0', 't': '2018'}

 Q: Who was stepparent of Emperor Wu of Liu Song?
 SPARQL: select distinct ?answer where { wd:Q49699 wdt:P3448 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Emperor Wu of Liu Song', 'p': 'stepparent', 'o': '?x0'}

 Q: Is the suicide rate of Nigeria more than 7.6?
 SPARQL: ASK WHERE { wd:Q1033 wdt:P3864 ?obj filter(?obj > 7.6) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Nigeria', 'p': 'suicide rate', 'o': '?x0', '?x0': '7.6'}

 Q: What is the population of Timisoara that is determined by the questionnaire?
 SPARQL: SELECT ?obj WHERE { wd:Q83404 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q747810 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Timisoara', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determined by', 'o': 'questionnaire'}}}

 Q: What is the {human} with the {MIN(century breaks)} whose {country for sport} is {Scotland}  ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4912 ?obj . ?ent wdt:P1532 wd:Q22} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'century breaks', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'country for sport', 'o': 'Scotland'}}}

 Q: What is {publisher} and {publication date} of {{Christopher Hitchens} has {notable work} as {Mortality}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q6914395 . ?s pq:P123 ?value1 . ?s pq:P577 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'publisher', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Mortality'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'publication date', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Christopher Hitchens', 'p': 'notable work', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'notable work', 'o': 'Mortality'}}}]

 Q: Who is the {human} for {composer} of {My Fair Lady}
 SPARQL:  select distinct ?obj where { wd:Q591943 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'My Fair Lady', 'p': 'composer', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: what is the {for work} for {Francis Ford Coppola} has {nominated for} as {Academy Award for Best Director} ?
 SPARQL: SELECT ?value WHERE { wd:Q56094 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Francis Ford Coppola', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Director'}}}

 Q: Was Mohenjo-daro discovered by John Marshall and Rakhaldas Bandyopadhyay?
 SPARQL: ASK WHERE { wd:Q5725 wdt:P61 wd:Q1376456 . wd:Q5725 wdt:P61 wd:Q7286651 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Mohenjo-daro', 'p': 'discovered by', 'o': '?x0', '?x0': 'John Marshall'}, {'h': 'IS', 'v': '?x1', 's': 'Mohenjo-daro', 'p': 'discovered by', 'o': '?x1', '?x1': 'Rakhaldas Bandyopadhyay'}]

 Q: What are the cryptid which start with the letter y
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772636 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'cryptid'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'y'}}

 Q: What is <MNCARS artist ID> of <Lee Miller> ?
 SPARQL: select distinct ?answer where { wd:Q265131 wdt:P4439 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lee Miller', 'p': 'MNCARS artist ID', 'o': '?x0'}

 Q: What {type of music} is {songwriter} {Princess Mononoke} ?
 SPARQL: SELECT ?answer WHERE { wd:Q186572 wdt:P86 ?X . ?X wdt:P136 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'type of music', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Princess Mononoke', 'p': 'songwriter', 'o': '$y0'}}

 Q: What is the {isotope of silver} with the {MAX(neutron number)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q1373385 . ?ent wdt:P1148 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'neutron number', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'isotope of silver'}}

 Q: Is the takeoff roll on the Airbus A400M less than 752?
 SPARQL: ASK WHERE { wd:Q6496 wdt:P2430 ?obj filter(?obj < 752.0) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'Airbus A400M', 'p': 'takeoff roll', 'o': '?x0', '?x0': '752.0'}

 Q: Which is the consumption rate per capital of petroleum?
 SPARQL: select distinct ?answer where { wd:Q22656 wdt:P2662 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'petroleum', 'p': 'consumption rate per capita', 'o': '?x0'}

 Q: What's the first human that starts with the letter "p"?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4349921 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'first human'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: Which is Australian Statistical Geography 2011 ID for Hobart?
 SPARQL: select distinct ?answer where { wd:Q40191 wdt:P4014 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hobart', 'p': 'Australian Statistical Geography 2011 ID', 'o': '?x0'}

 Q: What is the {Irritant} with the {MAX(enthalpy of vaporization)} ?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q6073871 . ?ent wdt:P2116 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'enthalpy of vaporization', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Irritant'}}

 Q: Did {Twenty Years After} {characters} {Charles I of England} and {Louis XIII of France} ?
 SPARQL: ASK WHERE { wd:Q1639633 wdt:P674 wd:Q81506 . wd:Q1639633 wdt:P674 wd:Q737533 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Twenty Years After', 'p': 'characters', 'o': '?x0', '?x0': 'Charles I of England'}, {'h': 'IS', 'v': '?x1', 's': 'Twenty Years After', 'p': 'characters', 'o': '?x1', '?x1': 'Louis XIII of France'}]

 Q: What is {category of associated people} of {civilisation} of {Hadrian's Wall} ?
 SPARQL: SELECT ?answer WHERE { wd:Q57357 wdt:P2596 ?X . ?X wdt:P1792 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'category of associated people', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': "Hadrian's Wall", 'p': 'civilisation', 'o': '$y0'}}

 Q: Who is the spouse of Erich Honecker in the series ordinal 3?
 SPARQL: SELECT ?obj WHERE { wd:Q2607 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1545 ?x filter(contains(?x,'3')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'spouse', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Erich Honecker', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'series ordinal', 'o': '3'}}}

 Q: what is the {for work} for {Nine Inch Nails} has {nominated for} as {Grammy Award for Best Alternative Music Album} ?
 SPARQL: SELECT ?value WHERE { wd:Q11647 p:P1411 ?s . ?s ps:P1411 wd:Q1542129 . ?s pq:P1686 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'for work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nine Inch Nails', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Grammy Award for Best Alternative Music Album'}}}

 Q: Tell me which eau de vie contains the word williamine in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2166541 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'williamine')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'eau de vie'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'williamine'}}

 Q: Which is the satellite state that has the motto Workers of the world, unite! and contains the word democratic in it's name?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q325261 . ?sbj wdt:P1546 wd:Q877781 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'democratic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'satellite state', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'motto', 'o': 'Workers of the world, unite!'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'democratic'}}

 Q: Was Stephen King born in Portland?
 SPARQL: ASK WHERE { wd:Q39829 wdt:P19 wd:Q49201 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Stephen King', 'p': 'born in', 'o': '?x0', '?x0': 'Portland'}]

 Q: What is {has boroughs} of {death place} of {James, son of Alphaeus} ?
 SPARQL: SELECT ?answer WHERE { wd:Q44047 wdt:P20 ?X . ?X wdt:P150 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has boroughs', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'James, son of Alphaeus', 'p': 'death place', 'o': '$y0'}}

 Q: What award did Olafur Eliasson receive in 2014?
 SPARQL: SELECT ?obj WHERE { wd:Q365691 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2014')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Olafur Eliasson', 'p': 'award', 'o': '?x0', 't': '2014'}

 Q: What is angular diameter for  Sun ?
 SPARQL: select distinct ?answer where { wd:Q525 wdt:P5348 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Sun', 'p': 'angular diameter', 'o': '?x0'}

 Q: Tell me archaeological site whose name has the word tripolis in it.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tripolis')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archaeological site'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tripolis'}}

 Q: How many {has facet polytope} are to/by {rectangle} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1312 wd:Q209 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'has facet polytope', 'o': 'rectangle'}

 Q: What is the formation of Zero Mostel with subsidiary company in the United States Army Human Resources Command?
 SPARQL: SELECT ?answer WHERE { wd:Q191952 wdt:P241 ?answer . ?answer wdt:P355 wd:Q7889484}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Zero Mostel', 'p': 'formation', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'subsidiary', 'o': 'United States Army Human Resources Command'}}

 Q: In the Diocese of Lapua, which church is the smallest in capacity?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q16970 . ?ent wdt:P1083 ?obj . ?ent wdt:P708 wd:Q871032} ORDER BY ASC(?obj)LIMIT 5 
 ALIST: {'h': 'MIN', 'v': '$y0', 's': '?x0', 'p': 'capacity', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'church', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diocese', 'o': 'Diocese of Lapua'}}}

 Q: What is a phase change that starts with the letter s.
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185357 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'phase change'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 's'}}

 Q: How many demonyms are there for Africa?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q15 wdt:P1549 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Africa', 'p': 'demonym', 'o': '?x0'}

 Q: Who was the spouse of Ilona Staller at the beginning of 1991?
 SPARQL: SELECT ?obj WHERE { wd:Q49941 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1991')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Ilona Staller', 'p': 'spouse', 'o': '?x0', 't': '1991'}

 Q: What is opposite of reality ?
 SPARQL: select distinct ?answer where { ?answer wdt:P461 wd:Q9510}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'opposite of', 'o': 'reality'}

 Q: Give me {decimal classification} that {has edition} {DDC 23} and which contains the word {classification} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q15222117 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'decimal classification', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'edition', 'o': 'DDC 23'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'classification'}}

 Q: In what field of work was Theodosius Dobzhansky awarded the National Medal of Science?
 SPARQL: SELECT ?value WHERE { wd:Q246731 p:P166 ?s . ?s ps:P166 wd:Q737051 . ?s pq:P101 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'field of work', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Theodosius Dobzhansky', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'National Medal of Science'}}}

 Q: What is {has effect} and {killed by} of {{John F. Kennedy} has {cause of death} as {ballistic trauma}}
 SPARQL: SELECT ?value1 ?value2 WHERE { wd:Q9696 p:P509 ?s . ?s ps:P509 wd:Q2140674 . ?s pq:P1542 ?value1 . ?s pq:P157 ?value2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'has effect', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'JFK', 'p': 'cause of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cause of death', 'o': 'shot'}}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'killed by', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'JFK', 'p': 'cause of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'cause of death', 'o': 'shot'}}}]

 Q: what is the {start time} for {Franz Liszt} has {partner} as {Marie d'Agoult} ?
 SPARQL: SELECT ?value WHERE { wd:Q41309 p:P451 ?s . ?s ps:P451 wd:Q253453 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Franz Liszt', 'p': 'partner', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'partner', 'o': "Marie d'Agoult"}}}

 Q: Which is the Canadian Olympic Committee athlete ID of Scott Moir?
 SPARQL: select distinct ?answer where { wd:Q440940 wdt:P4054 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Scott Moir', 'p': 'Canadian Olympic Committee athlete ID', 'o': '?x0'}

 Q: What is GitHub username of Google ?
 SPARQL: select distinct ?answer where { wd:Q95 wdt:P2037 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Google', 'p': 'GitHub username', 'o': '?x0'}

 Q: Did {John_Candy} {award received} {Canada's Walk of Fame} and {Canadian Comedy Awards} ?
 SPARQL: ASK WHERE { wd:Q218532 wdt:P166 wd:Q857933 . wd:Q218532 wdt:P166 wd:Q5029887 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'John Candy', 'p': 'award', 'o': '?x0', '?x0': "Canada's Walk of Fame"}, {'h': 'IS', 'v': '?x1', 's': 'John Candy', 'p': 'award', 'o': '?x1', '?x1': 'Canadian Comedy Awards'}]

 Q: Are the total assets of the Zlin Aircraft equal to 291600000?
 SPARQL: ASK WHERE { wd:Q207278 wdt:P2403 ?obj filter(?obj = 291600000) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Zlin Aircraft', 'p': 'total assets', 'o': '?x0', '?x0': '291600000'}

 Q: How many number of wins in this tournament?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q500834 . ?ent wdt:P1355 ?obj } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'number of wins', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'tournament'}}

 Q: What is the {animated feature film} for {narrator} of {David Spade}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2438 wd:Q298658 . ?sbj wdt:P31 wd:Q29168811 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'narrator', 'o': 'David Spade', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'animated feature film'}}

