 Q: what is the {statement is subject of} for {Geoffrey Rush} has {nominated for} as {Academy Award for Best Supporting Actor} ?
 SPARQL: SELECT ?value WHERE { wd:Q166272 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Geoffrey Rush', 'p': 'nominated for', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'nominated for', 'o': 'Academy Award for Best Supporting Actor'}}}

 Q: What is {workplace} of {Cnut the Great}, that has {diplomatic relation} is {Romania}
 SPARQL: SELECT ?answer WHERE { wd:Q134128 wdt:P937 ?answer . ?answer wdt:P530 wd:Q218}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Cnut the Great', 'p': 'workplace', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Romania'}}

 Q: Did {Dave_Grohl} {member of political party} {Democratic Party}?
 SPARQL: ASK WHERE { wd:Q12006 wdt:P102 wd:Q29552 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Dave Grohl', 'p': 'member of political party', 'o': '?x0', '?x0': 'Democratic Party'}]

 Q: Is the optimum viable temperature of the Marichromatium sp. 24.0
 SPARQL: ASK WHERE { wd:Q29565261 wdt:P3253 ?obj filter(?obj = 24.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Marichromatium sp.', 'p': 'optimum viable temperature', 'o': '?x0', '?x0': '24.0'}

 Q: Which is the 90minut player ID of Robert Lewandowski?
 SPARQL: select distinct ?answer where { wd:Q151269 wdt:P3605 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Robert Lewandowski', 'p': '90minut player ID', 'o': '?x0'}

 Q: Which is the taxon synonym of Ochotona?
 SPARQL: select distinct ?answer where { wd:Q184067 wdt:P1420 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ochotona', 'p': 'taxon synonym', 'o': '?x0'}

 Q: what is the {statement is subject of} for {Utah} has {shares border with} as {Wyoming} ?
 SPARQL: SELECT ?value WHERE { wd:Q829 p:P47 ?s . ?s ps:P47 wd:Q1214 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Utah', 'p': 'border', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'border', 'o': 'Wyoming'}}}

 Q: Is the electronegativity of the sodium less than 1.2?
 SPARQL: ASK WHERE { wd:Q658 wdt:P1108 ?obj filter(?obj < 1.2) } 
 ALIST: {'h': 'LESS', 'v': '?x0', 's': 'sodium', 'p': 'electronegativity', 'o': '?x0', '?x0': '1.2'}

 Q: what is the {end time} for {Andrew Barton Paterson} has {residence} as {Binalong} ?
 SPARQL: SELECT ?value WHERE { wd:Q436699 p:P551 ?s . ?s ps:P551 wd:Q2903896 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Andrew Barton Paterson', 'p': 'residence', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'residence', 'o': 'Binalong'}}}

 Q: Ethanol is of what ZINC ID?
 SPARQL: select distinct ?answer where { wd:Q153 wdt:P2084 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ethanol', 'p': 'ZINC ID', 'o': '?x0'}

 Q: What is {location of death} of {Yemelyan Pugachev}, that has {county seat of} is {Moscow Oblast} ?
 SPARQL: SELECT ?answer WHERE { wd:Q154240 wdt:P20 ?answer . ?answer wdt:P1376 wd:Q1697}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Yemelyan Pugachev', 'p': 'location of death', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'county seat of', 'o': 'Moscow Oblast'}}

 Q: What is {directs} of {holds position} of {Odo of Scarpone} ?
 SPARQL: SELECT ?answer WHERE { wd:Q16027431 wdt:P39 ?X . ?X wdt:P2389 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'directs', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Odo of Scarpone', 'p': 'holds position', 'o': '$y0'}}

 Q: What is the toponym of the Island of Montreal that has a geographic coordinate of -73.555?
 SPARQL: SELECT ?answer WHERE { wd:Q292354 wdt:P138 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-73.555'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Island of Montreal', 'p': 'toponym', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'geographic coordinate', 'o': '-73.555'}}

 Q: What is {population} of {Porto Alegre} that is {determination method} is {census} ?
 SPARQL: SELECT ?obj WHERE { wd:Q40269 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'population', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Porto Alegre', 'p': 'population', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'determination method', 'o': 'census'}}}

 Q: what is the {start time} for {Neil Simon} has {spouse} as {Marsha Mason} ?
 SPARQL: SELECT ?value WHERE { wd:Q315808 p:P26 ?s . ?s ps:P26 wd:Q235211 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Neil Simon', 'p': 'spouse', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'spouse', 'o': 'Marsha Mason'}}}

 Q: What award did Yasser Arafat receive, and what was the amount of money he won?
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q34211 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'money', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yasser Arafat', 'p': 'award', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'award', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Yasser Arafat', 'p': 'award', 'o': '$y0'}}]

 Q: What is {gender expression} of {Maudgalyayana}, that has {shortened name} is {чол} ?
 SPARQL: SELECT ?answer WHERE { wd:Q379814 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'чол'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Maudgalyayana', 'p': 'gender expression', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'shortened name', 'o': 'чол'}}

 Q: What is the dam of Lake Gordon
 SPARQL: select distinct ?answer where { wd:Q366813 wdt:P4792 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Lake Gordon', 'p': 'dam', 'o': '?x0'}

 Q: What is the {human} for {patron saint} of {Society of Jesus}
 SPARQL:  select distinct ?obj where { wd:Q36380 wdt:P417 ?obj . ?obj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Society of Jesus', 'p': 'patron saint', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: When did Kofi Annan receive the award Confucius Peace Prize?
 SPARQL: SELECT ?value WHERE { wd:Q1254 p:P166 ?s . ?s ps:P166 wd:Q1192712 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Kofi Annan', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Confucius Peace Prize'}, 't': '?x0'}

 Q: What is the native language of Modern Standard Arabic?
 SPARQL: select distinct ?answer where { ?answer wdt:P103 wd:Q56467}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'native language', 'o': 'Modern Standard Arabic'}

 Q: What is the border of the death location of Tommy Douglas?
 SPARQL: SELECT ?answer WHERE { wd:Q359653 wdt:P20 ?X . ?X wdt:P47 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'border', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Tommy Douglas', 'p': 'death location', 'o': '$y0'}}

 Q: how many hold the coat of arms?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P237 wd:Q14659 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'coat of arms', 'o': 'coat of arms'}

 Q: what is the {start time} for {Margaret Mead} has {spouse} as {Gregory Bateson} ?
 SPARQL: SELECT ?value WHERE { wd:Q180099 p:P26 ?s . ?s ps:P26 wd:Q314252 . ?s pq:P580 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'start time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Margaret Mead', 'p': 'marry', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'marry', 'o': 'Gregory Bateson'}}}

 Q: What is {position held} of {Winston Churchill} that is {elected in} is {United Kingdom general election, 1935} ?
 SPARQL: SELECT ?obj WHERE { wd:Q8016 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q918378 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'position held', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Winston Churchill', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'elected in', 'o': 'United Kingdom general election, 1935'}}}

 Q: What is the quantity of honorific suffix for a Doctor of Philosophy?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1035 wd:Q752297 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'honorific suffix', 'o': 'Doctor of Philosophy'}

 Q: What is GAMECIP media format ID for Blu-ray Disc ?
 SPARQL: select distinct ?answer where { wd:Q47770 wdt:P5371 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Blu-ray Disc', 'p': 'GAMECIP media format ID', 'o': '?x0'}

 Q: What is <original combination> of <blue whale> ?
 SPARQL: select distinct ?answer where { wd:Q42196 wdt:P1403 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'blue whale', 'p': 'original combination', 'o': '?x0'}

 Q: What is {sports} of {succeded by} of {1993 Rally GB} ?
 SPARQL: SELECT ?answer WHERE { wd:Q6361563 wdt:P156 ?X . ?X wdt:P641 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'sport', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': '1993 Rally GB', 'p': 'succeded by', 'o': '$y0'}}

 Q: Who is the officeholder of United Nations Secretary-General?
 SPARQL: select distinct ?answer where { wd:Q81066 wdt:P1308 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'United Nations Secretary-General', 'p': 'officeholder', 'o': '?x0'}

 Q: What is the {sexual preference} for {health specialty} of {psychotherapy}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1995 wd:Q183257 . ?sbj wdt:P31 wd:Q2275640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'health specialty', 'o': 'psychotherapy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sexual preference'}}

 Q: what is the {end time} for {Urban II} has {position held} as {cardinal-bishop} ?
 SPARQL: SELECT ?value WHERE { wd:Q30578 p:P39 ?s . ?s ps:P39 wd:Q1729113 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Urban II', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'cardinal-bishop'}}}

 Q: How many {studied by} are to/by {astronomy} ?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2579 wd:Q333 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'astronomy'}

 Q: What is the {Population I star} for {parent astronomical body} of {Uranus}
 SPARQL:  select distinct ?obj where { wd:Q324 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3592493 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Uranus', 'p': 'parent astronomical body', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'Population I star'}}

 Q: What is SSRN author ID for Fischer Black ?
 SPARQL: select distinct ?answer where { wd:Q963275 wdt:P3747 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Fischer Black', 'p': 'SSRN author ID', 'o': '?x0'}

 Q: who sexual preference for studied by of psychotherapy?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P2579 wd:Q183257 . ?sbj wdt:P31 wd:Q2275640 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'studied by', 'o': 'psychotherapy', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'sexual preference'}}

 Q: What are thegroup or class of chemical substances which start with the letter vitamin
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17339814 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vitamin')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'group or class of chemical substances'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'vitamin'}}

 Q: What is the {communist party} for {secretary general} of {Xi Jinping}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P3975 wd:Q15031 . ?sbj wdt:P31 wd:Q233591 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'secretary general', 'o': 'Xi Jinping', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'communist party'}}

 Q: Who was the member of the sports team of Gordon Banks until 1-1-1959?
 SPARQL: SELECT ?obj WHERE { wd:Q213879 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1959')) }
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Gordon Banks', 'p': 'team', 'o': '?x0', 't': '1959'}

 Q: What is the luxury yacht with the highest beam whose manufacturer is Lürssen?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q443802 . ?ent wdt:P2261 ?obj . ?ent wdt:P176 wd:Q657096 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'beam', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'luxury yacht', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'manufacturer', 'o': 'Lürssen'}}}

 Q: What is {has grammatical mood} of {French} that is {statement is subject of} is {French indicative} ?
 SPARQL: SELECT ?obj WHERE { wd:Q150 p:P3161 ?s . ?s ps:P3161 ?obj . ?s pq:P805 wd:Q3150151 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'mood', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'French', 'p': 'mood', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'statement is subject of', 'o': 'French indicative'}}}

 Q: what is the {electoral district} for {Shinzō Abe} has {position held} as {member of the House of Representatives of Japan} ?
 SPARQL: SELECT ?value WHERE { wd:Q132345 p:P39 ?s . ?s ps:P39 wd:Q17506823 . ?s pq:P768 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'electoral district', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Shinzō Abe', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'member of the House of Representatives of Japan'}}}

 Q: Which  is participant in  conflict  branch of Charles Whitman ?
 SPARQL: SELECT ?answer WHERE { wd:Q453209 wdt:P241 ?X . ?X wdt:P607 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'conflict', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Charles Whitman', 'p': 'branch', 'o': '$y0'}}

 Q: Tell me me a video game console model whose name consist of the " wii" and whose input method Classic Controller
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56682555 . ?sbj wdt:P479 wd:Q2573628 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wii')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'video game console model', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'input method', 'o': 'Classic Controller'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'wii'}}

 Q: When was Lou Reed awarded o the Rock and Roll Hall of Fame?
 SPARQL: SELECT ?value WHERE { wd:Q189080 p:P166 ?s . ?s ps:P166 wd:Q179191 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Lou Reed', 'p': 'award', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'award', 'o': 'Rock and Roll Hall of Fame'}, 't': '?x0'}

 Q: What is {educated at} of {Guion Bluford} and {academic major}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q528943 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'academic major', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guion Bluford', 'p': 'educated at', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'educated at', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Guion Bluford', 'p': 'educated at', 'o': '$y0'}}]

 Q: What is the statement is subject of Nigeria whose diplomatic relation is Cameroon?
 SPARQL: SELECT ?value WHERE { wd:Q1033 p:P530 ?s . ?s ps:P530 wd:Q1009 . ?s pq:P805 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'statement is subject of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Nigeria', 'p': 'diplomatic relation', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'diplomatic relation', 'o': 'Cameroon'}}}

 Q: What is the {single} for {performer} of {Hrithik Roshan}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P175 wd:Q233619 . ?sbj wdt:P31 wd:Q134556 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'performer', 'o': 'Hrithik Roshan', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'single'}}

 Q: Give me {commune of France with specific status} that {list of monuments} {list of monuments in Lyon} and which contains the word {lyon} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj wdt:P1456 wd:Q3252117 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'lyon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'commune of France with specific status', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'list of monuments', 'o': 'list of monuments in Lyon'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'lyon'}}

 Q: What is the {medical specialty} for {health specialty} of {cancer}
 SPARQL:  select distinct ?obj where { wd:Q12078 wdt:P1995 ?obj . ?obj wdt:P31 wd:Q930752 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'cancer', 'p': 'health specialty', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'medical specialty'}}

 Q: What is the mean anomaly of Ceres that equals 138.662?
 SPARQL: SELECT ?value WHERE { wd:Q596 p:P2325 ?s . ?s ps:P2325 ?x filter(contains(?x,'138.662')) . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Ceres', 'p': 'mean anomaly', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'mean anomaly', 'o': '138.662'}, 't': '?x0'}

 Q: Who is a member of the school attended by Sidney Mintz?
 SPARQL: SELECT ?answer WHERE { wd:Q327017 wdt:P69 ?X . ?X wdt:P463 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'member of', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Sidney Mintz', 'p': 'school attended', 'o': '$y0'}}

 Q: What is {co-founder} of {publishing house} of {Journal of experimental psychology. Human learning and memory} ?
 SPARQL: SELECT ?answer WHERE { wd:Q27711480 wdt:P123 ?X . ?X wdt:P112 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'co-founder', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Journal of experimental psychology. Human learning and memory', 'p': 'publishing house', 'o': '$y0'}}

 Q: How many {partnership with} are for {Autonomous University of Barcelona} ?
 SPARQL: SELECT (COUNT(?obj) AS ?value ) { wd:Q43452 wdt:P2652 ?obj }
 ALIST: {'h': 'Count', 'v': '?x0', 's': 'Autonomous University of Barcelona', 'p': 'partnership with', 'o': '?x0'}

 Q: What is the {business} for {headquarters location} of {Cleveland}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'headquarters location', 'o': 'Cleveland', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What is Hansard (1803–2005) ID for Clement Attlee?
 SPARQL: select distinct ?answer where { wd:Q129006 wdt:P2015 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Clement Attlee', 'p': 'Hansard (1803–2005) ID', 'o': '?x0'}

 Q: What is the {compact space} for {solved by} of {Grigori Perelman}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1136 wd:Q117346 . ?sbj wdt:P31 wd:Q381892 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'solved by', 'o': 'Grigori Perelman', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'compact space'}}

 Q: What is the {comune of Italy} for {patron saint} of {Thomas Aquinas}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P417 wd:Q9438 . ?sbj wdt:P31 wd:Q747074 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'patron saint', 'o': 'Thomas Aquinas', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'comune of Italy'}}

 Q: What is the {epic poem} for {present in work} of {Hera}
 SPARQL:  select distinct ?obj where { wd:Q38012 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q37484 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Hera', 'p': 'present in work', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'epic poem'}}

 Q: What is {date of death} of {Hippocrates} that is {sourcing circumstances} is {circa} ?
 SPARQL: SELECT ?obj WHERE { wd:Q5264 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'date of death', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Hippocrates', 'p': 'date of death', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'sourcing circumstances', 'o': 'c'}}}

 Q: Who is the  {protein} for {physically interacts with} of {diazepam}
 SPARQL:  select distinct ?obj where { wd:Q210402 wdt:P129 ?obj . ?obj wdt:P31 wd:Q8054 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'diazepam', 'p': 'physically interacts with', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'protein'}}

 Q: What is {position held} of {George Reid} and {elected in}
 SPARQL: SELECT ?value1 ?obj WHERE { wd:Q23352 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'elected in', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Reid', 'p': 'position held', 'o': '$y0'}}, {'h': 'Value', 'v': '?x1', 's': '$y0', 'p': 'position held', 'o': '?x1', '$y0': {'h': 'Value', 'v': '$y0', 's': 'George Reid', 'p': 'position held', 'o': '$y0'}}]

 Q: Is it true that the electorate of Del Carmen is greater than 8388?
 SPARQL: ASK WHERE { wd:Q28735 wdt:P1831 ?obj filter(?obj > 8388.0) } 
 ALIST: {'h': 'GREATER', 'v': '?x0', 's': 'Del Carmen', 'p': 'electorate', 'o': '?x0', '?x0': '8388.0'}

 Q: What is the think tank for the Smithsonian Institution's parent organization?
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P749 wd:Q131626 . ?sbj wdt:P31 wd:Q155271 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'parent organization', 'o': 'Smithsonian Institution', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'think tank'}}

 Q: Which is the locality of Vojvodina having a diplomatic relation of Holy See?
 SPARQL: SELECT ?answer WHERE { wd:Q44749 wdt:P131 ?answer . ?answer wdt:P530 wd:Q159583}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Vojvodina', 'p': 'in', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'diplomatic relation', 'o': 'Holy See'}}

 Q: What is the diocese of Paris archdiocese?
 SPARQL:  select distinct ?obj where { wd:Q90 wdt:P708 ?obj . ?obj wdt:P31 wd:Q2072238 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Paris', 'p': 'diocese', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'archdiocese'}}

 Q: Is the budget of Tinkoff equal to 19200000?
 SPARQL: ASK WHERE { wd:Q62424 wdt:P2769 ?obj filter(?obj = 19200000.0) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'Tinkoff', 'p': 'budget', 'o': '?x0', '?x0': '19200000.0'}

 Q: Give me {use} that contains the word {tinder} in their name
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tinder')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'use'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'contains', 'o': 'tinder'}}

 Q: Tell me how many kids Amlaib's sister has.
 SPARQL: SELECT ?answer WHERE { wd:Q281752 wdt:P3373 ?X . ?X wdt:P40 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'kid', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Amlaib', 'p': 'sister', 'o': '$y0'}}

 Q: What is informed by Saul Bellow whose nom-de-amore is Horatio?
 SPARQL: SELECT ?answer WHERE { wd:Q83059 wdt:P737 ?answer . ?answer wdt:P742 ?x FILTER(contains(?x,'Horatio'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Saul Bellow', 'p': 'informed by', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'nom-de-amore', 'o': 'horatio'}}

 Q: Which is the Jewish Encyclopedia Daat ID for Numbers?
 SPARQL: select distinct ?answer where { wd:Q43099 wdt:P3710 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Numbers', 'p': 'Jewish Encyclopedia Daat ID', 'o': '?x0'}

 Q: Who is Taxi Driver's film editor and director?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q47221 wdt:P1040 ?ans_1 . wd:Q47221 wdt:P57 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Taxi Driver', 'p': 'film editor', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Taxi Driver', 'p': 'director', 'o': '?x1'}]

 Q: what is the {end time} for {Beverly Sills} has {position held} as {chairperson} ?
 SPARQL: SELECT ?value WHERE { wd:Q235517 p:P39 ?s . ?s ps:P39 wd:Q140686 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Beverly Sills', 'p': 'position held', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'position held', 'o': 'chairperson'}}}

 Q: How many permanently duplicated items are associated with July?
 SPARQL: SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2959 wd:Q121 }
 ALIST: {'h': 'Count', 'v': '?x0', 's': '?x0', 'p': 'duplicate', 'o': 'July'}

 Q: Did {Karen_Carpenter} {occupation} {singer} and {Ringo Starr} ?
 SPARQL: ASK WHERE { wd:Q1250861 wdt:P106 wd:Q177220 . wd:Q1250861 wdt:P106 wd:Q2632 }
 ALIST: [{'h': 'IS', 'v': '?x0', 's': 'Karen Carpenter', 'p': 'occupation', 'o': '?x0', '?x0': 'singer'}, {'h': 'IS', 'v': '?x1', 's': 'Karen Carpenter', 'p': 'occupation', 'o': '?x1', '?x1': 'Ringo Starr'}]

 Q: Which Radofin MSX has the fastest clock speed?
 SPARQL: select ?ent where { ?ent wdt:P31 wd:Q853547 . ?ent wdt:P2149 ?obj . ?ent wdt:P178 wd:Q3928891 } ORDER BY DESC(?obj)LIMIT 5 
 ALIST: {'h': 'MAX', 'v': '$y0', 's': '?x0', 'p': 'clock speed', 'o': '$y0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'MSX', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'developer', 'o': 'Radofin'}}}

 Q: what is the {end time} for {Friedrich Nietzsche} has {educated at} as {University of Bonn} ?
 SPARQL: SELECT ?value WHERE { wd:Q9358 p:P69 ?s . ?s ps:P69 wd:Q152171 . ?s pq:P582 ?value}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'end time', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Friedrich Nietzsche', 'p': 'education', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'education', 'o': 'University of Bonn'}}}

 Q: What is {educated at} of {Ralph Abernathy} that is {academic degree} is {Master of Arts} ?
 SPARQL: SELECT ?obj WHERE { wd:Q545488 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q2091008 }
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'educated at', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Ralph Abernathy', 'p': 'educated at', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'degree', 'o': 'Master of Arts'}}}

 Q: What is the mineral resource that starts with the letter 'p'?
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q889659 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'mineral resource'}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'p'}}

 Q: What is the {human} for {doctoral student} of {Janet Yellen}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P185 wd:Q263725 . ?sbj wdt:P31 wd:Q5 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'doctoral student', 'o': 'Janet Yellen', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'human'}}

 Q: What is the {inspired by} and the {influenced by} of {Statue_of_Liberty} ?
 SPARQL: SELECT ?ans_1 ?ans_2 WHERE { wd:Q9202 wdt:P941 ?ans_1 . wd:Q9202 wdt:P737 ?ans_2 }
 ALIST: [{'h': 'Value', 'v': '?x0', 's': 'Statue of Liberty', 'p': 'inspiration', 'o': '?x0'}, {'h': 'Value', 'v': '?x1', 's': 'Statue of Liberty', 'p': 'influenced by', 'o': '?x1'}]

 Q: Is the binding energy of the neon-20 equal to 160644.8?
 SPARQL: ASK WHERE { wd:Q1956685 wdt:P2154 ?obj filter(?obj = 160644.8) } 
 ALIST: {'h': 'EQUAL', 'v': '?x0', 's': 'neon-20', 'p': 'binding energy', 'o': '?x0', '?x0': '160644.8'}

 Q: What is allegiance of Mughal Empire ?
 SPARQL: select distinct ?answer where { ?answer wdt:P945 wd:Q33296}
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'allegiance', 'o': 'Mughal Empire'}

 Q: what is the {point in time} for {Frederick Sanger} has {academic degree} as {doctor honoris causa} ?
 SPARQL: SELECT ?value WHERE { wd:Q151564 p:P512 ?s . ?s ps:P512 wd:Q11415564 . ?s pq:P585 ?value}
 ALIST: {'h': 'Value', 'v': '$y0', 's': 'Frederick Sanger', 'p': 'academic degree', 'o': '$y0', '$y0': {'h': 'Value', 'v': '$y0', 's': '$y0', 'p': 'academic degree', 'o': 'doctor honoris causa'}, 't': '?x0'}

 Q: What are the honours of Bill T. Jones whose winner is Jule Styne?
 SPARQL: SELECT ?answer WHERE { wd:Q2903368 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q587741}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Bill T. Jones', 'p': 'honours', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'winner', 'o': 'Jule Styne'}}

 Q: What is the {business} for {owner of} of {American Airlines}
 SPARQL:  select distinct ?sbj where { ?sbj wdt:P1830 wd:Q32396 . ?sbj wdt:P31 wd:Q4830453 } 
 ALIST: {'h': 'List', 'v': '?x0', 's': '?x0', 'p': 'owner of', 'o': 'American Airlines', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'business'}}

 Q: What county seat of Kathmandu, has mains electricity voltage of 230.0?
 SPARQL: SELECT ?answer WHERE { wd:Q3037 wdt:P1376 ?answer . ?answer wdt:P2884 ?x FILTER(contains(?x,'230.0'))}
 ALIST: {'h': 'Value', 'v': '?x0', 's': 'Kathmandu', 'p': 'county seat of', 'o': '?x0', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'mains electricity voltage', 'o': '230.0'}}

 Q: Give me {anime television series} that {original network} {Nippon BS Broadcasting} and which that starts with {'l'}
 SPARQL: SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj wdt:P449 wd:Q843957 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'l')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 
 ALIST: {'h': 'List', 'v': '?x0,?x1', 's': '?x0', 'p': 'label', 'o': '?x1', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'type', 'o': 'anime television', '?x0': {'h': 'Value', 'v': '?x0', 's': '?x0', 'p': 'network', 'o': 'Nippon BS Broadcasting'}}, '?x1': {'h': 'Value', 'v': '?x1', 's': '?x1', 'p': 'starts_with', 'o': 'l'}}

 Q: Which is the tributary orientation for Ottawa River?
 SPARQL: select distinct ?answer where { wd:Q60974 wdt:P3871 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Ottawa River', 'p': 'tributary orientation', 'o': '?x0'}

 Q: What is <BDFutbol player ID> of <Allan Simonsen> ?
 SPARQL: select distinct ?answer where { wd:Q153463 wdt:P3655 ?answer}
 ALIST: {'h': 'List', 'v': '?x0', 's': 'Allan Simonsen', 'p': 'BDFutbol player ID', 'o': '?x0'}

 Q: Who gave the {postal index number} of {resident in} of {Robert Pattinson} ?
 SPARQL: SELECT ?answer WHERE { wd:Q36767 wdt:P551 ?X . ?X wdt:P281 ?answer}
 ALIST: {'h': 'Value', 'v': '?x0', 's': '$y0', 'p': 'postal index number', 'o': '?x0', '$y0': {'h': 'Value', 'v': '$y0', 's': 'Robert Pattinson', 'p': 'resident in', 'o': '$y0'}}

